{
  "sources": [
    {
      "title": "Spring",
      "feedUrl": "https://spring.io/blog.atom",
      "siteUrl": "https://spring.io/blog",
      "articles": [
        {
          "id": "https://spring.io/blog/2021/07/07/spring-cloud-hoxton-sr12-has-been-released",
          "author": null,
          "description": "On behalf of the community, I am pleased to announce that the Service Release 12 (SR12) of the Spring Cloud Hoxton Release Train is available today. The release can be found in Maven Central. You can check out the Hoxton release notes for more information.\nNotable Changes in the Hoxton Release Train\n\r\nSee all issues included in this release here.\n\r\nThis was primarily a bug fix and documentation release. Hoxton.SR12 is compatible with Spring Boot 2.3.x and 2.2.x.\n\r\nNOTE: This will be the last regularly scheduled release of the Hoxton Release Train. It now enters a special maintenance period for security fixes and critical bugs until the end of Feb 2022 (which follows the lifecycle of Spring Boot 2.3.x). See the wiki for more information.\nSpring Cloud Commons\n\r\n\r\n  \nAdded TaskSchedulerWrappe…",
          "link": "https://spring.io/blog/2021/07/07/spring-cloud-hoxton-sr12-has-been-released",
          "publishedOn": "2021-07-07T16:35:47.000Z",
          "wordCount": 708,
          "title": "Spring Cloud Hoxton.SR12 has been released"
        },
        {
          "id": "https://spring.io/blog/2021/07/07/spring-tips-spring-cloud-square",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Spring Developer Advocate Josh Long (@starbuxman) looks at how to build smarter HTTP clients for your Spring Boot microservices with Spring Cloud Square, Retrofit, and OKHTTP.",
          "link": "https://spring.io/blog/2021/07/07/spring-tips-spring-cloud-square",
          "publishedOn": "2021-07-07T07:00:00.000Z",
          "wordCount": 417,
          "title": "Spring Tips: Spring Cloud Square"
        },
        {
          "id": "https://spring.io/blog/2021/07/06/this-week-in-spring-july-6th-2021",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring! We’re in July already! That blows my mind - we’re closer to 2022 than 2020 at this point. I don’t wanna jinx it, but this year seems markedly better than last year, and I hope it stays that way. Anyway, friends, let’s get on with the roundup!\n\r\n\r\n  \nA Bootiful Podcast: Benjamin Wilms, founder of the Chaos Monkey for Spring Boot and Steadybit, a company to help you build more robust software\n\r\n  \nBlockHound: how it works\n\r\n  \nGetting Started with Apache Camel and Spring Boot\n\r\n  \nGraalVM on Twitter\n\r\n  \nHello, Spring GraphQL\n\r\n  \nIntroducing Spring GraphQL\n\r\n  \nMaciej Walkowiak on Twitter\n\r\n  \nSpring Tips: Spring Retrosocket\n\r\n  \nUse New Relic to effortlessly monitor applications and dependencies in Azure Spring Cloud\n\r\n  \nDetect, Diagnose and Resolve Issues Faster in Spring Boot applications using @NewRelic across your Azure Spring Cloud instances. \n\r\n  \nRegister for @SpringOne today. https://t.co/2Imy31RPwz https://t.co/nVXiILvyOH http://bit.ly/SpringOne21TW VMwareTanzu SpringOne\n\r\n  \nThis project - mhewedy/spring-data-jpa-mongodb-expressions - adds MongoDB query expressions to Spring Data JPA. This’ll be a win for so many JavaScript clients that like to build queries using MongoDB expressions!",
          "link": "https://spring.io/blog/2021/07/06/this-week-in-spring-july-6th-2021",
          "publishedOn": "2021-07-07T01:42:00.000Z",
          "wordCount": 573,
          "title": "This Week in Spring - July 6th, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/07/06/introducing-spring-graphql",
          "author": null,
          "description": "Following the Spring GraphQL project announcement and the availability of a 1.0 milestone, this blog post aims to provide more details.\nIntroduction\n\r\nIf you’re looking to get started, please head over to our reference documentation and read the “Boot Starter” section, or run the samples.\n\r\nIf you don’t know much about GraphQL, there are plenty of good resources. You can start at graphql.org/learn. \n\r\nGraphQL is widely adopted and in “Early Majority” based on the InfoQ Architecture Trends for 2020. It provides an alternative to REST APIs that is more focused on data, and provides a schema and a query language for clients to use. The appeal from a client perspective is clear in this State of JavaScript report. You can read GitHub’s story on why it uses GraphQL.\nFoundational Support\n\r\nAs And…",
          "link": "https://spring.io/blog/2021/07/06/introducing-spring-graphql",
          "publishedOn": "2021-07-06T17:00:00.000Z",
          "wordCount": 1270,
          "title": "Introducing Spring GraphQL"
        },
        {
          "id": "https://spring.io/blog/2021/07/06/hello-spring-graphql",
          "author": null,
          "description": "Guest Author: Andy Marek, GraphQL Java founder\n\r\n\r\nI am very happy to announce the creation of the Spring GraphQL project and the availability of an initial milestone towards a 1.0 release. The project integrates GraphQL Java and Spring and was developed in collaboration between both teams.\n\r\nToday is GraphQL Java’s 6th birthday! One fundamental decision I made from the start was to leave any HTTP and IO aspects as a separate concern. GraphQL Java has always been “just” an engine to execute GraphQL requests. The decision has paid off but the obvious downside is the need to create your own HTTP adapter for real world usage.\n\r\nThis lead to the creation of a multitude of GraphQL integrations for Spring over the years, including the GraphQL Java Spring project from the GraphQL Java team.\n\r\nBut…",
          "link": "https://spring.io/blog/2021/07/06/hello-spring-graphql",
          "publishedOn": "2021-07-06T16:55:00.000Z",
          "wordCount": 822,
          "title": "Hello, Spring GraphQL"
        },
        {
          "id": "https://spring.io/blog/2021/07/01/a-bootiful-podcast-benjamin-wilms-founder-of-the-chaos-monkey-for-spring-boot-and-steadybit-a-company-to-help-you-build-more-robust-software",
          "author": null,
          "description": "Hi, Spring fans! In this installment, I am so happy to talk to Benjamin Wilms, who founded the Chaos Monkey for Spring Boot, and recently co-founded - along with Spring Boot Admin cofounder Johannes Edemeir - an exciting company called Steadybit whose SaaS tool aims to make your systems and services more robust. \n\r\n\r\n  \n@MrBWilms\n\r\n  \n@steadybithq",
          "link": "https://spring.io/blog/2021/07/01/a-bootiful-podcast-benjamin-wilms-founder-of-the-chaos-monkey-for-spring-boot-and-steadybit-a-company-to-help-you-build-more-robust-software",
          "publishedOn": "2021-07-01T17:00:00.000Z",
          "wordCount": 478,
          "title": "A Bootiful Podcast: Benjamin Wilms, founder of the Chaos Monkey for Spring Boot and Steadybit, a company to help you build more robust software"
        },
        {
          "id": "https://spring.io/blog/2021/07/01/use-new-relic-to-effortlessly-monitor-applications-and-dependencies-in-azure-spring-cloud",
          "author": null,
          "description": "Today, we are excited to announce the integration of New Relic One performance monitoring in Azure Spring Cloud.\n\r\nOver the past 18 months, we worked with many enterprise customers to learn about their scenarios. Many of these customers have thousands of Spring Boot applications running in on-premises data centers. As they migrate these applications to the cloud, they need to instrument them for application performance monitoring (APM) using tools that their developers are familiar with and have been using for years, and they must ensure continuity for desktop and mobile applications which are already pre-instrumented for end-to-end monitoring using agents like New Relic. With the integration of New Relic One in Azure Spring Cloud, you can continue your journey and easily instrument your S…",
          "link": "https://spring.io/blog/2021/07/01/use-new-relic-to-effortlessly-monitor-applications-and-dependencies-in-azure-spring-cloud",
          "publishedOn": "2021-07-01T15:00:00.000Z",
          "wordCount": 1514,
          "title": "Use New Relic to effortlessly monitor applications and dependencies in Azure Spring Cloud"
        },
        {
          "id": "https://spring.io/blog/2021/06/30/spring-tips-spring-retrosocket",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long looks at Spring Retrosocket, an EXPERIMENTAL project designed to provide an OpenFeign- or Retrofit-like experience for RSocket clients.",
          "link": "https://spring.io/blog/2021/06/30/spring-tips-spring-retrosocket",
          "publishedOn": "2021-06-30T07:00:00.000Z",
          "wordCount": 409,
          "title": "Spring Tips: Spring Retrosocket"
        },
        {
          "id": "https://spring.io/blog/2021/06/29/this-week-in-spring-june-29th-2021",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring! How’re you doin’? I’ve been busy working on new Spring Tips videos! (You are subscribed to our YouTube channel, aren’t you?) I’ll be doing Tanzu Code tomorrow, so don’t miss that. We’re going to be hacking on Spring Native, Spring Cloud Square, Spring Integration, and so much more. \n\r\n\r\n  \nHi, Spring fans! In last week’s installment of Spring Tips, I look at Kubernetes Native Java\n\r\n  \nA Bootiful Podcast: webassembly, IoT, data science, and Java guru Brian Sletten\n\r\n  \nBlog: Announcing Kubernetes Community Group Annual Reports\n\r\n  \nCVE report published for Spring Security\n\r\n  \nI was on the Software-Defined Talk podcast with Michael Coté last week. Check it out: Developer Relations with Josh Long\n\r\n  \nA new version of GraalVM Native Image build tools is available!\n\r\n  \nSpring Boot 2.4.8 is now available\n\r\n  \nSpring Boot 2.5.2 is now available\n\r\n  \nSpring Integration Zip 2.0.0 Available\n\r\n  \nMeet the team that worked with many customers to build the Azure Spring Cloud reference architecture. Deploy Spring Boot apps with confidence using enterprise best practices",
          "link": "https://spring.io/blog/2021/06/29/this-week-in-spring-june-29th-2021",
          "publishedOn": "2021-06-29T08:00:00.000Z",
          "wordCount": 566,
          "title": "This Week in Spring - June 29th, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/06/28/cve-report-published-for-spring-security",
          "author": null,
          "description": "We have released Spring Security 5.5.1, 5.4.7, 5.3.10 and 5.2.11 to address the following CVE report:\n\r\n\r\n  \nCVE-2021-22119: Denial-of-Service attack with spring-security-oauth2-client\n\r\n\r\nPlease review the information in the CVE report and upgrade immediately.\n\r\nSpring Boot users should upgrade to 2.5.2 or 2.4.8.",
          "link": "https://spring.io/blog/2021/06/28/cve-report-published-for-spring-security",
          "publishedOn": "2021-06-28T10:00:00.000Z",
          "wordCount": 428,
          "title": "CVE report published for Spring Security"
        },
        {
          "id": "https://spring.io/blog/2021/06/25/spring-integration-zip-2-0-0-available",
          "author": null,
          "description": "Dear Spring community,\n\r\n\r\n\r\nOn behalf of the team and everyone who contributed, it is my pleasure to announce 2.0.0 version for Spring Integration Zip extension.\n\r\n\r\n\r\nThis version is fully based on recently released Spring Integration 5.5.1 has upgraded other dependencies and  all the tests have been migrated to JUnit 5. The previously released released version 1.0.4 of spring-integration-zip is not compatible with Spring Integration 5th generation.\n\r\n\r\n\r\nThank you everyone who contributed!\n\r\n\r\n\r\nCheers, \n\r\nArtem\n\r\n\r\n\r\nProject Page | GitHub Issues | Contributing | Help | Chat",
          "link": "https://spring.io/blog/2021/06/25/spring-integration-zip-2-0-0-available",
          "publishedOn": "2021-06-25T18:55:28.000Z",
          "wordCount": 469,
          "title": "Spring Integration Zip 2.0.0 Available"
        },
        {
          "id": "https://spring.io/blog/2021/06/24/spring-boot-2-5-2-is-now-available",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.5.2 has been released and is now available from Maven Central.\n\r\nThis release includes 53 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/06/24/spring-boot-2-5-2-is-now-available",
          "publishedOn": "2021-06-25T02:00:00.000Z",
          "wordCount": 492,
          "title": "Spring Boot 2.5.2 is now available"
        },
        {
          "id": "https://spring.io/blog/2021/06/24/a-bootiful-podcast-webassembly-iot-data-science-and-java-guru-brian-sletten",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks to webassembly, IoT, data science, and Java guru Brian Sletten (@bsletten).",
          "link": "https://spring.io/blog/2021/06/24/a-bootiful-podcast-webassembly-iot-data-science-and-java-guru-brian-sletten",
          "publishedOn": "2021-06-24T19:00:00.000Z",
          "wordCount": 420,
          "title": "A Bootiful Podcast: webassembly, IoT, data science, and Java guru Brian Sletten"
        },
        {
          "id": "https://spring.io/blog/2021/06/24/spring-boot-2-4-8-is-now-available",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.4.8 has been released and is now available from Maven Central.\n\r\nThis release includes 33 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/06/24/spring-boot-2-4-8-is-now-available",
          "publishedOn": "2021-06-24T17:07:17.000Z",
          "wordCount": 492,
          "title": "Spring Boot 2.4.8 is now available"
        },
        {
          "id": "https://spring.io/blog/2021/06/23/spring-tips-kubernetes-native-java",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) looks at how to build Spring Boot applications destined for production on Kubernetes",
          "link": "https://spring.io/blog/2021/06/23/spring-tips-kubernetes-native-java",
          "publishedOn": "2021-06-23T07:00:00.000Z",
          "wordCount": 407,
          "title": "Spring Tips: Kubernetes Native Java"
        },
        {
          "id": "https://spring.io/blog/2021/06/22/this-week-in-spring-june-22nd-2021",
          "author": null,
          "description": "Hi, Spring fans! How’re y’all doing? Can you believe we’re almost halfway through this crazy little thing called 2021? Time sure flies when you’re having fun! This week was no exception. I joined the my buddy Matt Raible and Brian Demeers today for the OktaDev Twitch channel and we hacked on making the Spring Boot starter for Okta work with Spring Native. The goal is that you should be able to bring your application unchanged with Spring Native, and this is yet another example of that working. We didn’t know what issues we were going to face, but we managed to figure out the relatively minor things required to make it work within an hour and within two hours we had most a working, standalone “hints” .jar dependency that users can add to their spring-aot plugins dependencies. Hopefully they…",
          "link": "https://spring.io/blog/2021/06/22/this-week-in-spring-june-22nd-2021",
          "publishedOn": "2021-06-22T22:00:00.000Z",
          "wordCount": 944,
          "title": "This Week in Spring - June 22nd, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/06/22/spring-data-2021-0-2-and-2020-0-10-released",
          "author": null,
          "description": "On behalf of the team, I’m pleased to announce the availability of the Spring Data service 2021.0.2 and 2020.0.10 releases.\n\r\nBoth releases are built on top of Spring Framework 5.3.8. For your convenience, you can consumer these releases through Spring Boot 2.5.2 and 2.4.8, respectively.\n\r\nThe service releases ship with mostly bug fixes and dependency upgrades.\n\r\nTo round things off, here are the links to the artifacts, changelogs, and documentation:\n2021.0.2\n\r\n\r\n  \nSpring Data Commons 2.5.2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data JDBC 2.2.2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data JPA 2.5.2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data KeyValue 2.5.2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data…",
          "link": "https://spring.io/blog/2021/06/22/spring-data-2021-0-2-and-2020-0-10-released",
          "publishedOn": "2021-06-22T14:36:00.000Z",
          "wordCount": 840,
          "title": "Spring Data 2021.0.2 and 2020.0.10 released"
        },
        {
          "id": "https://spring.io/blog/2021/06/22/spring-security-5-5-1-5-4-7-5-3-10-and-5-2-11-released",
          "author": null,
          "description": "On behalf of the community, I’m pleased to announce the release of Spring Security 5.5.1 (release notes), 5.4.7 (release notes), 5.3.10 (release notes), and 5.2.11 (release notes). These releases deliver bug fixes along with some minor improvements. Users are encouraged to update to the latest patch release.\n\r\n\r\n\r\nProject Site | Reference | Help",
          "link": "https://spring.io/blog/2021/06/22/spring-security-5-5-1-5-4-7-5-3-10-and-5-2-11-released",
          "publishedOn": "2021-06-22T13:00:00.000Z",
          "wordCount": 444,
          "title": "Spring Security 5.5.1, 5.4.7, 5.3.10 and 5.2.11 released"
        },
        {
          "id": "https://spring.io/blog/2021/06/21/spring-tools-4-11-0-released",
          "author": null,
          "description": "Dear Spring Community,\n\r\nI am happy to announce the 4.11.0 release of the Spring Tools 4 for Eclipse, Visual Studio Code, and Theia.\nmajor changes to the Spring Tools 4 for Eclipse distribution\n\r\n\r\n  \nupdated to Eclipse 2021-06 release (including support for Java 16) (new and noteworthy)\n\r\n  \nearly-access builds for Apple Silicon platform (ARM M1) available\n\r\n\nreminder\n\r\n\r\n  \nthe Eclipse-based distribution of the Spring Tools 4 requires a JDK11 (or newer) to run on\n\r\n  \nthe Eclipse-based distribution ships with an embedded JDK16 runtime, no need to install or configure a specific JDK to run the IDE on anymore\n\r\n\nadditional highlights\n\r\n\r\n  \n(VS Code, Spring Boot) new: new walkthrough contribution to get started with Spring Boot in VS Code\n\r\n  \n(VS Code, Spring Boot) fixed: not work when change LightWeight mode to Standard (#628)\n\r\n  \n(VS Code, Spring Boot) fixed: language server processes doesn’t get shutdown properly in VSCode (#636)\n\r\n  \n(VS Code, Spring Boot) fixed: VSCode extension JDK version (#612)\n\r\n  \n(Eclipse) improvement: Boot Dash: flexible and configurable filters (#614)\n\r\n  \n(Eclipse) improvement: hide projects without a main class from boot dashboard automatically (#605)\n\r\n  \n(Concourse) improvement: VSCode extension doesn’t understand glob patterns in group config (#639)\n\r\n  \n(Concourse) improvement: Step and properties not recognized (#633)\n\r\n\r\nTo download the distribution for Eclipse and find links to the marketplace entries for Visual Studio Code and Theia, please go visit:\n\r\n\r\n  \nSpring Tools 4: https://spring.io/tools/\n\r\n\r\nDetailed changes can be found here: https://github.com/spring-projects/sts4/wiki/Changelog#2021-06-18-4110-release-incl-language-servers-version-1260\n\r\nSpring Tools 4.11.1 is scheduled to be released in early August 2021.\n\r\nEnjoy!",
          "link": "https://spring.io/blog/2021/06/21/spring-tools-4-11-0-released",
          "publishedOn": "2021-06-21T17:00:00.000Z",
          "wordCount": 624,
          "title": "Spring Tools 4.11.0 released"
        },
        {
          "id": "https://spring.io/blog/2021/06/17/a-bootiful-podcast-azure-developer-advocate-rory-preddy-on-spring-java-azure-spring-cloud-and-more",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of a Bootiful Podcast! In this installment, Josh Long (@starbuxman) talks to Azure Developer Advocate Rory Preddy (@rorypreddy).",
          "link": "https://spring.io/blog/2021/06/17/a-bootiful-podcast-azure-developer-advocate-rory-preddy-on-spring-java-azure-spring-cloud-and-more",
          "publishedOn": "2021-06-17T11:00:00.000Z",
          "wordCount": 432,
          "title": "A Bootiful Podcast: Azure Developer Advocate Rory Preddy on Spring, Java, Azure Spring Cloud and more"
        }
      ]
    },
    {
      "title": "HashiCorp Blog",
      "feedUrl": "https://www.hashicorp.com/blog/feed.xml",
      "siteUrl": "https://hashicorp.com/blog",
      "articles": [
        {
          "id": "https://www.hashicorp.com/blog/managing-ssh-access-at-scale-with-hashicorp-vault",
          "author": null,
          "description": "Learn how to build scalable, role-based SSH access with SSH certificates and HashiCorp Vault.",
          "link": "https://www.hashicorp.com/blog/managing-ssh-access-at-scale-with-hashicorp-vault",
          "publishedOn": "2021-07-07T16:00:00.000Z",
          "wordCount": 3873,
          "title": "Managing SSH Access at Scale with HashiCorp Vault"
        },
        {
          "id": "https://www.hashicorp.com/blog/transparent-proxy-on-consul-service-mesh",
          "author": null,
          "description": "Consul 1.10 can transparently intercept and redirect traffic to sidecar proxies in the service mesh to allow applications to be deployed without modification.",
          "link": "https://www.hashicorp.com/blog/transparent-proxy-on-consul-service-mesh",
          "publishedOn": "2021-07-01T20:00:00.000Z",
          "wordCount": 1948,
          "title": "Transparent Proxy on Consul Service Mesh"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-hashicorp-boundary-0-4",
          "author": null,
          "description": "HashiCorp Boundary 0.4.0 and Boundary Desktop 1.2.0 includes features supporting brokering of HashiCorp Vault secrets for Boundary targets to end-users, enhanced session cleanup, and foundational features for event logging.",
          "link": "https://www.hashicorp.com/blog/announcing-hashicorp-boundary-0-4",
          "publishedOn": "2021-07-01T16:00:00.000Z",
          "wordCount": 795,
          "title": "Announcing HashiCorp Boundary 0.4"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-vault-achieves-red-hat-openshift-helm-certification",
          "author": null,
          "description": "The HashiCorp Vault Helm chart has achieved Red Hat OpenShift Certification to help OpenShift users more readily deploy secrets management on Kubernetes.",
          "link": "https://www.hashicorp.com/blog/hashicorp-vault-achieves-red-hat-openshift-helm-certification",
          "publishedOn": "2021-07-01T15:00:00.000Z",
          "wordCount": 665,
          "title": "HashiCorp Vault Achieves Red Hat OpenShift Helm Certification"
        },
        {
          "id": "https://www.hashicorp.com/blog/onboarding-applications-to-vault-using-terraform-a-practical-guide",
          "author": null,
          "description": "Learn how to build an automated HashiCorp Vault onboarding system with Terraform using sensible naming standards, ACL policy templates, pre-created application entities, and workflows driven by VCS and CI/CD.",
          "link": "https://www.hashicorp.com/blog/onboarding-applications-to-vault-using-terraform-a-practical-guide",
          "publishedOn": "2021-06-29T16:00:00.000Z",
          "wordCount": 2272,
          "title": "Onboarding Applications to Vault Using Terraform: A Practical Guide"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-certified-a-great-place-to-work",
          "author": null,
          "description": "93% of our employees say HashiCorp is a great place to work. In this blog, we share the results from our recent Great Place to Work Trust Index employee survey.",
          "link": "https://www.hashicorp.com/blog/hashicorp-certified-a-great-place-to-work",
          "publishedOn": "2021-06-25T16:00:00.000Z",
          "wordCount": 745,
          "title": "HashiCorp Certified a Great Place to Work"
        },
        {
          "id": "https://www.hashicorp.com/blog/5-zero-trust-security-takeaways-from-hashiconf-europe",
          "author": null,
          "description": "HashiConf Europe speakers from Starbucks and Roblox share how they leverage HashiCorp Vault, Consul, and Boundary to create a zero trust security model.",
          "link": "https://www.hashicorp.com/blog/5-zero-trust-security-takeaways-from-hashiconf-europe",
          "publishedOn": "2021-06-24T16:00:00.000Z",
          "wordCount": 1325,
          "title": "5 Zero Trust Security Takeaways From HashiConf Europe"
        },
        {
          "id": "https://www.hashicorp.com/blog/gke-cluster-setup-with-cdk-for-terraform",
          "author": null,
          "description": "Learn how to provision a Google Kubernetes Engine (GKE) cluster and prepare it for application deployment using TypeScript via CDK for Terraform.",
          "link": "https://www.hashicorp.com/blog/gke-cluster-setup-with-cdk-for-terraform",
          "publishedOn": "2021-06-23T20:00:00.000Z",
          "wordCount": 3442,
          "title": "GKE Cluster Setup with CDK for Terraform"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-consul-1-10",
          "author": null,
          "description": "Consul 1.10 adds exciting new features such as transparent proxy for service mesh, support for xDS v3, streaming, and observability enhancements.",
          "link": "https://www.hashicorp.com/blog/announcing-consul-1-10",
          "publishedOn": "2021-06-23T16:00:00.000Z",
          "wordCount": 1041,
          "title": "Announcing Consul 1.10 GA"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-the-google-workspace-provider-for-hashicorp-terraform-tech-preview",
          "author": null,
          "description": "A new Terraform provider allows you to manage users, groups, and domains in your Google Workspace (formerly G Suite).",
          "link": "https://www.hashicorp.com/blog/announcing-the-google-workspace-provider-for-hashicorp-terraform-tech-preview",
          "publishedOn": "2021-06-23T15:00:00.000Z",
          "wordCount": 1308,
          "title": "Announcing the Google Workspace Provider for HashiCorp Terraform Tech Preview"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-general-availability-of-consul-terraform-sync-0-2",
          "author": null,
          "description": "CTS 0.2 includes Task Run Conditions, Terraform 0.15 Support, and more.",
          "link": "https://www.hashicorp.com/blog/announcing-general-availability-of-consul-terraform-sync-0-2",
          "publishedOn": "2021-06-22T19:00:00.000Z",
          "wordCount": 1000,
          "title": "Announcing General Availability of Consul-Terraform-Sync 0.2"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashiconf-europe-2021-recap-and-videos",
          "author": null,
          "description": "Watch all 30+ videos HashiConf Europe 2021 with these on-demand videos of all the keynotes, sessions, and customer presentations.",
          "link": "https://www.hashicorp.com/blog/hashiconf-europe-2021-recap-and-videos",
          "publishedOn": "2021-06-21T18:30:00.000Z",
          "wordCount": 1989,
          "title": "HashiConf Europe 2021 Recap and Videos"
        },
        {
          "id": "https://www.hashicorp.com/blog/survey-results-how-do-you-connect-with-consul",
          "author": null,
          "description": "We asked users how they are using HashiCorp Consul, here’s what they told us.",
          "link": "https://www.hashicorp.com/blog/survey-results-how-do-you-connect-with-consul",
          "publishedOn": "2021-06-17T16:00:00.000Z",
          "wordCount": 1186,
          "title": "Survey Results:  How Do You Connect with Consul?"
        },
        {
          "id": "https://www.hashicorp.com/blog/how-build-network-infrastructure-automation-nia-hashicorp-terraform-consul-a10-adc",
          "author": null,
          "description": "Get a walkthrough of the code and workflow for setting up NIA with Consul-Terraform-Sync (CTS) and A10 ADC.",
          "link": "https://www.hashicorp.com/blog/how-build-network-infrastructure-automation-nia-hashicorp-terraform-consul-a10-adc",
          "publishedOn": "2021-06-16T16:00:00.000Z",
          "wordCount": 2457,
          "title": "How to Build Network Infrastructure Automation (NIA) with HashiCorp Terraform, Consul, and A10 ADC"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-hashicorp-boundary-0-3",
          "author": null,
          "description": "The latest release of HashiCorp Boundary includes managed groups and OIDC configuration improvements, while Boundary Desktop is now available on Windows.",
          "link": "https://www.hashicorp.com/blog/announcing-hashicorp-boundary-0-3",
          "publishedOn": "2021-06-15T16:00:00.000Z",
          "wordCount": 788,
          "title": "Announcing HashiCorp Boundary 0.3"
        },
        {
          "id": "https://www.hashicorp.com/blog/toward-vagrant-3-0",
          "author": null,
          "description": "In order to support its growing ecosystem and community as we move toward the 3.0 release, we are making changes to Vagrant that will maintain its Ruby-based features while being ported to Go.",
          "link": "https://www.hashicorp.com/blog/toward-vagrant-3-0",
          "publishedOn": "2021-06-11T16:00:00.000Z",
          "wordCount": 1801,
          "title": "Toward Vagrant 3.0"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-hcp-packer",
          "author": null,
          "description": "HCP Packer is a new cloud service designed to bridge the gap between image creation and deployment with image-management workflows. The service will be available for beta testing in the coming months.",
          "link": "https://www.hashicorp.com/blog/announcing-hcp-packer",
          "publishedOn": "2021-06-09T10:50:00.000Z",
          "wordCount": 901,
          "title": "Announcing HCP Packer"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-cloud-platform-adds-transit-gateway-okta-new-skus",
          "author": null,
          "description": "The HashiCorp Cloud Platform (HCP) now has expanded capabilities for networking, single sign-on, and more. HCP will also support new configurations of HashiCorp Consul and HashiCorp Vault in the coming months.",
          "link": "https://www.hashicorp.com/blog/hashicorp-cloud-platform-adds-transit-gateway-okta-new-skus",
          "publishedOn": "2021-06-09T10:50:00.000Z",
          "wordCount": 1403,
          "title": "HashiCorp Cloud Platform Adds Transit Gateway, Okta Support, New Packages"
        }
      ]
    },
    {
      "title": "Elastic Blog - Elasticsearch, Kibana, and ELK Stack",
      "feedUrl": "https://www.elastic.co/blog/feed",
      "siteUrl": "https://www.elastic.co",
      "articles": [
        {
          "id": "https://www.elastic.co/blog/elastic-stack-7-13-3-released",
          "author": "João Duarte",
          "description": "Elastic Stack 7.13.3 has been released. Read about the updates and bug fixes that have been included in Elasticsearch, Kibana, Beats, Logstash, Workplace Search, App Search and APM.",
          "link": "https://www.elastic.co/blog/elastic-stack-7-13-3-released",
          "publishedOn": "2021-07-07T18:01:00.000Z",
          "wordCount": 280,
          "title": "Elastic Stack 7.13.3 released"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-security-prevents-100-percent-of-revil-ransomware-samples",
          "author": "Jamie Butler",
          "description": "Users of Elastic Security are protected through numerous layers of protections against the REvil ransomware that affected Kaseya VSA and its customers. Elastic Security’s layered protections prevented 100% of the REvil ransomware samples tested before damage and loss could occur to the business.\n\nWe believe that detections and preventions must be layered, as no single protection works 100% of the time. There are times where detection in the SIEM/central analytics layer is the most effective, especially when you need to take signals from multiple places or correlate the activity to determine it is malicious. However, the most effective way to stop an attack is at the host. \n\nPrevention is paramount when it comes to ransomware. Teams cannot wait to be notified of an issue after their data is…",
          "link": "https://www.elastic.co/blog/elastic-security-prevents-100-percent-of-revil-ransomware-samples",
          "publishedOn": "2021-07-07T18:00:00.000Z",
          "wordCount": 1288,
          "title": "Elastic Security prevents 100% of REvil ransomware samples"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-stack-6-8-17-released",
          "author": "João Duarte",
          "description": "Elastic Stack 6.8.17 has been released. Read about the updates and bug fixes that have been included in Kibana, Elasticsearch, Beats, Logstash.",
          "link": "https://www.elastic.co/blog/elastic-stack-6-8-17-released",
          "publishedOn": "2021-07-07T18:00:00.000Z",
          "wordCount": 276,
          "title": "Elastic Stack 6.8.17 released"
        },
        {
          "id": "https://www.elastic.co/blog/notice-cipher-changes-ess",
          "author": "Shubha Anjur Tupil",
          "description": "At Elastic Cloud we are committed to offering our customers the most secure way to run their workloads in the cloud. With the goal of being “secure by default,” we are deprecating ciphers that are considered weak and insecure. Going forward, we will only support ciphers that are included in the Mozilla intermediate list. These changes will take effect after January 30, 2022. We will communicate a precise date closer to the change.\n\nWhat are the changes?\nWe are updating the list of ciphers supported for clients connecting to their Elasticsearch clusters, Kibana, or other components on Elasticsearch Service. The changes are basically on two fronts:\n\n \n\t\nWe will deprecate certain ciphers that are considered weak by modern encryption standards. The ciphers we are going to stop supporting in al…",
          "link": "https://www.elastic.co/blog/notice-cipher-changes-ess",
          "publishedOn": "2021-07-07T15:00:00.000Z",
          "wordCount": 658,
          "title": "Changes to support for ciphers used to connect to Elasticsearch Service"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-security-recognized-in-gartner-magic-quadrant-for-siem",
          "author": "Mike Nichols,Mark Settle",
          "description": "We’re excited to share that Elastic Security has been recognized in the 2021 Gartner Magic Quadrant for Security Information and Event Management (SIEM). Elastic Security is the latest Elastic solution to be recognized in a 2021 Gartner Magic Quadrant report, following the 2021 Magic Quadrant for Insight Engines and 2021 Magic Quadrant for Application Performance Monitoring. \n\nDownload the complimentary report to see Gartner’s market evaluation, and read on to understand why we think that momentum is continuing to build for Elastic Security.\n\n\nThe 2021 Gartner Magic Quadrant for Security Information and Event Management (SIEM)1\n\n \n\nSIEM for the modern SOC\nThe Elastic Stack has enabled security teams at organizations like Uber and the Indiana University OmniSOC revamp how they operate since…",
          "link": "https://www.elastic.co/blog/elastic-security-recognized-in-gartner-magic-quadrant-for-siem",
          "publishedOn": "2021-07-06T19:00:00.000Z",
          "wordCount": 1280,
          "title": "Elastic Security Recognized in the 2021 Gartner Magic Quadrant for SIEM"
        },
        {
          "id": "https://www.elastic.co/blog/secure-your-deployments-on-elastic-cloud-with-azure-private-link",
          "author": "Shubha Anjur Tupil",
          "description": "We are pleased to announce the general availability of the Azure Private Link integration with Elastic Cloud. Azure Private Link provides private connectivity between your VNET (Virtual Network) and other Azure resources. Private Link simplifies your cloud network architecture and eliminates data exposure to the public internet by routing your data to private Azure service endpoints.  \n The use of Azure Private Link with Elastic Cloud provides an additional layer of security to help you meet your security policy and compliance requirements. You can take advantage of Azure Private Link across all subscription tiers on Elastic Cloud. In this blog we’ll show you how easy it is to get started. We’ll walk you through the steps to configure Private Link access between your VNET and Elastic Cloud…",
          "link": "https://www.elastic.co/blog/secure-your-deployments-on-elastic-cloud-with-azure-private-link",
          "publishedOn": "2021-07-06T18:00:00.000Z",
          "wordCount": 827,
          "title": "Secure your deployments on Elastic Cloud with Azure Private Link"
        },
        {
          "id": "https://www.elastic.co/blog/culture-managers-how-to-be-an-ally-and-build-an-inclusive-team",
          "author": "Kristina Frost",
          "description": "Over my years at Elastic, I’ve found myself privileged to be part of a number of different conversations around diversity, equity, and inclusion, starting with the Women of Elastic breakfasts at some of our oldest user conferences. Those meetups turned out to be just the start of a small snowball headed down a big hill, and have led to all kinds of wonderful diversity initiatives all throughout the company.\n\nIn the Business Technology team, we have worked hard to create a diverse team featuring multiple women in leadership roles, people of color, individuals who are not neurotypical, folks who struggle with mental health, and individuals who identify as part of the LGBTQ+ community. As a white, cisgender woman living the single life, I don’t always have shared experiences in each of these …",
          "link": "https://www.elastic.co/blog/culture-managers-how-to-be-an-ally-and-build-an-inclusive-team",
          "publishedOn": "2021-07-06T15:00:00.000Z",
          "wordCount": 1114,
          "title": "Managers: How to be an ally and build an inclusive team"
        },
        {
          "id": "https://www.elastic.co/blog/migrating-ess-certs-letsencrypt",
          "author": "Shubha Anjur Tupil",
          "description": "At Elastic Cloud we are committed to offering our customers the most secure way to run their workloads in the cloud. To help ensure this commitment, we are migrating our TLS certificates to Let’s Encrypt to best support sustainable and fully automated certificate management as our product offerings and available regions continue to expand.\n\nThese changes will begin rolling out to Elastic Cloud regions beginning October 4, 2021, and are expected to be completed in all regions by October 29, 2021. \n\nThe first region will be Azure southcentralus on October 4, 2021. After updating this region, we will pause the rollout to other regions for 14 days to allow for client validation. The remaining regions will begin being updated on October 18, 2021. We will post updates on our status page as the r…",
          "link": "https://www.elastic.co/blog/migrating-ess-certs-letsencrypt",
          "publishedOn": "2021-07-05T15:00:00.000Z",
          "wordCount": 699,
          "title": "Migrating the Certificate Authority (CA) for Elasticsearch Service to Let’s Encrypt"
        },
        {
          "id": "https://www.elastic.co/blog/ingesting-threat-data-with-threat-intel-filebeat-module",
          "author": "Elastic Security Intelligence & Analytics Team",
          "description": "The ability for security teams to integrate threat data into their operations substantially helps their organization identify potentially malicious endpoint and network events using indicators identified by other threat research teams. In this blog, we’ll cover how to ingest threat data with the Threat Intel Filebeat module. In future blog posts, we'll cover enriching threat data with the Threat ECS fieldset and operationalizing threat data with Elastic Security.\n \nElastic Filebeat modules\n\nElastic Filebeat modules simplify the collection, parsing, and visualization of data stored in common log formats. Elastic publishes a variety of Filebeat modules that are focused on collecting the data you want for use within Elasticsearch. These modules provide a standardized and “turnkey” method to i…",
          "link": "https://www.elastic.co/blog/ingesting-threat-data-with-threat-intel-filebeat-module",
          "publishedOn": "2021-07-01T15:00:00.000Z",
          "wordCount": 3598,
          "title": "Ingesting threat data with the Threat Intel Filebeat module"
        },
        {
          "id": "https://www.elastic.co/blog/how-the-elastic-infosec-team-uses-elastic-security",
          "author": "Michael Baldwin",
          "description": "At Elastic, we internally use, test, and provide feedback on all of our products. For example, the Information Security team is helping the Product team build a stronger solution for our customers.\n\nThe InfoSec team is an extremely valuable resource who acts not only as an extension of Quality Assurance/Testing, but also as a data custodian. In fact, our internal detections team utilizes internal Elastic InfoSec data to help build and test detection rules that ultimately find their way into the Elastic Security product.\nLast month, I was afforded the wonderful opportunity of “riding along” with our InfoSec team to better understand how we use Elastic internally. Over the course of three days, spread across three weeks, I saw the underbelly of our internal systems, how they are used, and ho…",
          "link": "https://www.elastic.co/blog/how-the-elastic-infosec-team-uses-elastic-security",
          "publishedOn": "2021-06-30T18:00:00.000Z",
          "wordCount": 1293,
          "title": "How the Elastic InfoSec team uses Elastic Security"
        },
        {
          "id": "https://www.elastic.co/blog/monitoring-kubernetes-with-the-elastic-stack-using-prometheus-and-fluentd",
          "author": "Yukiya Shimizu",
          "description": "Kubernetes is an open source container orchestration system for automating computer application deployment, scaling, and management, and seems to have established itself as the de facto standard in this area these days. The shift from monolithic applications to microservices brought by Kubernetes has enabled faster deployment, where dynamic environments become commonplace. But on the other hand, this has made monitoring applications and their underpinning infrastructure more complex. Fortunately, Elastic has been widely used for infrastructure and application monitoring solutions for many years — both as the ELK Stack (Elasticsearch, Logstash, and Kibana) and more recently as Elastic Observability. While Elastic Observability can be used to establish observability for Kubernetes environmen…",
          "link": "https://www.elastic.co/blog/monitoring-kubernetes-with-the-elastic-stack-using-prometheus-and-fluentd",
          "publishedOn": "2021-06-29T18:00:00.000Z",
          "wordCount": 1627,
          "title": "Monitoring Kubernetes with the Elastic Stack using Prometheus and Fluentd"
        },
        {
          "id": "https://www.elastic.co/blog/culture-someone-like-me-when-theres-diversity-my-work-is-better",
          "author": "Elastic Culture",
          "description": "We all want to work for a company where we fit in. That’s why Elastic built a Source Code that encourages all to come as they are. In this Pride blog series, we highlight LGBTQIA+ Elasticians who have a unique story — one, perhaps, just as unique as yours. \n David Ricordel, a consulting architect based in Barcelona, says: “If we bring more diverse people to our companies, it’s a way to allow people to feel safe being who they are.” Being safe, in turn, helps Elasticians focus their energy on work and growing as professionals. \n \nWhen did you realize that Elastic placed importance on diversity, equity, and inclusion?\n \nIt started at my orientation, which we call X-School, traveling to Mountain View, CA. That’s when I saw that everything was different. There was diversity in the people who w…",
          "link": "https://www.elastic.co/blog/culture-someone-like-me-when-theres-diversity-my-work-is-better",
          "publishedOn": "2021-06-29T15:00:00.000Z",
          "wordCount": 773,
          "title": "Someone Like Me | When there’s diversity, my work is better"
        },
        {
          "id": "https://www.elastic.co/blog/finding-business-critical-files-is-a-top-challenge-for-workers-better-search-is-the-answer",
          "author": "Matt Riley",
          "description": "Even before COVID-19 forced nearly everyone to grapple with virtual work, most organizations had mountains of content scattered across numerous teams and dozens, if not hundreds, of apps. But now new research shows the cost of poor employee experiences for organizations: productivity, confidence, and opportunity.\n\nWhile blended work environments are likely here to stay, 58% of 1,000 US-based knowledge workers surveyed by Wakefield Research on behalf of Elastic say searching for documents is a top work-from-home problem. Moreover, 81% say they have a hard time finding documents when a boss or client has put them in the hot seat. As employers forge new paths for growth in the post-pandemic era, and demand for a distributed work model persists, business leaders must better empower workers to …",
          "link": "https://www.elastic.co/blog/finding-business-critical-files-is-a-top-challenge-for-workers-better-search-is-the-answer",
          "publishedOn": "2021-06-29T13:00:00.000Z",
          "wordCount": 808,
          "title": "Finding business-critical files is a top challenge for workers — better search is the answer"
        },
        {
          "id": "https://www.elastic.co/blog/how-to-migrate-from-swiftype-app-search-to-elastic-cloud",
          "author": "Rathin Sawhney",
          "description": "If you are a current App Search user on Swiftype.com and you’d like to move to Elastic Cloud to benefit from the latest developments — look no further! Here’s a sampling of all the long term benefits you’ll enjoy after migrating:\n\nFaster performance, plus data locality\nMore flexibility and scalability \nEasier log and analytics management\n\n\n\n\tNote: If you’re not yet sure about moving you can read about the benefits of migrating. It’s also helpful to note that the planned end-of-life for Swiftype App Search is in early 2023.\n\t\n\n\n\nIn this blog we look at automating engine transfers from App Search on Swiftype.com to App Search on Elastic Cloud, using nothing but simple Python scripts and the available APIs. At the end of this process, you’ll be left with exactly the same engines on Elastic Cl…",
          "link": "https://www.elastic.co/blog/how-to-migrate-from-swiftype-app-search-to-elastic-cloud",
          "publishedOn": "2021-06-24T18:00:00.000Z",
          "wordCount": 1385,
          "title": "How to migrate from Swiftype App Search to Elastic Cloud"
        },
        {
          "id": "https://www.elastic.co/blog/practical-cpu-time-performance-tuning-security-software",
          "author": "Yamin Tian",
          "description": "“Wasting other people’s time is tantamount to robbery and murder, and wasting one’s own time is tantamount to chronic suicide.” - Lu Xun\n\nSoftware performance issues come in all shapes and sizes. Therefore, performance tuning includes many aspects and subareas, and has to adopt a broad range of methodologies and techniques. Despite all this, time is one of the most critical measurements of software performance. \n\nIn this multi-part series, I’ll focus on a few of the time-related aspects of software performance — particularly for security software. Each post in this series will focus on a single topic, including how to identify performance issues, how to fix them, and how to avoid them in future. \n\n%CPU\nLet’s start by diving into a high %CPU usage example on macOS. I wrote a demo program ca…",
          "link": "https://www.elastic.co/blog/practical-cpu-time-performance-tuning-security-software",
          "publishedOn": "2021-06-24T15:00:00.000Z",
          "wordCount": 1587,
          "title": "Practical CPU time performance tuning for security software: Part 1"
        },
        {
          "id": "https://www.elastic.co/blog/improve-search-relevance-by-combining-elasticsearch-stemmers-and-synonyms",
          "author": "Alex Marquardt",
          "description": "In a previous blog, we covered how you can incorporate synonyms into your Elasticsearch-powered application. Here, I build upon that blog and show how you can combine stemmers and multi-word synonyms to take the quality of your search results to the next level. \n \nMotivation\n\nImagine that you are using Elasticsearch to power a search application for finding books, and in this application you want to treat the following words as synonyms:\n\nbrainstorm\nbrainstorming\nbrainstormed\nbrain storm\nbrain storming\nbrain stormed\nenvisage\nenvisaging\nenvisaged\netc.\nIt is tedious and error prone to explicitly use synonyms to define all possible conjugations, declensions, and inflections of a word or of a compound word.\n\nHowever, it is possible to reduce the size of the list of synonyms by making use of a …",
          "link": "https://www.elastic.co/blog/improve-search-relevance-by-combining-elasticsearch-stemmers-and-synonyms",
          "publishedOn": "2021-06-23T18:00:00.000Z",
          "wordCount": 1184,
          "title": "Improve search relevance by combining Elasticsearch stemmers and synonyms"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-cloud-enterprise-platform-redesign",
          "author": "Omer Kushmaro",
          "description": "We’re excited to introduce usability enhancements to the Elastic Cloud Enterprise (ECE) platform administration console to simplify your experience. \n\nAdministration is shifting to a host-based management and dedicated role pages for ECE proxies and control plane. Moreover, when you upgrade to ECE 2.10, you’ll see usability enhancements within the administration console, including:\n\nSimplified management of ECE host roles, streamlining your operations\nEasy access to a central view of all the physical or virtual hosts managed by ECE\nA dedicated proxy and control plane view\nThis is an important first step in streamlining tasks and workflows within ECE to make it easier for ECE administrators like you to understand and operate. Keep reading to learn more.\n\nRole names\n\n\t\nThe Coordinator role c…",
          "link": "https://www.elastic.co/blog/elastic-cloud-enterprise-platform-redesign",
          "publishedOn": "2021-06-23T16:00:00.000Z",
          "wordCount": 763,
          "title": "A new, more streamlined experience for Elastic Cloud Enterprise admins"
        },
        {
          "id": "https://www.elastic.co/blog/culture-exponential-growth-experienced-leadership-values-define-growing-sales-organization",
          "author": "Riva Froymovich",
          "description": "The sales organization at Elastic is growing exponentially as demand for our solutions rises. \n\nOur talent has the opportunity to build career-defining relationships and impact alongside newly recruited industry leaders. \n\nThe volume of data companies produce just keeps increasing, and Elastic is in a unique position to help our customers realize value through search experiences. Search enables employees and customers to access data easily, whether through a simple search box or a more sophisticated cloud monitoring infrastructure. That can improve decision-making, customer retention, and employee satisfaction. With Elastic’s industry-leading solutions, we have a total addressable market in the tens of billions of dollars, and we are on the path to becoming a $1 billion-plus company. \n\nAnd…",
          "link": "https://www.elastic.co/blog/culture-exponential-growth-experienced-leadership-values-define-growing-sales-organization",
          "publishedOn": "2021-06-22T19:00:00.000Z",
          "wordCount": 1195,
          "title": "Exponential growth, experienced leadership, values define growing sales organization"
        },
        {
          "id": "https://www.elastic.co/blog/new-in-kibana-how-we-made-it-easier-manage-visualizations-and-build-dashboards",
          "author": "Poff Poffenberger",
          "description": "Our Kibana team has been hard at work implementing and executing on a new Kibana strategic vision to streamline the dashboard creation process and sand down the rough edges of creating visualizations for dashboards. We accomplished our goal and reduced the overall time it takes users to go from a blank slate to a meaningful dashboard that conveys insights about the data. \n In this post, I’m going to explain the technical concepts behind these improvements, and how they work to create a user-friendly and efficient dashboard creation process. My hope for this post is that it helps inform the mental models of our curious power users while they attempt to learn these new dashboard creation flows. For a high-level walkthrough of the Kibana features, check out our other blog post, Building Kiban…",
          "link": "https://www.elastic.co/blog/new-in-kibana-how-we-made-it-easier-manage-visualizations-and-build-dashboards",
          "publishedOn": "2021-06-22T16:00:00.000Z",
          "wordCount": 1066,
          "title": "New in Kibana: How we made it easier to manage visualizations and build dashboards"
        },
        {
          "id": "https://www.elastic.co/blog/easily-ingest-data-to-elastic-via-splunk",
          "author": "Jamie Hynds",
          "description": "As organizations migrate to Elastic from incumbent vendors, quickly onboarding log data from their current solution into Elastic is one of the first orders of business. Data onboarding often involves having to adjust ingestion architecture and implement configuration changes across data sources. We want to ensure that users trialing or migrating to Elastic can get data in quickly to start seeing the power of Elastic solutions as quickly as possible. That’s why we built an integration that automatically maps Splunk-ingested data to Elastic Common Schema (ECS). \n In this blog post, we’ll be walking you through this experimental Splunk integration, released in version 7.12 of the Elastic Stack. This integration allows you to keep your Splunk universal forwarders and other Splunk ingest techno…",
          "link": "https://www.elastic.co/blog/easily-ingest-data-to-elastic-via-splunk",
          "publishedOn": "2021-06-22T15:00:00.000Z",
          "wordCount": 783,
          "title": "Easily ingest data to Elastic via Splunk"
        }
      ]
    },
    {
      "title": "Ansible Blog",
      "feedUrl": "https://www.ansible.com/blog/rss.xml",
      "siteUrl": "https://www.ansible.com/blog",
      "articles": [
        {
          "id": "https://www.ansible.com/blog/aix-patch-management-with-ansible",
          "author": "Talor Holloway",
          "description": "Leading enterprises today use Red Hat Ansible Automation Platform to provision, configure, manage, secure and orchestrate hybrid IT environments. A common misconception is that Ansible is just used to manage the Linux operating system. This is a false belief. Ansible supports Linux, Windows, AIX, IBM i and IBM z/OS environments. This blog will help AIX system administrators get started with Ansible on AIX, and introduce a patching use case.",
          "link": "https://www.ansible.com/blog/aix-patch-management-with-ansible",
          "publishedOn": "2021-07-07T17:00:00.000Z",
          "wordCount": 2354,
          "title": "AIX Patch Management with Ansible"
        },
        {
          "id": "https://www.ansible.com/blog/using-vmware-vcenter-tags-in-a-red-hat-ansible-tower-dynamic-inventory",
          "author": "Raed Soliman",
          "description": "VMware vCenter Server tags are labels that can be applied to objects like the system’s environment and usage, therefore it is a very useful method of asset management - also making tags a perfect fit in the Ansible world to organize systems in an Ansible inventory. Red Hat customers have regularly requested the ability to use vCenter Tags in Red Hat Ansible Tower. This is now possible with an Ansible Tower inventory source that supports tags and provides the vmware_vm_inventory plugin.",
          "link": "https://www.ansible.com/blog/using-vmware-vcenter-tags-in-a-red-hat-ansible-tower-dynamic-inventory",
          "publishedOn": "2021-06-22T13:00:00.000Z",
          "wordCount": 1982,
          "title": "Using VMware vCenter Tags in a Red Hat Ansible Tower Dynamic Inventory"
        },
        {
          "id": "https://www.ansible.com/blog/getting-started-with-ansible-security-automation-incident-response",
          "author": "Craig Brandt",
          "description": "Technological advancements are intended to bring more control, agility and velocity to organizations. However, adopting these new technologies and techniques, such as cloud computing and microservices, increases an organization’s security footprint, bringing greater risk of security breaches.",
          "link": "https://www.ansible.com/blog/getting-started-with-ansible-security-automation-incident-response",
          "publishedOn": "2021-06-17T13:00:00.000Z",
          "wordCount": 2280,
          "title": "Getting started with Ansible security automation: Incident Response"
        },
        {
          "id": "https://www.ansible.com/blog/whats-new-in-the-ansible-content-collection-for-kubernetes-2.0",
          "author": "Mike Graves",
          "description": "As the adoption of containers and Kubernetes increases to drive application modernization, IT organizations must find ways to easily deploy and manage multiple Kubernetes clusters across regions, both residing in the public cloud and/or on-premises, and all the way to the edge. As such, we continue to expand on the capabilities of our Certified Ansible Content Collection for kubernetes.core.",
          "link": "https://www.ansible.com/blog/whats-new-in-the-ansible-content-collection-for-kubernetes-2.0",
          "publishedOn": "2021-06-15T13:00:00.000Z",
          "wordCount": 1784,
          "title": "What’s New in the Ansible Content Collection for Kubernetes - 2.0"
        },
        {
          "id": "https://www.ansible.com/blog/ansiblefest-2021-cfp-is-open",
          "author": "info@ansible.com (Ansible)",
          "description": "AnsibleFest will be a free, virtual two day event again this year on September 29-30. You can expect all the usual highlights, like customer keynotes, breakout sessions, direct access to Ansible experts and more. We will also be bringing back tracks from last year like Network, Security, Developer and more to give you exactly the type of information you need for wherever you are in your Ansible journey.",
          "link": "https://www.ansible.com/blog/ansiblefest-2021-cfp-is-open",
          "publishedOn": "2021-06-08T14:30:00.000Z",
          "wordCount": 756,
          "title": "AnsibleFest 2021 CFP is Open"
        }
      ]
    },
    {
      "title": "Azure DevOps Blog",
      "feedUrl": "https://devblogs.microsoft.com/devops/feed/",
      "siteUrl": "https://devblogs.microsoft.com/devops",
      "articles": [
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61886",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes Episode 37 – Microsoft Power Apps with @98codes appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-episode-37-microsoft-power-apps-with-98codes/",
          "publishedOn": "2021-07-06T14:00:26.000Z",
          "wordCount": 1148,
          "title": "AzureFunBytes Episode 37 – Microsoft Power Apps with @98codes"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61927",
          "author": "Jay Gordon",
          "description": "The top stories from the #AzureDevOps #community for 2021.07.02 are here!\nThe post Top Stories from the Microsoft DevOps Community – 2021.07.02 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-07-02/",
          "publishedOn": "2021-07-02T13:00:37.000Z",
          "wordCount": 1170,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.07.02"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61881",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes Episode 45 – Observing @Azure with @DatadogHQ, with guest @ryan_maclean appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-episode-45-observing-azure-with-datadoghq-with-guest-ryan_maclean/",
          "publishedOn": "2021-06-29T14:00:28.000Z",
          "wordCount": 1277,
          "title": "AzureFunBytes Episode 45 – Observing @Azure with @DatadogHQ, with guest @ryan_maclean"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61913",
          "author": "Jay Gordon",
          "description": "The top stories from the #AzureDevOps #community for 2021.06.25 are here!\nThe post Top Stories from the Microsoft DevOps Community – 2021.06.25 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-06-25/",
          "publishedOn": "2021-06-25T14:00:36.000Z",
          "wordCount": 1144,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.06.25"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61877",
          "author": "Jay Gordon",
          "description": "Recently the Developer relations came together to create a video series to get all the essential knowledge to move your project forward with Static Web Apps.  This series provides you with 16 different cookbooks to begin building applications using Azure Static Web Apps.\nThe post How to create your personal blog with Gatsby & Azure Static Web Apps –  Azure Tips & Tricks appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/how-to-create-your-personal-blog-with-gatsby-azure-static-web-apps-azure-tips-tricks/",
          "publishedOn": "2021-06-24T14:00:43.000Z",
          "wordCount": 1381,
          "title": "How to create your personal blog with Gatsby & Azure Static Web Apps –  Azure Tips & Tricks"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61906",
          "author": "DevOps Dojo",
          "description": "Learning is a very old topic. While developing Dojo, we learned that DevOps learning was very different from other types of skill learning because of its complexity, breadth, cultural context, team orientation, and difficulty to measure. As we promised in our first blog,\nThe post DevOps Dojo – Experiential Learning appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/devops-dojo-experiential-learning/",
          "publishedOn": "2021-06-23T23:36:08.000Z",
          "wordCount": 9853,
          "title": "DevOps Dojo – Experiential Learning"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61832",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes – @Azure Data Factory Security with @narainabhishek appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-azure-data-factory-security-with-narainabhishek/",
          "publishedOn": "2021-06-21T16:00:42.000Z",
          "wordCount": 1336,
          "title": "AzureFunBytes – @Azure Data Factory Security with @narainabhishek"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61862",
          "author": "Jay Gordon",
          "description": "The top stories from the #AzureDevOps #community for 2021.06.18 are here!\nThe post Top Stories from the Microsoft DevOps Community – 2021.06.18 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-06-18/",
          "publishedOn": "2021-06-18T14:00:22.000Z",
          "wordCount": 1133,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.06.18"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61853",
          "author": "Gloridel Morales",
          "description": "For the June patches, we are releasing fixes that impact our self-hosted product, Azure DevOps Server.\nRemoved references to stale test cases to help speed the data import process.\nThe post June patches for Azure DevOps Server appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/june-patches-for-azure-devops-server/",
          "publishedOn": "2021-06-15T19:09:15.000Z",
          "wordCount": 1658,
          "title": "June patches for Azure DevOps Server"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61742",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes – Intro to Azure Data Factory with @KromerBigData appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-intro-to-azure-data-factory-with-kromerbigdata/",
          "publishedOn": "2021-06-14T18:00:01.000Z",
          "wordCount": 1416,
          "title": "AzureFunBytes – Intro to Azure Data Factory with @KromerBigData"
        }
      ]
    },
    {
      "title": "Discover Dev",
      "feedUrl": "https://www.discoverdev.io/rss.xml",
      "siteUrl": "http://discoverdev.io",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "http://feeds.feedburner.com/AmazonWebServicesBlog",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "275d63fb9a5b17d9475df998629b499d6de358c8",
          "author": "Sébastien Stormacq",
          "description": "At AWS, we tirelessly innovate to allow you to focus on your business, not its underlying IT infrastructure. Sometimes we launch a new service or a major capability. Sometimes we focus on details that make your professional life easier. Today, I’m happy to announce one of these small details that makes a difference: VPC security […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/p1HdsCm42h0/",
          "publishedOn": "2021-07-07T21:27:44.000Z",
          "wordCount": 1275,
          "title": "Easily Manage Security Group Rules with the New Security Group Rule ID"
        },
        {
          "id": "0989c2f1a859a1e69d4d900252cc47ca4e779558",
          "author": "Jeff Barr",
          "description": "In what has now become an annual tradition (check out my 2016, 2017, 2019, and 2020 posts for a look back), I am happy to share some of the metrics from this year’s Prime Day and to tell you how AWS helped to make it happen. This year I bought all sorts of useful goodies […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/dZ110navB2M/",
          "publishedOn": "2021-06-30T16:08:14.000Z",
          "wordCount": 1183,
          "title": "Prime Day 2021 – Two Chart-Topping Days"
        },
        {
          "id": "c5a5694ebc6350153549c534be9a573abb574e54",
          "author": "Jeff Barr",
          "description": "Weather forecasting, genome sequencing, geoanalytics, computational fluid dynamics (CFD), and other types of high-performance computing (HPC) workloads can take advantage of massive amounts of compute power. These workloads are often spikey and massively parallel, and are used in situations where time to results is critical. Old Way Governments, well-funded research organizations, and Fortune 500 companies […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/NjovUW5A61A/",
          "publishedOn": "2021-06-28T20:37:27.000Z",
          "wordCount": 1612,
          "title": "Planetary-Scale Computing – 9.95 PFLOPS & Position 41 on the TOP500 List"
        },
        {
          "id": "475c831d2c248a8fdb39225b19d7bff9dbed0463",
          "author": "Channy Yun",
          "description": "Last AWS re:Invent, we announced the general availability of Amazon EMR on Amazon Elastic Kubernetes Service (Amazon EKS), a new deployment option for Amazon EMR that allows customers to automate the provisioning and management of Apache Spark on Amazon EKS. With Amazon EMR on EKS, customers can deploy EMR applications on the same Amazon EKS […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/bCg8X47IoPg/",
          "publishedOn": "2021-06-24T19:34:38.000Z",
          "wordCount": 1805,
          "title": "Customize and Package Dependencies With Your Apache Spark Applications on Amazon EMR on Amazon EKS"
        },
        {
          "id": "6302e669522464bce9f1de43887ad452aca0b1bd",
          "author": "Alex Casalboni",
          "description": "Amazon CodeGuru allows you to automate code reviews and improve code quality, and thanks to the new pricing model announced in April you can get started with a lower and fixed monthly rate based on the size of your repository (up to 90% less expensive). CodeGuru Reviewer helps you detect potential defects and bugs that […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/dRVMAyHEFx4/",
          "publishedOn": "2021-06-24T17:35:26.000Z",
          "wordCount": 1653,
          "title": "Amazon CodeGuru Reviewer Updates: New Java Detectors and CI/CD Integration with GitHub Actions"
        },
        {
          "id": "6d97bb81230f544ce3cef037e792e486ff00f4eb",
          "author": "Martin Beeby",
          "description": "Today, we are launching AWS BugBust, the world’s first global challenge to fix one million bugs and reduce technical debt by over $100 million. You might have participated in a bug bash before. Many of the software companies where I’ve worked (including Amazon) run them in the weeks before launching a new product or service. […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/W9k_BKTV3Q4/",
          "publishedOn": "2021-06-24T15:03:57.000Z",
          "wordCount": 1285,
          "title": "New – AWS BugBust: It’s Game Over for Bugs"
        },
        {
          "id": "ff75499d3417cfbcf1f7b506cf7e26de7607e7cb",
          "author": "Steve Roberts",
          "description": "AWS CloudFormation and the AWS Cloud Development Kit (CDK) provide scalable and consistent provisioning of AWS resources (for example, compute infrastructure, monitoring tools, databases, and more). We’ve heard from many customers that they’d like to benefit from the same consistency and scalability when provisioning resources from AWS Partner Network (APN) members, third-party vendors, and open-source […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/S04LfteN_e0/",
          "publishedOn": "2021-06-21T23:17:17.000Z",
          "wordCount": 2960,
          "title": "Introducing a Public Registry for AWS CloudFormation"
        },
        {
          "id": "c9ccf6b4c037f9b334b2523f3cef1997e43f19df",
          "author": "Marcia Villalba",
          "description": "AWS Step Functions allow you to build scalable, distributed applications using state machines. Until today, building workflows on Step Functions required you to learn and understand Amazon State Language (ASL). Today, we are launching Workflow Studio, a low-code visual tool that helps you learn Step Functions through a guided interactive interface and allows you to […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/qFtWYO343eg/",
          "publishedOn": "2021-06-17T17:18:40.000Z",
          "wordCount": 2515,
          "title": "New – AWS Step Functions Workflow Studio – A Low-Code Visual Tool for Building State Machines"
        },
        {
          "id": "879ef05df972890ced8deb8c1081f52d4d8fa0ec",
          "author": "Steve Roberts",
          "description": "Today, Dave Brown, VP of Amazon EC2 at AWS, announced the Graviton Challenge as part of his session on AWS silicon innovation at the Six Five Summit 2021. We invite you to take the Graviton Challenge and move your applications to run on AWS Graviton2. The challenge, intended for individual developers and small teams, is […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/fTklKzpv4yo/",
          "publishedOn": "2021-06-17T15:35:02.000Z",
          "wordCount": 2050,
          "title": "Migrate Your Workloads with the Graviton Challenge!"
        },
        {
          "id": "2a373d1da673c370969bab9975909c889413e7b4",
          "author": "Jeff Barr",
          "description": "TL;DR – If you are using the ancient Feedburner feed for this blog, please change to the new one (https://aws.amazon.com/blogs/aws/feed/) ASAP. Back in the early days of AWS, I paid a visit to the Chicago headquarters of a cool startup called FeedBurner. My friend Matt Shobe demo’ed their new product to me and showed me […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/Xhu_RVZmQuY/",
          "publishedOn": "2021-06-15T16:49:54.000Z",
          "wordCount": 651,
          "title": "Heads Up – AWS News Blog RSS Feed Change"
        },
        {
          "id": "f057ea11c459d137b14bd39a8b215fd1b55c46d0",
          "author": "Jeff Barr",
          "description": "We launched three AWS Regions (Italy, South Africa, and Japan) in the last 12 months, and are working on regions in Australia, Indonesia, Spain, India, Switzerland, and the United Arab Emirates. Tel Aviv, Israel in the Works Today I am happy to announce that the AWS Israel (Tel Aviv) Region is in the works and […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/ObHL8-p0Y_0/",
          "publishedOn": "2021-06-11T04:07:36.000Z",
          "wordCount": 854,
          "title": "In the Works – AWS Region in Tel Aviv, Israel"
        },
        {
          "id": "0d87f068b55fc7843f4a16efa94e7f39317a52d1",
          "author": "Julien Simon",
          "description": "Over the last few years, Machine Learning (ML) has proven its worth in helping organizations increase efficiency and foster innovation. As ML matures, the focus naturally shifts from experimentation to production. ML processes need to be streamlined, standardized, and automated to build, train, deploy, and manage models in a consistent and reliable way. Perennial IT […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/XANxIh1DrHo/",
          "publishedOn": "2021-06-09T18:00:54.000Z",
          "wordCount": 878,
          "title": "Amazon SageMaker Named as the Outright Leader in Enterprise MLOps Platforms"
        },
        {
          "id": "0a6f033f543473ec26043a249a9479efeac02c59",
          "author": "Martin Beeby",
          "description": "Amazon FSx for Windows File Server provides fully managed file storage that is accessible over the industry-standard Server Message Block (SMB) protocol. It is built on Windows Server and offers a rich set of enterprise storage capabilities with the scalability, reliability, and low cost that you have come to expect from AWS. In addition to […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/RJ2Ne6UWkrg/",
          "publishedOn": "2021-06-08T21:04:51.000Z",
          "wordCount": 1289,
          "title": "File Access Auditing Is Now Available for Amazon FSx for Windows File Server"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/atom.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2486/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/board_game_party_schedule.png\" title=\"Several of the guests are secretly playing Meta Board Game Party. Every minute of parallel debate in the breakaway faction earns double victory points!\" alt=\"Several of the guests are secretly playing Meta Board Game Party. Every minute of parallel debate in the breakaway faction earns double victory points!\" />",
          "link": "https://xkcd.com/2486/",
          "publishedOn": "2021-07-07T00:00:00.000Z",
          "wordCount": 189,
          "title": "Board Game Party Schedule"
        },
        {
          "id": "https://xkcd.com/2485/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/nightmare_code.png\" title=\"Charsets even used to be known as 'alpha-bets' before that word's obvious negative associations caused it to die out.\" alt=\"Charsets even used to be known as 'alpha-bets' before that word's obvious negative associations caused it to die out.\" />",
          "link": "https://xkcd.com/2485/",
          "publishedOn": "2021-07-05T00:00:00.000Z",
          "wordCount": 185,
          "title": "Nightmare Code"
        },
        {
          "id": "https://xkcd.com/2484/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/h_alpha.png\" title=\"&quot;All the companies whose blimps I shot fireworks at are mad, but MetLife is especially miffed because I dressed up as the Red Baron.&quot;\" alt=\"&quot;All the companies whose blimps I shot fireworks at are mad, but MetLife is especially miffed because I dressed up as the Red Baron.&quot;\" />",
          "link": "https://xkcd.com/2484/",
          "publishedOn": "2021-07-02T00:00:00.000Z",
          "wordCount": 183,
          "title": "H-alpha"
        },
        {
          "id": "https://xkcd.com/2483/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/linked_list_interview_problem.png\" title=\"I'd traverse it myself, but it's singly linked, so I'm worried that I won't be able to find my way back to 2021.\" alt=\"I'd traverse it myself, but it's singly linked, so I'm worried that I won't be able to find my way back to 2021.\" />",
          "link": "https://xkcd.com/2483/",
          "publishedOn": "2021-06-30T00:00:00.000Z",
          "wordCount": 189,
          "title": "Linked List Interview Problem"
        }
      ]
    },
    {
      "title": "Software Engineering Daily",
      "feedUrl": "https://softwareengineeringdaily.com/feed/podcast/",
      "siteUrl": "https://softwareengineeringdaily.com/archives/",
      "articles": [
        {
          "id": "https://softwareengineeringdaily.com/?p=11203",
          "author": null,
          "description": "In this episode we discuss coding bootcamps, fear, fitness, and more with Ruben Harris, CEO of Career Karma. This interview was also recorded as a video podcast. Check out the video on the Software Daily YouTube channel. Sponsorship inquiries: sponsor@softwareengineeringdaily.com\nThe post Career Karma with Ruben Harris appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/07/career-karma-with-ruben-harris/?utm_source=rss&utm_medium=rss&utm_campaign=career-karma-with-ruben-harris",
          "publishedOn": "2021-07-07T09:00:34.000Z",
          "wordCount": null,
          "title": "Career Karma with Ruben Harris",
          "itunes": {
            "duration": "1:45:42"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED9808247379.mp3",
            "length": "101510277",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11197",
          "author": null,
          "description": "SOC 2 is a security audit to prove that SaaS companies have secured their company and customer data. It’s often considered the minimum audit necessary to sell software. HIPAA is a federal law regulating how sensitive medical information about patients must be handled. ISO 27001 is the global benchmark for demonstrating your information security management\nThe post Vanta: Maintaining Security Standards with Christina Cacioppo appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/06/vanta-maintaining-security-standards-with-christina-cacioppo/?utm_source=rss&utm_medium=rss&utm_campaign=vanta-maintaining-security-standards-with-christina-cacioppo",
          "publishedOn": "2021-07-06T09:00:06.000Z",
          "wordCount": null,
          "title": "Vanta: Maintaining Security Standards with Christina Cacioppo",
          "itunes": {
            "duration": "54:17"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED5970613664.mp3",
            "length": "52160933",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11193",
          "author": null,
          "description": "When I worked as an engineer at Amazon, I would arrive at the office every day before 6:30am. Amazon’s enormous campus is in downtown Seattle. The company expands across the city like a massive, growing organism composed of towering buildings and ecospheres. The constant wet mist of Seattle always seems lighter within Amazon campus, perhaps\nThe post Build Your Own Amazon appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/04/build-your-own-amazon/?utm_source=rss&utm_medium=rss&utm_campaign=build-your-own-amazon",
          "publishedOn": "2021-07-04T11:48:31.000Z",
          "wordCount": null,
          "title": "Build Your Own Amazon",
          "itunes": {
            "duration": "4:38"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED5205462694.mp3",
            "length": "6712863",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11177",
          "author": null,
          "description": "There are over 4 billion people using email. Many people using email for business communicate quick questions to colleagues, send repetitive, template-based information to potential customers and freshly hired employees, and repeat a lot of the same phrases. We actually repeat phrases in a lot of written formats. How often do you copy and paste\nThe post Text Blaze: Text Shortcuts with Scott Fortmann-Roe appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/03/text-blaze-text-shortcuts-with-scott-fortmann-roe/?utm_source=rss&utm_medium=rss&utm_campaign=text-blaze-text-shortcuts-with-scott-fortmann-roe",
          "publishedOn": "2021-07-03T16:19:08.000Z",
          "wordCount": null,
          "title": "Text Blaze: Text Shortcuts with Scott Fortmann-Roe",
          "itunes": {
            "duration": "46:00"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED6119771976.mp3",
            "length": "44203722",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11158",
          "author": null,
          "description": "Continuous integration is a coding practice where engineers deliver incremental and frequent code changes to create higher quality software and collaborate more. Teams attempting to continuously integrate new code need a consistent and automated pipeline for reviewing, testing, and deploying the changes. Otherwise change requests pile up in the queue and nothing gets integrated efficiently. \nThe post LayerCI with Colin Chartier appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/01/layerci-with-colin-chartier/?utm_source=rss&utm_medium=rss&utm_campaign=layerci-with-colin-chartier",
          "publishedOn": "2021-07-02T05:03:49.000Z",
          "wordCount": null,
          "title": "LayerCI with Colin Chartier",
          "itunes": {
            "duration": "42:47"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED1389745926.mp3",
            "length": "41116705",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11176",
          "author": null,
          "description": "ELT is a process for copying data from a source system into a target system. It stands for “Extract, Load, Transform” and starts with extracting a copy of data from the source location. It’s loaded into the target system like a data warehouse, and then it’s ready to be transformed into a usable format for\nThe post Meltano: ELT for DataOps with Douwe Maan appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/30/meltano-elt-for-dataops-with-douwe-maan/?utm_source=rss&utm_medium=rss&utm_campaign=meltano-elt-for-dataops-with-douwe-maan",
          "publishedOn": "2021-07-01T02:50:07.000Z",
          "wordCount": null,
          "title": "Meltano: ELT for DataOps with Douwe Maan",
          "itunes": {
            "duration": "57:02"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED7947466113.mp3",
            "length": "54801169",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11159",
          "author": null,
          "description": "In this episode we discuss plug and play auth, password management, and crypto with Sean Li, co-founder and CEO of Magic. This interview was also recorded as a video podcast. Check out the video on the Software Daily YouTube channel. Sponsorship inquiries: sponsor@softwareengineeringdaily.com\nThe post Magic with Sean Li appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/29/magic-with-sean-li/?utm_source=rss&utm_medium=rss&utm_campaign=magic-with-sean-li",
          "publishedOn": "2021-06-29T09:00:50.000Z",
          "wordCount": null,
          "title": "Magic with Sean Li",
          "itunes": {
            "duration": "1:23:17"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED7585157449.mp3",
            "length": "79990815",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11170",
          "author": null,
          "description": "For some data problems, you may be more concerned with the state of data at a particular point. A ticket is booked, or it’s not. How many poetry submissions were made to the contest? This is relational data. For other problems, you’re concerned with the change in data over time. Solar energy consumption, for example,\nThe post Timescale: Time Series Databases with Mike Freedman appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/28/timescale-time-series-databases-with-mike-freedman/?utm_source=rss&utm_medium=rss&utm_campaign=timescale-time-series-databases-with-mike-freedman",
          "publishedOn": "2021-06-28T19:31:31.000Z",
          "wordCount": null,
          "title": "Timescale: Time Series Databases with Mike Freedman",
          "itunes": {
            "duration": "55:37"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED2530592682.mp3",
            "length": "53437256",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11141",
          "author": null,
          "description": "The cloud has delivered amazing benefits like on-demand infrastructure that’s easy to use, pay-as-you-go subscription plans, and effortless scaling of applications. This flexibility minimizes the growing pains for businesses and explains why today’s startups and established companies are both building apps on the cloud.  However, the costs of using the cloud stack up once companies\nThe post Cloud Cost with Martin Casado appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/25/cloud-cost-with-martin-casado/?utm_source=rss&utm_medium=rss&utm_campaign=cloud-cost-with-martin-casado",
          "publishedOn": "2021-06-25T09:00:50.000Z",
          "wordCount": null,
          "title": "Cloud Cost with Martin Casado",
          "itunes": {
            "duration": "49:26"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED6949261638.mp3",
            "length": "47500344",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11143",
          "author": null,
          "description": "Uber is one of many examples we’ve discussed on this show that has changed the world with big data analysis. With over 8 million users, 1 billion Uber trips and people driving for Uber in over 400 cities and 66 countries, Uber has redefined an entire industry in a very short time frame. It’s difficult\nThe post Uber Data Science with Kevin Novak appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/24/uber-data-science-with-kevin-novak/?utm_source=rss&utm_medium=rss&utm_campaign=uber-data-science-with-kevin-novak",
          "publishedOn": "2021-06-24T09:00:19.000Z",
          "wordCount": null,
          "title": "Uber Data Science with Kevin Novak",
          "itunes": {
            "duration": "50:17"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED6176591623.mp3",
            "length": "48312035",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11142",
          "author": null,
          "description": "The quantity and quality of a company’s data can mean the difference between a major success or major failure. Companies like Google have used big data from its earliest days to steer their product suite in the direction consumers need. Other companies, like Apple, didn’t always use big data analytics to drive product design, but\nThe post Axiom Browser Automation with Yaseer Sheriff appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/23/axiom-browser-automation-with-yaseer-sheriff/?utm_source=rss&utm_medium=rss&utm_campaign=axiom-browser-automation-with-yaseer-sheriff",
          "publishedOn": "2021-06-23T09:00:19.000Z",
          "wordCount": null,
          "title": "Axiom Browser Automation with Yaseer Sheriff",
          "itunes": {
            "duration": "38:21"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED3148267840.mp3",
            "length": "36858179",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11131",
          "author": null,
          "description": "In this episode we discuss software investing, business, and the future with David Rosenthal, co-host of the Acquired podcast. This interview was also recorded as our very first video podcast. Check out the video on the Software Daily YouTube channel. Sponsorship inquiries: sponsor@softwareengineeringdaily.com\nThe post Software Investing with David Rosenthal appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/22/software-investing-with-david-rosenthal/?utm_source=rss&utm_medium=rss&utm_campaign=software-investing-with-david-rosenthal",
          "publishedOn": "2021-06-22T09:00:02.000Z",
          "wordCount": null,
          "title": "Software Investing with David Rosenthal",
          "itunes": {
            "duration": "1:39:05"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED8731474091.mp3",
            "length": "95154783",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11127",
          "author": null,
          "description": "Complete information games are games where every player has information about the game sequence, strategies, and payoffs throughout gameplay. Playing chess, for example, relies on knowing the location of every piece everywhere on the board. In an incomplete information game like Minecraft, you continually gain new information during gameplay. Until very recently, incomplete information was\nThe post Dark Forest: Transparency on Blockchains with Zero-Knowledge Proofs with Brian Gu appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/21/dark-forest-transparency-on-blockchains-with-zero-knowledge-proofs-with-brian-gu/?utm_source=rss&utm_medium=rss&utm_campaign=dark-forest-transparency-on-blockchains-with-zero-knowledge-proofs-with-brian-gu",
          "publishedOn": "2021-06-21T22:37:56.000Z",
          "wordCount": null,
          "title": "Dark Forest: Transparency on Blockchains with Zero-Knowledge Proofs with Brian Gu",
          "itunes": {
            "duration": "59:10"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED2679692760.mp3",
            "length": "56839786",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11115",
          "author": null,
          "description": "Proof of Work cryptocurrency mining, as used on the Ethereum and Bitcoin blockchains, requires huge amounts of energy to validate transactions and generate new tokens. The alternative, Proof of Stake, needs large deposits of assets to be staked up front in order to work. While both consensus protocols have their own drawbacks, they are the\nThe post Spacemesh: A New Consensus Protocol Anton Learner appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/18/spacemesh-a-new-consensus-protocol-anton-learner/?utm_source=rss&utm_medium=rss&utm_campaign=spacemesh-a-new-consensus-protocol-anton-learner",
          "publishedOn": "2021-06-18T17:13:54.000Z",
          "wordCount": null,
          "title": "Spacemesh: A New Consensus Protocol Anton Learner",
          "itunes": {
            "duration": "56:07"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED8461548290.mp3",
            "length": "53913782",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11109",
          "author": null,
          "description": "The company StreamSets is enabling DataOps practices in today’s enterprises. StreamSets is a data engineering platform designed to help engineers design, deploy, and operate smart data pipelines. StreamSets Data Collector is a codeless solution for designing pipelines, triggering CDC operations, and monitoring data in flight. StreamSets Transformer uses Apache Spark to generate insights about your\nThe post StreamSets: DataOps and Smart Pipelines with Arvind Prabhakar appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/17/streamsets-dataops-and-smart-pipelines-with-arvind-prabhakar/?utm_source=rss&utm_medium=rss&utm_campaign=streamsets-dataops-and-smart-pipelines-with-arvind-prabhakar",
          "publishedOn": "2021-06-17T19:47:52.000Z",
          "wordCount": null,
          "title": "StreamSets: DataOps and Smart Pipelines with Arvind Prabhakar",
          "itunes": {
            "duration": "55:39"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED8121174953.mp3",
            "length": "53473535",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11084",
          "author": null,
          "description": "Delivering Saas products involves a lot more than just building the product. Saas management involves customer relationship management, licensing, renewals, maintaining software visibility, and the general management of the technology portfolio.  The company Blissfully helps businesses manage their SaaS products from within a complete IT platform with organization, automation, and security built in. The Blissfully\nThe post Blissfully: Comprehensive IT Management with Aaron White appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/16/blissfully-comprehensive-it-management-with-aaron-white/?utm_source=rss&utm_medium=rss&utm_campaign=blissfully-comprehensive-it-management-with-aaron-white",
          "publishedOn": "2021-06-16T18:53:33.000Z",
          "wordCount": null,
          "title": "Blissfully: Comprehensive IT Management with Aaron White",
          "itunes": {
            "duration": "55:52"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED2505242482.mp3",
            "length": "53674611",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11083",
          "author": null,
          "description": "Amundsen was started at Lyft and is the leading open-source data catalog with the fastest-growing community and the most integrations. Amundsen enables you to search your entire organization by text search, see automated and curated metadata, share context with co workers, and learn from others by seeing most common queries on a table or frequently\nThe post Stemma: Understanding Big Data with Mark Grover appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/15/stemma-understanding-big-data-with-mark-grover/?utm_source=rss&utm_medium=rss&utm_campaign=stemma-understanding-big-data-with-mark-grover",
          "publishedOn": "2021-06-15T09:00:32.000Z",
          "wordCount": null,
          "title": "Stemma: Understanding Big Data with Mark Grover",
          "itunes": {
            "duration": "40:33"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED4548783756.mp3",
            "length": "38968779",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11082",
          "author": null,
          "description": "Coinbase is a very popular and well trusted cryptocurrency platform for buying and selling digital assets like Bitcoin, Ethereum, and many more. With Coinbase you can manage your portfolio of cryptocurrencies in 1 place like you would for other investments. There are added features like scheduling recurring purchases of assets, time-delayed withdrawals from digital vaults,\nThe post Coinbase React Native: Building the Cryptocurrency Ecosystem with Brent Walter and Jacob Thornton appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/14/coinbase-rn-building-the-cryptocurrency-ecosystem-with-brent-walter-and-jacob-thornton/?utm_source=rss&utm_medium=rss&utm_campaign=coinbase-rn-building-the-cryptocurrency-ecosystem-with-brent-walter-and-jacob-thornton",
          "publishedOn": "2021-06-14T09:00:11.000Z",
          "wordCount": null,
          "title": "Coinbase React Native: Building the Cryptocurrency Ecosystem with Brent Walter and Jacob Thornton",
          "itunes": {
            "duration": "56:28"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED7754082961.mp3",
            "length": "54252232",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11073",
          "author": null,
          "description": "Corey Quinn is guest hosting on Software Engineering Daily this week, presenting a Tour of the Cloud. Corey Quinn is the Chief Cloud Economist at The Duckbill Group, where he helps companies fix their AWS bill by making it smaller and less horrifying. If you’re looking to lower your AWS bill or negotiate a new\nThe post Oracle Cloud with Salman Paracha appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/11/oracle-cloud-with-salman-paracha/?utm_source=rss&utm_medium=rss&utm_campaign=oracle-cloud-with-salman-paracha",
          "publishedOn": "2021-06-11T09:00:33.000Z",
          "wordCount": null,
          "title": "Oracle Cloud with Salman Paracha",
          "itunes": {
            "duration": "49:42"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED2000485501.mp3",
            "length": "47749093",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11072",
          "author": null,
          "description": "Corey Quinn is guest hosting on Software Engineering Daily this week, presenting a Tour of the Cloud. Corey Quinn is the Chief Cloud Economist at The Duckbill Group, where he helps companies fix their AWS bill by making it smaller and less horrifying. If you’re looking to lower your AWS bill or negotiate a new\nThe post Digital Ocean with John Allspaw appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/10/digital-ocean-with-john-allspaw/?utm_source=rss&utm_medium=rss&utm_campaign=digital-ocean-with-john-allspaw",
          "publishedOn": "2021-06-10T09:00:28.000Z",
          "wordCount": null,
          "title": "Digital Ocean with John Allspaw",
          "itunes": {
            "duration": "56:03"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED4109775475.mp3",
            "length": "53851287",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11059",
          "author": null,
          "description": "Corey Quinn is guest hosting on Software Engineering Daily this week, presenting a Tour of the Cloud. Corey Quinn is the Chief Cloud Economist at The Duckbill Group, where he helps companies fix their AWS bill by making it smaller and less horrifying. If you’re looking to lower your AWS bill or negotiate a new\nThe post GCP with Liz Fong-Jones appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/09/gcp-with-liz-fong-jones/?utm_source=rss&utm_medium=rss&utm_campaign=gcp-with-liz-fong-jones",
          "publishedOn": "2021-06-09T09:00:12.000Z",
          "wordCount": null,
          "title": "GCP with Liz Fong-Jones",
          "itunes": {
            "duration": "55:49"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED4121522002.mp3",
            "length": "53633651",
            "type": "audio/mpeg"
          }
        }
      ]
    },
    {
      "title": "Camunda",
      "feedUrl": "https://camunda.com/feed/",
      "siteUrl": "https://camunda.com",
      "articles": [
        {
          "id": "https://camunda.com/?p=23247",
          "author": "Charley Mann",
          "description": "How Europe's leading online fashion retailer serves 42 million active customers in 20 markets, leveraging Camunda for back-end logistics.\nThe post How Zalando Orchestrates its Sales Order Process with Camunda appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/07/how-zalando-orchestrates-its-sales-order-process-with-camunda/",
          "publishedOn": "2021-07-06T08:00:12.000Z",
          "wordCount": 1573,
          "title": "How Zalando Orchestrates its Sales Order Process with Camunda"
        },
        {
          "id": "https://camunda.com/?p=22723",
          "author": "Charley Mann",
          "description": "Is it possible to digitize consultations with tax and legal experts in order to seamlessly guide decision-makers towards consistent and compliant decisions? \nThe post How Deloitte Digitizes Tax and Legal Consultations with DMN appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/06/how-deloitte-digitizes-tax-and-legal-consultations-with-dmn/",
          "publishedOn": "2021-06-25T08:00:05.000Z",
          "wordCount": 1697,
          "title": "How Deloitte Digitizes Tax and Legal Consultations with DMN"
        },
        {
          "id": "https://camunda.com/?p=22625",
          "author": "Charley Mann",
          "description": "Automating the back-office with Camunda Platform - saving up to 30% of time previously spent handling electronic payment card requests.\nThe post Jyske Bank: From Emails to Automation appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/06/jyske-bank-from-emails-to-automation/",
          "publishedOn": "2021-06-23T13:22:09.000Z",
          "wordCount": 1778,
          "title": "Jyske Bank: From Emails to Automation"
        },
        {
          "id": "https://camunda.com/?p=22408",
          "author": "Camunda Team",
          "description": "Camunda Platform is deployed by more than half of the top 15 banks in the U.S., including Morgan Stanley, Truist and Goldman Sachs.\nThe post Why Fortune 500 Banks use Camunda Platform appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/06/why-fortune-500-banks-use-camunda-platform/",
          "publishedOn": "2021-06-18T16:02:02.000Z",
          "wordCount": 1540,
          "title": "Why Fortune 500 Banks use Camunda Platform"
        },
        {
          "id": "https://camunda.com/?p=22086",
          "author": "Felix Mueller",
          "description": "What is Camunda Cloud, and why is the community so excited about the first ever on-demand SaaS process automation as a service?\nThe post Your Camunda Cloud Questions Answered appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/06/your-camunda-cloud-questions-answered/",
          "publishedOn": "2021-06-15T08:00:00.000Z",
          "wordCount": 2168,
          "title": "Your Camunda Cloud Questions Answered"
        },
        {
          "id": "https://camunda.com/?p=22263",
          "author": "Charley Mann",
          "description": "How did one of Germany’s leading insurers, handling insurance premiums in excess of six billion per year, undergo a complete digital transformation in less than six years?\nThe post Scaling Camunda Adoption at Provinzial appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/06/scaling-camunda-adoption-at-provinzial/",
          "publishedOn": "2021-06-14T13:39:19.000Z",
          "wordCount": 1841,
          "title": "Scaling Camunda Adoption at Provinzial"
        },
        {
          "id": "https://camunda.com/?p=22069",
          "author": "Luca Buchholz",
          "description": "We’re thrilled to introduce our first cohort of Camunda Champions - individuals who demonstrate product expertise while actively supporting and contributing to developer communities.\nThe post Welcome, Camunda Champions appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/06/welcome-camunda-champions/",
          "publishedOn": "2021-06-10T08:59:42.000Z",
          "wordCount": 1595,
          "title": "Welcome, Camunda Champions"
        },
        {
          "id": "https://camunda.com/?p=21971",
          "author": "Camunda Team",
          "description": "Our partner Novatec combined Business Process Management with Artificial Intelligence, and the result was awesome!\nThe post Intelligent Process Automation with Camunda and Amazon Comprehend appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/06/intelligent-process-automation-with-camunda-and-amazon-comprehend/",
          "publishedOn": "2021-06-09T09:25:59.000Z",
          "wordCount": 2679,
          "title": "Intelligent Process Automation with Camunda and Amazon Comprehend"
        },
        {
          "id": "https://camunda.com/?p=22042",
          "author": "Camunda Cloud Team",
          "description": "We’re excited to announce the release of Camunda Cloud 1.1.0-alpha1, which includes 1.1.0-alpha1  versions of Zeebe, Operate and\nThe post Camunda Cloud 1.1.0-alpha1 Released appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/06/camunda-cloud-110-alpha1-released/",
          "publishedOn": "2021-06-08T15:08:51.000Z",
          "wordCount": 1490,
          "title": "Camunda Cloud 1.1.0-alpha1 Released"
        }
      ]
    },
    {
      "title": "Brendan Gregg's Blog",
      "feedUrl": "http://www.brendangregg.com/blog/rss.xml",
      "siteUrl": "http://www.brendangregg.com/blog",
      "articles": [
        {
          "id": "http://www.brendangregg.com/blog/2021-07-05/computing-performance-on-the-horizon.html",
          "author": null,
          "description": "It's an exciting time for developments in computer performance, not just for the BPF technology (which I often write about) but also for processors with 3D stacking and cloud vendor CPUs (e.g., AWS Graviton2); for memory with the arrival of DDR5 and High Bandwidth Memory (HBM) on-processor; for storage including new uses for 3D Xpoint as a 3D NAND accelerator; for networking with the rise of QUIC and eXpress Data Path (XDP); and so on. I summarized these topics and more as a plenary conference talk, including my own predictions (as a senior performance engineer) for the future of computing performance, with a focus on back-end servers.",
          "link": "http://www.brendangregg.com/blog/2021-07-05/computing-performance-on-the-horizon.html",
          "publishedOn": "2021-07-04T14:00:00.000Z",
          "wordCount": null,
          "title": "USENIX LISA2021 Computing Performance: On the Horizon",
          "itunes": {}
        },
        {
          "id": "http://www.brendangregg.com/blog/2021-07-03/how-to-add-bpf-observability.html",
          "author": null,
          "description": "There's an arms race to add eBPF to commercial observability products, and in this post I'll describe how to quickly do that. This is also applicable for people adding it to their own in-house monitoring systems.",
          "link": "http://www.brendangregg.com/blog/2021-07-03/how-to-add-bpf-observability.html",
          "publishedOn": "2021-07-02T14:00:00.000Z",
          "wordCount": null,
          "title": "How To Add eBPF Observability To Your Product",
          "itunes": {}
        },
        {
          "id": "http://www.brendangregg.com/blog/2021-06-15/bpf-internals.html",
          "author": null,
          "description": "For USENIX LISA2021 I gave a 40 minute deep dive talk on BPF internals for Linux, focusing on observability tracing tools. Since there are already BPF internals references online (listed in this post) I used the opportunity to create some new content, showing how bpftrace instrumentation works from user space down to machine code. I break it down to all the small components involved, where you'll find it's actually quite easy.",
          "link": "http://www.brendangregg.com/blog/2021-06-15/bpf-internals.html",
          "publishedOn": "2021-06-14T14:00:00.000Z",
          "wordCount": null,
          "title": "USENIX LISA2021 BPF Internals (eBPF)",
          "itunes": {}
        }
      ]
    }
  ],
  "cliVersion": "1.11.0"
}