{
  "sources": [
    {
      "title": "Spring",
      "feedUrl": "https://spring.io/blog.atom",
      "siteUrl": "https://spring.io/blog",
      "articles": [
        {
          "id": "https://spring.io/blog/2021/07/23/premiering-now-springone-tour-july-2021-do-or-do-not-there-is-no-try-in-production",
          "author": null,
          "description": "Hi, Spring fans! In this July 2021 installment of SpringOne Tour, Josh Long, Cora Iberkleid, Angie Jones, Madhura Bhave, Bella Bai, Olga Maciaszek-Sharma, Whitney Lee, and Nate Schutta look at the wide and wonderful world of testing, continuous integration, and continuous delivery. \n\r\nThis event - a mini-conference if you will - is two hours and some change long and features dedicated segments from the industry’s best, so grab a drink, a note pad, and let’s get to it!",
          "link": "https://spring.io/blog/2021/07/23/premiering-now-springone-tour-july-2021-do-or-do-not-there-is-no-try-in-production",
          "publishedOn": "2021-07-23T12:00:00.000Z",
          "wordCount": 487,
          "title": "Premiering Now: SpringOne Tour - July 2021: Do or Do Not, There is no try{} in Production"
        },
        {
          "id": "https://spring.io/blog/2021/07/22/spring-boot-2-6-0-m1-is-now-available",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.6.0-M1 has been released and is now available from Maven Central.\n\r\nThis release includes 120 bug fixes, documentation improvements, and dependency upgrades. Notable new features include:\n\r\n\r\n  \nAuto-configuration for Spring Data Envers\n\r\n  \nMore metrics support (including task execution and scheduling export and support for the Dynatrace v2 API)\n\r\n  \nAuto-configured Spring Web Service Server Tests\n\r\n  \nImproved Configuration of the Maven Plugin’s Start Goal\n\r\n\r\nPlease see the release notes for more details and upgrade instructions.\n\r\nThanks to all those who have contributed with issue reports and pull requests. Our next set of releases are due August 19, 2021.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/07/22/spring-boot-2-6-0-m1-is-now-available",
          "publishedOn": "2021-07-23T01:00:00.000Z",
          "wordCount": 552,
          "title": "Spring Boot 2.6.0-M1 is now available"
        },
        {
          "id": "https://spring.io/blog/2021/07/22/spring-boot-2-5-3-is-now-available",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.5.3 has been released and is now available from Maven Central.\n\r\nThis release includes 58 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/07/22/spring-boot-2-5-3-is-now-available",
          "publishedOn": "2021-07-22T14:31:26.000Z",
          "wordCount": 492,
          "title": "Spring Boot 2.5.3 is now available"
        },
        {
          "id": "https://spring.io/blog/2021/07/22/spring-boot-2-4-9-is-now-available",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.4.9 has been released and is now available from Maven Central.\n\r\nThis release includes 35 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/07/22/spring-boot-2-4-9-is-now-available",
          "publishedOn": "2021-07-22T10:58:32.000Z",
          "wordCount": 492,
          "title": "Spring Boot 2.4.9 is now available"
        },
        {
          "id": "https://spring.io/blog/2021/07/22/a-bootiful-podcast-industry-analyst-fascinating-person-strategist-and-storyteller-michael-cot",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks to industry analyst, fascinating person, strategist, and storyteller Michael Coté (@cote).",
          "link": "https://spring.io/blog/2021/07/22/a-bootiful-podcast-industry-analyst-fascinating-person-strategist-and-storyteller-michael-cot",
          "publishedOn": "2021-07-22T07:00:00.000Z",
          "wordCount": 420,
          "title": "A Bootiful Podcast: industry analyst, fascinating person, strategist, and storyteller Michael Coté"
        },
        {
          "id": "https://spring.io/blog/2021/07/20/this-week-in-spring-july-20th-2021",
          "author": null,
          "description": "Aloha, my friends, from Hawai’i, where I’m currently on vacation! And, because I’m on vacation, I’ll cut to the chase: there’s a lot of great stuff to get to this week (surprise!) \n\r\nBut first, a friendly turtle I met the other day:\n\r\n\r\nYou’re welcome. Now then, where were we? Oh right! \n\r\n\r\n  \nIn last week’s installment of A Bootiful Podcast, I talk about visualizing software architecture with the C4 model with architect Simon Brown. Don’t miss this one!\n\r\n  \nSpring Tips: Some cool features possible with Spring Integration 5.5\n\r\n  \nHave you checked out the speakers in this year’s SpringOne, on September 1st to 2nd, 2021? I’ll be there and so will many amazing others!\n\r\n  \nSpring Data 2021.0.3 and 2020.0.11 released\n\r\n  \nSpring Data 2021.1.0-M1 released\n\r\n  \nSpring Framework 5.3.9 and 5.2.16 available now\n\r\n  \nI love this blog looking at Spring GraphQL Milestone One\n\r\n  \nSpring Security 5.6.0-M1 released\n\r\n  \nThe State of Spring Survey is back and we want to hear from you!\n\r\n  \nI love to see this, finally, Building applications with RabbitMQ streams\n\r\n  \nBlog: Kubernetes Release Cadence Change: Here’s What You Need To Know",
          "link": "https://spring.io/blog/2021/07/20/this-week-in-spring-july-20th-2021",
          "publishedOn": "2021-07-20T14:33:00.000Z",
          "wordCount": 570,
          "title": "This Week in Spring - July 20th, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/07/19/spring-security-5-6-0-m1-released",
          "author": null,
          "description": "On behalf of the community, I’m pleased to announce the release of Spring Security 5.6.0-M1!\n\r\n\r\n\r\nIn addition to dependency upgrades, bug fixes, and minor enhancements, the milestone contains a few noteworthy changes:\n\r\n\r\n\r\n\r\n\r\nAn AuthorizationManager for method security\n\r\n\r\n\r\nSupport for any data type in Access Token Response\n\r\n\r\n\r\nA separate repository for Spring Security samples\n\r\n\r\n\r\n\r\n\r\nYou can find the complete details in the release notes.",
          "link": "https://spring.io/blog/2021/07/19/spring-security-5-6-0-m1-released",
          "publishedOn": "2021-07-19T14:00:00.000Z",
          "wordCount": 446,
          "title": "Spring Security 5.6.0-M1 released"
        },
        {
          "id": "https://spring.io/blog/2021/07/16/spring-data-2021-0-3-and-2020-0-11-released",
          "author": null,
          "description": "On behalf of the team, I’m pleased to announce the availability of the Spring Data2021.0.2 and 2020.0.10 service releases.\n\r\nBoth releases are built on top of Spring Framework 5.3.9. For your convenience, you can consume these releases through Spring Boot 2.5.3 and 2.4.9, respectively. Our teammates on the Boot team will release those in about a week.\n\r\nThe service releases ship with mostly bug fixes and dependency upgrades.\n\r\nTo round things off, here are the links to the artifacts, changelogs, and documentation:\n2021.0.3\n\r\n\r\n  \nSpring Data Commons 2.5.3 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data JDBC 2.2.3 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data JPA 2.5.3 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data KeyValue 2.5.3 -…",
          "link": "https://spring.io/blog/2021/07/16/spring-data-2021-0-3-and-2020-0-11-released",
          "publishedOn": "2021-07-16T15:00:00.000Z",
          "wordCount": 852,
          "title": "Spring Data 2021.0.3 and 2020.0.11 released"
        },
        {
          "id": "https://spring.io/blog/2021/07/16/spring-data-2021-1-0-m1-released",
          "author": null,
          "description": "On behalf of the team, I’m pleased to announce the availability of the Spring Data 2021.1.0-M1 milestone release.\n\r\nBoth releases are built on top of Spring Framework 5.3.9. For your convenience, you can consume this release through Spring Boot 2.6.0-M1, which our team mates on the Boot team will release in about a week.\n\r\nThe 2021.1 release train ships a set of features and dependency upgrades.\nThe most important changes are:\n\r\n\r\n  \nUpgrade to Querydsl 5.\n\r\n  \nSupport for a wide range of Redis 6.2 commands.\n\r\n  \nSupport for dialect-dependent custom conversions in Spring Data JDBC. This was used to improve the support of java.time types across multiple databases.\n\r\n  \nSupport for streaming large result sets in Spring Data JDBC.\n\r\n  \nSupport for AggregateReference in query derivation.\n\r\n  \n…",
          "link": "https://spring.io/blog/2021/07/16/spring-data-2021-1-0-m1-released",
          "publishedOn": "2021-07-16T14:00:00.000Z",
          "wordCount": 867,
          "title": "Spring Data 2021.1.0-M1 released"
        },
        {
          "id": "https://spring.io/blog/2021/07/15/a-bootiful-podcast-visualizing-software-architecture-with-the-c4-model-with-architect-simon-brown",
          "author": null,
          "description": "Hi, Spring fans! In this installment, I talk to author, prolific public speaker, an architect’s architect, and one of the most interesting people I get to bump into, and learn from, in this wacky, wild, and wonderful ecosystem of ours: Simon Brown (@simonbrown).",
          "link": "https://spring.io/blog/2021/07/15/a-bootiful-podcast-visualizing-software-architecture-with-the-c4-model-with-architect-simon-brown",
          "publishedOn": "2021-07-15T18:17:00.000Z",
          "wordCount": 446,
          "title": "A Bootiful Podcast: Visualizing software architecture with the C4 model with architect Simon Brown"
        },
        {
          "id": "https://spring.io/blog/2021/07/15/state-of-spring-survey-is-back",
          "author": null,
          "description": "TL;DR - head over to spring.io/survey to take the State of Spring 2021 survey! You can also RT this tweet and help spread the word! Thank you <3\n\r\n\r\nWe ran the State of Spring survey last year, and it was a huge success. Spring community members across the globe, like you, shared their views and experiences, and it all made for fantastic reading.\n\r\nThe survey is back this year, and we want to hear from you! How can Spring help you build new apps and experiences this year? What would you like us to change? This year, we have new sections on Spring Native, building & sharing APIs internally/externally, and a deeper dive on Data.\n\r\nIn exchange for 15 minutes of your time taking the survey, you’ll be among the first to receive our report and the insights included in it. \n\r\nSounds good? Head over to spring.io/survey now! The survey will close at the end of July. \n\r\nDo consider helping us share the survey by retweeting this post on Spring Central twitter, and thank you for sharing your thoughts and experiences with us! \n\r\nThe Spring Team",
          "link": "https://spring.io/blog/2021/07/15/state-of-spring-survey-is-back",
          "publishedOn": "2021-07-15T18:09:00.000Z",
          "wordCount": 573,
          "title": "State of Spring Survey is back!"
        },
        {
          "id": "https://spring.io/blog/2021/07/14/spring-tips-some-cool-features-possible-with-spring-integration-5-5",
          "author": null,
          "description": "Hi, Spring fans! In this installment, I look at some key features made possible by the new Spring Integration 5.5 release, including the new Spring .zip archive support and the new Spring Native hints supporting GraalVM native images",
          "link": "https://spring.io/blog/2021/07/14/spring-tips-some-cool-features-possible-with-spring-integration-5-5",
          "publishedOn": "2021-07-14T23:00:00.000Z",
          "wordCount": 433,
          "title": "Spring Tips: Some cool features possible with Spring Integration 5.5"
        },
        {
          "id": "https://spring.io/blog/2021/07/14/spring-framework-5-3-9-and-5-2-16-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I am pleased to announce that Spring Framework 5.3.9 and 5.2.16 are available now.\n\r\nSpring Framework 5.3.9 includes 45 fixes and improvements. Spring Framework 5.2.16 includes 12 selected fixes and improvements.\n\r\nStay tuned for follow-up Spring Boot releases next week.\n\r\nProject Page | GitHub | Issues | Documentation",
          "link": "https://spring.io/blog/2021/07/14/spring-framework-5-3-9-and-5-2-16-available-now",
          "publishedOn": "2021-07-14T08:41:12.000Z",
          "wordCount": 447,
          "title": "Spring Framework 5.3.9 and 5.2.16 available now"
        },
        {
          "id": "https://spring.io/blog/2021/07/13/this-week-in-spring-july-13th-2021",
          "author": null,
          "description": "Hi, Spring fans! How’re you doing? I’m heads-down, hurriedly making final preparations for tomorrow’s SpringOne Tour episode installment. This is going to be SO MUCH FUN. Do NOT miss this show tomorrow morning, 10AM California time. I’ll be there, along with my friends Madhura Bhave, Olga Maciaszek-Sharma, Bella Bai, Whitney Lee, Core Iberkleid, Nate Schutta, and special guest star Angie Jones. \n\r\nWe look forward to seeing you there and we’ll explore the wide and wonderful world of continuous delivery, testing and more together. \n\r\n\r\n  \nJOOQ 3.15.0 Release  is out, and includes support for R2DBC (and much more)\n\r\n  \nNeat! The JRE will be UTF-8 by default instead of dangerously assuming the host operating system’s default: openjdk/jdk\n\r\n  \nA Bootiful Podcast: Matt Raible Last week, I talked to Matt Raible, and you can too! I love that guy. So happy he was able to join the show again.\n\r\n  \nSpring Tips: Spring Cloud Square\n\r\n  \nThis is neat: you can run TestNG tests with JUnit 5 now\n\r\n  \nPiotr Mińkowski on Twitter: JPAstreamer is a library for expressing JPA/Hibernate queries as Java streams. It can be also integrated with Spring. \n\r\n  \nApress’ R2DBC Revealed book is available for order\n\r\n  \nScaling Spring Boot Microservices\n\r\n  \nHave you seen the lineup for our annual tentpole conference, SpringOne, this  Sep 1–2, 2021? I’ll be there and so will a ton of other amazing people.\n\r\n  \nSpring Authorization Server 0.1.2 available now\n\r\n  \nSpring Cloud Hoxton.SR12 has been released\n\r\n  \nCheck out this cool Spring GraphQL demo project",
          "link": "https://spring.io/blog/2021/07/13/this-week-in-spring-july-13th-2021",
          "publishedOn": "2021-07-14T00:00:00.000Z",
          "wordCount": 633,
          "title": "This Week in Spring - July 13th, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/07/09/spring-authorization-server-0-1-2-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, it is my pleasure to announce the general availability of Spring Authorization Server 0.1.2.\n\r\n\r\n\r\nYou can download it from Maven Central by using the module coordinates:\n\r\n\r\n\r\n\r\ncompile 'org.springframework.security.experimental:spring-security-oauth2-authorization-server:0.1.2'\n\r\n\r\n\r\n\r\nFor additional details on this new project, see the initial announcement and project page.\n\r\n\r\n\r\nThe main features delivered in this release are:\n\r\n\r\n\r\n\r\n\r\nAbility to configure a custom Authorization Consent page (gh-283)\n\r\n\r\n\r\nJDBC implementation of RegisteredClientRepository (gh-265), OAuth2AuthorizationService (gh-245) and OAuth2AuthorizationConsentService (gh-313)\n\r\n\r\n\r\nAbility to configure the Authorization Endpoint (gh-342)\n\r\n\r\n\r\nAbility to configure the Token Endpoint (gh-319)\n\r\n\r\n\r\n\r\n\r\nSee the release notes for complete details.\n\r\n\r\n\r\nTo get started using Spring Authorization Server, see the sample to become familiar with setup and configuration.\n\r\n\r\n\r\nWe would love to gather your feedback as we strive to improve and build upon this release.\n\r\n\r\n\r\nProject Page | GitHub Issues |  ZenHub Board",
          "link": "https://spring.io/blog/2021/07/09/spring-authorization-server-0-1-2-available-now",
          "publishedOn": "2021-07-09T14:00:00.000Z",
          "wordCount": 529,
          "title": "Spring Authorization Server 0.1.2 available now"
        },
        {
          "id": "https://spring.io/blog/2021/07/08/a-bootiful-podcast-matt-raible",
          "author": null,
          "description": "It’s Matt Raible! I love talking to Matt Raible, and I’ll bet you would too. He’s one of the good ones, people. One of the legends of the Java and JavaScript communities. One of the greats. Enjoy!",
          "link": "https://spring.io/blog/2021/07/08/a-bootiful-podcast-matt-raible",
          "publishedOn": "2021-07-08T07:00:00.000Z",
          "wordCount": 422,
          "title": "A Bootiful Podcast: Matt Raible"
        },
        {
          "id": "https://spring.io/blog/2021/07/07/spring-cloud-hoxton-sr12-has-been-released",
          "author": null,
          "description": "On behalf of the community, I am pleased to announce that the Service Release 12 (SR12) of the Spring Cloud Hoxton Release Train is available today. The release can be found in Maven Central. You can check out the Hoxton release notes for more information.\nNotable Changes in the Hoxton Release Train\n\r\nSee all issues included in this release here.\n\r\nThis was primarily a bug fix and documentation release. Hoxton.SR12 is compatible with Spring Boot 2.3.x and 2.2.x.\n\r\nNOTE: This will be the last regularly scheduled release of the Hoxton Release Train. It now enters a special maintenance period for security fixes and critical bugs until the end of Feb 2022 (which follows the lifecycle of Spring Boot 2.3.x). See the wiki for more information.\nSpring Cloud Commons\n\r\n\r\n  \nAdded TaskSchedulerWrappe…",
          "link": "https://spring.io/blog/2021/07/07/spring-cloud-hoxton-sr12-has-been-released",
          "publishedOn": "2021-07-07T16:35:47.000Z",
          "wordCount": 708,
          "title": "Spring Cloud Hoxton.SR12 has been released"
        },
        {
          "id": "https://spring.io/blog/2021/07/07/spring-tips-spring-cloud-square",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Spring Developer Advocate Josh Long (@starbuxman) looks at how to build smarter HTTP clients for your Spring Boot microservices with Spring Cloud Square, Retrofit, and OKHTTP.",
          "link": "https://spring.io/blog/2021/07/07/spring-tips-spring-cloud-square",
          "publishedOn": "2021-07-07T07:00:00.000Z",
          "wordCount": 417,
          "title": "Spring Tips: Spring Cloud Square"
        },
        {
          "id": "https://spring.io/blog/2021/07/06/this-week-in-spring-july-6th-2021",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring! We’re in July already! That blows my mind - we’re closer to 2022 than 2020 at this point. I don’t wanna jinx it, but this year seems markedly better than last year, and I hope it stays that way. Anyway, friends, let’s get on with the roundup!\n\r\n\r\n  \nA Bootiful Podcast: Benjamin Wilms, founder of the Chaos Monkey for Spring Boot and Steadybit, a company to help you build more robust software\n\r\n  \nBlockHound: how it works\n\r\n  \nGetting Started with Apache Camel and Spring Boot\n\r\n  \nGraalVM on Twitter\n\r\n  \nHello, Spring GraphQL\n\r\n  \nIntroducing Spring GraphQL\n\r\n  \nMaciej Walkowiak on Twitter\n\r\n  \nSpring Tips: Spring Retrosocket\n\r\n  \nUse New Relic to effortlessly monitor applications and dependencies in Azure Spring Cloud\n\r\n  \nDetect, Diagnose and Resolve Issues Faster in Spring Boot applications using @NewRelic across your Azure Spring Cloud instances. \n\r\n  \nRegister for @SpringOne today. https://t.co/2Imy31RPwz https://t.co/nVXiILvyOH http://bit.ly/SpringOne21TW VMwareTanzu SpringOne\n\r\n  \nThis project - mhewedy/spring-data-jpa-mongodb-expressions - adds MongoDB query expressions to Spring Data JPA. This’ll be a win for so many JavaScript clients that like to build queries using MongoDB expressions!",
          "link": "https://spring.io/blog/2021/07/06/this-week-in-spring-july-6th-2021",
          "publishedOn": "2021-07-07T01:42:00.000Z",
          "wordCount": 573,
          "title": "This Week in Spring - July 6th, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/07/06/introducing-spring-graphql",
          "author": null,
          "description": "Following the Spring GraphQL project announcement and the availability of a 1.0 milestone, this blog post aims to provide more details.\nIntroduction\n\r\nIf you’re looking to get started, please head over to our reference documentation and read the “Boot Starter” section, or run the samples.\n\r\nIf you don’t know much about GraphQL, there are plenty of good resources. You can start at graphql.org/learn. \n\r\nGraphQL is widely adopted and in “Early Majority” based on the InfoQ Architecture Trends for 2020. It provides an alternative to REST APIs that is more focused on data, and provides a schema and a query language for clients to use. The appeal from a client perspective is clear in this State of JavaScript report. You can read GitHub’s story on why it uses GraphQL.\nFoundational Support\n\r\nAs And…",
          "link": "https://spring.io/blog/2021/07/06/introducing-spring-graphql",
          "publishedOn": "2021-07-06T17:00:00.000Z",
          "wordCount": 1270,
          "title": "Introducing Spring GraphQL"
        }
      ]
    },
    {
      "title": "HashiCorp Blog",
      "feedUrl": "https://www.hashicorp.com/blog/feed.xml",
      "siteUrl": "https://hashicorp.com/blog",
      "articles": [
        {
          "id": "https://www.hashicorp.com/blog/mitchell-s-new-role-at-hashicorp",
          "author": null,
          "description": "Mitchell Hashimoto takes on a new individual contributor role at HashiCorp.",
          "link": "https://www.hashicorp.com/blog/mitchell-s-new-role-at-hashicorp",
          "publishedOn": "2021-07-22T21:00:00.000Z",
          "wordCount": 1115,
          "title": "Mitchell's New Role at HashiCorp"
        },
        {
          "id": "https://www.hashicorp.com/blog/running-duplicate-batch-jobs-in-hashicorp-nomad",
          "author": null,
          "description": "Two approaches to injecting variability into your Nomad batch job template without having to modify the template in the future.",
          "link": "https://www.hashicorp.com/blog/running-duplicate-batch-jobs-in-hashicorp-nomad",
          "publishedOn": "2021-07-21T16:00:00.000Z",
          "wordCount": 1957,
          "title": "Running Duplicate Batch Jobs in HashiCorp Nomad"
        },
        {
          "id": "https://www.hashicorp.com/blog/herding-apache-camels-with-hashicorp-consul",
          "author": null,
          "description": "Here’s how to keep track of your Apache Camel services running throughout a deployment, and enable them to communicate with one another in a multi-cloud or hybrid cloud environment.",
          "link": "https://www.hashicorp.com/blog/herding-apache-camels-with-hashicorp-consul",
          "publishedOn": "2021-07-20T17:45:00.000Z",
          "wordCount": 1467,
          "title": "Herding (Apache) Camels with HashiCorp Consul"
        },
        {
          "id": "https://www.hashicorp.com/blog/how-hashicorp-does-developer-advocacy",
          "author": null,
          "description": "Learn about our approach to developer advocacy, from choosing Developer Advocates to represent and engage our community, to how we approach the work.",
          "link": "https://www.hashicorp.com/blog/how-hashicorp-does-developer-advocacy",
          "publishedOn": "2021-07-16T17:00:00.000Z",
          "wordCount": 1225,
          "title": "How HashiCorp Does Developer Advocacy"
        },
        {
          "id": "https://www.hashicorp.com/blog/build-your-summer-spotify-playlist-with-terraform",
          "author": null,
          "description": "Follow our new tutorial to build your summer playlist with Terraform using a community-authored Spotify provider. Hear from the author and share your playlist for a chance to win a free HashiCorp T-shirt.",
          "link": "https://www.hashicorp.com/blog/build-your-summer-spotify-playlist-with-terraform",
          "publishedOn": "2021-07-15T17:00:00.000Z",
          "wordCount": 1108,
          "title": "Build Your Summer Spotify Playlist with Terraform"
        },
        {
          "id": "https://www.hashicorp.com/blog/introducing-hashitalks-build-a-developer-focused-edition-of-our-community-event",
          "author": null,
          "description": "Here’s what to expect from the first developer-focused edition of HashiTalks — and why you don't want to miss this virtual community event on July 21 and 22, 2021.",
          "link": "https://www.hashicorp.com/blog/introducing-hashitalks-build-a-developer-focused-edition-of-our-community-event",
          "publishedOn": "2021-07-09T16:00:00.000Z",
          "wordCount": 740,
          "title": "Introducing HashiTalks: Build, a Developer-Focused Edition of Our Community Event"
        },
        {
          "id": "https://www.hashicorp.com/blog/managing-ssh-access-at-scale-with-hashicorp-vault",
          "author": null,
          "description": "Learn how to build scalable, role-based SSH access with SSH certificates and HashiCorp Vault.",
          "link": "https://www.hashicorp.com/blog/managing-ssh-access-at-scale-with-hashicorp-vault",
          "publishedOn": "2021-07-07T16:00:00.000Z",
          "wordCount": 3871,
          "title": "Managing SSH Access at Scale with HashiCorp Vault"
        },
        {
          "id": "https://www.hashicorp.com/blog/transparent-proxy-on-consul-service-mesh",
          "author": null,
          "description": "Consul 1.10 can transparently intercept and redirect traffic to sidecar proxies in the service mesh to allow applications to be deployed without modification.",
          "link": "https://www.hashicorp.com/blog/transparent-proxy-on-consul-service-mesh",
          "publishedOn": "2021-07-01T20:00:00.000Z",
          "wordCount": 1943,
          "title": "Transparent Proxy on Consul Service Mesh"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-hashicorp-boundary-0-4",
          "author": null,
          "description": "HashiCorp Boundary 0.4.0 and Boundary Desktop 1.2.0 includes features supporting brokering of HashiCorp Vault secrets for Boundary targets to end-users, enhanced session cleanup, and foundational features for event logging.",
          "link": "https://www.hashicorp.com/blog/announcing-hashicorp-boundary-0-4",
          "publishedOn": "2021-07-01T16:00:00.000Z",
          "wordCount": 793,
          "title": "Announcing HashiCorp Boundary 0.4"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-vault-achieves-red-hat-openshift-helm-certification",
          "author": null,
          "description": "The HashiCorp Vault Helm chart has achieved Red Hat OpenShift Certification to help OpenShift users more readily deploy secrets management on Kubernetes.",
          "link": "https://www.hashicorp.com/blog/hashicorp-vault-achieves-red-hat-openshift-helm-certification",
          "publishedOn": "2021-07-01T15:00:00.000Z",
          "wordCount": 663,
          "title": "HashiCorp Vault Achieves Red Hat OpenShift Helm Certification"
        },
        {
          "id": "https://www.hashicorp.com/blog/onboarding-applications-to-vault-using-terraform-a-practical-guide",
          "author": null,
          "description": "Learn how to build an automated HashiCorp Vault onboarding system with Terraform using sensible naming standards, ACL policy templates, pre-created application entities, and workflows driven by VCS and CI/CD.",
          "link": "https://www.hashicorp.com/blog/onboarding-applications-to-vault-using-terraform-a-practical-guide",
          "publishedOn": "2021-06-29T16:00:00.000Z",
          "wordCount": 2281,
          "title": "Onboarding Applications to Vault Using Terraform: A Practical Guide"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-certified-a-great-place-to-work",
          "author": null,
          "description": "93% of our employees say HashiCorp is a great place to work. In this blog, we share the results from our recent Great Place to Work Trust Index employee survey.",
          "link": "https://www.hashicorp.com/blog/hashicorp-certified-a-great-place-to-work",
          "publishedOn": "2021-06-25T16:00:00.000Z",
          "wordCount": 739,
          "title": "HashiCorp Certified a Great Place to Work"
        },
        {
          "id": "https://www.hashicorp.com/blog/5-zero-trust-security-takeaways-from-hashiconf-europe",
          "author": null,
          "description": "HashiConf Europe speakers from Starbucks and Roblox share how they leverage HashiCorp Vault, Consul, and Boundary to create a zero trust security model.",
          "link": "https://www.hashicorp.com/blog/5-zero-trust-security-takeaways-from-hashiconf-europe",
          "publishedOn": "2021-06-24T16:00:00.000Z",
          "wordCount": 1328,
          "title": "5 Zero Trust Security Takeaways From HashiConf Europe"
        }
      ]
    },
    {
      "title": "Elastic Blog - Elasticsearch, Kibana, and ELK Stack",
      "feedUrl": "https://www.elastic.co/blog/feed",
      "siteUrl": "https://www.elastic.co",
      "articles": [
        {
          "id": "https://www.elastic.co/blog/how-orange-business-services-is-building-a-better-siem-with-elastic",
          "author": "Jocelyn Renouf",
          "description": "I’m a security analyst at Orange Business Services in Paris, and one of my current projects for the Orange Group is implementing a new SIEM based on the Elastic Stack. In this blog post, I’ll share why we chose Elastic and how we were able to integrate Elastic into our existing SIEM, resulting in faster investigations and saving our engineers’ time.\n\nSo follow along:\n\nOrange Group is a multi-service network operator and digital service provider in 26 countries and serves about 253 million customers with 147,000 employees. Orange Business Services, the unit dedicated to businesses and organizations, focuses on digital services. From connectivity, the Internet of Things (IoT), and the cloud to artificial intelligence (AI), application development, and cybersecurity, Orange Business Services …",
          "link": "https://www.elastic.co/blog/how-orange-business-services-is-building-a-better-siem-with-elastic",
          "publishedOn": "2021-07-22T16:00:00.000Z",
          "wordCount": 1609,
          "title": "How Orange Business Services is building a better SIEM with Elastic"
        },
        {
          "id": "https://www.elastic.co/blog/how-versatile-is-the-elastic-stack-ask-walmart-nasa-airbus",
          "author": "Becky Quintal",
          "description": "What do an airline, the world’s largest retailer, the French government, Adobe, and NASA’s JPL have in common? They use the Elastic Stack to empower customers, communities, and, even, interplanetary exploration.  \n With the Elastic Stack’s ability to take data from any source and in any format, and then search, analyze, and visualize it in real time, organizations can act quickly to improve customer experience and power critical systems. The flexibility of Elastic as a platform means that the same underlying technology can serve a broad range of challenges.  \n See how companies across the globe are using Elastic to... \n \nCombat fraud and save consumers millions\n \nWalmart’s Global Investigations team has used Elastic to ingest more than 4 billion metadata records over the past 5 years to co…",
          "link": "https://www.elastic.co/blog/how-versatile-is-the-elastic-stack-ask-walmart-nasa-airbus",
          "publishedOn": "2021-07-20T16:00:00.000Z",
          "wordCount": 843,
          "title": "How versatile is the Elastic Stack? Ask Walmart, NASA, or Airbus."
        },
        {
          "id": "https://www.elastic.co/blog/elastic-stack-7-13-4-released",
          "author": "Colin Goodheart-Smithe",
          "description": "Elastic Stack 7.13.4 has been released. Read about the updates and bug fixes that have been included in Elasticsearch, Kibana, Beats, Logstash, Workplace Search, App Search and APM.",
          "link": "https://www.elastic.co/blog/elastic-stack-7-13-4-released",
          "publishedOn": "2021-07-20T15:00:00.000Z",
          "wordCount": 355,
          "title": "Elastic Stack 7.13.4 released"
        },
        {
          "id": "https://www.elastic.co/blog/bringing-customers-the-best-elastic-experience-on-alibaba-cloud",
          "author": "Becky Quintal",
          "description": "The partnership between Elastic and Alibaba Cloud has expanded our community of users and developers into thousands of commercial users. \n\t\n\nThis partnership is a leading example of Elastic’s commitment to partnering with companies that users trust with their cloud infrastructure and developing a cloud-native, flexible platform. Other partners include Microsoft Azure, Google Cloud, and AWS.\n\t\n\nNow, we are thrilled to be the recipient of Alibaba Cloud’s Walking Together Award. Here, Pankaj Khushani, Sr. Director of Partners at Elastic, explains how Elastic and Alibaba Cloud have overcome market and global challenges to drive growth. \n\nWhat is unique about the partnership?\nOne of the most unique things about our partnership is that Alibaba Elasticsearch is one of Alibaba’s self-developed sol…",
          "link": "https://www.elastic.co/blog/bringing-customers-the-best-elastic-experience-on-alibaba-cloud",
          "publishedOn": "2021-07-15T18:00:00.000Z",
          "wordCount": 902,
          "title": "Bringing customers the best Elastic experience on Alibaba Cloud"
        },
        {
          "id": "https://www.elastic.co/blog/how-does-search-solve-data-problems",
          "author": "Becky Quintal,Fermi Fang",
          "description": "Is enterprise data a benefit or a burden?\n\nThink about all of the data your organization generates and consumes in the digital age — from security event logs to application error messages, energy consumption to vendor contracts. There is so much, and all of it is usually stored in silos, making the data difficult to synthesize to provide better services, identify signals proactively, or make stronger business decisions. How do organizations overcome the challenges of understanding their data so that they can finally derive value from it, allowing organizations to truly put their data to work? \n\nThe answer is to shift your organization’s thinking away from the complexity of consolidating data to how to better find the answers within it. More data can mean more insights, and those benefits h…",
          "link": "https://www.elastic.co/blog/how-does-search-solve-data-problems",
          "publishedOn": "2021-07-15T15:00:00.000Z",
          "wordCount": 886,
          "title": "How does search solve data problems?"
        },
        {
          "id": "https://www.elastic.co/blog/free-training-fundamentals-courses-elastic-enterprise-search",
          "author": "Tamara Rosini,Darren Meiss",
          "description": "We recently released new free on-demand Elastic training courses for the products in the Elastic Enterprise Search solution: Elastic Workplace Search and Elastic App Search. \n\nOur on-demand courses provide the same immersive learning experience found in the classroom, but delivered in a convenient, remote environment. These self-paced courses include expertly designed materials, engaging demos, and hands-on lab exercises. They provide everything you need to start creating powerful search experiences for your workplace, websites, and apps.\n \nElastic Workplace Search and Elastic App Search are built on the Elastic Stack, so you can enjoy its speed, scale, and relevance without the heavy development and maintenance requirements of building your own search solution.\n \nApp Search Fundamentals\nE…",
          "link": "https://www.elastic.co/blog/free-training-fundamentals-courses-elastic-enterprise-search",
          "publishedOn": "2021-07-14T18:00:00.000Z",
          "wordCount": 767,
          "title": "Free training fundamentals courses from Elastic Enterprise Search"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-named-leader-forrester-wave-cognitive-search-2021",
          "author": "Matt Riley",
          "description": "We’re thrilled to announce that Elastic has been named a Leader in The Forrester Wave™: Cognitive Search, Q3 2021*, highlighting, in our opinion, our commitment to providing a set of tools that makes it quicker and easier to build great search experiences with Elasticsearch. \n\nIn addition to receiving the highest score possible in the strategy category, Elastic also received the highest scores possible in the operations and market awareness criteria. We believe this underlines the investments and rapid pace of product innovation Elastic has committed to Enterprise Search over the past year. For example, we’ve continued to deepen our integrations, including adding prebuilt connectivity for Slack, Box, and Gmail. \n\n“[Elastic’s] sweet spot is for enterprises that want fast, friendly, and affo…",
          "link": "https://www.elastic.co/blog/elastic-named-leader-forrester-wave-cognitive-search-2021",
          "publishedOn": "2021-07-12T16:00:00.000Z",
          "wordCount": 761,
          "title": "Elastic named a Leader in The Forrester Wave: Cognitive Search"
        },
        {
          "id": "https://www.elastic.co/blog/how-to-add-search-to-your-ios-app-part-2",
          "author": "Ethan Groves",
          "description": "In part one, we went over setting up your Elastic stack and ingesting data. In the second part of this blog series, we will be creating an iOS app that uses Elasticsearch for searching a movie database.\n\nNote: This tutorial is based on Elasticsearch version 7.12.x\n\nStarting a New Xcode Project\n\n\n\t\nOpen Xcode and create a new project.\nIn the iOS tab, select App and choose Next\nConfigure the options for setting up the new app\n\t\nProduct name: App-Search\nTeam: <your team name>\nOrganization Identifier: <your identifier>\nInterface: SwiftUI\nLife Cycle: SwiftUI App\nLanguage: Swift\nUse core data: No\nInclude tests: No\n\n\t\nSelect Next\nChoose where to save your project, and select Create\n \nBuilding the UI\n\nThe UI will be built out in the ContentView.swift file.\nThe basic structure of the UI will be as …",
          "link": "https://www.elastic.co/blog/how-to-add-search-to-your-ios-app-part-2",
          "publishedOn": "2021-07-08T18:01:00.000Z",
          "wordCount": 2253,
          "title": "How to add search to your iOS app with Elastic App Search: Part 2"
        },
        {
          "id": "https://www.elastic.co/blog/how-to-add-search-to-your-ios-app-part-1",
          "author": "Ethan Groves",
          "description": "This is a short and sweet, to-the-point, tutorial series that shows how to add search functionality to an iOS app using Elasticsearch for free! More specifically, in this two-part blog series, we will be creating an iOS app that uses Elastic App Search for searching a movie database. By the end of this tutorial, whether you need to search through a small movie database or through petabytes of cloud metrics, you’ll have the knowledge you need to build an amazing search experience for iOS mobile users.\n\nNote: This tutorial is based on Elasticsearch version 7.12.x\n\nSetup Elastic Cloud trial\n\n\n\t\nNavigate to https://www.elastic.co/cloud/.\nChoose Start free trial.\nSign up and login.\nChoose Start your free trial.\nSelect the Enterprise Search option.\nChoose to Expand the settings.\nChoose version 7…",
          "link": "https://www.elastic.co/blog/how-to-add-search-to-your-ios-app-part-1",
          "publishedOn": "2021-07-08T18:00:00.000Z",
          "wordCount": 627,
          "title": "How to add search to your iOS app with Elastic App Search"
        },
        {
          "id": "https://www.elastic.co/blog/practical-cpu-time-performance-tuning-for-security-software-part-2",
          "author": "Yamin Tian",
          "description": "In a previous blog, we discussed how to monitor, troubleshoot, and fix high %CPU issues. We also revealed a system API that could have an unexpected impact on CPU consumption. In this episode, we’ll discuss another time-related performance aspect that is unique to security software: application startup time. You don’t need to be a developer to benefit from this article. As long as you are curious to find out how the applications in your environment perform and why sometimes they seem to be very slow and want to improve that, you might find this blog post helpful.\n \nWhat is application startup time?\n\nSecurity software usually sits along the critical path an application takes when it is about to launch or execute. The software makes the decision either to block or allow the launching/executi…",
          "link": "https://www.elastic.co/blog/practical-cpu-time-performance-tuning-for-security-software-part-2",
          "publishedOn": "2021-07-08T15:00:00.000Z",
          "wordCount": 1750,
          "title": "Practical CPU time performance tuning for security software: Part 2"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-stack-7-13-3-released",
          "author": "João Duarte",
          "description": "Elastic Stack 7.13.3 has been released. Read about the updates and bug fixes that have been included in Elasticsearch, Kibana, Beats, Logstash, Workplace Search, App Search and APM.",
          "link": "https://www.elastic.co/blog/elastic-stack-7-13-3-released",
          "publishedOn": "2021-07-07T18:01:00.000Z",
          "wordCount": 280,
          "title": "Elastic Stack 7.13.3 released"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-security-prevents-100-percent-of-revil-ransomware-samples",
          "author": "Jamie Butler",
          "description": "Users of Elastic Security are protected through numerous layers of protections against the REvil ransomware that affected Kaseya VSA and its customers. Elastic Security’s layered protections prevented 100% of the REvil ransomware samples tested before damage and loss could occur to the business.\n\nWe believe that detections and preventions must be layered, as no single protection works 100% of the time. There are times where detection in the SIEM/central analytics layer is the most effective, especially when you need to take signals from multiple places or correlate the activity to determine it is malicious. However, the most effective way to stop an attack is at the host. \n\nPrevention is paramount when it comes to ransomware. Teams cannot wait to be notified of an issue after their data is…",
          "link": "https://www.elastic.co/blog/elastic-security-prevents-100-percent-of-revil-ransomware-samples",
          "publishedOn": "2021-07-07T18:00:00.000Z",
          "wordCount": 1288,
          "title": "Elastic Security prevents 100% of REvil ransomware samples"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-stack-6-8-17-released",
          "author": "João Duarte",
          "description": "Elastic Stack 6.8.17 has been released. Read about the updates and bug fixes that have been included in Kibana, Elasticsearch, Beats, Logstash.",
          "link": "https://www.elastic.co/blog/elastic-stack-6-8-17-released",
          "publishedOn": "2021-07-07T18:00:00.000Z",
          "wordCount": 276,
          "title": "Elastic Stack 6.8.17 released"
        },
        {
          "id": "https://www.elastic.co/blog/notice-cipher-changes-ess",
          "author": "Shubha Anjur Tupil",
          "description": "At Elastic Cloud we are committed to offering our customers the most secure way to run their workloads in the cloud. With the goal of being “secure by default,” we are deprecating ciphers that are considered weak and insecure. Going forward, we will only support ciphers that are included in the Mozilla intermediate list. These changes will take effect after January 30, 2022. We will communicate a precise date closer to the change.\n\nWhat are the changes?\nWe are updating the list of ciphers supported for clients connecting to their Elasticsearch clusters, Kibana, or other components on Elasticsearch Service. The changes are basically on two fronts:\n\n \n\t\nWe will deprecate certain ciphers that are considered weak by modern encryption standards. The ciphers we are going to stop supporting in al…",
          "link": "https://www.elastic.co/blog/notice-cipher-changes-ess",
          "publishedOn": "2021-07-07T15:00:00.000Z",
          "wordCount": 658,
          "title": "Changes to support for ciphers used to connect to Elasticsearch Service"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-security-recognized-in-gartner-magic-quadrant-for-siem",
          "author": "Mike Nichols,Mark Settle",
          "description": "We’re excited to share that Elastic Security has been recognized in the 2021 Gartner Magic Quadrant for Security Information and Event Management (SIEM). Elastic Security is the latest Elastic solution to be recognized in a 2021 Gartner Magic Quadrant report, following the 2021 Magic Quadrant for Insight Engines and 2021 Magic Quadrant for Application Performance Monitoring. \n\nDownload the complimentary report to see Gartner’s market evaluation, and read on to understand why we think that momentum is continuing to build for Elastic Security.\n\n\nThe 2021 Gartner Magic Quadrant for Security Information and Event Management (SIEM)1\n\n \n\nSIEM for the modern SOC\nThe Elastic Stack has enabled security teams at organizations like Uber and the Indiana University OmniSOC revamp how they operate since…",
          "link": "https://www.elastic.co/blog/elastic-security-recognized-in-gartner-magic-quadrant-for-siem",
          "publishedOn": "2021-07-06T19:00:00.000Z",
          "wordCount": 1280,
          "title": "Elastic Security Recognized in the 2021 Gartner Magic Quadrant for SIEM"
        },
        {
          "id": "https://www.elastic.co/blog/secure-your-deployments-on-elastic-cloud-with-azure-private-link",
          "author": "Shubha Anjur Tupil",
          "description": "We are pleased to announce the general availability of the Azure Private Link integration with Elastic Cloud. Azure Private Link provides private connectivity between your VNET (Virtual Network) and other Azure resources. Private Link simplifies your cloud network architecture and eliminates data exposure to the public internet by routing your data to private Azure service endpoints.  \n The use of Azure Private Link with Elastic Cloud provides an additional layer of security to help you meet your security policy and compliance requirements. You can take advantage of Azure Private Link across all subscription tiers on Elastic Cloud. In this blog we’ll show you how easy it is to get started. We’ll walk you through the steps to configure Private Link access between your VNET and Elastic Cloud…",
          "link": "https://www.elastic.co/blog/secure-your-deployments-on-elastic-cloud-with-azure-private-link",
          "publishedOn": "2021-07-06T18:00:00.000Z",
          "wordCount": 827,
          "title": "Secure your deployments on Elastic Cloud with Azure Private Link"
        },
        {
          "id": "https://www.elastic.co/blog/culture-managers-how-to-be-an-ally-and-build-an-inclusive-team",
          "author": "Kristina Frost",
          "description": "Over my years at Elastic, I’ve found myself privileged to be part of a number of different conversations around diversity, equity, and inclusion, starting with the Women of Elastic breakfasts at some of our oldest user conferences. Those meetups turned out to be just the start of a small snowball headed down a big hill, and have led to all kinds of wonderful diversity initiatives all throughout the company.\n\nIn the Business Technology team, we have worked hard to create a diverse team featuring multiple women in leadership roles, people of color, individuals who are not neurotypical, folks who struggle with mental health, and individuals who identify as part of the LGBTQ+ community. As a white, cisgender woman living the single life, I don’t always have shared experiences in each of these …",
          "link": "https://www.elastic.co/blog/culture-managers-how-to-be-an-ally-and-build-an-inclusive-team",
          "publishedOn": "2021-07-06T15:00:00.000Z",
          "wordCount": 1114,
          "title": "Managers: How to be an ally and build an inclusive team"
        },
        {
          "id": "https://www.elastic.co/blog/migrating-ess-certs-letsencrypt",
          "author": "Shubha Anjur Tupil",
          "description": "At Elastic Cloud we are committed to offering our customers the most secure way to run their workloads in the cloud. To help ensure this commitment, we are migrating our TLS certificates to Let’s Encrypt to best support sustainable and fully automated certificate management as our product offerings and available regions continue to expand.\n\nThese changes will begin rolling out to Elastic Cloud regions beginning October 4, 2021, and are expected to be completed in all regions by October 29, 2021. \n\nThe first region will be Azure southcentralus on October 4, 2021. After updating this region, we will pause the rollout to other regions for 14 days to allow for client validation. The remaining regions will begin being updated on October 18, 2021. We will post updates on our status page as the r…",
          "link": "https://www.elastic.co/blog/migrating-ess-certs-letsencrypt",
          "publishedOn": "2021-07-05T15:00:00.000Z",
          "wordCount": 699,
          "title": "Migrating the Certificate Authority (CA) for Elasticsearch Service to Let’s Encrypt"
        },
        {
          "id": "https://www.elastic.co/blog/ingesting-threat-data-with-threat-intel-filebeat-module",
          "author": "Elastic Security Intelligence & Analytics Team",
          "description": "The ability for security teams to integrate threat data into their operations substantially helps their organization identify potentially malicious endpoint and network events using indicators identified by other threat research teams. In this blog, we’ll cover how to ingest threat data with the Threat Intel Filebeat module. In future blog posts, we'll cover enriching threat data with the Threat ECS fieldset and operationalizing threat data with Elastic Security.\n \nElastic Filebeat modules\n\nElastic Filebeat modules simplify the collection, parsing, and visualization of data stored in common log formats. Elastic publishes a variety of Filebeat modules that are focused on collecting the data you want for use within Elasticsearch. These modules provide a standardized and “turnkey” method to i…",
          "link": "https://www.elastic.co/blog/ingesting-threat-data-with-threat-intel-filebeat-module",
          "publishedOn": "2021-07-01T15:00:00.000Z",
          "wordCount": 3598,
          "title": "Ingesting threat data with the Threat Intel Filebeat module"
        },
        {
          "id": "https://www.elastic.co/blog/how-the-elastic-infosec-team-uses-elastic-security",
          "author": "Michael Baldwin",
          "description": "At Elastic, we internally use, test, and provide feedback on all of our products. For example, the Information Security team is helping the Product team build a stronger solution for our customers.\n\nThe InfoSec team is an extremely valuable resource who acts not only as an extension of Quality Assurance/Testing, but also as a data custodian. In fact, our internal detections team utilizes internal Elastic InfoSec data to help build and test detection rules that ultimately find their way into the Elastic Security product.\nLast month, I was afforded the wonderful opportunity of “riding along” with our InfoSec team to better understand how we use Elastic internally. Over the course of three days, spread across three weeks, I saw the underbelly of our internal systems, how they are used, and ho…",
          "link": "https://www.elastic.co/blog/how-the-elastic-infosec-team-uses-elastic-security",
          "publishedOn": "2021-06-30T18:00:00.000Z",
          "wordCount": 1293,
          "title": "How the Elastic InfoSec team uses Elastic Security"
        }
      ]
    },
    {
      "title": "Ansible Blog",
      "feedUrl": "https://www.ansible.com/blog/rss.xml",
      "siteUrl": "https://www.ansible.com/blog",
      "articles": [
        {
          "id": "https://www.ansible.com/blog/fun-with-private-automation-hub-part-2",
          "author": "Daniel Leroux",
          "description": "In the previous blog post, I provided a brief history on Ansible Content Collections and demonstrated how to upload a Collection to a private Automation Hub. We ended the blog by synchronizing content from Ansible Galaxy and Automation Hub. Today, we will configure Ansible Tower to communicate with private Automation Hub.",
          "link": "https://www.ansible.com/blog/fun-with-private-automation-hub-part-2",
          "publishedOn": "2021-07-20T13:00:00.000Z",
          "wordCount": 1471,
          "title": "Fun with private Automation Hub - Part 2"
        },
        {
          "id": "https://www.ansible.com/blog/automation-savings-planner",
          "author": "Roger Lopez",
          "description": "Pre-plan your automation savings with Red Hat Insights for Red Hat Ansible Automation Platform",
          "link": "https://www.ansible.com/blog/automation-savings-planner",
          "publishedOn": "2021-07-14T15:00:00.000Z",
          "wordCount": 2107,
          "title": "Automation Savings Planner"
        },
        {
          "id": "https://www.ansible.com/blog/mapping-saml-attributes-to-red-hat-ansible-automation-platform-organizations-and-teams",
          "author": "Nicolas Leiva",
          "description": "Two-Factor Authentication (2FA) is an additional layer of security that can be used to help protect enterprise applications from unauthorized access. While OAuth, and even some LDAP configs are viable options to enable 2FA in Ansible Automation Platform, users prefer to leverage Security Assertion Markup Language (SAML) for this purpose, as described in Using two-factor SAML with Red Hat Ansible Tower. On the other hand, 2FA to managed machines is discouraged.",
          "link": "https://www.ansible.com/blog/mapping-saml-attributes-to-red-hat-ansible-automation-platform-organizations-and-teams",
          "publishedOn": "2021-07-08T17:30:00.000Z",
          "wordCount": 1668,
          "title": "Mapping SAML attributes to Red Hat Ansible Automation Platform organizations and teams"
        },
        {
          "id": "https://www.ansible.com/blog/aix-patch-management-with-ansible",
          "author": "Talor Holloway",
          "description": "Leading enterprises today use Red Hat Ansible Automation Platform to provision, configure, manage, secure and orchestrate hybrid IT environments. A common misconception is that Ansible is just used to manage the Linux operating system. This is a false belief. Ansible supports Linux, Windows, AIX, IBM i and IBM z/OS environments. This blog will help AIX system administrators get started with Ansible on AIX, and introduce a patching use case.",
          "link": "https://www.ansible.com/blog/aix-patch-management-with-ansible",
          "publishedOn": "2021-07-07T17:00:00.000Z",
          "wordCount": 2356,
          "title": "AIX Patch Management with Ansible"
        }
      ]
    },
    {
      "title": "Azure DevOps Blog",
      "feedUrl": "https://devblogs.microsoft.com/devops/feed/",
      "siteUrl": "https://devblogs.microsoft.com/devops",
      "articles": [
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61948",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes – @Azure Logic Apps with @ChloeCondon appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-azure-logic-apps-with-chloecondon/",
          "publishedOn": "2021-07-20T16:00:56.000Z",
          "wordCount": 1378,
          "title": "AzureFunBytes – @Azure Logic Apps with @ChloeCondon"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61978",
          "author": "Jay Gordon",
          "description": "The top stories from the #AzureDevOps #community for 2021.07.16 are here!\nThe post Top Stories from the Microsoft DevOps Community – 2021.07.16 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-07-16/",
          "publishedOn": "2021-07-16T08:00:06.000Z",
          "wordCount": 1253,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.07.16"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61967",
          "author": "Gloridel Morales",
          "description": "Today, we released Azure DevOps Server 2020.1.1 RC. This is our planned prerelease before our final release of Azure DevOps Server 2020.1.1. You can upgrade from Azure DevOps Server 2020.1 or previous versions of TFS and Azure DevOps. You can find the full details in our release notes.\nThe post Azure DevOps Server 2020.1.1 RC now available appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azure-devops-server-2020-1-1-rc-now-available/",
          "publishedOn": "2021-07-13T17:51:13.000Z",
          "wordCount": 933,
          "title": "Azure DevOps Server 2020.1.1 RC now available"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61890",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes Episode 46 – OpenShift on @Azure with @jjasghar appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-episode-46-openshift-on-azure-with-jjasghar/",
          "publishedOn": "2021-07-13T14:00:15.000Z",
          "wordCount": 1413,
          "title": "AzureFunBytes Episode 46 – OpenShift on @Azure with @jjasghar"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61944",
          "author": "Jay Gordon",
          "description": "The top stories from the #AzureDevOps #community for 2021.07.09 are here!\nThe post Top Stories from the Microsoft DevOps Community – 2021.07.09 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-07-09/",
          "publishedOn": "2021-07-09T13:00:01.000Z",
          "wordCount": 1189,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.07.09"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61886",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes Episode 37 – Microsoft Power Apps with @98codes appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-episode-37-microsoft-power-apps-with-98codes/",
          "publishedOn": "2021-07-06T14:00:26.000Z",
          "wordCount": 1099,
          "title": "AzureFunBytes Episode 37 – Microsoft Power Apps with @98codes"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61927",
          "author": "Jay Gordon",
          "description": "The top stories from the #AzureDevOps #community for 2021.07.02 are here!\nThe post Top Stories from the Microsoft DevOps Community – 2021.07.02 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-07-02/",
          "publishedOn": "2021-07-02T13:00:37.000Z",
          "wordCount": 1148,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.07.02"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61881",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes Episode 45 – Observing @Azure with @DatadogHQ, with guest @ryan_maclean appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-episode-45-observing-azure-with-datadoghq-with-guest-ryan_maclean/",
          "publishedOn": "2021-06-29T14:00:28.000Z",
          "wordCount": 1266,
          "title": "AzureFunBytes Episode 45 – Observing @Azure with @DatadogHQ, with guest @ryan_maclean"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61913",
          "author": "Jay Gordon",
          "description": "The top stories from the #AzureDevOps #community for 2021.06.25 are here!\nThe post Top Stories from the Microsoft DevOps Community – 2021.06.25 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-06-25/",
          "publishedOn": "2021-06-25T14:00:36.000Z",
          "wordCount": 1145,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.06.25"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61877",
          "author": "Jay Gordon",
          "description": "Recently the Developer relations came together to create a video series to get all the essential knowledge to move your project forward with Static Web Apps.  This series provides you with 16 different cookbooks to begin building applications using Azure Static Web Apps.\nThe post How to create your personal blog with Gatsby & Azure Static Web Apps –  Azure Tips & Tricks appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/how-to-create-your-personal-blog-with-gatsby-azure-static-web-apps-azure-tips-tricks/",
          "publishedOn": "2021-06-24T14:00:43.000Z",
          "wordCount": 1364,
          "title": "How to create your personal blog with Gatsby & Azure Static Web Apps –  Azure Tips & Tricks"
        }
      ]
    },
    {
      "title": "Discover Dev",
      "feedUrl": "https://www.discoverdev.io/rss.xml",
      "siteUrl": "http://discoverdev.io",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "http://feeds.feedburner.com/AmazonWebServicesBlog",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "00b7c611ad2f6105489605e59f50390273ecc710",
          "author": "Sébastien Stormacq",
          "description": "Earlier this week, I ordered from Amazon.fr a box of four toothpaste tubes, but only one was in the box. I called Amazon’s customer center. The agent immediately found my order without me having to share the long order number. She issued a refund and told me I even can keep the one tube I […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/9-I5Zf71gm0/",
          "publishedOn": "2021-07-21T15:25:48.000Z",
          "wordCount": 1354,
          "title": "AWS Contact Center Day – July 2021"
        },
        {
          "id": "4f26815f4609dfa07968fe11baa5223ab8c8533c",
          "author": "Channy Yun",
          "description": "At AWS re:Invent 2020, we previewed Amazon EBS io2 Block Express volumes, the next-generation server storage architecture that delivers the first SAN built for the cloud. Block Express is designed to meet the requirements of the largest, most I/O-intensive, mission-critical deployments of Microsoft SQL Server, Oracle, SAP HANA, and SAS Analytics on AWS. Today, I […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/o7h88XQ3T_Y/",
          "publishedOn": "2021-07-19T20:46:04.000Z",
          "wordCount": 1274,
          "title": "Amazon EBS io2 Block Express Volumes with Amazon EC2 R5b Instances Are Now Generally Available"
        },
        {
          "id": "372e69aca051cae4f4c1b6a43259e8a84c0f5a51",
          "author": "Danilo Poccia",
          "description": "IT security teams need to have a real-time understanding of what’s happening with their infrastructure and applications. They need to be able to find and correlate data in this continuous flood of information to identify unexpected behaviors or patterns that can lead to a security breach. To simplify and automate this process, many solutions have […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/aTcqLe6p0cY/",
          "publishedOn": "2021-07-15T22:30:36.000Z",
          "wordCount": 2154,
          "title": "Hybrid Threat Protection with Sumo Logic Cloud SIEM Powered by AWS"
        },
        {
          "id": "57587dfa2c2661bbc68cad661a38c942328e95e6",
          "author": "Julien Simon",
          "description": "At AWS re:Invent 2020, we previewed Amazon HealthLake, a fully managed, HIPAA-eligible service that allows healthcare and life sciences customers to aggregate their health information from different silos and formats into a structured, centralized AWS data lake, and extract insights from that data with analytics and machine learning (ML). Today, I’m very happy to announce […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/DuRcp2g2t04/",
          "publishedOn": "2021-07-15T14:16:11.000Z",
          "wordCount": 2181,
          "title": "Paging Doctor Cloud! Amazon HealthLake Is Now Generally Available"
        },
        {
          "id": "2c8d960c80b46e817beea8943dac6c1c391c0232",
          "author": "Jeff Barr",
          "description": "Time sure does fly! I wrote about the production launch of Amazon Simple Queue Service (SQS) back in 2006, with no inkling that I would still be blogging fifteen years later, or that this service would still be growing rapidly while remaining fundamental to the architecture of so many different types of web-scale applications. The […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/yQjvDBuBwoA/",
          "publishedOn": "2021-07-13T12:57:06.000Z",
          "wordCount": 2039,
          "title": "Amazon Simple Queue Service (SQS) – 15 Years and Still Queueing!"
        },
        {
          "id": "275d63fb9a5b17d9475df998629b499d6de358c8",
          "author": "Sébastien Stormacq",
          "description": "At AWS, we tirelessly innovate to allow you to focus on your business, not its underlying IT infrastructure. Sometimes we launch a new service or a major capability. Sometimes we focus on details that make your professional life easier. Today, I’m happy to announce one of these small details that makes a difference: VPC security […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/p1HdsCm42h0/",
          "publishedOn": "2021-07-07T21:27:44.000Z",
          "wordCount": 1275,
          "title": "Easily Manage Security Group Rules with the New Security Group Rule ID"
        },
        {
          "id": "0989c2f1a859a1e69d4d900252cc47ca4e779558",
          "author": "Jeff Barr",
          "description": "In what has now become an annual tradition (check out my 2016, 2017, 2019, and 2020 posts for a look back), I am happy to share some of the metrics from this year’s Prime Day and to tell you how AWS helped to make it happen. This year I bought all sorts of useful goodies […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/dZ110navB2M/",
          "publishedOn": "2021-06-30T16:08:14.000Z",
          "wordCount": 1183,
          "title": "Prime Day 2021 – Two Chart-Topping Days"
        },
        {
          "id": "c5a5694ebc6350153549c534be9a573abb574e54",
          "author": "Jeff Barr",
          "description": "Weather forecasting, genome sequencing, geoanalytics, computational fluid dynamics (CFD), and other types of high-performance computing (HPC) workloads can take advantage of massive amounts of compute power. These workloads are often spikey and massively parallel, and are used in situations where time to results is critical. Old Way Governments, well-funded research organizations, and Fortune 500 companies […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/NjovUW5A61A/",
          "publishedOn": "2021-06-28T20:37:27.000Z",
          "wordCount": 1644,
          "title": "Planetary-Scale Computing – 9.95 PFLOPS & Position 40 on the TOP500 List"
        },
        {
          "id": "475c831d2c248a8fdb39225b19d7bff9dbed0463",
          "author": "Channy Yun",
          "description": "Last AWS re:Invent, we announced the general availability of Amazon EMR on Amazon Elastic Kubernetes Service (Amazon EKS), a new deployment option for Amazon EMR that allows customers to automate the provisioning and management of Apache Spark on Amazon EKS. With Amazon EMR on EKS, customers can deploy EMR applications on the same Amazon EKS […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/bCg8X47IoPg/",
          "publishedOn": "2021-06-24T19:34:38.000Z",
          "wordCount": 1805,
          "title": "Customize and Package Dependencies With Your Apache Spark Applications on Amazon EMR on Amazon EKS"
        },
        {
          "id": "6302e669522464bce9f1de43887ad452aca0b1bd",
          "author": "Alex Casalboni",
          "description": "Amazon CodeGuru allows you to automate code reviews and improve code quality, and thanks to the new pricing model announced in April you can get started with a lower and fixed monthly rate based on the size of your repository (up to 90% less expensive). CodeGuru Reviewer helps you detect potential defects and bugs that […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/dRVMAyHEFx4/",
          "publishedOn": "2021-06-24T17:35:26.000Z",
          "wordCount": 1653,
          "title": "Amazon CodeGuru Reviewer Updates: New Java Detectors and CI/CD Integration with GitHub Actions"
        },
        {
          "id": "6d97bb81230f544ce3cef037e792e486ff00f4eb",
          "author": "Martin Beeby",
          "description": "Today, we are launching AWS BugBust, the world’s first global challenge to fix one million bugs and reduce technical debt by over $100 million. You might have participated in a bug bash before. Many of the software companies where I’ve worked (including Amazon) run them in the weeks before launching a new product or service. […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/W9k_BKTV3Q4/",
          "publishedOn": "2021-06-24T15:03:57.000Z",
          "wordCount": 1285,
          "title": "New – AWS BugBust: It’s Game Over for Bugs"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/atom.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2492/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/commonly_mispronounced_equations.png\" title=\"&quot;Epsihootamoo doopsiquorps&quot; --the Schrödinger equation for the hydrogen atom\" alt=\"&quot;Epsihootamoo doopsiquorps&quot; --the Schrödinger equation for the hydrogen atom\" />",
          "link": "https://xkcd.com/2492/",
          "publishedOn": "2021-07-21T00:00:00.000Z",
          "wordCount": 187,
          "title": "Commonly Mispronounced Equations"
        },
        {
          "id": "https://xkcd.com/2491/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/immune_factory.png\" title=\"In the final vote, the doubters were won over by the strength of the name IMMUNION.\" alt=\"In the final vote, the doubters were won over by the strength of the name IMMUNION.\" />",
          "link": "https://xkcd.com/2491/",
          "publishedOn": "2021-07-19T00:00:00.000Z",
          "wordCount": 185,
          "title": "Immune Factory"
        },
        {
          "id": "https://xkcd.com/2490/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/pre_pandemic_ketchup.png\" title=\"I wonder what year I'll discard the last weird food item that I bought online in early 2020.\" alt=\"I wonder what year I'll discard the last weird food item that I bought online in early 2020.\" />",
          "link": "https://xkcd.com/2490/",
          "publishedOn": "2021-07-16T00:00:00.000Z",
          "wordCount": 185,
          "title": "Pre-Pandemic Ketchup"
        },
        {
          "id": "https://xkcd.com/2489/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/bad_map_projection_the_greenland_special.png\" title=\"The projection for those who think the Mercator projection gives people a distorted idea of how big Greenland is, but a very accurate idea of how big it SHOULD be.\" alt=\"The projection for those who think the Mercator projection gives people a distorted idea of how big Greenland is, but a very accurate idea of how big it SHOULD be.\" />",
          "link": "https://xkcd.com/2489/",
          "publishedOn": "2021-07-14T00:00:00.000Z",
          "wordCount": 193,
          "title": "Bad Map Projection: The Greenland Special"
        }
      ]
    },
    {
      "title": "Software Engineering Daily",
      "feedUrl": "https://softwareengineeringdaily.com/feed/podcast/",
      "siteUrl": "https://softwareengineeringdaily.com/archives/",
      "articles": [
        {
          "id": "https://softwareengineeringdaily.com/?p=11289",
          "author": null,
          "description": "Apache Pulsar is a cloud-native, distributed messaging and streaming platform originally created at Yahoo! and now a top-level Apache Software Foundation project (pulsar.apache.org). Pulsar is used by many large companies like Yahoo!, Verizon media, Tencent, and Splunk. The company DataStax, an open, multi-cloud stack for modern data apps, has added to their product stack Astra\nThe post Pulsar Revisited with Jonathan Ellis appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/23/pulsar-revisited-with-jonathan-ellis/?utm_source=rss&utm_medium=rss&utm_campaign=pulsar-revisited-with-jonathan-ellis",
          "publishedOn": "2021-07-23T23:13:46.000Z",
          "wordCount": null,
          "title": "Pulsar Revisited with Jonathan Ellis",
          "itunes": {
            "duration": "45:33"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED2757339594.mp3",
            "length": "43774576",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11280",
          "author": null,
          "description": "If you’ve ever googled a CS or programming question, you likely found an answer (or many) on Stack Overflow. Founded in 2008 and named after a common computing error, Stack Overflow empowers the world to develop technology through collective knowledge. More than 100 million people visit Stack Overflow every month making it one of the\nThe post Stack Overflow for Teams: A Centralized Knowledge Sharing and Collaboration Platform with Tom Limoncelli appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/22/stack-overflow-for-teams-a-centralized-knowledge-sharing-and-collaboration-platform-with-tom-limoncelli/?utm_source=rss&utm_medium=rss&utm_campaign=stack-overflow-for-teams-a-centralized-knowledge-sharing-and-collaboration-platform-with-tom-limoncelli",
          "publishedOn": "2021-07-22T09:00:31.000Z",
          "wordCount": null,
          "title": "Stack Overflow for Teams: A Centralized Knowledge Sharing and Collaboration Platform with Tom Limoncelli",
          "itunes": {
            "duration": "39:24"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED9052665781.mp3",
            "length": "37868513",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11275",
          "author": null,
          "description": "In 2003, Google developed a robust cluster management system called Borg. This enabled them to manage clusters with tens of thousands of machines, moving them away from virtual machines and firmly into container management. Then, in 2014, they open sourced a version of Borg called Kubernetes, or K8s.  Now, in 2021, CockroachDB is a distributed\nThe post CockroachDB: Distributed Databases and Containerization with Spencer Kimball appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/21/cockroachdb-distributed-databases-and-containerization-with-spencer-kimball/?utm_source=rss&utm_medium=rss&utm_campaign=cockroachdb-distributed-databases-and-containerization-with-spencer-kimball",
          "publishedOn": "2021-07-21T09:00:06.000Z",
          "wordCount": null,
          "title": "CockroachDB: Distributed Databases and Containerization with Spencer Kimball",
          "itunes": {
            "duration": "58:52"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED5323337855.mp3",
            "length": "56548435",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11270",
          "author": null,
          "description": "Governments, consumers, and companies across the world are becoming more aware and attentive to the risks and causes of climate change. From recycling to using solar power, people are looking for ways to reduce their carbon footprint. Markets like the financial sector, governments, and consulting are looking for ways to understand climate data to make\nThe post Sust Global: Taking Action Against Climate Change with Josh Gilbert appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/20/sust-global-taking-action-against-climate-change-with-josh-gilbert/?utm_source=rss&utm_medium=rss&utm_campaign=sust-global-taking-action-against-climate-change-with-josh-gilbert",
          "publishedOn": "2021-07-20T09:00:27.000Z",
          "wordCount": null,
          "title": "Sust Global: Taking Action Against Climate Change with Josh Gilbert",
          "itunes": {
            "duration": "45:56"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED4411414197.mp3",
            "length": "44136508",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11265",
          "author": null,
          "description": "Big data analytics is the process of collecting data, processing and cleaning it, then analyzing it with techniques like data mining, predictive analytics, and deep learning. This process requires a suite of tools to operate efficiently. Data analytics can save companies money, drive product development, and give insight into the market and customers. The company\nThe post Imply Infra: Big Data Analysis and Real-World Examples with Jad Naous appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/19/imply-infra-big-data-analysis-and-real-world-examples-with-jad-naous/?utm_source=rss&utm_medium=rss&utm_campaign=imply-infra-big-data-analysis-and-real-world-examples-with-jad-naous",
          "publishedOn": "2021-07-19T18:07:33.000Z",
          "wordCount": null,
          "title": "Imply Infra: Big Data Analysis and Real-World Examples with Jad Naous",
          "itunes": {
            "duration": "38:23"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED5610741840.mp3",
            "length": "36895982",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11262",
          "author": null,
          "description": "Ashmeet Sidana is the founder of Engineering Capital.\nThe post How to Convince Ashmeet Sidana to Invest in Your Business appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/18/how-to-convince-ashmeet-sidana-to-invest-in-your-business/?utm_source=rss&utm_medium=rss&utm_campaign=how-to-convince-ashmeet-sidana-to-invest-in-your-business",
          "publishedOn": "2021-07-18T17:31:18.000Z",
          "wordCount": null,
          "title": "How to Convince Ashmeet Sidana to Invest in Your Business",
          "itunes": {
            "duration": "55:23"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED6515893788.mp3",
            "length": "79791031",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11238",
          "author": null,
          "description": "DevOps has shortened the development life cycle for countless applications and is embraced by companies around the world. But managing and monitoring multiple environments is still a major pain point, particularly when companies need to mix cloud and legacy systems. Knowing when services go down and quickly pinpointing the cause is essential for continuous development. \nThe post Better Stack: A New DevOps Experience with Juraj Masar appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/15/better-stack-a-new-devops-experience-with-juraj-masar/?utm_source=rss&utm_medium=rss&utm_campaign=better-stack-a-new-devops-experience-with-juraj-masar",
          "publishedOn": "2021-07-15T21:22:16.000Z",
          "wordCount": null,
          "title": "Better Stack: A New DevOps Experience with Juraj Masar",
          "itunes": {
            "duration": "52:21"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED5743825474.mp3",
            "length": "50294007",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11236",
          "author": null,
          "description": "Data science is an interdisciplinary field that combines strong technical skills with industry knowledge to perform a large range of jobs. Data scientists solve business questions with hands-on work cleaning and analyzing data, building machine learning models and applying algorithms, and generating dynamic visuals and tools to understand the world from the data it generates.\nThe post Data Science on AWS: Implementing AI and ML Pipelines on AWS with Chris Fregly appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/14/data-science-on-aws-implementing-ai-and-ml-pipelines-on-aws-with-chris-fregly/?utm_source=rss&utm_medium=rss&utm_campaign=data-science-on-aws-implementing-ai-and-ml-pipelines-on-aws-with-chris-fregly",
          "publishedOn": "2021-07-14T09:00:36.000Z",
          "wordCount": null,
          "title": "Data Science on AWS: Implementing AI and ML Pipelines on AWS with Chris Fregly",
          "itunes": {
            "duration": "47:03"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED4675761613.mp3",
            "length": "45214509",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11231",
          "author": null,
          "description": "In this episode we discuss the new Move Fast book, as well as many aspects of the current state of software engineering. Daliana Liu interviews Jeff Meyerson, host of Software Daily and author of Move Fast. This interview was also recorded as a video podcast. Check out the video on the Software Daily YouTube channel.\nThe post Move Fast with Jeff Meyerson appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/13/move-fast-with-jeff-meyerson/?utm_source=rss&utm_medium=rss&utm_campaign=move-fast-with-jeff-meyerson",
          "publishedOn": "2021-07-13T16:25:26.000Z",
          "wordCount": null,
          "title": "Move Fast with Jeff Meyerson",
          "itunes": {
            "duration": "1:24:44"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED2623037346.mp3",
            "length": "81390598",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11210",
          "author": null,
          "description": "Big Data has exploded the past decade as cloud computing and more efficient hardware made scaling essentially limitless. Products like Uber revolve entirely around analyzing data to provide rides. According to an EMC/IDC study, there was approximately 5.2TB of data for every person in 2020. That estimate was made before the transition to remote work,\nThe post Data Lineage: Understanding Data Lineage at Scale with Julien Le Dem appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/12/data-lineage-understanding-data-lineage-at-scale-with-julien-le-dem/?utm_source=rss&utm_medium=rss&utm_campaign=data-lineage-understanding-data-lineage-at-scale-with-julien-le-dem",
          "publishedOn": "2021-07-12T18:13:22.000Z",
          "wordCount": null,
          "title": "Data Lineage: Understanding Data Lineage at Scale with Julien Le Dem",
          "itunes": {
            "duration": "58:48"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED5464256989.mp3",
            "length": "56486918",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11220",
          "author": null,
          "description": "Here is the full audiobook for “Move Fast: How Facebook Builds Software”. Continue listening to the end to hear my most recent album “Simulation”.\nThe post (Full Audiobook) Move Fast: How Facebook Builds Software appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/11/full-audiobook-move-fast-how-facebook-builds-software/?utm_source=rss&utm_medium=rss&utm_campaign=full-audiobook-move-fast-how-facebook-builds-software",
          "publishedOn": "2021-07-11T11:46:06.000Z",
          "wordCount": null,
          "title": "(Full Audiobook) Move Fast: How Facebook Builds Software",
          "itunes": {
            "duration": "3:41:35"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED6655547897.mp3",
            "length": "319109209",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11178",
          "author": null,
          "description": "We talk to a lot of exciting startups from all over the world about their tech products. Recently we’ve heard from people innovating in the blockchain space, cloud infrastructure, databases, and automation tools. However, in today’s episode, we’re going to talk about how these tech startups get investments to build their great products in the\nThe post Investment Strategy: Defining New Markets with Sarah Guo appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/09/investment-strategy-defining-new-markets-with-sarah-guo/?utm_source=rss&utm_medium=rss&utm_campaign=investment-strategy-defining-new-markets-with-sarah-guo",
          "publishedOn": "2021-07-09T09:00:05.000Z",
          "wordCount": null,
          "title": "Investment Strategy: Defining New Markets with Sarah Guo",
          "itunes": {
            "duration": "48:43"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED7570608356.mp3",
            "length": "46807229",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11209",
          "author": null,
          "description": "The company Dynatrace provides intelligent observability, continuous automation, and causation-based AI to help Cloud Ops, DevOps, and SRE teams transform faster, innovate more, and deliver better business outcomes. They offer application performance monitoring, infrastructure monitoring, cloud automation, application security, and much more. While being an industry leader in simplifying complex cloud applications, Dynatrace is continuously\nThe post Dynatrace for DevOps and SRE with Aloïs Reitbauer appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/08/dynatrace-for-devops-and-sre-with-alois-reitbauer/?utm_source=rss&utm_medium=rss&utm_campaign=dynatrace-for-devops-and-sre-with-alois-reitbauer",
          "publishedOn": "2021-07-08T17:38:32.000Z",
          "wordCount": null,
          "title": "Dynatrace for DevOps and SRE with Aloïs Reitbauer",
          "itunes": {
            "duration": "1:03:24"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED9335189731.mp3",
            "length": "60910697",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11203",
          "author": null,
          "description": "In this episode we discuss coding bootcamps, fear, fitness, and more with Ruben Harris, CEO of Career Karma. This interview was also recorded as a video podcast. Check out the video on the Software Daily YouTube channel. Sponsorship inquiries: sponsor@softwareengineeringdaily.com\nThe post Career Karma with Ruben Harris appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/07/career-karma-with-ruben-harris/?utm_source=rss&utm_medium=rss&utm_campaign=career-karma-with-ruben-harris",
          "publishedOn": "2021-07-07T09:00:34.000Z",
          "wordCount": null,
          "title": "Career Karma with Ruben Harris",
          "itunes": {
            "duration": "1:45:42"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED9808247379.mp3",
            "length": "101510277",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11197",
          "author": null,
          "description": "SOC 2 is a security audit to prove that SaaS companies have secured their company and customer data. It’s often considered the minimum audit necessary to sell software. HIPAA is a federal law regulating how sensitive medical information about patients must be handled. ISO 27001 is the global benchmark for demonstrating your information security management\nThe post Vanta: Maintaining Security Standards with Christina Cacioppo appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/06/vanta-maintaining-security-standards-with-christina-cacioppo/?utm_source=rss&utm_medium=rss&utm_campaign=vanta-maintaining-security-standards-with-christina-cacioppo",
          "publishedOn": "2021-07-06T09:00:06.000Z",
          "wordCount": null,
          "title": "Vanta: Maintaining Security Standards with Christina Cacioppo",
          "itunes": {
            "duration": "54:17"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED5970613664.mp3",
            "length": "52160933",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11193",
          "author": null,
          "description": "When I worked as an engineer at Amazon, I would arrive at the office every day before 6:30am. Amazon’s enormous campus is in downtown Seattle. The company expands across the city like a massive, growing organism composed of towering buildings and ecospheres. The constant wet mist of Seattle always seems lighter within Amazon campus, perhaps\nThe post Build Your Own Amazon appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/04/build-your-own-amazon/?utm_source=rss&utm_medium=rss&utm_campaign=build-your-own-amazon",
          "publishedOn": "2021-07-04T11:48:31.000Z",
          "wordCount": null,
          "title": "Build Your Own Amazon",
          "itunes": {
            "duration": "4:38"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED5205462694.mp3",
            "length": "6712863",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11177",
          "author": null,
          "description": "There are over 4 billion people using email. Many people using email for business communicate quick questions to colleagues, send repetitive, template-based information to potential customers and freshly hired employees, and repeat a lot of the same phrases. We actually repeat phrases in a lot of written formats. How often do you copy and paste\nThe post Text Blaze: Text Shortcuts with Scott Fortmann-Roe appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/03/text-blaze-text-shortcuts-with-scott-fortmann-roe/?utm_source=rss&utm_medium=rss&utm_campaign=text-blaze-text-shortcuts-with-scott-fortmann-roe",
          "publishedOn": "2021-07-03T16:19:08.000Z",
          "wordCount": null,
          "title": "Text Blaze: Text Shortcuts with Scott Fortmann-Roe",
          "itunes": {
            "duration": "46:00"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED6119771976.mp3",
            "length": "44203722",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11158",
          "author": null,
          "description": "Continuous integration is a coding practice where engineers deliver incremental and frequent code changes to create higher quality software and collaborate more. Teams attempting to continuously integrate new code need a consistent and automated pipeline for reviewing, testing, and deploying the changes. Otherwise change requests pile up in the queue and nothing gets integrated efficiently. \nThe post LayerCI with Colin Chartier appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/07/01/layerci-with-colin-chartier/?utm_source=rss&utm_medium=rss&utm_campaign=layerci-with-colin-chartier",
          "publishedOn": "2021-07-02T05:03:49.000Z",
          "wordCount": null,
          "title": "LayerCI with Colin Chartier",
          "itunes": {
            "duration": "42:47"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED1389745926.mp3",
            "length": "41116705",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11176",
          "author": null,
          "description": "ELT is a process for copying data from a source system into a target system. It stands for “Extract, Load, Transform” and starts with extracting a copy of data from the source location. It’s loaded into the target system like a data warehouse, and then it’s ready to be transformed into a usable format for\nThe post Meltano: ELT for DataOps with Douwe Maan appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/30/meltano-elt-for-dataops-with-douwe-maan/?utm_source=rss&utm_medium=rss&utm_campaign=meltano-elt-for-dataops-with-douwe-maan",
          "publishedOn": "2021-07-01T02:50:07.000Z",
          "wordCount": null,
          "title": "Meltano: ELT for DataOps with Douwe Maan",
          "itunes": {
            "duration": "57:02"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED7947466113.mp3",
            "length": "54801169",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11159",
          "author": null,
          "description": "In this episode we discuss plug and play auth, password management, and crypto with Sean Li, co-founder and CEO of Magic. This interview was also recorded as a video podcast. Check out the video on the Software Daily YouTube channel. Sponsorship inquiries: sponsor@softwareengineeringdaily.com\nThe post Magic with Sean Li appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/29/magic-with-sean-li/?utm_source=rss&utm_medium=rss&utm_campaign=magic-with-sean-li",
          "publishedOn": "2021-06-29T09:00:50.000Z",
          "wordCount": null,
          "title": "Magic with Sean Li",
          "itunes": {
            "duration": "1:23:17"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED7585157449.mp3",
            "length": "79990815",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11170",
          "author": null,
          "description": "For some data problems, you may be more concerned with the state of data at a particular point. A ticket is booked, or it’s not. How many poetry submissions were made to the contest? This is relational data. For other problems, you’re concerned with the change in data over time. Solar energy consumption, for example,\nThe post Timescale: Time Series Databases with Mike Freedman appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/28/timescale-time-series-databases-with-mike-freedman/?utm_source=rss&utm_medium=rss&utm_campaign=timescale-time-series-databases-with-mike-freedman",
          "publishedOn": "2021-06-28T19:31:31.000Z",
          "wordCount": null,
          "title": "Timescale: Time Series Databases with Mike Freedman",
          "itunes": {
            "duration": "55:37"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED2530592682.mp3",
            "length": "53437256",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11141",
          "author": null,
          "description": "The cloud has delivered amazing benefits like on-demand infrastructure that’s easy to use, pay-as-you-go subscription plans, and effortless scaling of applications. This flexibility minimizes the growing pains for businesses and explains why today’s startups and established companies are both building apps on the cloud.  However, the costs of using the cloud stack up once companies\nThe post Cloud Cost with Martin Casado appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/25/cloud-cost-with-martin-casado/?utm_source=rss&utm_medium=rss&utm_campaign=cloud-cost-with-martin-casado",
          "publishedOn": "2021-06-25T09:00:50.000Z",
          "wordCount": null,
          "title": "Cloud Cost with Martin Casado",
          "itunes": {
            "duration": "49:26"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED6949261638.mp3",
            "length": "47500344",
            "type": "audio/mpeg"
          }
        }
      ]
    },
    {
      "title": "Camunda",
      "feedUrl": "https://camunda.com/feed/",
      "siteUrl": "https://camunda.com",
      "articles": [
        {
          "id": "https://camunda.com/?p=21705",
          "author": "Camunda Team",
          "description": "Camunda Optimize is maturing. New features and a better understanding of user needs required a refinement of the tool's UI and provided Camunda’s design team with an opportunity to improve the user experience.\nThe post Design for the future: Improving the Camunda Optimize Report builder experience appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/06/design-for-the-future-improving-the-camunda-optimize-report-builder-experience/",
          "publishedOn": "2021-07-16T10:38:05.000Z",
          "wordCount": 2063,
          "title": "Design for the future: Improving the Camunda Optimize Report builder experience",
          "enclosure": {
            "url": "https://camunda.com/wp-content/uploads/2021/05/Configuring-Aggregations.mov",
            "length": "2475603",
            "type": "video/quicktime"
          }
        },
        {
          "id": "https://camunda.com/?p=24420",
          "author": "Felix Mueller",
          "description": "Camunda Cloud 1.1.0, the next version of our innovative process automation SaaS offering, is here. \nThe post Camunda Cloud 1.1.0 Released appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/07/camunda-cloud-110-released/",
          "publishedOn": "2021-07-13T10:42:22.000Z",
          "wordCount": 2662,
          "title": "Camunda Cloud 1.1.0 Released"
        },
        {
          "id": "https://camunda.com/?p=23929",
          "author": "Camunda BPM Team",
          "description": "Camunda Platform Runtime 7.16.0-alpha3 is here, featuring support for Java 15 & GraalVM JavaScript, and a new create deployment REST API. \nThe post Camunda Platform Runtime 7.16.0-alpha3 Released appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/07/camunda-platform-runtime-7160-alpha3-released/",
          "publishedOn": "2021-07-13T07:30:04.000Z",
          "wordCount": 1851,
          "title": "Camunda Platform Runtime 7.16.0-alpha3 Released"
        },
        {
          "id": "https://camunda.com/?p=23565",
          "author": "Nico Rehwaldt",
          "description": "The Camunda Modeler 4.9 release ships with support for Camunda Cloud 1.1, improvements to the core editor UI, BPMN and DMN editor enhancements, and bug fixes.\nThe post Camunda Modeler 4.9 Released appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/07/camunda-modeler-49-released/",
          "publishedOn": "2021-07-13T07:20:00.000Z",
          "wordCount": 1423,
          "title": "Camunda Modeler 4.9 Released"
        },
        {
          "id": "https://camunda.com/?p=24143",
          "author": "Felix Mueller",
          "description": "We’re excited to announce the release of Camunda Optimize 3.5.0. which ships with new capabilities including Multi Process Reports and an Elasticsearch headers plugin.\nThe post Camunda Optimize 3.5.0 Released appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/07/camunda-optimize-350-released/",
          "publishedOn": "2021-07-13T07:10:02.000Z",
          "wordCount": 2331,
          "title": "Camunda Optimize 3.5.0 Released"
        },
        {
          "id": "https://camunda.com/?p=24133",
          "author": "Christopher Rogers",
          "description": "We’re happy to announce the 1.7 release of Cawemo Enterprise On-Premises, including improvements like copy & paste between diagrams and smarter milestone autosaving.\nThe post Cawemo Enterprise (On-Premises) 1.7 Released appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/07/cawemo-enterprise-on-premises-17-released/",
          "publishedOn": "2021-07-13T07:00:00.000Z",
          "wordCount": 1468,
          "title": "Cawemo Enterprise (On-Premises) 1.7 Released"
        },
        {
          "id": "https://camunda.com/?p=23247",
          "author": "Charley Mann",
          "description": "How Europe's leading online fashion retailer serves 42 million active customers in 20 markets, leveraging Camunda for back-end logistics.\nThe post How Zalando Orchestrates its Sales Order Process with Camunda appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/07/how-zalando-orchestrates-its-sales-order-process-with-camunda/",
          "publishedOn": "2021-07-06T08:00:12.000Z",
          "wordCount": 1593,
          "title": "How Zalando Orchestrates its Sales Order Process with Camunda"
        },
        {
          "id": "https://camunda.com/?p=22723",
          "author": "Charley Mann",
          "description": "Is it possible to digitize consultations with tax and legal experts in order to seamlessly guide decision-makers towards consistent and compliant decisions? \nThe post How Deloitte Digitizes Tax and Legal Consultations with DMN appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/06/how-deloitte-digitizes-tax-and-legal-consultations-with-dmn/",
          "publishedOn": "2021-06-25T08:00:05.000Z",
          "wordCount": 1982,
          "title": "How Deloitte Digitizes Tax and Legal Consultations with DMN"
        }
      ]
    }
  ],
  "cliVersion": "1.11.0"
}