{
  "sources": [
    {
      "title": "Spring",
      "feedUrl": "https://spring.io/blog.atom",
      "siteUrl": "https://spring.io/blog",
      "articles": [
        {
          "id": "https://spring.io/blog/2022/08/11/a-bootiful-podcast-the-good-dr-venkat-subramaniam",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks to the good Dr. Venkat Subramaniam (@venkat_s) about the art of writing software, his latest projects, and more",
          "link": "https://spring.io/blog/2022/08/11/a-bootiful-podcast-the-good-dr-venkat-subramaniam",
          "publishedOn": "2022-08-11T10:00:00.000Z",
          "wordCount": 527,
          "title": "A Bootiful Podcast: the good Dr. Venkat Subramaniam",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/08/10/spring-web-flow-3-0-m1-released",
          "author": null,
          "description": "It has been almost 4 years since the last set of Spring Web Flow releases. Nevertheless, the project continues to serve a specific need particularly well, arguably better than alternatives, and remains in active use. While there hasn’t been a strong driver for new releases, the upcoming Spring Framework 6 brings a Java 17 baseline and makes the shift to Jakarta EE, which creates the need for such a release in order to enable applications to migrate to this new baseline.\n\r\nToday I’m pleased to announce the availability of Spring Web Flow 3.0 M1 in the Spring milestone repository. This release focuses mainly on compatibility with Spring Framework 6 and Jakarta EE. The Travel booking-mvc sample on spring-projects/spring-webflow-samples has been updated and the commit history provides example changes. One significant change is the need to remove Tiles which has not migrated to Jakarta EE. In the sample, Thymeleaf Layouts is used instead.\n\r\nNote that Spring Faces is not included in the release due to its deep integration with JSF and the additional time and effort required to migrate. Please, reach out if you have experience with Web Flow and JSF and are interested to help out with the migration of Spring Faces to Spring Framework 6 and Jakarta EE.\n\r\nIf you have a Web Flow application and you plan to migrate to Spring Framework 6, please give this milestone a try and provide feedback through the project issue tracker. Special thanks to Ian Young and Scott Cantor for their substantial contributions to this release!",
          "link": "https://spring.io/blog/2022/08/10/spring-web-flow-3-0-m1-released",
          "publishedOn": "2022-08-10T15:26:28.000Z",
          "wordCount": 749,
          "title": "Spring Web Flow 3.0 M1 Released",
          "imageUrl": "https://avatars.githubusercontent.com/u/401908?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/08/09/this-week-in-spring-august-9th-2022",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring! How are you this fine Tuesday? I’m in Kansas City for the Kansas City Developer Conference. It’s a crazy fun show, and I’m glad to be here. I only wish the rest of you were here, too! We’ve got a packed This Week in Spring, however, so let’s dive right into it.\n\r\n\r\n  \nsnicoll/demo-aot-native: Demo of a basic webapp using Ahead-Of-Time compilation\n\r\n  \nA Bootiful Podcast: Observability guru Jonatan Ivanov on the future of observability in Spring Boot\n\r\n  \nBlog: Kubernetes Removals and Major Changes In 1.25\n\r\n  \nBuilding a Topic Exchange with RabbitMQ and .NET 6\n\r\n  \nDisplay Logged-in User’s Information in Thymeleaf\n\r\n  \nDockerizing a Java Application\n\r\n  \nGet Started with Spring Boot and SAML\n\r\n  \nResilient Kafka Consumers With Reactor Kafka - DZone Java\n\r\n  \nSpring Batch + Karp Rabin = How CRISPR CAS9 Works\n\r\n  \nSpring Tools 4.15.2 released\n\r\n  \nUpload Image With Spring Boot and Thymeleaf",
          "link": "https://spring.io/blog/2022/08/09/this-week-in-spring-august-9th-2022",
          "publishedOn": "2022-08-09T08:00:00.000Z",
          "wordCount": 651,
          "title": "This Week in Spring - August 9th, 2022",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/08/04/a-bootiful-podcast-observability-guru-jonatan-ivanov-on-the-future-of-observability-in-spring-boot",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks to Spring observability guru Jonatan Ivanov (@jonatan_ivanov)",
          "link": "https://spring.io/blog/2022/08/04/a-bootiful-podcast-observability-guru-jonatan-ivanov-on-the-future-of-observability-in-spring-boot",
          "publishedOn": "2022-08-04T09:00:00.000Z",
          "wordCount": 530,
          "title": "A Bootiful Podcast: Observability guru Jonatan Ivanov on the future of observability in Spring Boot",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/08/04/spring-tools-4-15-2-released",
          "author": null,
          "description": "Dear Spring Community,\n\r\nI am happy to announce the 4.15.2 release of the Spring Tools 4 for Eclipse, Visual Studio Code, and Theia.\nfixes and improvements\n\r\n\r\n  \n(Spring Boot) fixed: Validation errors on @@ placeholders in YAML editor (#711)\n\r\n  \n(VSCode) fixed: Live process is not auto connected when app is launched in internalConsole (#794)\n\r\n  \n(Eclipse) fixed: Cleanup / reduce verbosity of diagnostic output in Eclipse logs (#798)\n\r\n  \n(Eclipse) fixed: Not properly disposed SWT resource was caused Spring Starter Project (#797)\n\r\n  \n(Eclipse) fixed: avoid live hover connection attempt when deploying app to docker without actuator (#716)\n\r\n  \n(Eclipse) fixed: Devtools integration with boot dash docker is broken (#724)\n\r\n  \n(Eclipse) fixed: Pause / Resume for docker boot dash malfunctions (#783)\n\r\n  \n(Concourse) fixed: Concourse extension (in vscode) doesn’t allow on_error in Steps (#737)\n\r\n\r\nTo download the distribution for Eclipse and find links to the marketplace entries for Visual Studio Code and Theia, please go visit:\n\r\n\r\n  \nSpring Tools 4: https://spring.io/tools/\n\r\n\r\nDetailed changes can be found here: https://github.com/spring-projects/sts4/wiki/Changelog#2022-08-03-4152-release-incl-language-servers-version-1370\n\r\nSpring Tools 4.16.0 is scheduled to be released in mid September 2022.\n\r\nEnjoy!",
          "link": "https://spring.io/blog/2022/08/04/spring-tools-4-15-2-released",
          "publishedOn": "2022-08-04T08:50:00.000Z",
          "wordCount": 664,
          "title": "Spring Tools 4.15.2 released",
          "imageUrl": "https://avatars.githubusercontent.com/u/107705?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/08/02/spring-for-apache-kafka-2-9-0-available",
          "author": null,
          "description": "I am pleased to announce that Spring for Apache Kafka 2.9.0 is now available.\n\r\n\r\n\r\nThis version is not provided by Spring Boot dependency management, but it can be used with Boot 2.7 (or 2.6), as long as you override the Kafka dependencies to 3.2.0 as described in this appendix, especially if you are using the embedded Kafka broker.\n\r\n\r\n\r\nPlease see the release candidate announcement for notable changes in this release.\n\r\n\r\n\r\nFor information about all changes in this release, see What’s New.\n\r\n\r\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2022/08/02/spring-for-apache-kafka-2-9-0-available",
          "publishedOn": "2022-08-02T16:05:26.000Z",
          "wordCount": 589,
          "title": "Spring for Apache Kafka 2.9.0 Available",
          "imageUrl": "https://avatars.githubusercontent.com/u/483832?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/08/02/this-week-in-spring-august-1st-2022",
          "author": null,
          "description": "Aloha, Spring fans! Welcome to another installment of This Week in Spring!\n\r\nI’m still on vacation on the beautiful island of Maui, Hawaii, but I wanted to say hello (“aloha!”) and share this week’s latest roundup of all that’s good and glorious in the wide and wonderful world of Springdom.\n\r\nFunny thing, today - the 2nd of August, 2022 - is also my 12-year anniversary on the Spring team. It continues to be a helluva ride, and I so look forward to all that lies ahead. Thank you, Spring team, for everything. Also, sort of coincidentally, I just got a nice promotion. (Thanks, Spring team and VMware). I’m also just about to hit 60,000 followers on Twitter. It’s been a weird, wonderful week, and not just because of all that, but because we’ve got a ton of great stuff to dive into this week (be…",
          "link": "https://spring.io/blog/2022/08/02/this-week-in-spring-august-1st-2022",
          "publishedOn": "2022-08-02T07:00:00.000Z",
          "wordCount": 846,
          "title": "This Week in Spring - August 1st, 2022",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/08/01/spring-cloud-2022-0-0-m4-codename-kilburn-has-been-released",
          "author": null,
          "description": "On behalf of the community, I am pleased to announce that the Milestone 4 (M4) of the Spring Cloud 2022.0.0 Release Train is available today. The release can be found in Spring Milestone repository. You can check out the 2022.0 release notes for more information.\nNotable Changes in the 2022.0.0 Release Train\n\r\nSee the project page for all the issues and pull requests included in this release.\n\r\nSpring Cloud 2022.0.0-M4 is compatible with Spring Boot 3.0.0-M4.\nSpring Cloud Stream\n\r\n\r\n  \nInitial version of fully reactive Kafka binder\n\r\n  \nImproved support for Kafka tombstone records via BiFunction\n\r\n  \nSpring Native improvements\n\r\n\nSpring Cloud Config\n\r\n\r\n  \nMoved to AWS SDK V2 (#2111)\n\r\n  \nMoved from JSCH to Apache MINA (#1901)\n\r\n\nSpring Cloud Gateway\n\r\n\r\n  \nAdds JSON to gRPC filter (#2657)…",
          "link": "https://spring.io/blog/2022/08/01/spring-cloud-2022-0-0-m4-codename-kilburn-has-been-released",
          "publishedOn": "2022-08-01T20:00:00.000Z",
          "wordCount": 877,
          "title": "Spring Cloud 2022.0.0-M4 (codename Kilburn) Has Been Released",
          "imageUrl": "https://avatars.githubusercontent.com/u/524254?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/07/31/how-to-integrate-hibernates-multitenant-feature-with-spring-data-jpa-in-a-spring-boot-application",
          "author": null,
          "description": "For quite some time now, Hibernate has offered a Multitenant feature.\r\nIt integrates nicely with Spring, but there is not much information about how to actually set it up, so I thought an example or two or three could help.\n\r\n\r\n\r\nThere is already an excellent blog article, but it is a little dated and it covers a lot of specifics to the business problems the author tried to solve.\r\nThis approach hides a little of the actual integration, which will be the focus of this article.\n\r\n\r\n\r\nDo not worry about the code in this post. You can find links to the full code examples at the end of this blog post.\n\r\n\r\n\r\nWhat Does Multitenant Mean?\n\r\n\r\n\r\nImagine you build an application. You want to host it yourself and offer the service provided by the application to multiple companies.\r\nBut the data of th…",
          "link": "https://spring.io/blog/2022/07/31/how-to-integrate-hibernates-multitenant-feature-with-spring-data-jpa-in-a-spring-boot-application",
          "publishedOn": "2022-07-31T17:03:00.000Z",
          "wordCount": 2109,
          "title": "How to integrate Hibernates Multitenant feature with Spring Data JPA in a Spring Boot application",
          "imageUrl": "https://avatars.githubusercontent.com/u/136683?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/07/28/a-bootiful-podcast-rabbitmq-rabbit-herder-dan-carwin",
          "author": null,
          "description": "Hi, Spring fans! In this installment Josh Long (@starbuxman) talks to a very busy rabbit-herder on the RabbitMQ team, Dan Carwin (@dcarwin)",
          "link": "https://spring.io/blog/2022/07/28/a-bootiful-podcast-rabbitmq-rabbit-herder-dan-carwin",
          "publishedOn": "2022-07-28T13:00:00.000Z",
          "wordCount": 519,
          "title": "A Bootiful Podcast: RabbitMQ rabbit-herder Dan Carwin",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/07/28/spring-authorization-server-is-going-1-0",
          "author": null,
          "description": "We are excited to announce that we’ve started preparing for Spring Authorization Server 1.0 with plans to release the GA version in November 2022. It has been just over two years since we initially announced this new project, and we have come a long way since its initial development. The project has a full feature set, and the APIs have stabilized and matured over this time. A lot of effort and care was put into this project to ensure that it can grow and adapt over the next few years.\n\r\n\r\n\r\nSpring Authorization Server 1.0 will be based on Spring Security 6.0, which will be based off of Spring Framework 6.0 and will require a minimum of Java 17 at runtime, as well as a minimum of Tomcat 10 or Jetty 11 (for Jakarta EE 9 compatibility). This major release will inherit the VMware Tanzu OSS su…",
          "link": "https://spring.io/blog/2022/07/28/spring-authorization-server-is-going-1-0",
          "publishedOn": "2022-07-28T13:00:00.000Z",
          "wordCount": 857,
          "title": "Spring Authorization Server Is Going 1.0",
          "imageUrl": "https://avatars.githubusercontent.com/u/10884212?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/07/27/spring-cloud-openfeign-3-0-8-is-now-available",
          "author": null,
          "description": "On behalf of the community, I am pleased to announce the Spring Cloud OpenFeign 3.0.8 is available today. The release can be found in Maven Central. This version is compatible with 2020.0.6 Spring Cloud release, but it’s not included in the bom, so it has to be set up manually in project build files.\nNotable Changes in the 3.0.8 Release\n\r\nThis is primarily a bugfix and documentation release, that backports fixes over from 3.1.x releases. The most notable backport is the Fix related to cascading Spring Data’s Page deserialisation.",
          "link": "https://spring.io/blog/2022/07/27/spring-cloud-openfeign-3-0-8-is-now-available",
          "publishedOn": "2022-07-28T05:00:00.000Z",
          "wordCount": 585,
          "title": "Spring Cloud OpenFeign 3.0.8 is now available",
          "imageUrl": "https://avatars.githubusercontent.com/u/4328892?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/07/26/this-week-in-spring-july-26th-2022",
          "author": null,
          "description": "Aloha, Spring fans! I’m on vacation, reporting to you from the paradise-like island of Maui, Hawaii, and hoping that you’re having a wonderful day! My family and I love Hawaii. It’s brimming with beauty and serenity, and while the island of Maui, in the state of Hawaii, is very small, the islands are humbling. They make you feel so very small. It’s surreal to sit there on the beach as the sun creeps down beyond the horizon and to realize there’s nothing but pitch black darkness and water for as far as you can see, starting just a few meters away. It’s endless. It has no end. Like the bugs in code. Endless. And humbling. \n\r\nI’ve spent so much time on the beach with my partner and our daughter that it actually feels kind of weird just to sit here at the keyboard and write out this blog! But …",
          "link": "https://spring.io/blog/2022/07/26/this-week-in-spring-july-26th-2022",
          "publishedOn": "2022-07-26T07:00:00.000Z",
          "wordCount": 960,
          "title": "This Week in Spring - July 26th, 2022",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/07/25/spring-shell-2-1-0-is-now-available",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Shell 2.1.0 has been released and is now available from https://repo.spring.io/milestone.\n\r\nPlease see the release notes for more details.\n\r\nThanks to all those who have contributed with issue reports and pull requests.\n\r\nEarlier this year we started an effort align the project with latest Spring Boot and Spring Framework versions as it was difficult to use existing Spring Shell release of a spring family.\n\r\nOriginally the main issue we wanted to address was a removal of a bean cycles which Spring Boot is now enforcing by default. While this feature can be turned off it is not something Spring Shell should require. This required a lot of changes and we chose to handle it with rework of a shell interna…",
          "link": "https://spring.io/blog/2022/07/25/spring-shell-2-1-0-is-now-available",
          "publishedOn": "2022-07-25T07:02:18.000Z",
          "wordCount": 1148,
          "title": "Spring Shell 2.1.0 is now available",
          "imageUrl": "https://avatars.githubusercontent.com/u/50398?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/07/21/spring-boot-3-0-0-m4-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 3.0.0-M4 has been released and is now available from https://repo.spring.io/milestone.\n\r\nThis release includes 161 enhancements, documentation improvements, dependency upgrades, and bug fixes. Notable new features include:\n\r\n\r\n  \nSupport for Elasticsearch’s new Java client\n\r\n  \nSupport for Flyway 9\n\r\n  \nSupport for Hibernate 6.1\n\r\n\r\nPlease see the release notes for more details and upgrade instructions.\n\r\nThanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2022/07/21/spring-boot-3-0-0-m4-available-now",
          "publishedOn": "2022-07-21T11:15:15.000Z",
          "wordCount": 627,
          "title": "Spring Boot 3.0.0-M4 available now",
          "imageUrl": "https://avatars.githubusercontent.com/u/914682?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/07/21/spring-boot-2-7-2-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.7.2 has been released and is now available from Maven Central.\n\r\nThis release includes 40 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2022/07/21/spring-boot-2-7-2-available-now",
          "publishedOn": "2022-07-21T10:08:50.000Z",
          "wordCount": 598,
          "title": "Spring Boot 2.7.2 available now",
          "imageUrl": "https://avatars.githubusercontent.com/u/914682?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/07/21/a-bootiful-podcast-spring-cloud-and-spring-cloud-kubernetes-contributor-ryan-baxter",
          "author": null,
          "description": "Hi, Spring fans! In this episode, Josh Long (@starbuxman) talks to a person who knows more than most about the awesome implications of both the words “Spring” and “Cloud,” Spring Cloud Kubernetes lead Ryan Baxter (@ryanjbaxter).",
          "link": "https://spring.io/blog/2022/07/21/a-bootiful-podcast-spring-cloud-and-spring-cloud-kubernetes-contributor-ryan-baxter",
          "publishedOn": "2022-07-21T09:00:00.000Z",
          "wordCount": 543,
          "title": "A Bootiful Podcast: Spring Cloud and Spring Cloud Kubernetes contributor Ryan Baxter",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/07/21/spring-boot-2-6-10-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.6.10 has been released and is now available from Maven Central.\n\r\nThis release includes 30 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2022/07/21/spring-boot-2-6-10-available-now",
          "publishedOn": "2022-07-21T08:28:04.000Z",
          "wordCount": 598,
          "title": "Spring Boot 2.6.10 available now",
          "imageUrl": "https://avatars.githubusercontent.com/u/914682?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/07/20/spring-batch-5-0-0-m4-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I am pleased to announce that Spring Batch 5.0.0-M4 is now available from our milestone repository.\n\r\nThis fourth milestone introduces several improvements for Java Records support. It also comes with a number of enhancements, bug fixes, dependency upgrades, and documentation updates. For more details about all the changes, see the release notes.\nJava Records Support Improvement\n\r\nThe support for Java records as items in a chunk-oriented step was initially introduced in v4.3, but that support was limited, due to the fact that v4 has Java 8 as a baseline. In Java 8, records were not even in preview yet. That initial support was based on reflection tricks to create Java records and populate them with data, without having access to the j…",
          "link": "https://spring.io/blog/2022/07/20/spring-batch-5-0-0-m4-available-now",
          "publishedOn": "2022-07-20T19:59:00.000Z",
          "wordCount": 921,
          "title": "Spring Batch 5.0.0-M4 available now!",
          "imageUrl": "https://avatars.githubusercontent.com/u/1210553?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/07/20/spring-for-graphql-1-0-1-released",
          "author": null,
          "description": "On behalf of everyone involved, I’m pleased to announce the first maintenance release of Spring for GraphQL, it is now available from Maven Central. This version will be shipped with Spring Boot 2.7.2.\n\r\nThis release includes 10 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you have general questions, please ask on stackoverflow.com using the spring-graphql tag.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow",
          "link": "https://spring.io/blog/2022/07/20/spring-for-graphql-1-0-1-released",
          "publishedOn": "2022-07-20T16:18:00.000Z",
          "wordCount": 577,
          "title": "Spring for GraphQL 1.0.1 released",
          "imageUrl": "https://avatars.githubusercontent.com/u/103264?v=4?s=200"
        }
      ]
    },
    {
      "title": "HashiCorp Blog",
      "feedUrl": "https://www.hashicorp.com/blog/feed.xml",
      "siteUrl": "https://hashicorp.com/blog",
      "articles": [
        {
          "id": "https://www.hashicorp.com/blog/introducing-sentinel-policies-to-the-terraform-registry",
          "author": null,
          "description": "Terraform Sentinel policies are now available in the Terraform Registry so you can publish policies you want to share and search the Registry for policies you need.",
          "link": "https://www.hashicorp.com/blog/introducing-sentinel-policies-to-the-terraform-registry",
          "publishedOn": "2022-08-11T16:00:00.000Z",
          "wordCount": 1965,
          "title": "Introducing Sentinel Policies to the Terraform Registry (Beta)",
          "imageUrl": "https://www.datocms-assets.com/2885/1620083068-blog-library-product-terraform-black.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/successful-multi-cloud-adoption-requires-automated-security",
          "author": null,
          "description": "In HashiCorp’s new State of Cloud Strategy survey, 89% of respondents said that security is the key driver of their cloud success — here’s how to best secure your multi-cloud environment.",
          "link": "https://www.hashicorp.com/blog/successful-multi-cloud-adoption-requires-automated-security",
          "publishedOn": "2022-08-11T16:00:00.000Z",
          "wordCount": 2637,
          "title": "Successful Multi-Cloud Adoption Requires Automated Security",
          "imageUrl": "https://www.datocms-assets.com/2885/1659570872-state-of-the-cloud-final-card-10-sec_00139.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/zero-trust-security-for-kubernetes-with-a-service-mesh",
          "author": null,
          "description": "A service mesh like HashiCorp Consul can be an essential part of applying zero trust security principles to modern, complex, Kubernetes deployments.",
          "link": "https://www.hashicorp.com/blog/zero-trust-security-for-kubernetes-with-a-service-mesh",
          "publishedOn": "2022-08-10T07:00:00.000Z",
          "wordCount": 3023,
          "title": "Zero Trust Security for Kubernetes with a Service Mesh",
          "imageUrl": "https://www.datocms-assets.com/2885/1620082415-blog-library-product-kubernetes-consul-dark-logomark-lockup.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/cloud-platform-teams-are-everywhere-heres-why",
          "author": null,
          "description": "In HashiCorp’s new State of Cloud Strategy survey, 86% of respondents said they rely on cloud platform teams — for a wide variety of very good reasons.",
          "link": "https://www.hashicorp.com/blog/cloud-platform-teams-are-everywhere-heres-why",
          "publishedOn": "2022-08-08T18:00:00.000Z",
          "wordCount": 3336,
          "title": "Cloud Platform Teams Are Everywhere — Here’s Why",
          "imageUrl": "https://www.datocms-assets.com/2885/1659570872-state-of-the-cloud-final-card-10-sec_00139.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/claiming-her-seat-at-the-tech-table",
          "author": null,
          "description": "Zoraya Sanchez De La Vega Cayero makes a mid-career transition to tech via the HashiCorp Early Careers program.",
          "link": "https://www.hashicorp.com/blog/claiming-her-seat-at-the-tech-table",
          "publishedOn": "2022-08-05T07:00:00.000Z",
          "wordCount": 2403,
          "title": "A Mother of Four Claims Her Seat at the Tech Table",
          "imageUrl": "https://www.datocms-assets.com/2885/1658166656-hashicorp-early-career-program-intern-logo.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-state-of-cloud-strategy-survey-2022-multi-cloud-is-working",
          "author": null,
          "description": "Multi-cloud approaches — and platform teams — are helping 90% of respondents achieve their goals. But watch out for challenges around security, skills, and spending.",
          "link": "https://www.hashicorp.com/blog/hashicorp-state-of-cloud-strategy-survey-2022-multi-cloud-is-working",
          "publishedOn": "2022-08-04T16:00:00.000Z",
          "wordCount": 2814,
          "title": "HashiCorp State of Cloud Strategy Survey 2022: Multi-Cloud Is Working",
          "imageUrl": "https://www.datocms-assets.com/2885/1659570328-state-of-the-cloud-final-card-10-sec_00140.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/3-surprising-things-consul-service-mesh-can-do",
          "author": null,
          "description": "HashiCorp Consul has evolved into a comprehensive networking platform that bolsters zero trust networking, works well with Kubernetes, and is remarkably easy to use.",
          "link": "https://www.hashicorp.com/blog/3-surprising-things-consul-service-mesh-can-do",
          "publishedOn": "2022-08-03T16:00:00.000Z",
          "wordCount": 3461,
          "title": "3 Surprising Things Consul Service Mesh Can Do",
          "imageUrl": "https://www.datocms-assets.com/2885/1620083637-blog-library-product-consul-dark-gradient.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/cdk-for-terraform-now-generally-available",
          "author": null,
          "description": "Cloud Development Kit for Terraform (CDKTF) has reached its first GA release, adding full support for Go and providing a GitHub action to use with Terraform Cloud.",
          "link": "https://www.hashicorp.com/blog/cdk-for-terraform-now-generally-available",
          "publishedOn": "2022-08-01T16:00:00.000Z",
          "wordCount": 2517,
          "title": "CDK for Terraform Is Now Generally Available",
          "imageUrl": "https://www.datocms-assets.com/2885/1632350732-terraform-share.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/meet-hashicorp-2022-interns",
          "author": null,
          "description": "Six interns in HashiCorp’s Early Career Program share their expectations, highs and lows, how they’ve built relationships, and advice for future interns.",
          "link": "https://www.hashicorp.com/blog/meet-hashicorp-2022-interns",
          "publishedOn": "2022-07-28T16:00:00.000Z",
          "wordCount": 2823,
          "title": "Meet Some of HashiCorp’s Talented 2022 Interns",
          "imageUrl": "https://www.datocms-assets.com/2885/1658166656-hashicorp-early-career-program-intern-logo.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/the-evolution-of-service-networking",
          "author": null,
          "description": "In the journey toward a modern service-based networking solution, core workflows are needed for discovering services, securing service communications, automating networking tasks, and controlling access.",
          "link": "https://www.hashicorp.com/blog/the-evolution-of-service-networking",
          "publishedOn": "2022-07-27T16:00:00.000Z",
          "wordCount": 4870,
          "title": "The Evolution of Service Networking",
          "imageUrl": "https://www.datocms-assets.com/2885/1599961299-blog-library-abstract-00091.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/hcp-consul-on-azure",
          "author": null,
          "description": "HCP Consul on Microsoft Azure is now generally available and capable of supporting production workloads running on Azure. Get started today with a secure, resilient service mesh for connecting applications running in Azure.",
          "link": "https://www.hashicorp.com/blog/hcp-consul-on-azure",
          "publishedOn": "2022-07-26T16:00:00.000Z",
          "wordCount": 1750,
          "title": "HCP Consul on Azure is Now Generally Available",
          "imageUrl": "https://www.datocms-assets.com/2885/1655842467-blog-library-product-hcp-consul.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/cribl-mongodb-thales-highlight-new-hcp-enterprise-vault-integrations",
          "author": null,
          "description": "The HashiCorp Vault ecosystem continues to show strong growth with 12 new HCP, Enterprise, and OSS integrations added this quarter.",
          "link": "https://www.hashicorp.com/blog/cribl-mongodb-thales-highlight-new-hcp-enterprise-vault-integrations",
          "publishedOn": "2022-07-20T16:00:00.000Z",
          "wordCount": 2277,
          "title": "Cribl, MongoDB, and Thales Highlight New HCP and Enterprise Vault Integrations",
          "imageUrl": "https://www.datocms-assets.com/2885/1658251325-q2fy23vaultintegrationsgraphic.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/configuring-azure-application-gateway-with-consul-terraform-sync",
          "author": null,
          "description": "Synchronize HCP Consul services as backend address pools for Microsoft Azure Application Gateway using Consul-Terraform-Sync (CTS).",
          "link": "https://www.hashicorp.com/blog/configuring-azure-application-gateway-with-consul-terraform-sync",
          "publishedOn": "2022-07-19T16:00:00.000Z",
          "wordCount": 5207,
          "title": "Configuring Azure Application Gateway with Consul-Terraform-Sync",
          "imageUrl": "https://www.datocms-assets.com/2885/1620082169-blog-library-product-terraform-consul-dark-logomark-lockup.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/recruiting-for-early-careers-at-hashicorp",
          "author": null,
          "description": "The second year of HashiCorp’s Early Career Program includes some 70 interns. The Early Career recruiting team shares details and offers tips for prospective candidates.",
          "link": "https://www.hashicorp.com/blog/recruiting-for-early-careers-at-hashicorp",
          "publishedOn": "2022-07-18T18:00:00.000Z",
          "wordCount": 2439,
          "title": "Recruiting for Early Careers at HashiCorp",
          "imageUrl": "https://www.datocms-assets.com/2885/1658166656-hashicorp-early-career-program-intern-logo.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-azure-stack-hub-provider-1-0",
          "author": null,
          "description": "The new HashiCorp Terraform Azure Stack provider 1.0 includes several provider behavior improvements, 19 new resources, and supports a new service for Key Vault.",
          "link": "https://www.hashicorp.com/blog/announcing-azure-stack-hub-provider-1-0",
          "publishedOn": "2022-07-14T16:00:00.000Z",
          "wordCount": 2300,
          "title": "Announcing Azure Stack Hub Provider 1.0",
          "imageUrl": "https://www.datocms-assets.com/2885/1620082225-blog-library-product-terraform-azure-dark.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-wins-microsoft-azure-oss-us-partner-of-the-year-for-2022",
          "author": null,
          "description": "HashiCorp has been chosen as the 2022 Microsoft US (MSUS) Partner Award winner OSS on Azure and a 2022 Microsoft OSS on Azure Partner of the Year Award finalist.",
          "link": "https://www.hashicorp.com/blog/hashicorp-wins-microsoft-azure-oss-us-partner-of-the-year-for-2022",
          "publishedOn": "2022-07-13T20:00:00.000Z",
          "wordCount": 1880,
          "title": "HashiCorp Wins Microsoft Azure OSS US Partner of the Year for 2022",
          "imageUrl": "https://www.datocms-assets.com/2885/1657744487-microsoft-award-2022.png"
        }
      ]
    },
    {
      "title": "Elastic Blog - Elasticsearch, Kibana, and ELK Stack",
      "feedUrl": "https://www.elastic.co/blog/feed",
      "siteUrl": "https://www.elastic.co",
      "articles": [
        {
          "id": "https://www.elastic.co/blog/heres-why-i-know-open-security-is-our-best-defense",
          "author": "Tony Meehan",
          "description": "No single organization is prepared to stop an attack from a nation-state.",
          "link": "https://www.elastic.co/blog/heres-why-i-know-open-security-is-our-best-defense",
          "publishedOn": "2022-08-11T00:00:00.000Z",
          "wordCount": 9694,
          "title": "I’m a former nation-state exploiter — here’s why I know Open Security is our best defense",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt0baa5e547d28f045/62f29d15e717bf11519ac520/blog-open-security-720x420-B.png"
        },
        {
          "id": "https://www.elastic.co/blog/data-to-drive-the-end-to-end-shopping-journey",
          "author": "Brandon Mavleos",
          "description": "The shopper of the future is here today. Elastic is a key partner to the retail ecosystem: delivering insights by enabling customers to store, search, and consume customer information at speed.",
          "link": "https://www.elastic.co/blog/data-to-drive-the-end-to-end-shopping-journey",
          "publishedOn": "2022-08-11T00:00:00.000Z",
          "wordCount": 9441,
          "title": "Data to drive the end-to-end shopping journey",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt3b157ca95ff8c016/62f2b2d24c4bc9109f698cdb/04-bedroom-laptop_(2).jpg"
        },
        {
          "id": "https://www.elastic.co/blog/heres-why-i-know-open-security-is-our-best-defense",
          "author": "Tony Meehan",
          "description": ",\nNot so long ago, I woke up every morning focused on one thing: finding and exploiting vulnerabilities.\n\nDuring my 10 years working for the U.S. National Security Agency (NSA), my single objective was to identify and exploit networks to collect foreign intelligence. I was fortunate to work alongside the world’s best professional vulnerability and exploit developers. My time serving my government was formative and humbling. I learned impossible challenges are possible through unwavering persistence and patience.\n\n\nBut that was more than a decade ago. Now I sit on the other side of the table. I work with amazing people to build defensive cybersecurity software that protects the world’s data from attack. \n\n\nAs most of us understand, even the most sophisticated cybersecurity defenses are no m…",
          "link": "https://www.elastic.co/blog/heres-why-i-know-open-security-is-our-best-defense",
          "publishedOn": "2022-08-11T00:00:00.000Z",
          "wordCount": 9694,
          "title": "I’m a former nation-state exploiter — here’s why I know Open Security is our best defense",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt0baa5e547d28f045/62f29d15e717bf11519ac520/blog-open-security-720x420-B.png"
        },
        {
          "id": "https://www.elastic.co/blog/data-to-drive-the-end-to-end-shopping-journey",
          "author": "Brandon Mavleos",
          "description": ",\nThe shopper of the future is here today. Customers want ultimate flexibility, reliability, and immediate gratification. They’ve become accustomed to zero friction in the buyer journey and associate their favorite brands as extensions of themselves.\n\nData is essential to delivering on your brand promise. Access to information across disparate sources can help create highly personalized ecommerce experiences, ensure the performance and security of critical systems, and protect customers from bad actors.\n\nElastic is a key partner to the retail ecosystem, delivering insights by enabling customers to store, search, and consume customer information at speed. From the retailers themselves to ecommerce providers and manufacturing companies that put products on the shelves, Elastic is the common …",
          "link": "https://www.elastic.co/blog/data-to-drive-the-end-to-end-shopping-journey",
          "publishedOn": "2022-08-11T00:00:00.000Z",
          "wordCount": 9441,
          "title": "Data to drive the end-to-end shopping journey",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt3b157ca95ff8c016/62f2b2d24c4bc9109f698cdb/04-bedroom-laptop_(2).jpg"
        },
        {
          "id": "https://www.elastic.co/blog/building-personalized-ecommerce-search-experiences-with-elastic",
          "author": "The Elastic Enterprise Search team",
          "description": "A growing number of retailers use Elastic to build personalized ecommerce search experiences that enable rich opportunities for analyzing a wealth of customer search data. Better yet, it gives you many ways to boost engagement, conversion, and revenue.",
          "link": "https://www.elastic.co/blog/building-personalized-ecommerce-search-experiences-with-elastic",
          "publishedOn": "2022-08-10T00:00:00.000Z",
          "wordCount": 9007,
          "title": "Building personalized ecommerce search experiences with Elastic",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltf8f5ba11c2a0d384/62ec1beb412cd777d8051ed0/blog-ecommerce-personalized-thumbnail.png"
        },
        {
          "id": "https://www.elastic.co/blog/using-search-analytics-to-strengthen-ecommerce-solutions",
          "author": "The Elastic Enterprise Search team",
          "description": "Every time a customer searches on your site, they share critical information about what they want. Use Elastic to build search experiences that take advantage of all this search data to personalize results, capitalize on trends, and address gaps in products, services, or content.",
          "link": "https://www.elastic.co/blog/using-search-analytics-to-strengthen-ecommerce-solutions",
          "publishedOn": "2022-08-10T00:00:00.000Z",
          "wordCount": 9601,
          "title": "Using search analytics to strengthen ecommerce solutions",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt00c2f8a3c98e34bf/60053ba382548c0f8284971e/blog-seriousanalytics-720x420.png"
        },
        {
          "id": "https://www.elastic.co/blog/how-ml-driven-search-is-helping-ecommerce-sites-boost-customer-loyalty",
          "author": "Dan Tynan",
          "description": "Search abandonment costs $333 billion a year, but retailers are (machine) learning how to keep customers happy",
          "link": "https://www.elastic.co/blog/how-ml-driven-search-is-helping-ecommerce-sites-boost-customer-loyalty",
          "publishedOn": "2022-08-10T00:00:00.000Z",
          "wordCount": 9567,
          "title": "How ML-driven search is helping ecommerce sites boost customer loyalty",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt1c32f7371e04cc0e/62f416ab99dab06ebd13f48b/search-box-for-scale.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/building-personalized-ecommerce-search-experiences-with-elastic",
          "author": "The Elastic Enterprise Search team",
          "description": ",\nFor online storefronts, there’s a fine line between a converted sale and a lost opportunity. The slightest overlooked detail on an ecommerce site can lead to customers quickly clicking elsewhere.  \nThe key to retaining site visitors and driving clicks that lead to sales lies in the technology behind the customer experience — specifically, search. Offering highly personalized search experiences powered by Elastic Enterprise Search is proven to boost engagement, drive conversion, and increase sales.\n[Related article: Driving quantified success with Elastic Enterprise Search]\nWhat retailers are facing: The ecommerce landscape\nToday’s ecommerce outlook is uncertain. With prices creeping upward, online shoppers are more discriminating than ever. Studies show that finding the products customer…",
          "link": "https://www.elastic.co/blog/building-personalized-ecommerce-search-experiences-with-elastic",
          "publishedOn": "2022-08-10T00:00:00.000Z",
          "wordCount": 9007,
          "title": "Building personalized ecommerce search experiences with Elastic",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltf8f5ba11c2a0d384/62ec1beb412cd777d8051ed0/blog-ecommerce-personalized-thumbnail.png"
        },
        {
          "id": "https://www.elastic.co/blog/using-search-analytics-to-strengthen-ecommerce-solutions",
          "author": "The Elastic Enterprise Search team",
          "description": ",\nWhen it comes to delivering exceptional results to customers, having an understanding of all the tools at your disposal will give you a leg up. Especially in these uncertain economic times, this is even more important as companies look to gain any advantage possible. Being able to convert browsers into buyers and customers for life by providing the best customer experience will truly usher in this advantage.\n\nIn addition to your business data, search analytics data from your ecommerce platform is critical to delivering an optimal customer experience. Every time a customer uses search on your site, they share critical information with you about what they want. With Elastic, these insights are at your fingertips and can help merchandisers improve their product mix and optimize sales.\nWhat …",
          "link": "https://www.elastic.co/blog/using-search-analytics-to-strengthen-ecommerce-solutions",
          "publishedOn": "2022-08-10T00:00:00.000Z",
          "wordCount": 9601,
          "title": "Using search analytics to strengthen ecommerce solutions",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt00c2f8a3c98e34bf/60053ba382548c0f8284971e/blog-seriousanalytics-720x420.png"
        },
        {
          "id": "https://www.elastic.co/blog/how-ml-driven-search-is-helping-ecommerce-sites-boost-customer-loyalty",
          "author": "Dan Tynan",
          "description": ",\nIt's a great time to be an online retailer. But it's also more challenging than ever. \n\nIn 2022, global ecommerce sales are projected to exceed $5.4 trillion, continuing a pattern of explosive growth that was accelerated by the pandemic. Yet, competition is intense and expectations are high, while customer loyalty is extremely fluid. If people can't easily find what they're looking for on your site, they'll buy it somewhere else — and they might never return.\n\nA Harris Poll survey of 10,000 customers worldwide found that 76% abandoned a retailer after failing to find a product they wanted. Roughly half ended up buying the product elsewhere. Per the study, search abandonment costs U.S. retailers an estimated $333 billion each year.\n\nIt's why forward-thinking e-tailers are turning to machi…",
          "link": "https://www.elastic.co/blog/how-ml-driven-search-is-helping-ecommerce-sites-boost-customer-loyalty",
          "publishedOn": "2022-08-10T00:00:00.000Z",
          "wordCount": 9567,
          "title": "How ML-driven search is helping ecommerce sites boost customer loyalty",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt1c32f7371e04cc0e/62f416ab99dab06ebd13f48b/search-box-for-scale.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/supporting-us-veteran-heroes-through-operation-giving-back",
          "author": "Stephanie Raiguel",
          "description": "Learn about how Elastic is giving back to America's heroes by providing access to a customized free training program, career support, and resources and a special place in our community to network build connections.",
          "link": "https://www.elastic.co/blog/supporting-us-veteran-heroes-through-operation-giving-back",
          "publishedOn": "2022-08-09T00:00:00.000Z",
          "wordCount": 9137,
          "title": "Supporting U.S. veteran heroes through Operation Giving Back",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltd7520537f6dd18fe/5f7e2a06af58110efed2809e/illustration-veterans-dog-tags.svg"
        },
        {
          "id": "https://www.elastic.co/blog/supporting-us-veteran-heroes-through-operation-giving-back",
          "author": "Stephanie Raiguel",
          "description": ",\nLaunched in September 2021, Operation Giving Back provides all U.S. veterans and active duty military personnel with access to Elastic training to help them grow and diversify their technical skill set.  \n\nOperation Giving Back is about Elastic saying thank you to all military personnel by providing a leg up when it comes to technical skills development.\n,Customize your training experience\nDesigned to support individuals looking to develop their Elastic skills in a variety of areas, participants in the program have access to a customized training program that includes the following courses:\n\nData Analysis with Kibana\nObservability Fundamentals\nApp Search Fundamentals\nApp Search Web Crawler Fundamentals\nWorkplace Search Fundamentals\nECE Fundamentals\nKibana Fundamentals\nKibana for Splunk S…",
          "link": "https://www.elastic.co/blog/supporting-us-veteran-heroes-through-operation-giving-back",
          "publishedOn": "2022-08-09T00:00:00.000Z",
          "wordCount": 9137,
          "title": "Supporting U.S. veteran heroes through Operation Giving Back",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltd7520537f6dd18fe/5f7e2a06af58110efed2809e/illustration-veterans-dog-tags.svg"
        },
        {
          "id": "https://www.elastic.co/blog/driving-quantified-success-with-elastic-security",
          "author": "Rick Fernandez",
          "description": "Discover how Elastic’s Security solution helps customers realize and quantify outcomes and satisfaction in decision-making, customer churns, the impact of security threats, and overall risk reduction.",
          "link": "https://www.elastic.co/blog/driving-quantified-success-with-elastic-security",
          "publishedOn": "2022-08-08T00:00:00.000Z",
          "wordCount": 9185,
          "title": "Driving quantified success with Elastic Security",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt6b865b5ac272971b/611eba28043d546bb462a323/blog-security-radar-720x420.png"
        },
        {
          "id": "https://www.elastic.co/blog/driving-quantified-success-with-elastic-security",
          "author": "Rick Fernandez",
          "description": ",\nRegardless of geography, industry, sector, or use cases, most would agree that reducing risk is a top priority for their organization. Whether it’s decreasing phishing scams, ransomware, and malware attacks or reducing the risk of customer churn due to breaches, security is everyone’s concern. As leaders working toward strategic initiatives around security, we should be asking how we can improve security and modernize our tech stack to drive organizational resiliency and efficiency, while reducing risk and spend.  \n\nFor more than a decade, Elastic has been solving complex data problems for customers that increase productivity, drive down tool sprawl, and reduce risk of revenue disruption. Since the time I have been at Elastic, we have focused on building out-of-the-box content around sec…",
          "link": "https://www.elastic.co/blog/driving-quantified-success-with-elastic-security",
          "publishedOn": "2022-08-08T00:00:00.000Z",
          "wordCount": 9185,
          "title": "Driving quantified success with Elastic Security",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt6b865b5ac272971b/611eba28043d546bb462a323/blog-security-radar-720x420.png"
        },
        {
          "id": "https://www.elastic.co/blog/continued-leadership-in-open-and-transparent-security",
          "author": "Mark Dufresne",
          "description": "Elastic Security has long had open source roots. Learn how we're continuing to build on that foundation today by opening a new public repo, protection-artifacts.",
          "link": "https://www.elastic.co/blog/continued-leadership-in-open-and-transparent-security",
          "publishedOn": "2022-08-03T00:00:00.000Z",
          "wordCount": 9962,
          "title": "Continued leadership in open and transparent security",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltd316fcd9a9047cca/62ea7319022e5e700e65d3f0/blog-open-and-transparent-security-720x420-A.png"
        },
        {
          "id": "https://www.elastic.co/blog/continued-leadership-in-open-and-transparent-security",
          "author": "Mark Dufresne",
          "description": ",\nElastic Security has long been open — with open source roots, open development, and the release of our SIEM in 2019. In 2020, we further embraced the openness of Elastic and released our open detection-rules repo to collaborate with our users and be transparent about how we protect customers. That repo is focused on our SIEM and Security Analytics use cases and did not yet include Elastic Endpoint Security artifacts. We continue to build on that foundation today by opening a new public repo, protections-artifacts.\n\n\nIn the protections-artifacts repo, you’ll find protection logic utilized by Elastic Endpoint Security to stop threats on Windows, macOS, and Linux operating systems. This includes malware behavior protection rules written in EQL as well as YARA signatures applied to both file…",
          "link": "https://www.elastic.co/blog/continued-leadership-in-open-and-transparent-security",
          "publishedOn": "2022-08-03T00:00:00.000Z",
          "wordCount": 9962,
          "title": "Continued leadership in open and transparent security",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltd316fcd9a9047cca/62ea7319022e5e700e65d3f0/blog-open-and-transparent-security-720x420-A.png"
        },
        {
          "id": "https://www.elastic.co/blog/why-the-best-kind-of-cybersecurity-is-open-security",
          "author": "Santosh Krishnan",
          "description": "It’s time for a new paradigm in the world of cybersecurity. Rather than closed systems that show no signs of abating the ever-increasing cycle of vulnerability, intrusion, patch, and repeat, we propose a model of Open Security.",
          "link": "https://www.elastic.co/blog/why-the-best-kind-of-cybersecurity-is-open-security",
          "publishedOn": "2022-08-02T00:00:00.000Z",
          "wordCount": 9986,
          "title": "Why the best kind of cybersecurity is Open Security",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltcaf8e3e614fb824e/62e949032a66d4760f00e2c9/blog-open-security-720x420-A.png"
        },
        {
          "id": "https://www.elastic.co/blog/what-is-search-powered-technology-and-why-do-84-of-execs-say-its-the-key-to-digital-transformation",
          "author": "Megan Radogna",
          "description": "Search-powered technology enables the search of data across multiple sources — a critical functionality that helps organizations drive speed, scale, and productivity in the next wave of digital transformation.",
          "link": "https://www.elastic.co/blog/what-is-search-powered-technology-and-why-do-84-of-execs-say-its-the-key-to-digital-transformation",
          "publishedOn": "2022-08-02T00:00:00.000Z",
          "wordCount": 8981,
          "title": "What is search-powered technology and why do 84% of execs say it's the key to digital transformation?",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt3e07abc896e7706e/62e8393ce717bf11519aa2b3/blog-forrester-digital-transformation-plant-compressed_(1).png"
        },
        {
          "id": "https://www.elastic.co/blog/why-the-best-kind-of-cybersecurity-is-open-security",
          "author": "Santosh Krishnan",
          "description": ",\nFor too long, the idea of security in digital systems has been accompanied by another idea: secrecy. \n\nTo have true security, some argue, the technology that provides it must be kept a secret, even from the customers who use it. Just trust us, they say — our software is constantly updated by the best developers out there. We’re monitoring for threats before anyone else knows they exist. And we patch them up before they ever create a problem for your systems. All you have to do is install our software and leave what happens on the inside of it to us.\n\nUnfortunately, this black-box approach to security is, in an era of committed, well-resourced attackers who seek to do great harm, a huge vulnerability in itself. By closing off their code from the community, these security firms themselves …",
          "link": "https://www.elastic.co/blog/why-the-best-kind-of-cybersecurity-is-open-security",
          "publishedOn": "2022-08-02T00:00:00.000Z",
          "wordCount": 9986,
          "title": "Why the best kind of cybersecurity is Open Security",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltcaf8e3e614fb824e/62e949032a66d4760f00e2c9/blog-open-security-720x420-A.png"
        },
        {
          "id": "https://www.elastic.co/blog/what-is-search-powered-technology-and-why-do-84-of-execs-say-its-the-key-to-digital-transformation",
          "author": "Megan Radogna",
          "description": ",\nWe all know that too much of a good thing can quickly backfire. In today’s business world, many companies are finding that they’re hitting a tipping point in terms of data. \n\nData creates the potential for informed business decisions that drive speed, productivity, and digital transformation, but not without introducing a series of challenges. Managing data across silos and disparate environments, unstructured data, and storage issues are just a few of the complications that arise from generating and collecting more data. \n\nSo how can organizations realize the benefits of more data without becoming overwhelmed? A new global study conducted by Forrester Consulting, commissioned by Elastic, analyzed one method organizations have applied to harness the power of their data: search-powered te…",
          "link": "https://www.elastic.co/blog/what-is-search-powered-technology-and-why-do-84-of-execs-say-its-the-key-to-digital-transformation",
          "publishedOn": "2022-08-02T00:00:00.000Z",
          "wordCount": 8981,
          "title": "What is search-powered technology and why do 84% of execs say it's the key to digital transformation?",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt3e07abc896e7706e/62e8393ce717bf11519aa2b3/blog-forrester-digital-transformation-plant-compressed_(1).png"
        }
      ]
    },
    {
      "title": "Ansible Blog",
      "feedUrl": "https://www.ansible.com/blog/rss.xml",
      "siteUrl": "https://www.ansible.com/blog",
      "articles": [
        {
          "id": "https://www.ansible.com/blog/creating-kubernetes-dynamic-inventories-with-kubernetes.core-modules",
          "author": "Roger Lopez",
          "description": "When managing infrastructure, there are times when a dynamic inventory is essential. Kubernetes is a perfect example of this where you may create multiple applications within a namespace but you will not be able to create a static inventory due to Kubernetes appending a systems-generated string to uniquely identify objects.",
          "link": "https://www.ansible.com/blog/creating-kubernetes-dynamic-inventories-with-kubernetes.core-modules",
          "publishedOn": "2022-08-10T13:15:00.000Z",
          "wordCount": 3078,
          "title": "Creating Kubernetes Dynamic Inventories with kubernetes.core Modules",
          "imageUrl": "https://www.ansible.com/hubfs/roger%20kube.core%20blog%20aug%205%2022.png"
        },
        {
          "id": "https://www.ansible.com/blog/peeling-back-the-layers-and-understanding-automation-mesh",
          "author": "scavanau@redhat.com (Sean Cavanaugh)",
          "description": "Red Hat Ansible Automation Platform 2 features an awesome new way to scale out your automation workloads: automation mesh.  If you are unfamiliar with automation mesh, I highly recommend reading Craig Brandt’s blog post What's new: an introduction to automation mesh which outlines how automation mesh can simplify your operations and scale your automation globally.  For this blog post, I want to focus on the technical implementation of automation mesh, what network ports it is using and how you can secure it.",
          "link": "https://www.ansible.com/blog/peeling-back-the-layers-and-understanding-automation-mesh",
          "publishedOn": "2022-08-01T13:00:00.000Z",
          "wordCount": 4487,
          "title": "Peeling back the layers and understanding automation mesh",
          "imageUrl": "https://lh5.googleusercontent.com/k5ot1T_1tDkUb5vwSwmXnM0Y8A_ApAD_qiRKnV9ChKNCywGvDd9h3H_ub6kpO23b9GZsoZoCMjfFoAoptUfC0Bw_dBAxdBkMqgs41H6l_xouLEGM5cQ2nLCs9KrtTisE6YAEYKQM2p4tXvovXDoK6QQ"
        },
        {
          "id": "https://www.ansible.com/blog/using-red-hat-ansible-automation-platform-to-enable-a-policy-as-code-solution",
          "author": "tcoulter@redhat.com (Tim Coulter)",
          "description": "Nelson, the director of operations of a large manufacturing company, told me that he has a highly leveraged staff. That is, most of the work on the company's critical cloud project is being done by consultants and vendors, and not by their team members. Unfortunately, much of the staff’s time is spent making sure that the infrastructure as code (IaC) implementation is in compliance with the standards and policies that his company has for cloud resources. Nelson said, “Oftentimes the code works, but doesn’t conform to naming conventions, or is missing labels, or has security issues, which impacts downstream workflows and applications. We need the environment to conform to our policies, and I don’t want my staff burning cycles to ensure that this is the case.” This was the reason why he brought me in to run a proof of concept (POC). The POC would validate what would become a Policy as Code solution based on one of the common IaC products.",
          "link": "https://www.ansible.com/blog/using-red-hat-ansible-automation-platform-to-enable-a-policy-as-code-solution",
          "publishedOn": "2022-07-25T13:00:00.000Z",
          "wordCount": 4244,
          "title": "Using Red Hat Ansible Automation Platform to Enable a Policy as Code Solution",
          "imageUrl": "https://www.ansible.com/hubfs/policy%20as%20code%20blog.png"
        },
        {
          "id": "https://www.ansible.com/blog/whats-new-cloud-automation-with-amazon.aws-4.0.0",
          "author": "Alina Buzachis",
          "description": "This blog post goes through what has changed and highlights what’s new in the 4.0.0 release of this Content Collection.",
          "link": "https://www.ansible.com/blog/whats-new-cloud-automation-with-amazon.aws-4.0.0",
          "publishedOn": "2022-07-20T13:00:00.000Z",
          "wordCount": 3549,
          "title": "What’s New: Cloud Automation with amazon.aws 4.0.0",
          "imageUrl": "https://lh5.googleusercontent.com/3sgpgutiGj064Yzo8lxDjXyRXTRNranAeH2K1hiVuP6b85SL2zuu74dZzGHy8xwQYHJq2aD9uZztnayJ0o_UnhYpFnllFO4WZ6bnHmAyjCBtb_v4pORQoR01D7FntdhA8a5kJIb4YpfPRZkXeIP2Ig"
        }
      ]
    },
    {
      "title": "Azure DevOps Blog",
      "feedUrl": "https://devblogs.microsoft.com/devops/feed/",
      "siteUrl": "https://devblogs.microsoft.com/devops/",
      "articles": [
        {
          "id": "https://devblogs.microsoft.com/devops/?p=65570",
          "author": "Gloridel Morales",
          "description": "Today we’re very excited to announce the first release candidate (RC) of Azure DevOps Server 2022!\nDelivery Plans\nThere are many more features with this release and you can read all about those features in our release notes.\nThe post Introducing Azure DevOps Server 2022 RC1 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/introducing-azure-devops-server-2022-rc1/",
          "publishedOn": "2022-08-09T18:20:01.000Z",
          "wordCount": 4891,
          "title": "Introducing Azure DevOps Server 2022 RC1",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2019/02/index-hero.jpg"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=65582",
          "author": "Gloridel Morales",
          "description": "This month, we are releasing fixes that impact our self-hosted product, Azure DevOps Server.\nFix identity value error while assigning a work item to an identity which appears in different domains.\nAzure DevOps Server 2020.1.2 Patch 2\nThe post August patches for Azure DevOps Server appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/august-patches-for-azure-devops-server-2/",
          "publishedOn": "2022-08-09T16:56:12.000Z",
          "wordCount": 4547,
          "title": "August patches for Azure DevOps Server",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/06/HERO-1.jpg"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=65387",
          "author": "Dan Hellem",
          "description": "Since the March announcement of the New Boards Hub, our team has collected a lot of your feedback. Thank you! We have been hard at work addressing the issues. Every week the experience gets better and better. The issues backlog is getting smaller,\nThe post New Boards Hub, Sprint 208 Update appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/new-boards-hub-sprint-208-update/",
          "publishedOn": "2022-08-02T17:36:54.000Z",
          "wordCount": 4787,
          "title": "New Boards Hub, Sprint 208 Update",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/03/agile.png"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=64636",
          "author": "Dan Hellem",
          "description": "Over these last few months, our team has been working hard at delivering new value in Azure Boards. We would like to take a moment to highlight some of the most recently released features. Be sure to check out the Features Timeline for updates and our product roadmap.\nThe post Azure Boards Summer Update appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azure-boards-summer-update-2/",
          "publishedOn": "2022-07-14T18:21:10.000Z",
          "wordCount": 5893,
          "title": "Azure Boards Summer Update",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/03/agile.png"
        }
      ]
    },
    {
      "title": "Discover Dev",
      "feedUrl": "https://www.discoverdev.io/rss.xml",
      "siteUrl": "http://discoverdev.io",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "http://feeds.feedburner.com/AmazonWebServicesBlog",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "8f6fde13422a7d6f709abd13a6bff48a21025568",
          "author": "Jeff Barr",
          "description": "Back in the mid-1990’s, I had a young family and 5 or 6 PCs in the basement. One day my son Stephen and I bought a single box that contained a bunch of 3COM network cards, a hub, some drivers, and some cables, and spent a pleasant weekend setting up our first home LAN. Introducing […]",
          "link": "https://aws.amazon.com/blogs/aws/new-aws-private-5g-build-your-own-private-mobile-network/",
          "publishedOn": "2022-08-11T22:33:05.000Z",
          "wordCount": 1281,
          "title": "New – AWS Private 5G – Build Your Own Private Mobile Network",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/24/Site-Merch_AWS-Private-5G_Blog.png"
        },
        {
          "id": "895c8f94e7763a3e32f7029ecb7f0e5aefa364af",
          "author": "Veliswa Boya",
          "description": "We are on the fourth year of our annual AWS Storage Day! Do you remember our first Storage Day 2019 and the subsequent Storage Day 2020? I watched Storage Day 2021, which was streamed live from downtown Seattle. We continue to hear from our customers about how powerful the Storage Day announcements and educational sessions […]",
          "link": "https://aws.amazon.com/blogs/aws/welcome-to-aws-storage-day-2022/",
          "publishedOn": "2022-08-10T16:32:21.000Z",
          "wordCount": 2015,
          "title": "Welcome to AWS Storage Day 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/08/10/aws-storage-day-2022.png"
        },
        {
          "id": "5368b5f3eeaf1b269292cf7fe2e8e38eb5b9e360",
          "author": "Steve Roberts",
          "description": "As an ex-.NET developer, and now Developer Advocate for .NET at AWS, I’m excited to bring you this week’s Week in Review post, for reasons that will quickly become apparent! There are several updates, customer stories, and events I want to bring to your attention, so let’s dive straight in! Last Week’s launches .NET developers, […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-august-8-2022/",
          "publishedOn": "2022-08-08T20:36:38.000Z",
          "wordCount": 1726,
          "title": "AWS Week in Review – August 8, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/08/07/AWS-WIR-8.8.22.png"
        },
        {
          "id": "d6058242a768258e28607ce3481412188bae9244",
          "author": "Danilo Poccia",
          "description": "With the Graviton Challenge last year, we helped customers migrate to Graviton-based EC2 instances and get up to 40 percent price performance benefit in as little as 4 days. Tens of thousands of customers, including 48 of the top 50 Amazon Elastic Compute Cloud (Amazon EC2) customers, use AWS Graviton processors for their workloads. In […]",
          "link": "https://aws.amazon.com/blogs/aws/graviton-fast-start-a-new-program-to-help-move-your-workloads-to-aws-graviton/",
          "publishedOn": "2022-08-03T20:49:11.000Z",
          "wordCount": 1401,
          "title": "Graviton Fast Start – A New Program to Help Move Your Workloads to AWS Graviton",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/08/03/Graviton3_featured_2x1.jpg"
        },
        {
          "id": "c9b4d0c62bc0acd424a612d9281c227e53c86a7c",
          "author": "Channy Yun",
          "description": "Today we are announcing the general availability of license-included Visual Studio software on Amazon Elastic Cloud Compute (Amazon EC2) instances. You can now purchase fully compliant AWS-provided licenses of Visual Studio with a per-user subscription fee. Amazon EC2 provides preconfigured Amazon Machine Images (AMIs) of Visual Studio Enterprise 2022 and Visual Studio Professional 2022. You […]",
          "link": "https://aws.amazon.com/blogs/aws/new-run-visual-studio-software-on-amazon-ec2-with-user-based-license-model/",
          "publishedOn": "2022-08-02T23:19:34.000Z",
          "wordCount": 1275,
          "title": "New – Run Visual Studio Software on Amazon EC2 with User-Based License Model",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/07/15/2022-vs-on-ec2-7-1.jpg"
        },
        {
          "id": "aff220b67001fae8fec9dc52e8fe845d58be9d9e",
          "author": "Sébastien Stormacq",
          "description": "Today, I am excited to announce AWS Skill Builder Individual and Team subscriptions. This is a new way for you to learn about cloud technologies and get practical experience with hands-on training. Between 2013 and 2016, I spent three years delivering AWS Training classes to customers in Europe, North America, and Asia. At the time, […]",
          "link": "https://aws.amazon.com/blogs/aws/new-aws-skill-builder-subscriptions/",
          "publishedOn": "2022-08-02T10:23:01.000Z",
          "wordCount": 2061,
          "title": "New – AWS Skill Builder Subscriptions",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/08/01/TC_Subs_Blog_B2I_4b_Image_1600x800-1.jpg"
        },
        {
          "id": "0f24a0fdd5f7ab793f757ad334ae2cdb84629c3b",
          "author": "Jeff Barr",
          "description": "AWS re:Inforce returned to Boston last week, kicking off with a keynote from Amazon Chief Security Officer Steve Schmidt and AWS Chief Information Security officer C.J. Moses: Be sure to take some time to watch this video and the other leadership sessions, and to use what you learn to take some proactive steps to improve […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-august-1-2022/",
          "publishedOn": "2022-08-01T19:30:57.000Z",
          "wordCount": 1861,
          "title": "AWS Week in Review – August 1, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/08/01/AWS-WIR-8.1.22.png"
        },
        {
          "id": "9bec03501b8ca4c7c824bf930c12e92ad2e6bc59",
          "author": "Danilo Poccia",
          "description": "IPv6 adoption has consistently increased over the last few years, especially among mobile networks. The main reasons to move to IPv6 are: The limited availability of IPv4 addresses can limit the ability to scale up public-facing web and applications servers. IPv6 users from mobile networks experience better performance when their network traffic doesn’t need to […]",
          "link": "https://aws.amazon.com/blogs/aws/new-for-aws-global-accelerator-internet-protocol-version-6-ipv6-support/",
          "publishedOn": "2022-07-27T18:05:22.000Z",
          "wordCount": 2004,
          "title": "New for AWS Global Accelerator – Internet Protocol Version 6 (IPv6) Support",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/03/08/aws-global-accelerator-ipv6-dual-stack-1260x540.png"
        },
        {
          "id": "228b9e3ad02e93f0f9bad62933e4749660f6d29e",
          "author": "Jeff Barr",
          "description": "When I first started to talk about AWS in front of IT professionals, they would always listen intently and ask great questions. Invariably, a seasoned pro would raise there hand and ask “This all sounds great, but have you thought about security?” Of course we had, and for a while I would describe our principal […]",
          "link": "https://aws.amazon.com/blogs/aws/fortinet-forticnp-now-available-in-aws-marketplace/",
          "publishedOn": "2022-07-27T13:20:59.000Z",
          "wordCount": 1435,
          "title": "Fortinet FortiCNP – Now Available in AWS Marketplace",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/07/27/forticnp.png"
        },
        {
          "id": "2ea8dcba424be2adb64f4bd1b985f6e4e93d2055",
          "author": "Danilo Poccia",
          "description": "August 1st, 2022: Post updated to clarify how GuardDuty Malware Protection works with KMS keys. With Amazon GuardDuty, you can monitor your AWS accounts and workloads to detect malicious activity. Today, we are adding to GuardDuty the capability to detect malware. Malware is malicious software that is used to compromise workloads, repurpose resources, or gain […]",
          "link": "https://aws.amazon.com/blogs/aws/new-for-amazon-guardduty-malware-detection-for-amazon-ebs-volumes/",
          "publishedOn": "2022-07-26T14:10:24.000Z",
          "wordCount": 3418,
          "title": "New for Amazon GuardDuty – Malware Protection for Amazon EBS Volumes",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/05/20/guardduty-malware-protection-finding-ecs-1073x630.png"
        },
        {
          "id": "6277ac078919bdf2ef27a28e6d7e8244d9993147",
          "author": "Channy Yun",
          "description": "In March 2020, we introduced Amazon Detective, a fully managed service that makes it easy to analyze, investigate, and quickly identify the root cause of potential security issues or suspicious activities. Amazon Detective continuously extracts temporal events such as login attempts, API calls, and network traffic from Amazon GuardDuty, AWS CloudTrail, and Amazon Virtual Private Cloud (Amazon VPC) […]",
          "link": "https://aws.amazon.com/blogs/aws/amazon-detective-supports-kubernetes-workloads-on-amazon-eks-for-security-investigations/",
          "publishedOn": "2022-07-26T14:09:42.000Z",
          "wordCount": 1632,
          "title": "Amazon Detective Supports Kubernetes Workloads on Amazon EKS for Security Investigations",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/06/20/Site-Merch_Amazon-Detective_Blog.jpeg"
        },
        {
          "id": "68fcf959f2f14ba13ce1cef8a22f31dccb956bd7",
          "author": "Antje Barth",
          "description": "A few weeks ago, we hosted the first EMEA AWS Heroes Summit in Milan, Italy. This past week, I had the privilege to join the Americas AWS Heroes Summit in Seattle, Washington, USA. Meeting with our community experts is always inspiring and a great opportunity to learn from each other. During the Summit, AWS Heroes […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-july-25-2022/",
          "publishedOn": "2022-07-25T16:38:15.000Z",
          "wordCount": 1822,
          "title": "AWS Week In Review – July 25, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/07/25/AWS-WIR-7.25.22.png"
        },
        {
          "id": "98646721b4ebacd2a86061013ed5679a8d425663",
          "author": "Jeff Barr",
          "description": "As part of my annual tradition to tell you about how AWS makes Prime Day possible, I am happy to be able to share some chart-topping metrics (check out my 2016, 2017, 2019, 2020, and 2021 posts for a look back). My purchases this year included a first aid kit, some wood brown filament for […]",
          "link": "https://aws.amazon.com/blogs/aws/amazon-prime-day-2022-aws-for-the-win/",
          "publishedOn": "2022-07-25T14:34:24.000Z",
          "wordCount": 1240,
          "title": "Amazon Prime Day 2022 – AWS for the Win!",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/07/25/prime_day_logo_1.png"
        },
        {
          "id": "d05b293512d0481393cd06a097706cb42601bfa4",
          "author": "Jeff Barr",
          "description": "I have been a fan of space travel and the US space program since I was 4 or 5 years old. I remember reading about the Mercury and Gemini programs, and watched with excitement as Lunar Module Eagle landed on the Moon. Today, with the cost to reach Low Earth Orbit (LEO) seemingly declining with […]",
          "link": "https://aws.amazon.com/blogs/aws/how-we-sent-an-aws-snowcone-into-orbit/",
          "publishedOn": "2022-07-21T18:45:55.000Z",
          "wordCount": 1508,
          "title": "How We Sent an AWS Snowcone into Orbit",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/07/08/snowcone_iss_2.jpg"
        },
        {
          "id": "644f029ceb1ef3d47149b3db6e5a0d485f62f874",
          "author": "Channy Yun",
          "description": "We launched the general-purpose Amazon EC2 M6a instances at AWS re:Invent 2021 and compute-intensive C6a instances in February of this year. These instances are powered by the 3rd Gen AMD EPYC processors running at frequencies up to 3.6 GHz to offer up to 35 percent better price performance versus the previous generation instances. Today, we […]",
          "link": "https://aws.amazon.com/blogs/aws/new-amazon-ec2-r6a-instances-powered-by-3rd-gen-amd-epyc-processors-for-memory-intensive-workloads/",
          "publishedOn": "2022-07-19T22:20:17.000Z",
          "wordCount": 1044,
          "title": "New – Amazon EC2 R6a Instances Powered by 3rd Gen AMD EPYC Processors for Memory-Intensive Workloads",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/06/02/AWS-R6a-EC2-Instance-Graphic-600x338-1.jpeg"
        },
        {
          "id": "0d85312f4833bb666f3613acb995ab332f610620",
          "author": "Channy Yun",
          "description": "Last week, AWS Summit New York was held in person at the Javits Center with thousands of attendees and over 100 sponsors and partners. During the keynote, Martin Beeby, AWS Principal Developer Advocate, talked about how innovations in cloud infrastructure enable customers to adapt to challenges and seize new opportunities. It included Liz Fong-Jones‘s great […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-july-18-2022/",
          "publishedOn": "2022-07-18T17:02:40.000Z",
          "wordCount": 1845,
          "title": "AWS Week In Review – July 18, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/07/15/AWS-WIR-7.18.22.png"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/atom.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2657/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/complex_vowels.png\" title=\"Pronouncing [ṡṡċċḣḣẇẇȧȧ] is easy; you just say it like the 'x' in 'fire'.\" alt=\"Pronouncing [ṡṡċċḣḣẇẇȧȧ] is easy; you just say it like the 'x' in 'fire'.\" />",
          "link": "https://xkcd.com/2657/",
          "publishedOn": "2022-08-10T00:00:00.000Z",
          "wordCount": 232,
          "title": "Complex Vowels",
          "imageUrl": "https://imgs.xkcd.com/comics/complex_vowels_2x.png"
        },
        {
          "id": "https://xkcd.com/2656/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/scientific_field_prefixes.png\" title=\"Massage: Theoretical (10), Quantum (6), High-energy (2), Computational (1), Marine (1), Astro- (None)\" alt=\"Massage: Theoretical (10), Quantum (6), High-energy (2), Computational (1), Marine (1), Astro- (None)\" />",
          "link": "https://xkcd.com/2656/",
          "publishedOn": "2022-08-08T00:00:00.000Z",
          "wordCount": 234,
          "title": "Scientific Field Prefixes",
          "imageUrl": "https://imgs.xkcd.com/comics/scientific_field_prefixes_2x.png"
        },
        {
          "id": "https://xkcd.com/2655/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/asking_scientists_questions.png\" title=\"'Does the substance feel weird to the touch?' is equally likely to get the answers 'Don't be ridiculous, you would never put your hand near a sample. We have safety protocols.' and 'Yeah, and it tastes AWFUL.'\" alt=\"'Does the substance feel weird to the touch?' is equally likely to get the answers 'Don't be ridiculous, you would never put your hand near a sample. We have safety protocols.' and 'Yeah, and it tastes AWFUL.'\" />",
          "link": "https://xkcd.com/2655/",
          "publishedOn": "2022-08-05T00:00:00.000Z",
          "wordCount": 234,
          "title": "Asking Scientists Questions",
          "imageUrl": "https://imgs.xkcd.com/comics/asking_scientists_questions_2x.png"
        },
        {
          "id": "https://xkcd.com/2654/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/chemtrails.png\" title=\"Ants have reverse chemtrails--regular citizens spraying chemicals everywhere they go to control the government.\" alt=\"Ants have reverse chemtrails--regular citizens spraying chemicals everywhere they go to control the government.\" />",
          "link": "https://xkcd.com/2654/",
          "publishedOn": "2022-08-03T00:00:00.000Z",
          "wordCount": 230,
          "title": "Chemtrails",
          "imageUrl": "https://imgs.xkcd.com/comics/chemtrails_2x.png"
        }
      ]
    },
    {
      "title": "Camunda",
      "feedUrl": "https://camunda.com/feed/",
      "siteUrl": "https://camunda.com/",
      "articles": [
        {
          "id": "https://camunda.com/?p=60009",
          "author": "Anna Schroth",
          "description": "In this blog series, we highlight the customers who have chosen to utilize Camunda Platform 8 and explore the challenges those companies are attempting to overcome using process orchestration. For the latest installment of Why Camunda 8, we spoke with R-KOM, a telecommunications company based in Regensburg, Germany. When R-KOM was founded in 1997, its shareholders pooled their telecommunications infrastructure, which had evolved over decades with utility networks for water, electricity, and gas. Initially, R-KOM’s services were limited to business and the public sector, but now it has developed further in line with demand. Over the years, the company’s high-performance infrastructure and a broad range of products have grown. Today, R-KOM has a number of city networks in Eastern Bavaria...\nThe post Why R-KOM Chose Camunda Platform 8 appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/08/why-r-kom-chose-camunda-platform-8/",
          "publishedOn": "2022-08-10T12:30:00.000Z",
          "wordCount": 3057,
          "title": "Why R-KOM Chose Camunda Platform 8",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/07/Official-Slide-Template-Camunda-2022_1200x627-3.jpg"
        },
        {
          "id": "https://camunda.com/?p=59448",
          "author": "Camunda Platform Team",
          "description": "We are pleased to announce the next alpha release of Camunda Platform Runtime 7.18. This release features the following improvements: Support for H2 2.1 Traditional Chinese translations are available Improved status monitoring of batch jobs Improved safety of executing a batch operation on the Batch Operation page 8 Bug Fixes You can download Camunda for free or run it with Docker. For a complete list of all improvements, take a look at the release notes. Please also see the list of known issues. If you want to dig in deeper, you can find the source code on GitHub. Support for H2 2.1 This release adds support for the H2 database in version 2.1, which provides fixes for vulnerabilities. Enterprise customers...\nThe post Camunda Automation Platform 7.18.0-alpha4 Released appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/08/camunda-automation-platform-7180-alpha4-released/",
          "publishedOn": "2022-08-09T10:02:00.000Z",
          "wordCount": 2567,
          "title": "Camunda Automation Platform 7.18.0-alpha4 Released",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/08/Screen-Shot-2022-08-08-at-10.17.48-PM.png"
        },
        {
          "id": "https://camunda.com/?p=59822",
          "author": "Camunda Optimize Team",
          "description": "We’re excited to announce a new release of Camunda Optimize. Camunda Optimize provides business activity monitoring for workflows, supporting continuous process improvement by providing transparency into your automated workflows and decisions. Business-friendly reports, dashboards, and alerts make it possible to identify process bottlenecks, improve end-to-end processes, and evaluate the success of your process automation initiative. In the rest of this post, we’ll highlight some of the new capabilities introduced in Optimize 3.9.0 alpha3. What’s new? Ease of adding new reports to dashboard Reports are added to dashboards to design an individual overview of the performance of your processes. Adding reports to dashboards was already possible with previous versions of Optimize, but now we’ve reduced the number of steps to do...\nThe post Camunda Optimize 3.9.0 alpha3 Released appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/08/camunda-optimize-3-9-0-alpha3-released/",
          "publishedOn": "2022-08-09T10:00:00.000Z",
          "wordCount": 2373,
          "title": "Camunda Optimize 3.9.0 alpha3 Released",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/08/Screen-Shot-2022-08-08-at-11.13.34-AM.png"
        },
        {
          "id": "https://camunda.com/?p=59035",
          "author": "Bernd Ruecker",
          "description": "Learn what a connector is made of, how the code for a connector roughly looks, and how connectors can be operated in various scenarios. Since this is a preview, details are subject to change.\nThe post A Technical Sneak Peek into Camunda’s Connector Architecture appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/07/a-technical-sneak-peek-into-camundas-connector-architecture/",
          "publishedOn": "2022-07-28T16:00:00.000Z",
          "wordCount": 3682,
          "title": "A Technical Sneak Peek into Camunda’s Connector Architecture",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/07/Camunda_Blog_2022-07JUL_Bernd-Technical-Sneak-Peek-Connectors_1200x627-v3.png"
        },
        {
          "id": "https://camunda.com/?p=58811",
          "author": "Bernd Ruecker",
          "description": "Life is seldom a straight line, and the same is true for processes. Therefore, you must be able to accurately express all the things happening in your business processes for proper end-to-end process orchestration. This requires workflow patterns that go beyond basic control flow patterns (like sequence or condition). If your orchestration tool does not provide those advanced workflow patterns, you will experience confusion amongst developers, you will need to implement time-consuming workarounds, and you will end up with confusing models. Let’s explore this by examining an example of why these advanced workflow patterns matter in today’s blog post. Initial process example Let’s assume you’re processing incoming orders of hand-crafted goods to be shipped individually. Each order consists of many...\nThe post Why Process Orchestration Needs Advanced Workflow Patterns appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/07/why-process-orchestration-needs-advanced-workflow-patterns/",
          "publishedOn": "2022-07-21T12:00:00.000Z",
          "wordCount": 3314,
          "title": "Why Process Orchestration Needs Advanced Workflow Patterns",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/07/2022_July_Camunda_Blog_Why-Process-Orchestration-Needs-Advanced-Workflow-Patterns.png"
        }
      ]
    },
    {
      "title": "となりのヤングジャンプ（ワンパンマン）",
      "feedUrl": "https://tonarinoyj.jp/rss/series/13932016480028984490",
      "siteUrl": "https://tonarinoyj.jp/episode/13932016480028985383",
      "articles": [
        {
          "id": "tonarino_yj:episode:3270375685396151729",
          "author": "原作/ＯＮＥ/漫画/村田雄介",
          "description": "ワンパンマン",
          "link": "https://tonarinoyj.jp/episode/3270375685396151729",
          "publishedOn": "2022-08-03T15:00:00.000Z",
          "wordCount": 206,
          "title": "[第214話] ワンパンマン",
          "enclosure": {
            "url": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/3270375685396151729-572af0ebde1242b7d768510aeeb84274",
            "length": "0",
            "type": "image/jpeg"
          },
          "imageUrl": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/3270375685396151729-572af0ebde1242b7d768510aeeb84274"
        },
        {
          "id": "tonarino_yj:episode:3270375685361384268",
          "author": "原作/ＯＮＥ/漫画/村田雄介",
          "description": "ワンパンマン",
          "link": "https://tonarinoyj.jp/episode/3270375685361384268",
          "publishedOn": "2022-07-20T15:00:00.000Z",
          "wordCount": 206,
          "title": "[第213話] ワンパンマン",
          "enclosure": {
            "url": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/3270375685361384268-fe03d22aa36dce033003d0035de24d5b",
            "length": "0",
            "type": "image/jpeg"
          },
          "imageUrl": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/3270375685361384268-fe03d22aa36dce033003d0035de24d5b"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.com/blog/all.atom",
      "siteUrl": "https://github.blog",
      "articles": [
        {
          "id": "https://github.blog/2022-08-10-github-pages-now-uses-actions-by-default/",
          "author": null,
          "description": "As GitHub Pages, home to 16 million websites, approaches its 15th anniversary, we’re excited to announce that all sites now build and deploy with GitHub Actions.",
          "link": "https://github.blog/2022-08-10-github-pages-now-uses-actions-by-default/",
          "publishedOn": "2022-08-10T16:00:29.000Z",
          "wordCount": 1630,
          "title": "GitHub Pages now uses Actions by default",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/06/Engineering-Product@2x.png?fit=2400%2C1260"
        },
        {
          "id": "https://github.blog/2022-08-09-dependabot-now-alerts-for-vulnerable-github-actions/",
          "author": null,
          "description": "GitHub Actions gives teams access to powerful, native CI/CD capabilities right next to their code hosted in GitHub. Starting today, GitHub will send a Dependabot alert for vulnerable GitHub Actions, making it even easier to stay up to date and fix security vulnerabilities in your actions workflows.",
          "link": "https://github.blog/2022-08-09-dependabot-now-alerts-for-vulnerable-github-actions/",
          "publishedOn": "2022-08-09T15:00:27.000Z",
          "wordCount": 1503,
          "title": "Dependabot now alerts for vulnerable GitHub Actions",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/05/Security-Product@2x.png"
        },
        {
          "id": "https://github.blog/2022-08-08-new-request-for-comments-on-improving-npm-security-with-sigstore-is-now-open/",
          "author": null,
          "description": "Supply chain attacks exploit our implicit trust of open source to hurt developers and our customers. Read our proposal for how npm will significantly reduce supply chain attacks by signing packages with Sigstore.",
          "link": "https://github.blog/2022-08-08-new-request-for-comments-on-improving-npm-security-with-sigstore-is-now-open/",
          "publishedOn": "2022-08-08T16:22:23.000Z",
          "wordCount": 1323,
          "title": "New request for comments on improving npm security with Sigstore is now open",
          "imageUrl": "https://github.blog/wp-content/uploads/2021/02/npm-github.png"
        },
        {
          "id": "https://github.blog/2022-08-08-all-github-enterprise-users-now-have-access-to-the-security-overview/",
          "author": null,
          "description": "Today, we’re expanding access to the GitHub security overview! All GitHub Enterprise customers now have access to the security overview, not just those with GitHub Advanced Security. Additionally, all users within an enterprise can now access the security overview, not just admins and security managers.",
          "link": "https://github.blog/2022-08-08-all-github-enterprise-users-now-have-access-to-the-security-overview/",
          "publishedOn": "2022-08-08T15:00:11.000Z",
          "wordCount": 1524,
          "title": "All GitHub Enterprise users now have access to the security overview",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/06/Security-Product@2x.png"
        },
        {
          "id": "https://github.blog/2022-08-05-release-radar-jul-2022/",
          "author": null,
          "description": "While some of us have been wrapping up the financial year, and enjoying vacation time, others have been hard at work shipping open source projects and releases. These projects include everything from world-changing technology to developer tooling, and weekend hobbies. Here are some of the open source projects that released major version updates this July. [&#8230;]",
          "link": "https://github.blog/2022-08-05-release-radar-jul-2022/",
          "publishedOn": "2022-08-05T17:00:38.000Z",
          "wordCount": 1851,
          "title": "Release Radar · July 2022 Edition",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/08/Release-Radar-July.jpg?fit=1200%2C630"
        },
        {
          "id": "https://github.blog/2022-08-04-5-simple-things-you-can-do-with-github-packages-to-level-up-your-workflows/",
          "author": null,
          "description": "From hosting private packages in a private repository to tightening your security profile with GITHUB_TOKEN, here are five simple ways you can streamline your workflow with GitHub Packages.",
          "link": "https://github.blog/2022-08-04-5-simple-things-you-can-do-with-github-packages-to-level-up-your-workflows/",
          "publishedOn": "2022-08-04T16:00:08.000Z",
          "wordCount": 2090,
          "title": "5 simple things you can do with GitHub Packages to level up your workflows",
          "imageUrl": "https://github.blog/wp-content/uploads/2021/12/Product-Engineering-Scurity.png"
        },
        {
          "id": "https://github.blog/2022-08-03-github-availability-report-july-2022/",
          "author": null,
          "description": "In July, we experienced one incident that resulted in degraded performance for Codespaces. This report also acknowledges two incidents that impacted multiple GitHub.com services in June.",
          "link": "https://github.blog/2022-08-03-github-availability-report-july-2022/",
          "publishedOn": "2022-08-03T16:00:30.000Z",
          "wordCount": 1399,
          "title": "GitHub Availability Report: July 2022",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/03/Engineering@2x.png?fit=2400%2C1260"
        },
        {
          "id": "https://github.blog/2022-08-02-streamline-virtual-hackathon-events-with-the-new-hackathon-in-the-cloud-experience/",
          "author": null,
          "description": "Attention all students! Make managing your virtual hackathon events even easier with the new Hackathon in the Cloud Experience.",
          "link": "https://github.blog/2022-08-02-streamline-virtual-hackathon-events-with-the-new-hackathon-in-the-cloud-experience/",
          "publishedOn": "2022-08-02T13:00:52.000Z",
          "wordCount": 1033,
          "title": "Streamline virtual hackathon events with the new Hackathon in the Cloud Experience",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/08/hackathon1-2.png"
        },
        {
          "id": "https://github.blog/2022-07-28-marketing-for-maintainers-how-to-promote-your-project-to-both-users-and-contributors/",
          "author": null,
          "description": "Marketing your open source project can be intimidating, but three experts share their insider tips and tricks for how to get your hard work on the right people’s radars.",
          "link": "https://github.blog/2022-07-28-marketing-for-maintainers-how-to-promote-your-project-to-both-users-and-contributors/",
          "publishedOn": "2022-07-28T17:00:14.000Z",
          "wordCount": 3599,
          "title": "Marketing for maintainers: Promote your project to users and contributors",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/04/Engineering-Security.png?fit=1200%2C630"
        },
        {
          "id": "https://github.blog/2022-07-28-github-sponsors-available-in-30-new-regions-2/",
          "author": null,
          "description": "GitHub Sponsors expands globally with 30 newly supported regions, bringing the total to 68.",
          "link": "https://github.blog/2022-07-28-github-sponsors-available-in-30-new-regions-2/",
          "publishedOn": "2022-07-28T13:00:07.000Z",
          "wordCount": 1721,
          "title": "GitHub Sponsors available in 30 new regions",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/07/image1-1.png"
        }
      ]
    },
    {
      "title": "Martin Kleppmann's blog",
      "feedUrl": "https://feeds.feedburner.com/martinkl",
      "siteUrl": "http://martin.kleppmann.com/",
      "articles": []
    },
    {
      "title": "Kubernetes – Production-Grade Container Orchestration",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": [
        {
          "id": "https://kubernetes.io/blog/2022/08/11/enhancing-kubernetes-one-kep-at-a-time/",
          "author": null,
          "description": "Author: Ryler Hockenbury (Mastercard)\nDid you know that Kubernetes v1.24 has 46 enhancements? That's a lot of new functionality packed into a 4-month release cycle. The Kubernetes release team coordinates the logistics of the release, from remediating test flakes to publishing updated docs. It's a ton of work, but they always deliver.\nThe release team comprises around 30 people across six subteams - Bug Triage, CI Signal, Enhancements, Release Notes, Communications, and Docs.  Each of these subteams manages a component of the release. This post will focus on the role of the enhancements subteam and how you can get involved.\nWhat's the enhancements subteam?\nGreat question. We'll get to that in a second but first, let's talk about how features are managed in Kubernetes.\nEach new feature requ…",
          "link": "https://kubernetes.io/blog/2022/08/11/enhancing-kubernetes-one-kep-at-a-time/",
          "publishedOn": "2022-08-11T00:00:00.000Z",
          "wordCount": 3743,
          "title": "Blog: Enhancing Kubernetes one KEP at a Time",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/08/04/upcoming-changes-in-kubernetes-1-25/",
          "author": null,
          "description": "Authors: Kat Cosgrove, Frederico Muñoz, Debabrata Panigrahi\nAs Kubernetes grows and matures, features may be deprecated, removed, or replaced with improvements for the health of the project. Kubernetes v1.25 includes several major changes and one major removal.\nThe Kubernetes API Removal and Deprecation process\nThe Kubernetes project has a well-documented deprecation policy for features. This policy states that stable APIs may only be deprecated when a newer, stable version of that same API is available and that APIs have a minimum lifetime for each stability level. A deprecated API is one that has been marked for removal in a future Kubernetes release; it will continue to function until removal (at least one year from the deprecation), but usage will result in a warning being displayed. R…",
          "link": "https://kubernetes.io/blog/2022/08/04/upcoming-changes-in-kubernetes-1-25/",
          "publishedOn": "2022-08-04T00:00:00.000Z",
          "wordCount": 3526,
          "title": "Blog: Kubernetes Removals and Major Changes In 1.25",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/08/02/sig-docs-spotlight-2022/",
          "author": null,
          "description": "Author: Purneswar Prasad\nIntroduction\nThe official documentation is the go-to source for any open source project. For Kubernetes,\nit's an ever-evolving Special Interest Group (SIG) with people constantly putting in their efforts\nto make details about the project easier to consume for new contributors and users. SIG Docs publishes\nthe official documentation on kubernetes.io which includes,\nbut is not limited to, documentation of the core APIs, core architectural details, and CLI tools\nshipped with the Kubernetes release.\nTo learn more about the work of SIG Docs and its future ahead in shaping the community, I have summarised\nmy conversation with the co-chairs, Divya Mohan (DM),\nRey Lejano (RL) and Natali Vlatko (NV), who ran through the\nSIG's goals and how fellow contributors can help.\nA su…",
          "link": "https://kubernetes.io/blog/2022/08/02/sig-docs-spotlight-2022/",
          "publishedOn": "2022-08-02T00:00:00.000Z",
          "wordCount": 4027,
          "title": "Blog: Spotlight on SIG Docs",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "http://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/aab780b2f8c8",
          "author": "Netflix Technology Blog",
          "description": "The use of virtual production and real time technologies in film & tv has accelerated in recent years. Game engines, such as Unreal Engine, have been a major part driving the democratization of advanced in-camera visual effects (ICVFX). But with infinite configuration and setting combinations, how can a production get it right?",
          "link": "https://netflixtechblog.com/virtual-production-a-validation-framework-for-unreal-engine-aab780b2f8c8?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-08-10T14:03:05.000Z",
          "wordCount": 5030,
          "title": "Virtual Production — A Validation Framework For Unreal Engine",
          "imageUrl": "https://miro.medium.com/max/1200/1*SVx5wVsCT4NnHixscIOaEw.png"
        },
        {
          "id": "https://medium.com/p/1288bcab2873",
          "author": "Netflix Technology Blog",
          "description": "By Bo Lei, Guilherme Pires, James Shao, Kasturi Chatterjee, Sujay Jain, Vlad Sydorenko",
          "link": "https://netflixtechblog.com/data-mesh-a-data-movement-and-processing-platform-netflix-1288bcab2873?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-08-01T18:20:37.000Z",
          "wordCount": 4285,
          "title": "Data Mesh — A Data Movement and Processing Platform @ Netflix",
          "imageUrl": "https://miro.medium.com/max/1200/0*-gA7_aFh4okv6Qp9"
        },
        {
          "id": "https://medium.com/p/989599029109",
          "author": "Netflix Technology Blog",
          "description": "by Aryan Mehra,  with Farnaz Karimdady Sharifabad, Prasanna Vijayanathan, Chaïna Wade, Vishal Sharma and Mike Schassberger",
          "link": "https://netflixtechblog.com/formulating-out-of-memory-kill-prediction-on-the-netflix-app-as-a-machine-learning-problem-989599029109?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-07-21T21:16:36.000Z",
          "wordCount": 5349,
          "title": "Formulating ‘Out of Memory Kill’ Prediction on the Netflix App as a Machine Learning Problem",
          "imageUrl": "https://miro.medium.com/max/1200/1*gSa6QOZtpuQ8pN7MdvGFrA.png"
        }
      ]
    },
    {
      "title": "Google AI Blog",
      "feedUrl": "http://feeds.feedburner.com/blogspot/gJZg",
      "siteUrl": "http://ai.googleblog.com/",
      "articles": [
        {
          "id": "http://ai.googleblog.com/2022/08/rax-composable-learning-to-rank-using.html",
          "author": null,
          "description": "Posted by Rolf Jagerman and Honglei Zhuang, Software Engineers, Google Research \nRanking is a core problem across a variety of domains, such as search engines, recommendation systems, or question answering. As such, researchers often utilize learning-to-rank (LTR), a set of supervised machine learning techniques that optimize for the utility of an entire list of items (rather than a single item at a time). A noticeable recent focus is on combining LTR with deep learning. Existing libraries, most notably TF-Ranking, offer researchers and practitioners the necessary tools to use LTR in their work. However, none of the existing LTR libraries work natively with JAX, a new machine learning framework that provides an extensible system of function transformations that compose: automatic different…",
          "link": "http://ai.googleblog.com/2022/08/rax-composable-learning-to-rank-using.html",
          "publishedOn": "2022-08-11T18:22:00.000Z",
          "wordCount": 6978,
          "title": "Rax: Composable Learning-to-Rank Using JAX",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/08/efficient-video-text-learning-with.html",
          "author": null,
          "description": "Posted by AJ Piergiovanni and Anelia Angelova, Research Scientists, Google Research, Brain Team \nVideo is an ubiquitous source of media content that touches on many aspects of people’s day-to-day lives. Increasingly, real-world video applications, such as video captioning, video content analysis, and video question-answering (VideoQA), rely on models that can connect video content with text or natural language. VideoQA is particularly challenging, however, as it requires grasping both semantic information, such as objects in a scene, as well as temporal information, e.g., how things move and interact, both of which must be taken in the context of a natural-language question that holds specific intent. In addition, because videos have many frames, processing all of them to learn spatio-temp…",
          "link": "http://ai.googleblog.com/2022/08/efficient-video-text-learning-with.html",
          "publishedOn": "2022-08-09T17:49:00.000Z",
          "wordCount": 6958,
          "title": "Efficient Video-Text Learning with Iterative Co-tokenization",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/08/introducing-google-universal-image.html",
          "author": null,
          "description": "Posted by Bingyi Cao, Software Engineer, Google Research, and Mário Lipovský, Software Engineer, Google Lens \nComputer vision models see daily application for a wide variety of tasks, ranging from object recognition to image-based 3D object reconstruction. One challenging type of computer vision problem is instance-level recognition (ILR) — given an image of an object, the task is to not only determine the generic category of an object (e.g., an arch), but also the specific instance of the object (”Arc de Triomphe de l'Étoile, Paris, France”).  \nPreviously, ILR was tackled using deep learning approaches. First, a large set of images was collected. Then a deep model was trained to embed each image into a high-dimensional space where similar images have similar representations. Finally, the …",
          "link": "http://ai.googleblog.com/2022/08/introducing-google-universal-image.html",
          "publishedOn": "2022-08-04T17:47:00.002Z",
          "wordCount": 7560,
          "title": "Introducing the Google Universal Image Embedding Challenge",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/08/building-efficient-multiple-visual.html",
          "author": null,
          "description": "Posted by Qifei Wang, Senior Software Engineer, and Feng Yang, Senior Staff Software Engineer, Google Research \nDeep learning models for visual tasks (e.g., image classification) are usually trained end-to-end with data from a single visual domain (e.g., natural images or computer generated images). Typically, an application that completes visual tasks for multiple domains would need to build multiple models for each individual domain, train them independently (meaning no data is shared between domains), and then at inference time each model would process domain-specific input data. However, early layers between these models generate similar features, even for different domains, so it can be more efficient — decreasing latency and power consumption, lower memory overhead to store parameter…",
          "link": "http://ai.googleblog.com/2022/08/building-efficient-multiple-visual.html",
          "publishedOn": "2022-08-03T19:57:00.001Z",
          "wordCount": 7815,
          "title": "Building Efficient Multiple Visual Domain Models with Multi-path Neural Architecture Search",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/08/efficient-sequence-modeling-for-on.html",
          "author": null,
          "description": "Posted by Arun Kandoor, Software Engineer, Google Research  \nThe increasing demand for machine learning (ML) model inference on-device (for mobile devices, tablets, etc.) is driven by the rise of compute-intensive applications, the need to keep certain data on device for privacy and security reasons, and the desire to provide services when a network connection may not be available. However, on-device inference introduces a myriad of challenges, ranging from modeling to platform support requirements. These challenges relate to how different architectures are designed to optimize memory and computation, while still trying to maintain the quality of the model. From a platform perspective, the issue is identifying operations and building on top of them in a way that can generalize well across …",
          "link": "http://ai.googleblog.com/2022/08/efficient-sequence-modeling-for-on.html",
          "publishedOn": "2022-08-03T17:00:00.000Z",
          "wordCount": 7040,
          "title": "Efficient Sequence Modeling for On-Device ML",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/07/enhancing-backpropagation-via-local.html",
          "author": null,
          "description": "Posted by Ehsan Amid, Research Scientist, and Rohan Anil, Principal Engineer, Google Research, Brain Team \nWhile model design and training data are key ingredients in a deep neural network’s (DNN’s) success, less-often discussed is the specific optimization method used for updating the model parameters (weights). Training DNNs involves minimizing a loss function that measures the discrepancy between the ground truth labels and the model’s predictions. Training is carried out by backpropagation, which adjusts the model weights via gradient descent steps. Gradient descent, in turn, updates the weights by using the gradient (i.e., derivative) of the loss with respect to the weights. \nThe simplest weight update corresponds to stochastic gradient descent, which, in every step, moves the weights…",
          "link": "http://ai.googleblog.com/2022/07/enhancing-backpropagation-via-local.html",
          "publishedOn": "2022-07-29T17:02:00.005Z",
          "wordCount": 7089,
          "title": "Enhancing Backpropagation via Local Loss Optimization",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/07/look-and-talk-natural-conversations.html",
          "author": null,
          "description": "Posted by Tuan Anh Nguyen, Staff Software Engineer, Google Assistant, and Sourish Chaudhuri, Staff Software Engineer, Google Research \nIn natural conversations, we don't say people's names every time we speak to each other. Instead, we rely on contextual signaling mechanisms to initiate conversations, and eye contact is often all it takes. Google Assistant, now available in more than 95 countries and over 29 languages, has primarily relied on a hotword mechanism (\"Hey Google\" or “OK Google”) to help more than 700 million people every month get things done across Assistant devices. As virtual assistants become an integral part of our everyday lives, we're developing ways to initiate conversations more naturally. \nAt Google I/O 2022, we announced Look and Talk, a major development in our jou…",
          "link": "http://ai.googleblog.com/2022/07/look-and-talk-natural-conversations.html",
          "publishedOn": "2022-07-27T18:34:00.004Z",
          "wordCount": 7803,
          "title": "Look and Talk: Natural Conversations with Google Assistant",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/07/ml-enhanced-code-completion-improves.html",
          "author": null,
          "description": "Posted by Maxim Tabachnyk, Staff Software Engineer and Stoyan Nikolov, Senior Engineering Manager, Google Research \nThe increasing complexity of code poses a key challenge to productivity in software engineering. Code completion has been an essential tool that has helped mitigate this complexity in integrated development environments (IDEs). Conventionally, code completion suggestions are implemented with rule-based semantic engines (SEs), which typically have access to the full repository and understand its semantic structure. Recent research has demonstrated that large language models (e.g., Codex and PaLM) enable longer and more complex code suggestions, and as a result, useful products have emerged (e.g., Copilot). However, the question of how code completion powered by machine learnin…",
          "link": "http://ai.googleblog.com/2022/07/ml-enhanced-code-completion-improves.html",
          "publishedOn": "2022-07-26T20:59:00.001Z",
          "wordCount": 7611,
          "title": "ML-Enhanced Code Completion Improves Developer Productivity",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/07/training-generalist-agents-with-multi.html",
          "author": null,
          "description": "Posted by Winnie Xu, Student Researcher and Kuang-Huei Lee, Software Engineer, Google Research, Brain Team \nCurrent deep reinforcement learning (RL) methods can train specialist artificial agents that excel at decision-making on various individual tasks in specific environments, such as Go or StarCraft. However, little progress has been made to extend these results to generalist agents that would not only be capable of performing many different tasks, but also upon a variety of environments with potentially distinct embodiments. \nLooking across recent progress in the fields of natural language processing, vision, and generative models (such as PaLM, Imagen, and Flamingo), we see that breakthroughs in making general-purpose models are often achieved by scaling up Transformer-based models an…",
          "link": "http://ai.googleblog.com/2022/07/training-generalist-agents-with-multi.html",
          "publishedOn": "2022-07-21T22:17:00.002Z",
          "wordCount": 7597,
          "title": "Training Generalist Agents with Multi-Game Decision Transformers",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/07/simplified-transfer-learning-for-chest.html",
          "author": null,
          "description": "Posted by Akib Uddin, Product Manager and Andrew Sellergren, Software Engineer, Google Health \nEvery year, nearly a billion chest X-ray (CXR) images are taken globally to aid in the detection and management of health conditions ranging from collapsed lungs to infectious diseases. Generally, CXRs are cheaper and more accessible than other forms of medical imaging. However, existing challenges continue to impede the optimal use of CXRs. For example, in some areas, trained radiologists that can accurately interpret CXR images are in short supply. In addition, interpretation variability between experts, workflow differences between institutions, and the presence of rare conditions familiar only to subspecialists all contribute to making high-quality CXR interpretation a challenge. \n Recent res…",
          "link": "http://ai.googleblog.com/2022/07/simplified-transfer-learning-for-chest.html",
          "publishedOn": "2022-07-19T17:05:00.000Z",
          "wordCount": 7598,
          "title": "Simplified Transfer Learning for Chest Radiography Model Development",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/07/google-at-icml-2022.html",
          "author": null,
          "description": "Posted by Cat Armato, Program Manager, University Relations \nGoogle is a leader in machine learning (ML) research with groups innovating across virtually all aspects of the field, from theory to application. We build machine learning systems to solve deep scientific and engineering challenges in areas of language, music, visual processing, algorithm development, and more. Core to our approach is to actively engage with the broader research community by open-sourcing datasets and models, publishing our discoveries, and actively participating in leading conferences. \nGoogle is proud to be a Diamond Sponsor of the thirty-ninth International Conference on Machine Learning (ICML 2022), a premier annual conference, which is being held this week in Baltimore, Maryland. Google has a strong presenc…",
          "link": "http://ai.googleblog.com/2022/07/google-at-icml-2022.html",
          "publishedOn": "2022-07-18T20:54:00.001Z",
          "wordCount": 10140,
          "title": "Google at ICML 2022",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/07/towards-reliability-in-deep-learning.html",
          "author": null,
          "description": "Posted by Dustin Tran and Balaji Lakshminarayanan, Research Scientists, Google Research \nDeep learning models have made impressive progress in vision, language, and other modalities, particularly with the rise of large-scale pre-training. Such models are most accurate when applied to test data drawn from the same distribution as their training set. However, in practice, the data confronting models in real-world settings rarely match the training distribution. In addition, the models may not be well-suited for applications where predictive performance is only part of the equation. For models to be reliable in deployment, they must be able to accommodate shifts in data distribution and make useful decisions in a broad array of scenarios.  \nIn “Plex: Towards Reliability Using Pre-trained Larg…",
          "link": "http://ai.googleblog.com/2022/07/towards-reliability-in-deep-learning.html",
          "publishedOn": "2022-07-14T17:07:00.001Z",
          "wordCount": 7537,
          "title": "Towards Reliability in Deep Learning Systems",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/07/rewriting-image-captions-for-visual.html",
          "author": null,
          "description": "Posted by Soravit Beer Changpinyo and Doron Kukliansky‎, Senior Software Engineers, Google Research \nVisual Question Answering (VQA) is a useful machine learning (ML) task that requires a model to answer a visual question about an image. What makes it challenging is its multi-task and open-ended nature; it involves solving multiple technical research questions in computer vision and natural language understanding simultaneously. Yet, progress on this task would enable a wide range of applications, from assisting the blind and the visually-impaired or communicating with robots to enhancing the user’s visual experience with external knowledge. \nEffective and robust VQA systems cannot exist without high-quality, semantically and stylistically diverse large-scale training data of image-questio…",
          "link": "http://ai.googleblog.com/2022/07/rewriting-image-captions-for-visual.html",
          "publishedOn": "2022-07-13T19:24:00.002Z",
          "wordCount": 6399,
          "title": "Rewriting Image Captions for Visual Question Answering Data Creation",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        }
      ]
    },
    {
      "title": "Seth Godin's Blog on marketing, tribes and respect",
      "feedUrl": "https://feeds.feedblitz.com/sethsblog",
      "siteUrl": "https://seths.blog",
      "articles": [
        {
          "id": "https://seths.blog/?p=43534",
          "author": "Seth Godin",
          "description": "Look around the rooftops of many cities and you’ll see wooden water towers. New York has thousands of them. The reason is simple and often overlooked: In the morning, when every resident of the building is preparing for the day, there’s a need for thousands of gallons of water under high pressure. Providing that much […]",
          "link": "https://feeds.feedblitz.com/~/705900434/0/sethsblog~The-wisdom-of-the-water-tower/",
          "publishedOn": "2022-08-11T08:28:00.000Z",
          "wordCount": 1195,
          "title": "The wisdom of the water tower",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806138-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=41623",
          "author": "Seth Godin",
          "description": "It was early in the development of a new product, and someone asked this question. I’m not sure the word “marketing” means what you think it means. Later, we will get to the promotion and advertising part. But right now, this is marketing. All of it. The product. The warranty. The team. The color choices. […]",
          "link": "https://feeds.feedblitz.com/~/705780907/0/sethsblog~When-do-we-get-to-the-marketing-part/",
          "publishedOn": "2022-08-10T09:32:00.000Z",
          "wordCount": 1139,
          "title": "“When do we get to the marketing part?”",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806135-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=42471",
          "author": "Seth Godin",
          "description": "There are 1,000 other high schools, and each one has a vice principal who isn’t you. No, you’re not irreplaceable. No one is, not really. But if we work at it, we might become indispensable. The linchpin, someone who would be missed if they were gone.",
          "link": "https://feeds.feedblitz.com/~/705634210/0/sethsblog~Indispensable-or-irreplaceable/",
          "publishedOn": "2022-08-09T08:16:00.000Z",
          "wordCount": 1087,
          "title": "Indispensable or irreplaceable",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061312.jpg"
        },
        {
          "id": "https://seths.blog/?p=42469",
          "author": "Seth Godin",
          "description": "It doesn’t matter that it’s not the Super Bowl or the World Cup. For this twelve-year old, tomorrow’s game is the big game, the biggest ever, and the emotional stakes are just as high. It doesn’t matter that this illness isn’t going to be life or death in the next few days. For this patient, […]",
          "link": "https://feeds.feedblitz.com/~/705511208/0/sethsblog~Absolute-and-relative/",
          "publishedOn": "2022-08-08T08:14:00.000Z",
          "wordCount": 1140,
          "title": "Absolute and relative",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061313.jpg"
        },
        {
          "id": "https://seths.blog/?p=42465",
          "author": "Seth Godin",
          "description": "In countries throughout the world, even in countries where there are no snakes, the most common dream is one based on our (it must be) genetic fear of snakes. But in Bhutan, they dream of rainbows. The dreams might be consistent, but the way we talk about them clearly isn’t. Perhaps the dreams we remember […]",
          "link": "https://feeds.feedblitz.com/~/705428508/0/sethsblog~In-Bhutan-they-dream-of-rainbows/",
          "publishedOn": "2022-08-07T08:16:00.000Z",
          "wordCount": 1137,
          "title": "In Bhutan, they dream of rainbows",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061314.jpg"
        },
        {
          "id": "https://seths.blog/?p=42462",
          "author": "Seth Godin",
          "description": "When we sing in the shower, we hardly expect applause. In fact, that would be awfully weird. But online, when just about anyone might be clicking, watching or sharing, it’s disappointing to put your work into the world and hear nothing. Nothing but a black hole that absorbs your best work and reflects nothing back. […]",
          "link": "https://feeds.feedblitz.com/~/705352012/0/sethsblog~Crickets/",
          "publishedOn": "2022-08-06T08:11:00.000Z",
          "wordCount": 1218,
          "title": "Crickets",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061314.jpg"
        },
        {
          "id": "https://seths.blog/?p=41583",
          "author": "Seth Godin",
          "description": "So many choices. So many sorts of metrics, critics and measures. Perhaps it makes sense to count things where the counting tells us how to do better next time. And to count things that let us know how much risk we can take next time. Or to calibrate our judgment about the market. But it […]",
          "link": "https://feeds.feedblitz.com/~/705285166/0/sethsblog~What-to-count/",
          "publishedOn": "2022-08-05T09:54:00.000Z",
          "wordCount": 1273,
          "title": "What to count",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806135-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=42434",
          "author": "Seth Godin",
          "description": "Every year, tens of thousands of people get into a famous college of their choice. It’s not unlikely that someone will get in, it’s simply not certain that you will. But someone will, so getting isn’t a miracle, it’s simply a long shot. If you add a pound a day to the leg press machine […]",
          "link": "https://feeds.feedblitz.com/~/705196140/0/sethsblog~Waiting-for-a-miracle/",
          "publishedOn": "2022-08-04T08:56:00.000Z",
          "wordCount": 1157,
          "title": "Waiting for a miracle?",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061318.jpg"
        },
        {
          "id": "https://seths.blog/?p=43493",
          "author": "Seth Godin",
          "description": "Sooner or later, they’re all finite. And the way we allocate our time and emotional energy determines what gets done. If we audited your day in six-minute increments, what would we find? By the clock, how did you actually spend the time given to you (we each get the same 24 hours). How much was […]",
          "link": "https://feeds.feedblitz.com/~/704989038/0/sethsblog~Time-and-focus-and-energy/",
          "publishedOn": "2022-08-03T08:15:00.000Z",
          "wordCount": 1203,
          "title": "Time and focus and energy",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_180613-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=42430",
          "author": "Seth Godin",
          "description": "“What other colors do you have that are not currently in stock?” There are always more options. If exploring them is the goal, please explore. And sometimes, the unavailable can lead to a breakthrough. But if the job is to simply get the work done, it might be worth pretending that the unexplored options don’t […]",
          "link": "https://feeds.feedblitz.com/~/704782990/0/sethsblog~Unavailable-options/",
          "publishedOn": "2022-08-02T08:23:00.000Z",
          "wordCount": 1096,
          "title": "Unavailable options",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061315.jpg"
        }
      ]
    },
    {
      "title": "The JetBrains Blog",
      "feedUrl": "https://blog.jetbrains.com/feed/",
      "siteUrl": "https://blog.jetbrains.com",
      "articles": [
        {
          "id": "https://blog.jetbrains.com/?post_type=pycharm&p=273489",
          "author": "Valeria Letusheva",
          "description": "This is a new update for the upcoming minor bug-fix release for 2022.2. Last week, in the first release candidate for 2022.2.1, we delivered some critical fixes to use the new functionality of PyCharm 2022.2 without having issues with remote interpreters. If you encounter an issue in PyCharm 2022.2, please reach out to our support […]",
          "link": "https://blog.jetbrains.com/pycharm/2022/08/2022-2-1-rc-2/",
          "publishedOn": "2022-08-11T13:36:21.000Z",
          "wordCount": 2020,
          "title": "The Second Release Candidate for PyCharm 2022.2.1 Is Available!",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2019/02/pycharm_social.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=dotnet&p=268579",
          "author": "Matthias Koch",
          "description": "For decades, developers have had heated debates about tabs and spaces in their source code. The topic became so widespread that it made it into an episode of “Silicon Valley”. In this blog post, we will introduce you to ReSharper’s Virtual Formatter, that helps you settle this particular infamous argument and even a couple more […]",
          "link": "https://blog.jetbrains.com/dotnet/2022/08/11/virtual-formatter-in-resharper-2022-2/",
          "publishedOn": "2022-08-11T12:24:45.000Z",
          "wordCount": 2905,
          "title": "Virtual Formatter – Fixing Tabs versus Spaces and other Problems",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/07/rs-how-tos-blog-social-share-image-1280x720-1.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=dotnet&p=273299",
          "author": "Sasha Ivanova",
          "description": "Hello everyone, The ReSharper and Rider 2022.2.1 bug-fix releases are now available! Let’s go over the most important updates. ReSharper Fixed the issue where the ReSharper installer got an “Access denied” error, requiring admin privileges to install or update to version 2022.2 (RSRP-489377). Fixed an installation issue caused by the “strong name key container not […]",
          "link": "https://blog.jetbrains.com/dotnet/2022/08/10/resharper-and-rider-2022-2-1/",
          "publishedOn": "2022-08-10T15:37:02.000Z",
          "wordCount": 2086,
          "title": "ReSharper and Rider 2022.2.1 Bug Fixes Have Landed",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/08/rs-bug-fix-blog-featured-image-1280x600-1.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=kotlin&p=272476",
          "author": "Alina Dolgikh",
          "description": "Kotlin 1.7.20 Beta Is Now Available This preview version of Kotlin brings: The new Kotlin K2 compiler that supports Lombok, all-open, Parcelize, and other compiler plugins. A preview of the ..< operator for creating open-ended ranges. The new Kotlin/Native memory manager enabled by default. A new experimental feature for JVM – inline classes with generic […]",
          "link": "https://blog.jetbrains.com/kotlin/2022/08/kotlin-news-july/",
          "publishedOn": "2022-08-10T12:01:35.000Z",
          "wordCount": 2462,
          "title": "Monthly News: Kotlin 1.7.20 Beta, KotlinConf Workshops, New Webinar, and more!",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/08/Monthly-digest-5-Summer-2022-01-1-1.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=youtrack&p=271821",
          "author": "Elena Pishkova",
          "description": "Thousands of academic institutions and students across the globe use YouTrack for software development and project management courses, as well as in research. If you’re working in this field and searching for a tool that, like you and your colleagues or your fellow students, speaks the language of mathematics, look no further than YouTrack. LaTeX […]",
          "link": "https://blog.jetbrains.com/youtrack/2022/08/do-you-speak-math-so-does-youtrack/",
          "publishedOn": "2022-08-09T19:53:38.000Z",
          "wordCount": 2023,
          "title": "Do You Speak Math? So Does YouTrack!",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/08/Blog_Social_share_image_1280x720-2.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=teamcity&p=272880",
          "author": "Julia Alexandrova",
          "description": "We’re continuing to work on TeamCity performance – the new bug-fix update addresses 32 issues, 6 of which focus on improving performance.  See our release notes for the full list of fixes in TeamCity 2022.04.3. The most notable of them are: Previously finished successful test batches are now reused when rerunning a build with the […]",
          "link": "https://blog.jetbrains.com/teamcity/2022/08/teamcity-2022-04-3-has-been-released/",
          "publishedOn": "2022-08-09T11:27:18.000Z",
          "wordCount": 1962,
          "title": "TeamCity 2022.04.3 has been released",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2019/02/teamcity_social.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=space&p=272480",
          "author": "Evgenia Verbina",
          "description": "Following the release of Space Marketplace, we’d like to invite you to take part in the Space Apps Contest!  Applications are the main way to extend the functionality of Space, a complete software development platform. With apps in Space, you can adjust the platform to the needs of your team and introduce more advanced workflows […]",
          "link": "https://blog.jetbrains.com/space/2022/08/09/space-apps-contest/",
          "publishedOn": "2022-08-09T08:28:21.000Z",
          "wordCount": 2210,
          "title": "Space Apps Contest: Create Apps and Win Prizes",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/08/social-share.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=webstorm&p=271913",
          "author": "David Watson",
          "description": "No matter how much familiarity you have with Angular, or how you feel about it, JetBrains IDEs can make your experience with this framework much better. In today’s FOMO digest, we’ll tell you about the features for working in Angular that you can find in JetBrains IDEs, such as WebStorm, IntelliJ IDEA Ultimate, PhpStorm, Rider, […]",
          "link": "https://blog.jetbrains.com/webstorm/2022/08/fomo-digest-2/",
          "publishedOn": "2022-08-08T13:00:05.000Z",
          "wordCount": 2758,
          "title": "FOMO Digest #2: Top 5 Tips for Angular Development With JetBrains IDEs",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/08/fomo-2-blog-social-share-.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=writerside&p=267281",
          "author": "Anna Gasparyan",
          "description": "Single-source publishing is a powerful must-have feature that is normally among the top three competitive advantages for any professional help authoring solution – and for good reason. Single-sourcing reusable content lets you: Maintain consistency throughout your documentation in terms of style, terminology, the level of detail, and so on.  Avoid making multiple updates when a […]",
          "link": "https://blog.jetbrains.com/writerside/2022/08/content-reuse-a-productivity-booster-or-a-vicious-circle/",
          "publishedOn": "2022-08-08T11:56:31.000Z",
          "wordCount": 4057,
          "title": "Content reuse – a productivity booster or a vicious circle?",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/08/content_reuse_banner.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=dotnet&p=272373",
          "author": "Rachel Appel",
          "description": "Did you know? ASP.NET was originally called ASP, which stands for Active Server Pages. It was released in December 1996 and was the pre-.NET version of this popular web framework. Read more about the history of Active Server Pages on Wikipedia.   .NET news .NET July 2022 Updates – .NET 6.0.7 and .NET Core 3.1.27 .NET […]",
          "link": "https://blog.jetbrains.com/dotnet/2022/08/08/net-annotated-monthly-august-2022/",
          "publishedOn": "2022-08-08T11:49:21.000Z",
          "wordCount": 3860,
          "title": ".NET Annotated Monthly | August 2022",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2020/10/dotnet-NET_Annotated_blog_1600x800.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=datagrip&p=272555",
          "author": "Maksim Sobolevskiy",
          "description": "There is one thing which makes DataGrip different from many other database tools: DataGrip doesn’t show all schemas and databases by default in the database explorer. In this post we’ll briefly describe why it’s designed like this and what you can do if this doesn’t suit your workflow. The most important thing about DataGrip is […]",
          "link": "https://blog.jetbrains.com/datagrip/2022/08/08/not-all-databases-schemas-are-displayed-by-default-why/",
          "publishedOn": "2022-08-08T10:23:27.000Z",
          "wordCount": 2046,
          "title": "Not All Databases/Schemas Are Displayed by Default. Why?",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/08/NotAll.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=pycharm&p=272446",
          "author": "Valeria Letusheva",
          "description": "We’re working closely with your feedback on the PyCharm 2022.2 version that was released last week. Thank you for sharing with us! If you encounter an issue in PyCharm 2022.2, please reach out to our support team. We are actively fixing regressions, and will be delivering a minor bug-fix release soon. You can get the […]",
          "link": "https://blog.jetbrains.com/pycharm/2022/08/2022-2-1-rc/",
          "publishedOn": "2022-08-07T08:22:05.000Z",
          "wordCount": 2144,
          "title": "The PyCharm 2022.2.1 Release Candidate Is Now Available!",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2019/02/pycharm_social.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}