{
  "sources": [
    {
      "title": "Spring",
      "feedUrl": "https://spring.io/blog.atom",
      "siteUrl": "https://spring.io/blog",
      "articles": [
        {
          "id": "https://spring.io/blog/2022/01/06/a-bootiful-podcast-spring-cloud-cofounder-spencer-gibb-and-happy-new-year",
          "author": null,
          "description": "Hi, Spring fans, and happy new year! In this installment, Josh Long (@starbuxman) talks to Spring Cloud co-founder, legend, and the all-around nice guy Spencer Gibb (@spencerbgibb).",
          "link": "https://spring.io/blog/2022/01/06/a-bootiful-podcast-spring-cloud-cofounder-spencer-gibb-and-happy-new-year",
          "publishedOn": "2022-01-06T18:00:00.000Z",
          "wordCount": 416,
          "title": "A Bootiful Podcast: Spring Cloud cofounder Spencer Gibb (and happy new year!)"
        },
        {
          "id": "https://spring.io/blog/2022/01/06/introducing-spring-integration-groovy-dsl",
          "author": null,
          "description": "Happy New Year, Spring community!\n\r\n\r\n\r\nHope you had great holidays and ready for new excitements in front of us.\n\r\n\r\n\r\nAfter the rest and recharging during Christmas break I decided to pay honor to my favorite language back in days - Groovy.\n\r\n\r\n\r\nAnd now it’s my pleasure to present you a brand new Groovy DSL for Spring Integration.\r\nYou perhaps heard about our old attempt to make a Groovy DSL on top of Spring Integration XML support.\r\nBut the solution was pretty cumbersome (especially for protocol-specific channel adapters) and support burden has grown tremendously.\r\nThis my latest implementation is fully based on already mature Java DSL and its builder pattern support.\n\r\n\r\n\r\nHaving 10 years experience with Gradle I thought that it is going be easy enough for me to prepare quickly someth…",
          "link": "https://spring.io/blog/2022/01/06/introducing-spring-integration-groovy-dsl",
          "publishedOn": "2022-01-06T17:47:00.000Z",
          "wordCount": 817,
          "title": "Introducing Spring Integration Groovy DSL"
        },
        {
          "id": "https://spring.io/blog/2022/01/05/spring-framework-cve-2021-22060-has-been-published",
          "author": null,
          "description": "The Spring Framework 5.3.14 and 5.2.19 releases on December 16 included fixes for CVE-2021-22060 and are a follow-up to CVE-2021-22096, to address additional types of input that can cause the issue. As the Spring Boot releases 2.6.2 and 2.5.8 picking up these Spring Framework versions were due the day before Christmas and given the medium severity, we postponed the announcement until after the new year, to avoid disclosure during a period when many take time off. Please, upgrade to those latest maintenance releases.",
          "link": "https://spring.io/blog/2022/01/05/spring-framework-cve-2021-22060-has-been-published",
          "publishedOn": "2022-01-06T00:00:00.000Z",
          "wordCount": 460,
          "title": "Spring Framework CVE-2021-22060 has been published"
        },
        {
          "id": "https://spring.io/blog/2022/01/04/this-week-in-spring-11-year-anniversary-edition-january-4th-2022",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring, the first in the new year! (Happy new year!) This week also marks the 11th anniversary of This Week in Spring, which I started writing on the first Tuesday of January 2011 thanks to a great idea from SpringSource co-founder and all-around good-guy Keith Donald (@kdonald). \n\r\nWhat a run! As always, I just wanna extend a heartfelt thanks to all of you who read (_suffer!_) my rambling writing every week. We’ve been lucky, as a community, to have presided over the most amazing and uplifting period in Spring and the JVM’s history… This roundup has reflected that with incredible stuff happening all the time. Where there’s smoke, there’s fire. The many blogs, articles, podcasts, YouTube (and ever so occasionally Vimeo) videos…",
          "link": "https://spring.io/blog/2022/01/04/this-week-in-spring-11-year-anniversary-edition-january-4th-2022",
          "publishedOn": "2022-01-04T11:00:00.000Z",
          "wordCount": 884,
          "title": "This Week in Spring (11 year anniversary edition!) - January 4th, 2022"
        },
        {
          "id": "https://spring.io/blog/2021/12/30/a-bootiful-podcast-geertjan-wielenga-senior-director-of-opensource-projects-at-azul-systems-and-foojay-io-founder",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks (again!) to Java ecosystem legend and senior director of opensource projects at Azul Systems, Geertjan Wielenga (@GeertjanW). \n\r\nHappy new year, everyone!",
          "link": "https://spring.io/blog/2021/12/30/a-bootiful-podcast-geertjan-wielenga-senior-director-of-opensource-projects-at-azul-systems-and-foojay-io-founder",
          "publishedOn": "2021-12-30T10:25:00.000Z",
          "wordCount": 428,
          "title": "A Bootiful Podcast: Geertjan Wielenga, senior director of opensource projects at Azul Systems and Foojay.io founder"
        },
        {
          "id": "https://spring.io/blog/2021/12/29/go-go-graalvm-with-spring-native-my-adventures-in-native-image-ville",
          "author": null,
          "description": "Hi, Spring fans! Happy new year! I can’t believe we quickly got this far, but we did. This last year’s been insanely busy, and one of the things I’ve most loved is all the opportunities to use Spring Native to build GraalVM-powered architecture-specific native images.\n\r\nWe released Spring Native 0.11, which is fantastic because it features a brand new AOT (ahead-of-time) engine that completely reworks how we transpile Spring Boot applications into GraalVM native images. I’ve been working with GraalVM a lot over the last two years, and this new release is a vast, revolutionary step in the story of Spring Native and a giant leap forward on the journey to Spring Framework 6 and Spring Boot 3, both of which will land in 2022. \n\r\nI’ve been tinkering with the new release a lot over the last mont…",
          "link": "https://spring.io/blog/2021/12/29/go-go-graalvm-with-spring-native-my-adventures-in-native-image-ville",
          "publishedOn": "2021-12-29T08:00:00.000Z",
          "wordCount": 1472,
          "title": "Go, Go, GraalVM with Spring Native: My Adventures in Native Image-ville"
        },
        {
          "id": "https://spring.io/blog/2021/12/28/this-year-in-spring-december-28th-2021",
          "author": null,
          "description": "Hi, Spring fans! How’re you doin’? I’m fresh off a fantastic holiday spent with family in Los Angeles, California. Later today, the girls and I will drive home to San Francisco, California. I’ve enjoyed my visits with people here in Los Angeles, especially since it’s our first actual visit to Los Angeles before the pandemic. \n\r\nAnd now, (can you believe it?), we’re staring down the new year. As always, I will do my yearly This Year in Spring roundup, so stay tuned for that below, after our weekly roundup. So, without further ado, here’s the last This Week in Spring recap of 2021. \n\r\n\r\n  \nA Bootiful Podcast: HBase and Cassandra cofounder and Yugabyte CTO Karthik Ranganathan\n\r\n  \nMigrating a Spring Boot application to Java 17 – the hard way: Day 2\n\r\n  \nSpring Boot 2.5.8 available now\n\r\n  \nSp…",
          "link": "https://spring.io/blog/2021/12/28/this-year-in-spring-december-28th-2021",
          "publishedOn": "2021-12-28T08:00:00.000Z",
          "wordCount": 1929,
          "title": "This Year in Spring - December 28th, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/12/23/a-bootiful-podcast-hbase-and-cassandra-cofounder-and-yugabyte-cto-karthik-ranganathan",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks to Yugabyte CTO, Apache HBase and Apache Cassandra co-founder, and distributed database legend Karthik Ranganathan. (Merry Christmas, if you celebrate!)",
          "link": "https://spring.io/blog/2021/12/23/a-bootiful-podcast-hbase-and-cassandra-cofounder-and-yugabyte-cto-karthik-ranganathan",
          "publishedOn": "2021-12-23T12:00:00.000Z",
          "wordCount": 419,
          "title": "A Bootiful Podcast: HBase and Cassandra cofounder and Yugabyte CTO Karthik Ranganathan"
        },
        {
          "id": "https://spring.io/blog/2021/12/22/spring-cloud-square-0-4-0-has-been-released",
          "author": null,
          "description": "On behalf of the community, I am pleased to announce that the 0.4.0 release of Spring Cloud Square is available today. The release can be found in Maven Central. You can check out the 0.4.0 release notes for more information.\nNotable changes in 0.4.0:\n\r\n\r\n  \nSpring Native support adjustments for non-load-balanced use-cases (PR)\n\r\n  \nSupport for configuring different WebClient.Builder beans (not shared) for each @RetrofitClient instance (PR)\n\r\n  \nSpring Cloud Sleuth integration for OkHttpClient #36\n\r\n\r\nThe documentation for this release can be found here.",
          "link": "https://spring.io/blog/2021/12/22/spring-cloud-square-0-4-0-has-been-released",
          "publishedOn": "2021-12-22T21:02:00.000Z",
          "wordCount": 459,
          "title": "Spring Cloud Square 0.4.0 has been released"
        },
        {
          "id": "https://spring.io/blog/2021/12/22/spring-native-0-11-1-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Native 0.11.1 has been released and is now available from https://repo.spring.io/release.\n\r\nThis release includes 13 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\n\r\nGitHub | Issues | Documentation",
          "link": "https://spring.io/blog/2021/12/22/spring-native-0-11-1-available-now",
          "publishedOn": "2021-12-22T08:01:32.000Z",
          "wordCount": 431,
          "title": "Spring Native 0.11.1 available now"
        },
        {
          "id": "https://spring.io/blog/2021/12/22/spring-tips-controllers-wrap-up",
          "author": null,
          "description": "Hi, Spring fans! In this installment, we conclude our tour of all things @Controller and look at how to distinguish one controller from another with the judicious use of Spring’s stereotype annotations.\n\r\n\r\n  \nWebSockets\n\r\n  \nMVC\n\r\n  \nREST\n\r\n  \nRSocket\n\r\n  \nGraphQL\n\r\n\r\nHappy holidays and happy new year!",
          "link": "https://spring.io/blog/2021/12/22/spring-tips-controllers-wrap-up",
          "publishedOn": "2021-12-22T08:00:00.000Z",
          "wordCount": 418,
          "title": "Spring Tips: @Controllers: Wrap Up"
        },
        {
          "id": "https://spring.io/blog/2021/12/21/spring-boot-2-6-2-available-now",
          "author": null,
          "description": "Update Jan 5: 2022: The Spring Framework version in this release includes fixes for CVE-2021-22060 whose official publication was deferred until today since many people take time off at the end of the year.\n\r\nOn behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.6.2 has been released and is now available from Maven Central.\n\r\nThis release includes 55 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/12/21/spring-boot-2-6-2-available-now",
          "publishedOn": "2021-12-21T21:25:00.000Z",
          "wordCount": 514,
          "title": "Spring Boot 2.6.2 available now"
        },
        {
          "id": "https://spring.io/blog/2021/12/21/spring-boot-2-5-8-available-now",
          "author": null,
          "description": "Update Jan 5: 2022: The Spring Framework version in this release includes fixes for CVE-2021-22060 whose official publication was deferred until today since many people take time off at the end of the year.\n\r\nOn behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.5.8 has been released and is now available from Maven Central.\n\r\nThis release includes 46 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/12/21/spring-boot-2-5-8-available-now",
          "publishedOn": "2021-12-21T18:52:00.000Z",
          "wordCount": 514,
          "title": "Spring Boot 2.5.8 available now"
        },
        {
          "id": "https://spring.io/blog/2021/12/21/spring-integration-5-5-7-available",
          "author": null,
          "description": "Dear Spring community,\n\r\n\r\n\r\nOn behalf of the team and all the contributors, it’s my pleasure to wish you a Merry Christmas and Happy New Year and present you a fresh Spring Integration 5.5.7 release.\n\r\n\r\n\r\nIt can be obtained from Maven Central and it is recommended to upgrade your projects or just pull it transitively from respective latest Spring Boot patch version!\n\r\n\r\n\r\n\r\ncompile 'org.springframework.integration:spring-integration-core:5.5.7'\n\r\n\r\n\r\n\r\nThe notable changes and important bug fixes are:\n\r\n\r\n\r\n\r\n\r\nJDBC message store SQL scripts now quote a CONDITION column name for those RDBMS vendors which have this word as reserved.\r\nIt is likely in the next major 6.0 version we will rename it to GROUP_CONDITION.\r\nSo, it is recommended to upgrade to this 5.5.7 version if you deal with Jdbc…",
          "link": "https://spring.io/blog/2021/12/21/spring-integration-5-5-7-available",
          "publishedOn": "2021-12-21T16:48:33.000Z",
          "wordCount": 698,
          "title": "Spring Integration 5.5.7 Available"
        },
        {
          "id": "https://spring.io/blog/2021/12/21/this-week-in-spring-december-21st-2021",
          "author": null,
          "description": "Hi, Spring fans! What a crazy wonderful week it’s been and what a wonderful week it’ll be! It’s the holidays. I’ve set my out-of-office status and am already winding down for the year. You can expect new episodes of This Week in Spring and a Bootiful Podcast (@BootifulPodcast), of course, but I won’t be doing any new Spring Tips (@SpringTipsLive) videos until next year. That said, I can’t wait for you to see what I’m cooking up for the new installmetn of Spring Tips! It’s going to be a ton of fun! \n\r\nNow then, we’ve got a crazy amount of stuff to get to this week. Let’s dive right into it. It’ll be Christmas before we talk again, so Merry Christmas, if you celebrate that. Otherwise, I just hope you’re having a wonderful week. I look forward to next week’s installment where of course we’ll …",
          "link": "https://spring.io/blog/2021/12/21/this-week-in-spring-december-21st-2021",
          "publishedOn": "2021-12-21T08:00:00.000Z",
          "wordCount": 724,
          "title": "This Week in Spring - December 21st, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/12/20/spring-security-5-2-15-5-3-13-5-4-10-5-5-4-and-5-6-1-released",
          "author": null,
          "description": "On behalf of the community, I’m pleased to announce the release of Spring Security 5.2.15 (release notes), Spring Security 5.3.13 (release notes), Spring Security 5.4.10 (release notes), Spring Security 5.5.4 (release notes) and Spring Security 5.6.1 (release notes). These releases deliver bug fixes along with some minor improvements. Users are encouraged to update to the latest patch release.\n\r\n\r\n\r\nProject Site | Reference | Help\n\r\n\r\n\r\nNOTE: There was a missing dependency update in 5.2.14.RELEASE which caused us to need to release 5.2.15.RELEASE.",
          "link": "https://spring.io/blog/2021/12/20/spring-security-5-2-15-5-3-13-5-4-10-5-5-4-and-5-6-1-released",
          "publishedOn": "2021-12-20T21:38:00.000Z",
          "wordCount": 466,
          "title": "Spring Security 5.2.15, 5.3.13, 5.4.10, 5.5.4 and 5.6.1 released"
        },
        {
          "id": "https://spring.io/blog/2021/12/17/client-side-development-with-spring-boot-applications",
          "author": null,
          "description": "This article explores the different options that Spring Boot developers have for using Javascript and CSS on the client (browser) side of their application. Part of the plan is to explore some Javascript libraries that play well in the traditional server-side-rendered world of Spring web applications. Those libraries tend to have a light touch for the application developer, in the sense that they allow you to completely avoid Javascript, but still have nice a progressive \"modern\" UI. We also look at some more \"pure\" Javascript tools and frameworks. It’s kind of a spectrum, so as a TL;DR here is a list of the sample apps, in rough order of low to high Javascript content:\n\r\n\r\n\r\n\r\n\r\nhtmx: HTMX is a library that allows you to access modern browser features directly from HTML, rather than using…",
          "link": "https://spring.io/blog/2021/12/17/client-side-development-with-spring-boot-applications",
          "publishedOn": "2021-12-17T08:00:00.000Z",
          "wordCount": 9227,
          "title": "Client Side Development with Spring Boot Applications"
        },
        {
          "id": "https://spring.io/blog/2021/12/16/a-bootiful-podcast-ronald-dehuysser-creator-of-the-distributed-job-scheduler-jobrunr",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long talks to JobRunr.io creator Ronald Dehuysser (@rdehuyss) about JobRunr, which is a distributed job scheduling engine that plugs right into Spring Boot.",
          "link": "https://spring.io/blog/2021/12/16/a-bootiful-podcast-ronald-dehuysser-creator-of-the-distributed-job-scheduler-jobrunr",
          "publishedOn": "2021-12-17T00:00:00.000Z",
          "wordCount": 419,
          "title": "A Bootiful Podcast: Ronald Dehuysser, Creator of the Distributed Job Scheduler JobRunr"
        },
        {
          "id": "https://spring.io/blog/2021/12/16/spring-framework-6-0-m1-released",
          "author": null,
          "description": "Dear Spring community,\n\r\nIt is my pleasure to announce that the first Spring Framework 6.0 milestone release is available from htts://repo.spring.io/milestone now. This initial milestone covers our baseline upgrade efforts, in particular requiring JDK 17+ and migrating to the Jakarta EE 9 APIs; see my recent baseline blog post for the rationale. At the same time, it removes many long-deprecated classes, including several support packages for outdated third-party infrastructure.\n\r\nFor current upgrade notes, please refer to our Upgrading to Spring Framework 6.0 page which we will keep updating. Follow our main branch on GitHub for the latest changes, as we prepare for 6.0 M2 and the corresponding Spring Boot 3.0 M1 release in January. At that point, you will also be able to consume Spring Framework 6.0 through https://start.spring.io/. For the time being, feel free to grab 6.0 M1 from https://repo.spring.io/ and let us know how it goes.\n\r\nCheers,\nJuergen",
          "link": "https://spring.io/blog/2021/12/16/spring-framework-6-0-m1-released",
          "publishedOn": "2021-12-16T16:00:32.000Z",
          "wordCount": 524,
          "title": "Spring Framework 6.0 M1 released"
        },
        {
          "id": "https://spring.io/blog/2021/12/16/spring-framework-5-3-14-and-5-2-19-available-now",
          "author": null,
          "description": "Update Jan 5, 2022: The releases include fixes for CVE-2021-22060 whose official publication was deferred until today since many people take time off at the end of the year.\n\r\nOn behalf of the team and everyone who has contributed, I am pleased to announce that Spring Framework 5.3.14 and 5.2.19 are available now.\n\r\nSpring Framework 5.3.14 includes 36 fixes and improvements. Spring Framework 5.2.19 includes 11 selected fixes and improvements.\n\r\nStay tuned for the announcement of Spring Framework 6.0.0-M1 later today!\n\r\nProject Page | GitHub | Issues | Documentation",
          "link": "https://spring.io/blog/2021/12/16/spring-framework-5-3-14-and-5-2-19-available-now",
          "publishedOn": "2021-12-16T10:05:00.000Z",
          "wordCount": 468,
          "title": "Spring Framework 5.3.14 and 5.2.19 available now"
        }
      ]
    },
    {
      "title": "HashiCorp Blog",
      "feedUrl": "https://www.hashicorp.com/blog/feed.xml",
      "siteUrl": "https://hashicorp.com/blog",
      "articles": [
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-2021-year-in-review",
          "author": null,
          "description": "A look back at some of the most important moments of a very eventful 2021 for HashiCorp.",
          "link": "https://www.hashicorp.com/blog/hashicorp-2021-year-in-review",
          "publishedOn": "2022-01-05T17:00:00.000Z",
          "wordCount": 1661,
          "title": "HashiCorp 2021 Year in Review"
        },
        {
          "id": "https://www.hashicorp.com/blog/integrating-azure-ad-identity-hashicorp-vault-part-1-application-auth-oidc",
          "author": null,
          "description": "Learn how to achieve user authentication to HashiCorp Vault with OIDC using Microsoft Azure AD as a central identity provider.",
          "link": "https://www.hashicorp.com/blog/integrating-azure-ad-identity-hashicorp-vault-part-1-application-auth-oidc",
          "publishedOn": "2022-01-04T18:00:00.000Z",
          "wordCount": 1122,
          "title": "Integrating Azure AD Identity with HashiCorp Vault — Part 1: Azure Application Auth via OIDC"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-ambassador-call-for-submissions-2022",
          "author": null,
          "description": "We are once again calling for nominations and applications to the HashiCorp Ambassadors program.",
          "link": "https://www.hashicorp.com/blog/hashicorp-ambassador-call-for-submissions-2022",
          "publishedOn": "2022-01-04T16:00:00.000Z",
          "wordCount": 576,
          "title": "HashiCorp Ambassador Call for Submissions 2022"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashitalks-2022-call-for-proposals",
          "author": null,
          "description": "HashiTalks, our annual, all-day virtual community event, returns for its fourth edition on Thursday, February 17, 2022. Submit your proposals now!",
          "link": "https://www.hashicorp.com/blog/hashitalks-2022-call-for-proposals",
          "publishedOn": "2021-12-21T17:00:00.000Z",
          "wordCount": 742,
          "title": "HashiTalks 2022 Call for Proposals"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-cloud-platform-adds-new-asia-regions-mfa-and-more",
          "author": null,
          "description": "HashiCorp Cloud Platform added new locations in the Asia-Pacific region, multi-factor authentication, and support for additional configurations of HashiCorp Consul and HashiCorp Vault.",
          "link": "https://www.hashicorp.com/blog/hashicorp-cloud-platform-adds-new-asia-regions-mfa-and-more",
          "publishedOn": "2021-12-20T17:00:00.000Z",
          "wordCount": 1832,
          "title": "HashiCorp Cloud Platform Adds New Asia Regions, MFA, and More"
        },
        {
          "id": "https://www.hashicorp.com/blog/meet-the-hashicorp-partner-hackstravaganza-winners",
          "author": null,
          "description": "See the results of HashiCorp’s virtual partner hackathon held in the Asia-Pacific region.",
          "link": "https://www.hashicorp.com/blog/meet-the-hashicorp-partner-hackstravaganza-winners",
          "publishedOn": "2021-12-17T00:00:00.000Z",
          "wordCount": 802,
          "title": "Meet the HashiCorp Partner Hackstravaganza Winners"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-hashicorp-consul-1-11",
          "author": null,
          "description": "HashiCorp Consul 1.11 adds important new features: multi-tenancy with administrative partitions, new installation-and-management Consul Kubernetes CLI, and Vault integration on Consul Kubernetes.",
          "link": "https://www.hashicorp.com/blog/announcing-hashicorp-consul-1-11",
          "publishedOn": "2021-12-16T17:00:00.000Z",
          "wordCount": 1383,
          "title": "Announcing HashiCorp Consul 1.11 - Now Generally Available"
        },
        {
          "id": "https://www.hashicorp.com/blog/deploying-helm-apps-to-kubernetes-with-waypoint-and-gitops",
          "author": null,
          "description": "You can use HashiCorp Waypoint to help simplify and automate your Helm application deployments.",
          "link": "https://www.hashicorp.com/blog/deploying-helm-apps-to-kubernetes-with-waypoint-and-gitops",
          "publishedOn": "2021-12-15T17:00:00.000Z",
          "wordCount": 627,
          "title": "Deploying Helm Apps to Kubernetes with Waypoint and GitOps"
        },
        {
          "id": "https://www.hashicorp.com/blog/terraform-adds-support-for-gke-autopilot",
          "author": null,
          "description": "The Google Cloud Terraform provider now supports deployment of GKE Autopilot clusters. Learn how to use the new feature with a short example.",
          "link": "https://www.hashicorp.com/blog/terraform-adds-support-for-gke-autopilot",
          "publishedOn": "2021-12-14T17:00:00.000Z",
          "wordCount": 1434,
          "title": "Terraform Adds Support for GKE Autopilot"
        }
      ]
    },
    {
      "title": "Elastic Blog - Elasticsearch, Kibana, and ELK Stack",
      "feedUrl": "https://www.elastic.co/blog/feed",
      "siteUrl": "https://www.elastic.co",
      "articles": [
        {
          "id": "https://www.elastic.co/blog/how-search-enables-role-based-data-classification-sharing-across-government",
          "author": "Bobby Suber",
          "description": "Government departments see great value in data sharing but face hurdles in implementation due to silos and compliance requirements. Learn how Elastic helps overcome these hurdles and keeps department, IT, and data science stakeholders in sync.",
          "link": "https://www.elastic.co/blog/how-search-enables-role-based-data-classification-sharing-across-government",
          "publishedOn": "2022-01-04T17:00:00.000Z",
          "wordCount": 956,
          "title": "How search enables role-based data classification and sharing across the government"
        },
        {
          "id": "https://www.elastic.co/blog/how-search-enables-role-based-data-classification-sharing-across-government",
          "author": "Bobby Suber",
          "description": ",\nGovernment data strategies lay a promising groundwork for how data will be used to drive more informed decision making internally and more streamlined public services externally. A commonality between these strategies is the need for improved role-based data sharing and data re-use. The sticking point, however, is in the way to implement data sharing when there are known silos across and within various departments. More often than not, these silos exist for good reason, particularly for data privacy compliance requirements.\nHow can these hurdles be overcome and the promise of data sharing across government departments be realized?        \nKey stakeholders of government data sharing initiatives\nBefore tackling this dilemma, it’s important to understand the key stakeholders of government d…",
          "link": "https://www.elastic.co/blog/how-search-enables-role-based-data-classification-sharing-across-government",
          "publishedOn": "2022-01-04T17:00:00.000Z",
          "wordCount": 956,
          "title": "How search enables role-based data classification and sharing across the government"
        },
        {
          "id": "https://www.elastic.co/blog/gain-upper-hand-over-adversaries-with-osquery-and-elastic",
          "author": "Melissa Burpo",
          "description": "Easily deploy and run Osquery across your environments to gather valuable insight into your data. Reduce investigation time by identifying incident telemetry and isolate hosts as needed.",
          "link": "https://www.elastic.co/blog/gain-upper-hand-over-adversaries-with-osquery-and-elastic",
          "publishedOn": "2022-01-04T14:00:00.000Z",
          "wordCount": 1195,
          "title": "Gain the upper hand over adversaries with Osquery and Elastic"
        },
        {
          "id": "https://www.elastic.co/blog/gain-upper-hand-over-adversaries-with-osquery-and-elastic",
          "author": "Melissa Burpo",
          "description": ",\nWith the Elastic 7.16 release, Osquery Manager is now generally available for Elastic Agent, making it easier than ever to deploy and run Osquery across your environments. By collecting Osquery data and combining it with the power of the Elastic Stack, you can greatly expand your endpoint telemetry, enabling enhanced detection and investigation, and improved hunting for vulnerabilities and anomalous activities.\nThis blog post gives a brief intro to the Osquery Manager integration for Elastic Agent ​​and how it can be used in conjunction with Elastic Security. Included are examples that show how to operationalize the Osquery data with use cases such as building critical security alerts, querying isolated hosts during investigations, and monitoring for anomalous host activities with ML det…",
          "link": "https://www.elastic.co/blog/gain-upper-hand-over-adversaries-with-osquery-and-elastic",
          "publishedOn": "2022-01-04T14:00:00.000Z",
          "wordCount": 1195,
          "title": "Gain the upper hand over adversaries with Osquery and Elastic"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-security-uncovers-blister-malware-campaign",
          "author": "Joe Desimone,Samir Bousseaden",
          "description": "Elastic Security has identified active intrusions leveraging the newly identified BLISTER malware loader utilizing valid code-signing certificates to evade detection. We are providing detection guidance for security teams to protect themselves.",
          "link": "https://www.elastic.co/blog/elastic-security-uncovers-blister-malware-campaign",
          "publishedOn": "2021-12-22T19:00:00.000Z",
          "wordCount": 1064,
          "title": "Elastic Security uncovers BLISTER malware campaign"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-security-uncovers-blister-malware-campaign",
          "author": "Joe Desimone,Samir Bousseaden",
          "description": ",\nKey takeaways:\n\nElastic Security uncovered a stealthy malware campaign that leverages valid code signing certificates to evade detection\nA novel malware loader, BLISTER was used to execute second stage malware payloads in-memory and maintain persistence\nThe identified malware samples have very low or no detections on VirusTotal\nElastic provided layered prevention coverage from this threat out of the box\n\nOverview\n\nThe Elastic Security team identified a noteworthy cluster of malicious activity after reviewing our threat prevention telemetry. A valid code signing certificate is used to sign malware to help the attackers remain under the radar of the security community. We also discovered a novel malware loader used in the campaign, which we’ve named BLISTER. The majority of the malware sam…",
          "link": "https://www.elastic.co/blog/elastic-security-uncovers-blister-malware-campaign",
          "publishedOn": "2021-12-22T19:00:00.000Z",
          "wordCount": 1064,
          "title": "Elastic Security uncovers BLISTER malware campaign"
        },
        {
          "id": "https://www.elastic.co/blog/log4j2-vulnerability-what-to-know-security-vulnerability-learn-more-elastic-support",
          "author": "Cole Henry",
          "description": "The Log4j2 vulnerability has taken the internet by storm due to various cyber security exploit risks. Elastic is staying on top of this security flaw and we want to make sure you are too. These attack vectors are serious so it’s important to learn all that you can.",
          "link": "https://www.elastic.co/blog/log4j2-vulnerability-what-to-know-security-vulnerability-learn-more-elastic-support",
          "publishedOn": "2021-12-20T17:00:00.000Z",
          "wordCount": 1156,
          "title": "The Log4j2 Vulnerability: What to know, tools to learn more, and how Elastic can help"
        },
        {
          "id": "https://www.elastic.co/blog/log4j2-vulnerability-what-to-know-security-vulnerability-learn-more-elastic-support",
          "author": "Cole Henry",
          "description": ",\nWelcome to Elastic’s Log4j2 vulnerability information hub. Here we will explain what the specific Log4j2 vulnerability is, why it matters, and what tools and resources Elastic is providing to help negate the opportunity for malware exploits, cyberattacks, and other cybersecurity risks stemming from Log4j2.\nWhat is Log4j2? \nLog4j2 is an open source logging framework incorporated into many Java based applications on both end-user systems and servers. It is one of the most popular logging libraries online and it offers developers a means to log a record of their activity that can be used across various use-cases: code auditing, monitoring, data tracking, troubleshooting/tweaking, and more. Log4j2 is an open-source, free software that is used by some of the largest companies in the world. \nH…",
          "link": "https://www.elastic.co/blog/log4j2-vulnerability-what-to-know-security-vulnerability-learn-more-elastic-support",
          "publishedOn": "2021-12-20T17:00:00.000Z",
          "wordCount": 1156,
          "title": "The Log4j2 Vulnerability: What to know, tools to learn more, and how Elastic can help"
        },
        {
          "id": "https://www.elastic.co/blog/new-elasticsearch-and-logstash-releases-upgrade-apache-log4j2",
          "author": "Tom Callahan,Quin Hoxie,Rajiv Raghunarayan",
          "description": "We are pleased to announce new versions of Elasticsearch and Logstash, 7.16.2 and 6.8.22, to upgrade to the latest release of Apache Log4j and address false positive concerns with some vulnerability scanners.",
          "link": "https://www.elastic.co/blog/new-elasticsearch-and-logstash-releases-upgrade-apache-log4j2",
          "publishedOn": "2021-12-19T14:00:00.000Z",
          "wordCount": 803,
          "title": "Introducing 7.16.2 and 6.8.22 releases of Elasticsearch and Logstash to upgrade Apache Log4j2"
        },
        {
          "id": "https://www.elastic.co/blog/new-elasticsearch-and-logstash-releases-upgrade-apache-log4j2",
          "author": "Tom Callahan,Quin Hoxie,Rajiv Raghunarayan",
          "description": ",\nWe are pleased to announce new versions of Elasticsearch and Logstash, 7.16.2 and 6.8.22, to upgrade to the latest release of Apache Log4j and address false positive concerns with some vulnerability scanners. Elastic also maintains ongoing updates via our advisory to ensure our Elastic customers and our communities can stay up-to-date on the latest developments. \nDecember 10th started with the public disclosure of the Apache Log4j vulnerability -  CVE-2021-44228 affecting the popular open source logging framework adopted by several Java based custom and commercial applications. This vulnerability, affecting versions 2.0-beta9 through 2.14.1 of Log4j2, and is already being exploited by nation state attackers and ransomware groups, such as APT35 and Hafnium. Research by Google using Open S…",
          "link": "https://www.elastic.co/blog/new-elasticsearch-and-logstash-releases-upgrade-apache-log4j2",
          "publishedOn": "2021-12-19T14:00:00.000Z",
          "wordCount": 803,
          "title": "Introducing 7.16.2 and 6.8.22 releases of Elasticsearch and Logstash to upgrade Apache Log4j2"
        },
        {
          "id": "https://www.elastic.co/blog/how-elastic-supports-fastpaced-growth-with-empathy-culture",
          "author": "Lauren Peters",
          "description": "In the spirit of our free and open heritage, we’re sharing some of the ways we’ve maintained our culture as we’ve grown, and what we’ve learned along the way.",
          "link": "https://www.elastic.co/blog/how-elastic-supports-fastpaced-growth-with-empathy-culture",
          "publishedOn": "2021-12-17T17:00:00.000Z",
          "wordCount": 2081,
          "title": "Better together: How Elastic supports fast-paced growth with empathy"
        },
        {
          "id": "https://www.elastic.co/blog/how-cisos-better-manage-emerging-risk-unfilled-roles-insights-leadership",
          "author": "Matt Palmquist",
          "description": "Cybersecurity leaders are accelerating recruiting efforts to build organizational resilience.",
          "link": "https://www.elastic.co/blog/how-cisos-better-manage-emerging-risk-unfilled-roles-insights-leadership",
          "publishedOn": "2021-12-17T17:00:00.000Z",
          "wordCount": 1336,
          "title": "How CISOs can better manage an emerging risk: unfilled roles"
        },
        {
          "id": "https://www.elastic.co/blog/how-elastic-supports-fastpaced-growth-with-empathy-culture",
          "author": "Lauren Peters",
          "description": ",\nOur ten-year anniversary is just around the corner. As I’m sure you can imagine, a lot has changed since our humble beginnings as a recipe app. For one, we’ve gone from a scrappy startup with our core Elastic Stack to becoming a publicly traded company with a full arsenal of search-powered solutions. \nSince our start, we’ve led with a human-centric approach to our culture and how we grow. It’s so integrated into what we do, it’s a part of our Source Code. \n“At the beginning of defining values for the company, it was difficult to determine what would actually inspire people.” says CEO and founder, Shay Banon when talking about how our Source Code came to be. “We didn’t want our set of values to be bland or common. We wanted it to be multidimensional, so people can find themselves in it. G…",
          "link": "https://www.elastic.co/blog/how-elastic-supports-fastpaced-growth-with-empathy-culture",
          "publishedOn": "2021-12-17T17:00:00.000Z",
          "wordCount": 2081,
          "title": "Better together: How Elastic supports fast-paced growth with empathy"
        },
        {
          "id": "https://www.elastic.co/blog/how-cisos-better-manage-emerging-risk-unfilled-roles-insights-leadership",
          "author": "Matt Palmquist",
          "description": ",\nWhen Colonial Pipeline suffered a massive ransomware attack in early 2021, an internal vulnerability added to the crisis: The company was operating without its top cybersecurity manager. \nThe global security workforce needs to grow by 65% to become fully staffed, according to a new study by (ISC)², the world’s largest organization for cybersecurity pros. While modern IT platforms and tools can certainly automate many low-level tasks to help relieve overburdened security teams, chief information security officers must still find better ways to retain existing workers and recruit new ones.  \nIf they don’t, those unfilled positions represent a significant source of risk, security leaders say. Staff shortages are causing misconfigured systems, oversights in following security procedures, rus…",
          "link": "https://www.elastic.co/blog/how-cisos-better-manage-emerging-risk-unfilled-roles-insights-leadership",
          "publishedOn": "2021-12-17T17:00:00.000Z",
          "wordCount": 1336,
          "title": "How CISOs can better manage an emerging risk: unfilled roles"
        },
        {
          "id": "https://www.elastic.co/blog/use-cross-cluster-search-elastic-cloud-observability",
          "author": "Neil Brookes",
          "description": "Elastic’s SRE team has used features and functionality from Elastic Cloud to build and deploy a global observability solution that allows vital visibility into the logs, metrics and traces that are collected across our globally distributed platform.",
          "link": "https://www.elastic.co/blog/use-cross-cluster-search-elastic-cloud-observability",
          "publishedOn": "2021-12-16T17:00:00.000Z",
          "wordCount": 1261,
          "title": "Use Cross Cluster Search with Elastic Cloud to improve observability"
        },
        {
          "id": "https://www.elastic.co/blog/use-cross-cluster-search-elastic-cloud-observability",
          "author": "Neil Brookes",
          "description": ",\nLeveraging various tools and pieces of functionality, this blog describes how we have built a scalable cross-region and cross-provider Single Pane of Glass (SPOG) using cross-cluster search (CCS).\nThis blog will be useful if your Observability data is distributed across deployments, if you have multiple points of entry to view and analyze your data, and if you find yourself hopping from one Kibana instance to another to find the answers you’re looking for.\nSupporting customers across multiple providers and regions means we collect and observe data within each region. Technically, we operate each region in a largely stand-alone fashion. Logs, metrics and trace data collected within that region will remain in that region. While this provides the benefits of isolation and security, it can b…",
          "link": "https://www.elastic.co/blog/use-cross-cluster-search-elastic-cloud-observability",
          "publishedOn": "2021-12-16T17:00:00.000Z",
          "wordCount": 1261,
          "title": "Use Cross Cluster Search with Elastic Cloud to improve observability"
        },
        {
          "id": "https://www.elastic.co/blog/upskilling-reskilling-it-key-strategies-success",
          "author": "Howard Rabinowitz",
          "description": "The IT talent gap shortage requires CIOs to make savvy investments in upskilling and reskilling. Here are the 4 key strategies IT practitioners recommend.",
          "link": "https://www.elastic.co/blog/upskilling-reskilling-it-key-strategies-success",
          "publishedOn": "2021-12-16T14:00:00.000Z",
          "wordCount": 977,
          "title": "Advice for CIOs from the IT frontlines: Design training programs for higher impact and retention"
        },
        {
          "id": "https://www.elastic.co/blog/upskilling-reskilling-it-key-strategies-success",
          "author": "Howard Rabinowitz",
          "description": ",\nThe shortage of tech skills worsened during the pandemic, and the battle to hire and retain top IT talent is only getting more challenging. To close the IT talent gap, more CIOs are looking to expand the skills of their current workforce, according to a recent McKinsey Global Survey.\nBut effective upskilling and reskilling isn’t simply a matter of paying for IT practitioners to earn certifications in the latest technology. Leaders must decide what options align best with business objectives, specific skills gaps, and rapidly changing learning styles of knowledge workers.\nTo get a front-line perspective on these issues, we interviewed a group of seasoned IT pros for their insights into how enterprise leaders should approach employee training and reskilling challenges. Here are highlights …",
          "link": "https://www.elastic.co/blog/upskilling-reskilling-it-key-strategies-success",
          "publishedOn": "2021-12-16T14:00:00.000Z",
          "wordCount": 977,
          "title": "Advice for CIOs from the IT frontlines: Design training programs for higher impact and retention"
        },
        {
          "id": "https://www.elastic.co/blog/how-observability-drives-better-customer-experiences",
          "author": "David Rand",
          "description": "New software tools can help CIOs identify, fix, and prevent service-impacting glitches in real time.",
          "link": "https://www.elastic.co/blog/how-observability-drives-better-customer-experiences",
          "publishedOn": "2021-12-16T07:00:00.000Z",
          "wordCount": 989,
          "title": "How observability drives better customer experiences"
        },
        {
          "id": "https://www.elastic.co/blog/how-observability-drives-better-customer-experiences",
          "author": "David Rand",
          "description": ",\nAs marketing director of technology for Stanley Black & Decker, it’s no surprise that Colleen Romero is into power tools. But her favorite utility isn’t a jigsaw or cordless drill.\nIt’s observability technology.\nObservability—software that integrates data from various departments and applications —makes it possible to monitor how customers experience the performance of the 350 websites that Romero oversees. On her watch, the tools have spotted some problems before customers notice. \n“We no longer have customers calling us to say our websites are down,” says Romero. “Observability tools let us spot any degradation of performance and identify the root cause so we can address it proactively.”\nObservability enables businesses and IT teams to trace customer issues back to an offending applica…",
          "link": "https://www.elastic.co/blog/how-observability-drives-better-customer-experiences",
          "publishedOn": "2021-12-16T07:00:00.000Z",
          "wordCount": 989,
          "title": "How observability drives better customer experiences"
        }
      ]
    },
    {
      "title": "Ansible Blog",
      "feedUrl": "https://www.ansible.com/blog/rss.xml",
      "siteUrl": "https://www.ansible.com/blog",
      "articles": [
        {
          "id": "https://www.ansible.com/blog/top-5-ansible-automation-platform-blogs-2021",
          "author": "trmcconn@redhat.com (Tricia McConnell)",
          "description": "A end-of-year roundup of the most read blogs in 2021 for Red Hat Ansible Automation Platform.",
          "link": "https://www.ansible.com/blog/top-5-ansible-automation-platform-blogs-2021",
          "publishedOn": "2021-12-21T14:15:00.000Z",
          "wordCount": 1300,
          "title": "The top 5 Ansible Automation Platform blogs of 2021"
        },
        {
          "id": "https://www.ansible.com/blog/whats-new-network-automation-using-red-hat-ansible-automation-platform-2.1",
          "author": "Dafné Mendoza",
          "description": "A financial customer explained his first automation priority in the most visual and understandable way: “I want to paint all of my network devices with the color of the company.” What I like about that analogy is that it clearly describes the first rule for automation: customers must define their golden configurations (the color to paint) to be able to automate configurations and later assess compliance, and remediate any issues accordingly. \nA “golden configuration” usually refers to a Day 1 configuration, and covers the minimal settings needed for a network device to be configured after a fresh network operating system installation. This usually includes common services such as NTP, DNS, AAA, Syslog, SNMP, and ACLs for management connectivity.",
          "link": "https://www.ansible.com/blog/whats-new-network-automation-using-red-hat-ansible-automation-platform-2.1",
          "publishedOn": "2021-12-16T14:15:00.000Z",
          "wordCount": 1935,
          "title": "What's new: network automation using Red Hat Ansible Automation Platform 2.1"
        },
        {
          "id": "https://www.ansible.com/blog/new-reference-architecture-deploying-red-hat-ansible-automation-platform-2.1",
          "author": "Roger Lopez",
          "description": "With the release of Red Hat Ansible Automation Platform 2.1, we are proud to deliver the latest reference architecture on the best practices for deploying a highly available Ansible Automation Platform environment.",
          "link": "https://www.ansible.com/blog/new-reference-architecture-deploying-red-hat-ansible-automation-platform-2.1",
          "publishedOn": "2021-12-14T14:15:00.000Z",
          "wordCount": 1505,
          "title": "New reference architecture: Deploying Red Hat Ansible Automation Platform 2.1"
        }
      ]
    },
    {
      "title": "Azure DevOps Blog",
      "feedUrl": "https://devblogs.microsoft.com/devops/feed/",
      "siteUrl": "https://devblogs.microsoft.com/devops",
      "articles": [
        {
          "id": "https://devblogs.microsoft.com/devops/?p=63171",
          "author": "Jay Gordon",
          "description": "The top stories from the #AzureDevOps #community for 2022.01.07 are here!\nThe post Top Stories from the Microsoft DevOps Community – 2022.01.07 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2022-01-07/",
          "publishedOn": "2022-01-07T11:00:33.000Z",
          "wordCount": 1653,
          "title": "Top Stories from the Microsoft DevOps Community – 2022.01.07"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=63156",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes Episode 63 – Getting Started with @Azure and WebAssembly with @StevenMurawski appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-episode-63-getting-started-with-azure-and-webassembly-with-stevenmurawski/",
          "publishedOn": "2022-01-03T16:27:57.000Z",
          "wordCount": 1525,
          "title": "AzureFunBytes Episode 63 – Getting Started with @Azure and WebAssembly with @StevenMurawski"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=63045",
          "author": "DevOps Dojo",
          "description": "Before we discuss culture and mindset in Dojo, let’s begin with quizzes on culture.\na. Using Agile Methodology\nThe post DevOps Dojo – Culture and Mindset appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/devops-dojo-culture-and-mindset/",
          "publishedOn": "2021-12-31T11:36:05.000Z",
          "wordCount": 6467,
          "title": "DevOps Dojo – Culture and Mindset"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=63121",
          "author": "Jay Gordon",
          "description": "The top stories from the #AzureDevOps #community for 2021.12.31 are here!\nThe post Top Stories from the Microsoft DevOps Community – 2021.12.31 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-12-31/",
          "publishedOn": "2021-12-31T10:00:41.000Z",
          "wordCount": 1568,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.12.31"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=63015",
          "author": "Jay Gordon",
          "description": "The top stories from the #AzureDevOps #community for 2021.12.17 are here!\nThe post Top Stories from the Microsoft DevOps Community – 2021.12.17 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-12-17/",
          "publishedOn": "2021-12-17T11:00:06.000Z",
          "wordCount": 1657,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.12.17"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62998",
          "author": "Gloridel Morales",
          "description": "This month, we are releasing fixes that impact our self-hosted product, Azure DevOps Server.\nFix work item macro for queries with “Contains Words”. Previously, queries were returning incorrect results for values that contained a line break.\nThe post December patches for Azure DevOps Server appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/december-patches-for-azure-devops-server/",
          "publishedOn": "2021-12-15T18:37:40.000Z",
          "wordCount": 2811,
          "title": "December patches for Azure DevOps Server"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62991",
          "author": "Gloridel Morales",
          "description": "For the most part, Azure DevOps (and Azure DevOps Server) are built on .NET and do not use the Apache log4j library whose vulnerabilities (CVE-2021-44228, CVE-2021-45046, Microsoft security blog post) have been the focus of so much recent attention. The Search feature in both Azure DevOps and Azure DevOps Server does use this library,\nThe post Azure DevOps (and Azure DevOps Server) and the log4j vulnerability appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azure-devops-and-azure-devops-server-and-the-log4j-vulnerability/",
          "publishedOn": "2021-12-15T02:11:40.000Z",
          "wordCount": 1778,
          "title": "Azure DevOps (and Azure DevOps Server) and the log4j vulnerability"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62942",
          "author": "Jay Gordon",
          "description": "Recently, I did a live streaming session for the New York City Microsoft Reactor in which I took concepts from the Quickstart: Deploy Bicep files by using GitHub Actions doc and put them into action.  In this session I create an Azure Kubernetes (AKS) cluster with secrets from Azure Key Vault with Bicep and GitHub Actions.\nThe post Deploy Bicep files by using GitHub Actions appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/deploy-bicep-files-by-using-github-actions/",
          "publishedOn": "2021-12-13T11:00:43.000Z",
          "wordCount": 1979,
          "title": "Deploy Bicep files by using GitHub Actions"
        }
      ]
    },
    {
      "title": "Discover Dev",
      "feedUrl": "https://www.discoverdev.io/rss.xml",
      "siteUrl": "http://discoverdev.io",
      "articles": [
        {
          "id": "http://discoverdev.io/archive/2022-01-07.html",
          "author": null,
          "description": "Shops on Facebook and Instagram: Understanding relationships between products to improve buyer and seller experience \n \n          \n            \n General and Scalable Parallelization for Neural Networks \n \n          \n            \n Video: Understanding Queuing Theory and Software Performance \n \n          \n            \n Snaring the Bad Folks \n \n          \n            \n Deep Learning vs Machine Learning Challenger Models for Default Risk with Explainability",
          "link": "http://discoverdev.io/archive/2022-01-07.html",
          "publishedOn": "2022-01-07T00:00:00.000Z",
          "wordCount": 89,
          "title": "DiscoverDev - curated engineering articles for Fri, 07 Jan 2022"
        }
      ]
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "http://feeds.feedburner.com/AmazonWebServicesBlog",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "a25768b407b6c7537fa13a1b030520c8673d316b",
          "author": "Sébastien Stormacq",
          "description": "Starting today, you can deploy applications that use IPv6 address space on Amazon Elastic Kubernetes Service (EKS). Many of our customers are standardizing Kubernetes as their compute infrastructure platform for cloud and on-premises applications. Amazon EKS makes it easy to deploy containerized workloads. It provides highly available clusters and automates tasks such as patching, node […]",
          "link": "https://aws.amazon.com/blogs/aws/amazon-elastic-kubernetes-service-adds-ipv6-networking/",
          "publishedOn": "2022-01-06T17:36:40.000Z",
          "wordCount": 1976,
          "title": "Amazon Elastic Kubernetes Service Adds IPv6 Networking"
        },
        {
          "id": "f2939be25b70e1866f8b4c262cdd3a095b2fe38c",
          "author": "Jeff Barr",
          "description": "The AWS Region in Jakarta, Indonesia, is now open and you can start using it today. The official name is Asia Pacific (Jakarta) and the API name is ap-southeast-3. The AWS Asia Pacific (Jakarta) Region is the tenth active AWS Region in Asia Pacific and mainland China along with Beijing, Hong Kong, Mumbai, Ningxia, Osaka, […]",
          "link": "https://aws.amazon.com/blogs/aws/now-open-aws-asia-pacific-jakarta-region/",
          "publishedOn": "2021-12-14T05:31:17.000Z",
          "wordCount": 1551,
          "title": "Now Open – AWS Asia Pacific (Jakarta) Region"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/atom.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2565/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/latency.png\" title=\"Each SCAPDFATIAT point increases the chance that the process will involve the phrase 'by the next business day.'\" alt=\"Each SCAPDFATIAT point increases the chance that the process will involve the phrase 'by the next business day.'\" />",
          "link": "https://xkcd.com/2565/",
          "publishedOn": "2022-01-07T00:00:00.000Z",
          "wordCount": 190,
          "title": "Latency"
        },
        {
          "id": "https://xkcd.com/2564/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/sunshield.png\" title=\"RIP the surface of Mars\" alt=\"RIP the surface of Mars\" />",
          "link": "https://xkcd.com/2564/",
          "publishedOn": "2022-01-05T00:00:00.000Z",
          "wordCount": 190,
          "title": "Sunshield"
        },
        {
          "id": "https://xkcd.com/2563/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/throat_and_nasal_passages.png\" title=\"I always felt like what the 'you are now aware of your tongue' thing needed in order to be truly enjoyable was an element of mortal peril.\" alt=\"I always felt like what the 'you are now aware of your tongue' thing needed in order to be truly enjoyable was an element of mortal peril.\" />",
          "link": "https://xkcd.com/2563/",
          "publishedOn": "2022-01-03T00:00:00.000Z",
          "wordCount": 196,
          "title": "Throat and Nasal Passages"
        },
        {
          "id": "https://xkcd.com/2562/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/formatting_meeting.png\" title=\"Neither group uses iso 8601 because the big-endian enthusiasts were all at the meeting 20 years ago.\" alt=\"Neither group uses iso 8601 because the big-endian enthusiasts were all at the meeting 20 years ago.\" />",
          "link": "https://xkcd.com/2562/",
          "publishedOn": "2021-12-31T00:00:00.000Z",
          "wordCount": 192,
          "title": "Formatting Meeting"
        }
      ]
    },
    {
      "title": "Camunda",
      "feedUrl": "https://camunda.com/feed/",
      "siteUrl": "https://camunda.com",
      "articles": [
        {
          "id": "https://camunda.com/?p=40270",
          "author": "Christian Connors",
          "description": "Learn how BuyBay worked with Camunda to enable more efficient operations of the reselling journey and automate key decision-making tasks.  \nThe post Reselling Made Easy: BuyBay Automates E-commerce Process with Camunda appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/01/reselling-made-easy-buybay-automates-e-commerce-process-with-camunda/",
          "publishedOn": "2022-01-06T14:30:00.000Z",
          "wordCount": 2124,
          "title": "Reselling Made Easy: BuyBay Automates E-commerce Process with Camunda"
        },
        {
          "id": "https://camunda.com/?p=40145",
          "author": "Bryan Grover",
          "description": "Do you have a truly innovative enterprise? Explore what exactly a legacy mindset is, and how to overcome one in your organization.\nThe post How to Overcome a Legacy Mindset appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/01/how-to-overcome-a-legacy-mindset/",
          "publishedOn": "2022-01-04T14:30:00.000Z",
          "wordCount": 2217,
          "title": "How to Overcome a Legacy Mindset"
        },
        {
          "id": "https://camunda.com/?p=15696",
          "author": "Amy Johnston",
          "description": "Explore the tools, technologies and sophistication that go into hyperautomation to evolve your automation strategy.\nThe post Three Things You Should Know About Hyperautomation appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/03/three-things-you-should-know-about-hyperautomation/",
          "publishedOn": "2021-12-30T14:20:00.000Z",
          "wordCount": 1863,
          "title": "Three Things You Should Know About Hyperautomation"
        },
        {
          "id": "https://camunda.com/?p=39244",
          "author": "Bryan Grover",
          "description": "Legacy and homegrown infrastructure aren't keeping pace. Learn the 3 reasons why top enterprises are using automation to reach their goals. \nThe post 3 Reasons Why Top Enterprises Are Automating appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/12/3-reasons-why-top-enterprises-are-automating/",
          "publishedOn": "2021-12-21T14:45:00.000Z",
          "wordCount": 2433,
          "title": "3 Reasons Why Top Enterprises Are Automating"
        },
        {
          "id": "https://camunda.com/?p=38609",
          "author": "Daniel Meyer",
          "description": "Discover why Apendo partnered with Camunda to automate citizen services for several municipalities and counting all over Sweden. \nThe post Building Smarter Cities with Process Automation appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/12/building-smarter-cities-with-process-automation/",
          "publishedOn": "2021-12-15T14:30:00.000Z",
          "wordCount": 1920,
          "title": "Building Smarter Cities with Process Automation"
        },
        {
          "id": "https://camunda.com/?p=38438",
          "author": "Camunda Platform Team",
          "description": "We're pleased to announce the second alpha release of Camunda Platform Runtime 7.17.0. Download Camunda for free or run it with Docker today. \nThe post Camunda Automation Platform 7.17.0-alpha2 Released appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/12/camunda-automation-platform-7170-alpha2-released/",
          "publishedOn": "2021-12-15T02:50:45.000Z",
          "wordCount": 1684,
          "title": "Camunda Automation Platform 7.17.0-alpha2 Released"
        },
        {
          "id": "https://camunda.com/?p=38581",
          "author": "Camunda Optimize Team",
          "description": "We’re excited to announce the release of Camunda Optimize 3.7.0-alpha2. Use your Camunda Enterprise Platform credentials to get started now.\nThe post Camunda Optimize 3.7.0-alpha2 Released appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/12/camunda-optimize-3-7-0-alpha2-released/",
          "publishedOn": "2021-12-14T08:45:00.000Z",
          "wordCount": 2273,
          "title": "Camunda Optimize 3.7.0-alpha2 Released"
        },
        {
          "id": "https://camunda.com/?p=38579",
          "author": "Camunda Cloud Team",
          "description": "We’re excited to announce the release of Camunda Cloud 1.3.0-alpha3. Sign up now to get started with Camunda Cloud 1.3.0-alpha3 right away!\nThe post Camunda Cloud 1.3.0-alpha3 Released appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/12/camunda-cloud-1-3-0-alpha3-released/",
          "publishedOn": "2021-12-14T08:30:00.000Z",
          "wordCount": 1431,
          "title": "Camunda Cloud 1.3.0-alpha3 Released"
        },
        {
          "id": "https://camunda.com/?p=38461",
          "author": "Christian Connors",
          "description": "Learn how the help of our process automation and support, made BT Media and Broadcast fully equipped to adapt for their clients' needs. \nThe post Behind the Scenes: BT Media and Broadcast Builds A Stronger Media Network with Camunda appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/12/behind-the-scenes-bt-media-and-broadcast-builds-a-stronger-media-network-with-camunda/",
          "publishedOn": "2021-12-13T14:15:00.000Z",
          "wordCount": 1958,
          "title": "Behind the Scenes: BT Media and Broadcast Builds A Stronger Media Network with Camunda"
        }
      ]
    },
    {
      "title": "となりのヤングジャンプ（ワンパンマン）",
      "feedUrl": "https://tonarinoyj.jp/rss/series/13932016480028984490",
      "siteUrl": "https://tonarinoyj.jp/episode/13932016480028985383",
      "articles": [
        {
          "id": "tonarino_yj:episode:3269754496666439231",
          "author": "原作/ＯＮＥ/漫画/村田雄介",
          "description": "ワンパンマン",
          "link": "https://tonarinoyj.jp/episode/3269754496666439231",
          "publishedOn": "2021-12-31T15:00:00.000Z",
          "wordCount": 102,
          "title": "[年賀状] ワンパンマン",
          "enclosure": {
            "url": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/3269754496666439231-ef8f086ac68b55b5075bf20179af5de8",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "tonarino_yj:episode:3269754496654874704",
          "author": "原作/ＯＮＥ/漫画/村田雄介",
          "description": "ワンパンマン",
          "link": "https://tonarinoyj.jp/episode/3269754496654874704",
          "publishedOn": "2021-12-17T15:00:00.000Z",
          "wordCount": 102,
          "title": "[第200話] ワンパンマン",
          "enclosure": {
            "url": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/3269754496654874704-9fa3d261b6ef62dc42e03a4a1b159e2e",
            "length": "0",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.com/blog/all.atom",
      "siteUrl": "https://github.blog",
      "articles": [
        {
          "id": "https://github.blog/2022-01-05-github-availability-report-december-2021/",
          "author": null,
          "description": "In December, we experienced no incidents resulting in service downtime to our core services.",
          "link": "https://github.blog/2022-01-05-github-availability-report-december-2021/",
          "publishedOn": "2022-01-05T21:34:45.000Z",
          "wordCount": 238,
          "title": "GitHub Availability Report: December 2021"
        },
        {
          "id": "https://github.blog/2022-01-05-how-the-community-powers-github-advanced-security-with-codeql-queries/",
          "author": null,
          "description": "The GitHub Security Lab’s CodeQL bounty program fuels GitHub Advanced Security with queries written by the open source community.",
          "link": "https://github.blog/2022-01-05-how-the-community-powers-github-advanced-security-with-codeql-queries/",
          "publishedOn": "2022-01-05T18:18:04.000Z",
          "wordCount": 1244,
          "title": "How the community powers GitHub Advanced Security with CodeQL queries"
        },
        {
          "id": "https://github.blog/2021-12-28-githubs-top-10-blog-posts-of-2021/",
          "author": null,
          "description": "As the year winds down, we're highlighting some of the incredible work from GitHub’s engineers, product teams, and security researchers.",
          "link": "https://github.blog/2021-12-28-githubs-top-10-blog-posts-of-2021/",
          "publishedOn": "2021-12-28T17:00:37.000Z",
          "wordCount": 544,
          "title": "GitHub’s top 10 blog posts of 2021"
        },
        {
          "id": "https://github.blog/2021-12-21-how-github-contributed-santa-clara-principles-update/",
          "author": null,
          "description": "GitHub was honored to contribute to the Santa Clara Principles on Transparency and Accountability in Content Moderation 2.0.",
          "link": "https://github.blog/2021-12-21-how-github-contributed-santa-clara-principles-update/",
          "publishedOn": "2021-12-21T17:55:56.000Z",
          "wordCount": 1162,
          "title": "How GitHub contributed to the Santa Clara Principles update"
        },
        {
          "id": "https://github.blog/2021-12-20-how-to-leverage-security-frameworks-and-libraries-for-secure-code/",
          "author": null,
          "description": "In this post, I’ll discuss how to apply OWASP Proactive Control C2: Leverage security frameworks and libraries.",
          "link": "https://github.blog/2021-12-20-how-to-leverage-security-frameworks-and-libraries-for-secure-code/",
          "publishedOn": "2021-12-20T17:47:15.000Z",
          "wordCount": 2196,
          "title": "How to leverage security frameworks and libraries for secure code"
        },
        {
          "id": "https://github.blog/2021-12-17-getting-started-with-github-actions-just-got-easier/",
          "author": null,
          "description": "When you want to create a workflow in the Actions tab of your repository, the recommendations are now based on an analysis of repo content.",
          "link": "https://github.blog/2021-12-17-getting-started-with-github-actions-just-got-easier/",
          "publishedOn": "2021-12-17T17:35:29.000Z",
          "wordCount": 506,
          "title": "Getting started with GitHub Actions just got easier!"
        },
        {
          "id": "https://github.blog/2021-12-16-technical-interviews-via-codespaces/",
          "author": null,
          "description": "Codespaces is a great tool for technical hiring exercises and helps level the playing field for candidates.",
          "link": "https://github.blog/2021-12-16-technical-interviews-via-codespaces/",
          "publishedOn": "2021-12-16T17:59:56.000Z",
          "wordCount": 1066,
          "title": "Technical interviews via Codespaces"
        },
        {
          "id": "https://github.blog/2021-12-16-5-automations-every-developer-should-be-running/",
          "author": null,
          "description": "Looking to avoid security vulnerabilities, buttons that don’t work, slow site speeds, or manually writing release notes? This one's for you.",
          "link": "https://github.blog/2021-12-16-5-automations-every-developer-should-be-running/",
          "publishedOn": "2021-12-16T17:04:20.000Z",
          "wordCount": 1474,
          "title": "5 automations every developer should be running"
        },
        {
          "id": "https://github.blog/2021-12-15-a-brief-history-of-code-search-at-github/",
          "author": null,
          "description": "This blog post tells the story of why we built a new search engine optimized for code.",
          "link": "https://github.blog/2021-12-15-a-brief-history-of-code-search-at-github/",
          "publishedOn": "2021-12-15T18:35:29.000Z",
          "wordCount": 3076,
          "title": "A brief history of code search at GitHub"
        },
        {
          "id": "https://github.blog/2021-12-14-using-githubs-security-features-identify-log4j-exposure-codebase/",
          "author": null,
          "description": "Use GitHub’s security features to assess Apache Log4j exposure and, where possible, mitigate this vulnerability within your GitHub repositories.",
          "link": "https://github.blog/2021-12-14-using-githubs-security-features-identify-log4j-exposure-codebase/",
          "publishedOn": "2021-12-14T19:46:00.000Z",
          "wordCount": 730,
          "title": "Using GitHub’s security features to help identify Log4j exposure in your codebase"
        }
      ]
    },
    {
      "title": "Martin Kleppmann's blog",
      "feedUrl": "https://feeds.feedburner.com/martinkl",
      "siteUrl": "http://martin.kleppmann.com/",
      "articles": [
        {
          "id": "http://martin.kleppmann.com/2022/01/03/future-of-fusion-energy.html",
          "author": "Martin Kleppmann",
          "description": "I give a five-star ⭐️⭐️⭐️⭐️⭐️ rating to the following book: Jason Parisi and Justin Ball. The Future of Fusion Energy. World Scientific, 2019. ISBN 978-1-78634-749-7. Available from Amazon US, Amazon UK, and many other retailers. I came to this book looking for answers to questions such as: Is there still...",
          "link": "http://martin.kleppmann.com/2022/01/03/future-of-fusion-energy.html",
          "publishedOn": "2022-01-03T00:00:00.000Z",
          "wordCount": 955,
          "title": "Book Review: The Future of Fusion Energy"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "http://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "Google AI Blog",
      "feedUrl": "http://feeds.feedburner.com/blogspot/gJZg",
      "siteUrl": "http://ai.googleblog.com/",
      "articles": [
        {
          "id": "http://ai.googleblog.com/2021/12/a-scalable-approach-for-partially-local.html",
          "author": null,
          "description": "Posted by Karan Singhal, Senior Software Engineer, Google Research  \nFederated learning enables users to train a model without sending raw data to a central server, thus avoiding the collection of privacy-sensitive data. Often this is done by learning a single global model for all users, even though the users may differ in their data distributions. For example, users of a mobile keyboard application may collaborate to train a suggestion model but have different preferences for the suggestions. This heterogeneity has motivated algorithms that can personalize a global model for each user.  \n However, in some settings privacy considerations may prohibit learning a fully global model. Consider models with user-specific embeddings, such as matrix factorization models for recommender systems. Tr…",
          "link": "http://ai.googleblog.com/2021/12/a-scalable-approach-for-partially-local.html",
          "publishedOn": "2021-12-16T18:11:00.000Z",
          "wordCount": 2092,
          "title": "A Scalable Approach for Partially Local Federated Learning"
        },
        {
          "id": "http://ai.googleblog.com/2021/12/training-machine-learning-models-more.html",
          "author": null,
          "description": "Posted by Timothy Nguyen1, Research Engineer and Jaehoon Lee, Senior Research Scientist, Google Research  \nFor a machine learning (ML) algorithm to be effective, useful features must be extracted from (often) large amounts of training data. However, this process can be made challenging due to the costs associated with training on such large datasets, both in terms of compute requirements and wall clock time. The idea of distillation plays an important role in these situations by reducing the resources required for the model to be effective. The most widely known form of distillation is model distillation (a.k.a. knowledge distillation), where the predictions of large, complex teacher models are distilled into smaller models.  \n An alternative option to this model-space approach is dataset …",
          "link": "http://ai.googleblog.com/2021/12/training-machine-learning-models-more.html",
          "publishedOn": "2021-12-15T19:26:00.000Z",
          "wordCount": 2651,
          "title": "Training Machine Learning Models More Efficiently with Dataset Distillation"
        },
        {
          "id": "http://ai.googleblog.com/2021/12/interpretable-deep-learning-for-time.html",
          "author": null,
          "description": "Posted by Sercan O. Arik, Research Scientist and Tomas Pfister, Engineering Manager, Google Cloud   \nMulti-horizon forecasting, i.e. predicting variables-of-interest at multiple future time steps, is a crucial challenge in time series machine learning. Most real-world datasets have a time component, and forecasting the future can unlock great value. For example, retailers can use future sales to optimize their supply chain and promotions, investment managers are interested in forecasting the future prices of financial assets to maximize their performance, and healthcare institutions can use the number of future patient admissions to have sufficient personnel and equipment. \n  \nDeep neural networks (DNNs) have increasingly been used in multi-horizon forecasting, demonstrating strong perform…",
          "link": "http://ai.googleblog.com/2021/12/interpretable-deep-learning-for-time.html",
          "publishedOn": "2021-12-13T17:22:00.002Z",
          "wordCount": 2548,
          "title": "Interpretable Deep Learning for Time Series Forecasting"
        },
        {
          "id": "http://ai.googleblog.com/2021/12/a-fast-wordpiece-tokenization-system.html",
          "author": null,
          "description": "Posted by Xinying Song, Staff Software Engineer and Denny Zhou, Senior Staff Research Scientist, Google Research   \nTokenization is a fundamental pre-processing step for most natural language processing (NLP) applications. It involves splitting text into smaller units called tokens (e.g., words or word segments) in order to turn an unstructured input string into a sequence of discrete elements that is suitable for a machine learning (ML) model. ln deep learning–based models (e.g., BERT), each token is mapped to an embedding vector to be fed into the model.  \n   \n\n\nTokenization in a typical deep learning model, like BERT.\n\n   \nA fundamental tokenization approach is to break text into words. However, using this approach, words that are not included in the vocabulary are treated as “unknown”.…",
          "link": "http://ai.googleblog.com/2021/12/a-fast-wordpiece-tokenization-system.html",
          "publishedOn": "2021-12-10T20:35:00.001Z",
          "wordCount": 2448,
          "title": "A Fast WordPiece Tokenization System"
        }
      ]
    },
    {
      "title": "Seth Godin's Blog on marketing, tribes and respect",
      "feedUrl": "https://feeds.feedblitz.com/sethsblog",
      "siteUrl": "https://seths.blog",
      "articles": [
        {
          "id": "https://seths.blog/?p=42130",
          "author": "Seth Godin",
          "description": "The phone is ringing. Your ice cream is melting. Next month’s rent is due. There’s a useful workshop coming up in a few months. Your hard drive will fail before the end of the year. College tuition will need to start being paid in five years. Your back tooth is going to need a crown […]",
          "link": "https://feeds.feedblitz.com/~/677412154/0/sethsblog~Coming-soon/",
          "publishedOn": "2022-01-08T09:35:00.000Z",
          "wordCount": 375,
          "title": "Coming soon"
        },
        {
          "id": "https://seths.blog/?p=40112",
          "author": "Seth Godin",
          "description": "Technology is not neutral. It can’t be, because by definition, advances in tech create change, and change always creates positives and negatives. We now live in a time of rapid technological change, perhaps the biggest in 150 years. In the face of the overwhelming impact of tech, we might not be enjoying the ride. Sometimes […]",
          "link": "https://feeds.feedblitz.com/~/677314222/0/sethsblog~Progress/",
          "publishedOn": "2022-01-07T09:15:00.000Z",
          "wordCount": 304,
          "title": "Progress"
        },
        {
          "id": "https://seths.blog/?p=42108",
          "author": "Seth Godin",
          "description": "This is not the same as being creative. In fact, they’re very different skills and emotional mindsets. All humans are creative. Sometimes. Creativity is a special sort of internal conversation, an opportunity to see a problem or a situation and then produce something that dances with it. But shipping creative work is a cultural and […]",
          "link": "https://feeds.feedblitz.com/~/677216346/0/sethsblog~Shipping-creative-work/",
          "publishedOn": "2022-01-06T09:46:00.000Z",
          "wordCount": 267,
          "title": "Shipping creative work"
        },
        {
          "id": "https://seths.blog/?p=41203",
          "author": "Seth Godin",
          "description": "Laser guns don’t make noise. At least in real life. In the movies, they always do. Phasers and ray guns and light sabers all manage to make distinctive sounds. And we don’t mind. In fact, we expect them to. The foley artist works overtime to create sounds that amplify our experience and fill in the […]",
          "link": "https://feeds.feedblitz.com/~/677120776/0/sethsblog~Laser-noise/",
          "publishedOn": "2022-01-05T10:10:00.000Z",
          "wordCount": 204,
          "title": "Laser noise"
        },
        {
          "id": "https://seths.blog/?p=41190",
          "author": "Seth Godin",
          "description": "The problem with becoming defensive is that our internal narrative gets in the way of expressing what’s actually going on. Because we’re imagining all the blame and shame and scorn that the other person may or may not be feeling toward us, we bring those feelings into our words and actions, and end up making […]",
          "link": "https://feeds.feedblitz.com/~/677033124/0/sethsblog~Defensiveoffensiveactual/",
          "publishedOn": "2022-01-04T09:51:00.000Z",
          "wordCount": 234,
          "title": "Defensive/offensive/actual"
        },
        {
          "id": "https://seths.blog/?p=42101",
          "author": "Seth Godin",
          "description": "Some people say “hobby” like it’s a bad thing. In a race for more, it seems as though doing something you don’t get paid for, something that requires patience and skill–well, some people don’t get it. They’d rather troll around on social media or watch a rerun. A generation or two ago, hobbies were things […]",
          "link": "https://feeds.feedblitz.com/~/676948040/0/sethsblog~Generative-hobbies/",
          "publishedOn": "2022-01-03T09:12:00.000Z",
          "wordCount": 404,
          "title": "Generative hobbies"
        },
        {
          "id": "https://seths.blog/?p=41196",
          "author": "Seth Godin",
          "description": "That’s why it’s worth so much. Sure, you can outsource. You can look for shortcuts. You can hire folks. You can use mailmerge. You can even send it to voice mail. But all of these time shortcuts fail to express the thing we want the most. Your time, my time, their time–we all get the […]",
          "link": "https://feeds.feedblitz.com/~/676848906/0/sethsblog~Time-doesnt-scale/",
          "publishedOn": "2022-01-02T09:09:00.000Z",
          "wordCount": 203,
          "title": "Time doesn’t scale"
        },
        {
          "id": "https://seths.blog/?p=41173",
          "author": "Seth Godin",
          "description": "There’s a better cause right around the corner. It might not work. You’ll never be able to keep all the promises. It can’t last forever. We’re all going to die. It’s not perfect. Someone might steal your idea. There will be critics. You’re not ready. Someone else is going to do it. It’s not that […]",
          "link": "https://feeds.feedblitz.com/~/676738156/0/sethsblog~Might-as-well-quit/",
          "publishedOn": "2022-01-01T09:13:00.000Z",
          "wordCount": 227,
          "title": "Might as well quit"
        },
        {
          "id": "https://seths.blog/?p=42094",
          "author": "Seth Godin",
          "description": "If you’re feeling creative, do the errands tomorrow. If you’re fit and healthy, take a day to go surfing. When inspiration strikes, write it down. The calendar belongs to everyone else. Their schedule isn’t your schedule unless it helps you get where you’re going.",
          "link": "https://feeds.feedblitz.com/~/676661664/0/sethsblog~Dont-waste-the-good-days/",
          "publishedOn": "2021-12-31T10:34:00.000Z",
          "wordCount": 181,
          "title": "Don’t waste the good days"
        },
        {
          "id": "https://seths.blog/?p=41013",
          "author": "Seth Godin",
          "description": "So many missed opportunities. Decisions not made, errors in judgment, opportunities lost. Perhaps you didn’t buy Google stock at $80, didn’t buy ETH at $5, didn’t buy that winning lottery ticket… You also didn’t take that course in college, or go out of your way to meet that person on campus or learn Spanish when […]",
          "link": "https://feeds.feedblitz.com/~/676562214/0/sethsblog~Which-errors-to-focus-on/",
          "publishedOn": "2021-12-30T10:01:00.000Z",
          "wordCount": 363,
          "title": "Which errors to focus on?"
        }
      ]
    }
  ],
  "cliVersion": "1.11.3"
}