{
  "sources": [
    {
      "title": "Spring",
      "feedUrl": "https://spring.io/blog.atom",
      "siteUrl": "https://spring.io/blog",
      "articles": [
        {
          "id": "https://spring.io/blog/2021/09/09/a-bootiful-podcast-spring-security-engineer-josh-cummings",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuman) talks about pumpkin spice lattes, COVID, labor day, and then gets to talk to Spring Security engineer Josh Cummings (@jzheaux)",
          "link": "https://spring.io/blog/2021/09/09/a-bootiful-podcast-spring-security-engineer-josh-cummings",
          "publishedOn": "2021-09-09T19:00:00.000Z",
          "wordCount": 410,
          "title": "A Bootiful Podcast: Spring Security Engineer Josh Cummings"
        },
        {
          "id": "https://spring.io/blog/2021/09/09/spring-data-jdbc-how-to-use-custom-id-generation",
          "author": null,
          "description": "This is the first article of a series about how to tackle various challenges you might encounter when using Spring Data JDBC.\n\r\n\r\n\r\nIf you are new to Spring Data JDBC, you should start by reading its introduction and this article, which explains the relevance of aggregates in the context of Spring Data JDBC. Trust me, it is important.\n\r\n\r\n\r\nThis article is based on part of a talk I did at Spring One 2021.\n\r\n\r\n\r\nNow we can get started with IDs - especially about what your options are when you want to control the ID of an entity and do not want to leave it to the database.\r\nBut let us first reiterate Spring Data JDBC’s default strategy for this.\n\r\n\r\n\r\nBy default, Spring Data JDBC assumes that IDs get generated by some kind of SERIAL, IDENTITY, or AUTOINCREMENT column.\r\nIt basically checks wh…",
          "link": "https://spring.io/blog/2021/09/09/spring-data-jdbc-how-to-use-custom-id-generation",
          "publishedOn": "2021-09-09T18:00:00.000Z",
          "wordCount": 1510,
          "title": "Spring Data JDBC - How to use custom ID generation"
        },
        {
          "id": "https://spring.io/blog/2021/09/07/this-week-in-spring-september-7th-2021",
          "author": null,
          "description": "Hi, Spring fans! I am still reeling from the craziness of last week’s SpringOne event! That doesn’t mean that the world’s stood still in the interim though! Quite the contrary! There’s a ton of things to get to this week so without further ado let’s go! \n\r\n\r\n  \nIn last week’s, A Bootiful Podcast, I briefly recap some of the excitement from SpringOne 2021 and then talked Jackson and Woodstox creator Tatu Saloranta\n\r\n  \nI loved Spring Framework lead Juergen Hoeller’s post A Java 17 and Jakarta EE 9 baseline for Spring Framework 6\n\r\n  \nAnnouncing Spring Data YugabyteDB - The Distributed SQL Blog\n\r\n  \nAnnouncing VMware Tanzu Application Platform: A Better Developer Experience on any Kubernetes\n\r\n  \nCheck out the SpringOne 2021 keynotes\n\r\n  \nSpeaking of SpringOne, I loved this silly moment in one of the talks from Jetbrains’ Hadi Hariri: Spring is not Spring without @starbuxman - LOL!\n\r\n  \nJonas Hecht’s article, Goodbye Dockerfile, looking at Cloud Native Buildpacks and Spring Boot, is featured in the summer edition of iXmagazin, a German language developer journal\n\r\n  \nKuassi Mensah has announced the latest official release of the R2DBC driver for Oracle database\n\r\n  \nMaciej Walkowiak lists some good choices for people who want options for feature toggles\n\r\n  \nMonitor Spring Boot applications end-to-end using Dynatrace in Azure Spring Cloud!\n\r\n  \nPiotr Mińkowski points the community to this interesting Spring Boot integration for Testcontainers that provides auto-configurations for Spring Boot-based integration tests\n\r\n  \nSpring Boot, Spring Security, JWT, React, and Ant Design - Polling App | GitHub\n\r\n  \nSpring GraphQL 1.0.0-M2 available now\n\r\n  \nSpringOne 2021: Day 2 Recap and Breakout Session Highlights\n\r\n  \nThe State of Spring 2021\n\r\n  \nVMware Tanzu Adds Enterprise Support for Spring Boot Native Applications Compiled with BellSoft Liberica NIK\n\r\n  \nVMware’s new Tanzu platform aims to unify Kubernetes development",
          "link": "https://spring.io/blog/2021/09/07/this-week-in-spring-september-7th-2021",
          "publishedOn": "2021-09-07T10:00:00.000Z",
          "wordCount": 668,
          "title": "This Week in Spring - September 7th, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/09/02/a-bootiful-podcast-springone-2021-and-jackson-and-woodstox-creator-tatu-saloranta",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman ) breathlessly recaps some of the exciting news from the just-finished SpringOne 2021 event and then talks to Jackson and Woodstox creator Tatu Saloranta (@cowtowncoder)",
          "link": "https://spring.io/blog/2021/09/02/a-bootiful-podcast-springone-2021-and-jackson-and-woodstox-creator-tatu-saloranta",
          "publishedOn": "2021-09-02T23:00:00.000Z",
          "wordCount": 423,
          "title": "A Bootiful Podcast: SpringOne 2021 and Jackson and Woodstox creator Tatu Saloranta"
        },
        {
          "id": "https://spring.io/blog/2021/09/02/a-java-17-and-jakarta-ee-9-baseline-for-spring-framework-6",
          "author": null,
          "description": "As announced at SpringOne yesterday, Spring Framework 6 and Spring Boot 3 are planned towards a high-end baseline for their general availability in Q4 2022:\n\r\n\r\n  \nJava 17+ (from Java 8-17 in the Spring Framework 5.3.x line)\n\r\n  \nJakarta EE 9+ (from Java EE 7-8 in the Spring Framework 5.3.x line)\n\r\n\r\nThis forward-looking baseline will provide significant benefits in our API design and integration efforts, shining through to your application code and future-proofing the framework as well as your applications for many years to come. However, it comes at a cost, of course: Spring Framework 6 and Spring Boot 3 based applications will require a minimum of JDK 17 at runtime, as well as a minimum of Tomcat 10 / Jetty 11 (for Jakarta EE 9 compatibility). Even more importantly, there might be some …",
          "link": "https://spring.io/blog/2021/09/02/a-java-17-and-jakarta-ee-9-baseline-for-spring-framework-6",
          "publishedOn": "2021-09-02T17:02:00.000Z",
          "wordCount": 1037,
          "title": "A Java 17 and Jakarta EE 9 baseline for Spring Framework 6"
        },
        {
          "id": "https://spring.io/blog/2021/09/01/monitor-spring-boot-applications-end-to-end-using-dynatrace-in-azure-spring-cloud",
          "author": null,
          "description": "Today, we are excited to announce the integration of the Dynatrace Software Intelligence Platform in Azure Spring Cloud.\n\r\nOver the past 18 months, we worked with many enterprise customers to learn about the scenarios they face. Many of these customers have thousands of Spring Boot applications running in on-premises data centers. As they migrate these applications to the cloud, they need to instrument them for application performance monitoring (APM) using solutions their developers are familiar with and have been using for years. In addition, they must ensure continuity for desktop and mobile applications that are already pre-instrumented for end-to-end monitoring using agents like Dynatrace OneAgent, which automatically discovers and maps all applications, microservices, and infrastruct…",
          "link": "https://spring.io/blog/2021/09/01/monitor-spring-boot-applications-end-to-end-using-dynatrace-in-azure-spring-cloud",
          "publishedOn": "2021-09-01T16:00:00.000Z",
          "wordCount": 1899,
          "title": "Monitor Spring Boot applications end-to-end using Dynatrace in Azure Spring Cloud!"
        },
        {
          "id": "https://spring.io/blog/2021/09/01/spring-graphql-1-0-0-m2-available-now",
          "author": null,
          "description": "Less than 2 months after the initial announcement of Spring GraphQL and its follow up intro blog,\nI’m happy to announce that the 1.0.0-M2 version has been released and is available from the Spring Milestone repository.\n\r\nThe Spring GraphQL team would like to thank the early adopters and contributors - with your help, we’re making good progress towards a GA version!\n\r\nWe’ve fixed a few issues and renamed a couple of concepts, but the most notable change is the introduction of a new annotation model for GraphQL Controllers.\nYou can now annotate @Controller components to handle queries, mutations and subscriptions:\n\r\n@Controller\r\r\npublic class GreetingController {\r\r\n\r\r\n        @QueryMapping \r\r\n        public String hello() { \r\r\n            return \"Hello, world!\";\r\r\n        }\r\r\n\r\r\n}\r\n\n\r\nThis is a new feature and we can’t wait to hear your feedback - please give it a try and let us know what you think!\nSpring GraphQL at SpringOne!\n\r\nDon’t miss the Spring GraphQL presentation at SpringOne today!\nThis will give a nice intro to this new Spring project and you’ll get a chance to chat with the team, live and on the dedicated SpringOne Slack.\nHow can you help?\n\r\nIf you’re interested in helping out, you can get started with Spring GraphQL and raise issues on our GitHub project.\nIf you have general questions, please ask on stackoverflow.com using the spring-graphql tag.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow",
          "link": "https://spring.io/blog/2021/09/01/spring-graphql-1-0-0-m2-available-now",
          "publishedOn": "2021-09-01T08:20:00.000Z",
          "wordCount": 599,
          "title": "Spring GraphQL 1.0.0-M2 available now"
        },
        {
          "id": "https://spring.io/blog/2021/08/31/this-week-in-spring-august-31st-2021",
          "author": null,
          "description": "Hi, Spring fans! Can you believe it? SpringOne 2021 kicks off in less than 24 hours! Have you registered? It’s free and it’s virtual, but the talks are live and there’ll be ample opportunity to talk to the Spring and Tanzu teams behinds the scenes. And, of course, I’ll be there. Also, don’t miss tomorrow mornings opening keynote, which I’ll be emceeing. And please don’t miss my session on Azure Spring Cloud with Julien Dubois and Layla Porter. There are a ton of great talks over the next two days. Do not miss these! Alrigty my friends, we’ve got a ton of stuff to review so without further ado, let’s dive right in! \n\r\n\r\n  \nHi, Spring fans! In the last week’s installment of Bootiful Podcast, I talked to Richard North and Sergei Egorov on Testcontainers, their new company AtomicJar, and more\n\r\n  \nGet hands-on with Azure Spring Cloud in 90 minutes. Register today - space is limited! Brought to you by Microsoft and VMware\n\r\n  \nAre you ready to rapidly deploy and scale Spring Boot apps to Azure Spring Cloud? Register today!\n\r\n  \nThis video seems like it’ll be worth a watch if you’re trying to learn Spring Boot\n\r\n  \nHere’s an interesting video that looks at streaming with the reactive Spring Webflux\n\r\n  \nThis looks interesting: a video from Manning Publications on building and securing web applications with Spring Boot\n\r\n  \nHave you seen the Spring.io Community page? It’s a great place to find out about some of the external resources and portals in the wider community.\n\r\n  \nInstana has updated their documentation on how to monitor Spring Boot applications with their suite\n\r\n  \nThe Baeldung article on embedding the Keycloak authorization and authentication server in a Spring  Boot application has been updated.\n\r\n  \nThe Baeldung article on the fundamentals of dependency injection in Spring has also been updated",
          "link": "https://spring.io/blog/2021/08/31/this-week-in-spring-august-31st-2021",
          "publishedOn": "2021-09-01T02:00:00.000Z",
          "wordCount": 681,
          "title": "This Week in Spring - August 31st, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/08/26/bootiful-podcast-richard-north-and-sergei-egorov-on-testcontainers-their-new-company-atomicjar-and-more",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring! In this installment, Josh Long talks to Richard North (@whichrich) and Sergei Egorov (@bsideup) about Testcontainers, their new company AtomicJar, and software licensing, among other things.",
          "link": "https://spring.io/blog/2021/08/26/bootiful-podcast-richard-north-and-sergei-egorov-on-testcontainers-their-new-company-atomicjar-and-more",
          "publishedOn": "2021-08-26T11:00:00.000Z",
          "wordCount": 435,
          "title": "Bootiful Podcast - Richard North and Sergei Egorov on Testcontainers, their new company AtomicJar, and more"
        },
        {
          "id": "https://spring.io/blog/2021/08/24/this-week-in-spring-august-24th-2021",
          "author": null,
          "description": "Hi, Spring fans, and welcome to another riveting roundup of all the news that’s fit to reprint in the Java and Spring ecosystems, with apologies, as always, to The Times. We’re a week away from SpringOne 2021, our annual, free, and utterly online tentpole conference featuring hundreds of hours of amazing technical content from speakers all around the world and tens of thousands of attendees with whom to partake in the festivities. Do not miss this! I’ll be there! \n\r\nI get so excited in the leadup to SpringOne each year, and this year doubly so! First, there’s the usual monumental scope of the whole thing, which always gets me. I also just got my first (of hopefully many) negative COVID-19 tests a few days ago, after three weeks of convalescence. Huzzah! I’m still taking it easy, trying to …",
          "link": "https://spring.io/blog/2021/08/24/this-week-in-spring-august-24th-2021",
          "publishedOn": "2021-08-24T07:00:00.000Z",
          "wordCount": 828,
          "title": "This Week in Spring - August 24th, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/08/22/structuring-your-code-for-spring-framework-and-spring-boot",
          "author": null,
          "description": "or: How To Build a Mental Framework for Spring Framework\n\r\nEDIT: There’s a great comment below that mentions that the original title, Structuring Spring Boot Applications, is a bit misleading, in that the blog doesn’t intend to talk about how to organize types and packages, and instead thinks about how Spring interacts with the objects in your code. The next paragraph sought to clarify that point but apparently fell short. Anyway, I’ve changed it, which unfortunately will break earlier links to it. I’m sorry for both the poor title and the now two days of broken links. I hope it’s useful for everyone, even if I clearly could’ve done a better job with the title… \n\r\nIt’s hard to think about structuring applications. There’s a lot to think about at the higher level - is it a batch job, a web …",
          "link": "https://spring.io/blog/2021/08/22/structuring-your-code-for-spring-framework-and-spring-boot",
          "publishedOn": "2021-08-23T05:02:00.000Z",
          "wordCount": 1840,
          "title": "Structuring Your Code for Spring Framework and Spring Boot"
        },
        {
          "id": "https://spring.io/blog/2021/08/19/spring-boot-2-6-0-m2-is-now-available",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.6.0-M2 has been released and is now available from https://repo.spring.io/milestone.\n\r\nThis release includes more than a 100 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/08/19/spring-boot-2-6-0-m2-is-now-available",
          "publishedOn": "2021-08-19T18:00:39.000Z",
          "wordCount": 484,
          "title": "Spring Boot 2.6.0-M2 is now available"
        },
        {
          "id": "https://spring.io/blog/2021/08/19/spring-boot-2-5-4-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.5.4 has been released and is now available from Maven Central.\n\r\nThis release includes 35 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/08/19/spring-boot-2-5-4-available-now",
          "publishedOn": "2021-08-19T13:12:05.000Z",
          "wordCount": 480,
          "title": "Spring Boot 2.5.4 available now"
        },
        {
          "id": "https://spring.io/blog/2021/08/19/a-bootiful-podcast-microsoft-azure-engineering-manager-rome-li-on-his-work-supporting-microsoft-azure-in-intellij-visual-studio-maven-eclipse-and-visual-studio-code",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks to Microsoft’s Rome Li (@akalirong) on his work supporting Microsoft Azure from IntelliJ, Visual Studio, Maven, Eclipse, and Visual Studio Code.",
          "link": "https://spring.io/blog/2021/08/19/a-bootiful-podcast-microsoft-azure-engineering-manager-rome-li-on-his-work-supporting-microsoft-azure-in-intellij-visual-studio-maven-eclipse-and-visual-studio-code",
          "publishedOn": "2021-08-19T12:00:00.000Z",
          "wordCount": 446,
          "title": "A Bootiful Podcast: Microsoft Azure engineering manager Rome Li on his work supporting Microsoft Azure in IntelliJ, Visual Studio, Maven, Eclipse, and Visual Studio Code"
        },
        {
          "id": "https://spring.io/blog/2021/08/19/spring-boot-2-4-10-is-now-available",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.4.10 has been released and is now available from Maven Central.\n\r\nThis release includes 29 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/08/19/spring-boot-2-4-10-is-now-available",
          "publishedOn": "2021-08-19T11:06:27.000Z",
          "wordCount": 482,
          "title": "Spring Boot 2.4.10 is now available"
        },
        {
          "id": "https://spring.io/blog/2021/08/19/spring-authorization-server-goes-to-production",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, it is my great pleasure to announce the general availability of Spring Authorization Server 0.2.0.\n\r\n\r\n\r\nThis release is the first officially supported production-ready version backed by our new support policy.\n\r\n\r\n\r\nYou can download it from Maven Central by using the module coordinates:\n\r\n\r\n\r\n\r\ncompile 'org.springframework.security:spring-security-oauth2-authorization-server:0.2.0'\n\r\n\r\n\r\n\r\nSee the release notes for complete details.\n\r\n\r\n\r\nFor additional details on this project, see the latest and initial announcement and the project page.\n\r\n\r\n\r\nTo get started using Spring Authorization Server, see the sample to become familiar with setup and configuration.\n\r\n\r\n\r\nWe would love to gather your feedback as we strive to improve and build upon this release.\n\r\n\r\n\r\nProject Page | GitHub Issues |  ZenHub Board",
          "link": "https://spring.io/blog/2021/08/19/spring-authorization-server-goes-to-production",
          "publishedOn": "2021-08-19T08:00:00.000Z",
          "wordCount": 498,
          "title": "Spring Authorization Server goes to production !"
        },
        {
          "id": "https://spring.io/blog/2021/08/18/spring-tools-4-11-1-released",
          "author": null,
          "description": "ear Spring Community,\n\r\nI am happy to announce the 4.11.1 release of the Spring Tools 4 for Eclipse, Visual Studio Code, and Theia.\nFixes in this release\n\r\n\r\n  \n(VS Code, Spring Boot) fixed: [codespaces] spring boot extension starting up multiple times in Codespaces setting (#669)\n\r\n  \n(VS Code, Spring Boot) fixed: [codespaces] spring boot extension doesn’t find the right JDK when connecting to a codespace (#670)\n\r\n  \n(VS Code, Spring Boot) fixed: JAVA_Home should be right but still shows “Note Java 8 can still be used in your own projects” (#664)\n\r\n  \n(Eclipse) improvement: progress view shows many AsyncLiveExpression refresh messages and doesn’t respond anymore (#653)\n\r\n  \n(Eclipse) improvement: latest CI builds do not show port of running app anymore (#659)\n\r\n  \n(Concourse) improvement: Property ‘commit_message’ not recognized for semver resources (#655)\n\r\n  \n(Concourse) improvement: GitResource schema, add missing properties (#671)\n\r\n  \n(Concourse) improvement: Unknown property ‘fetch_tags’ for type ‘GitSource’(YamlSchemaProblem) (#668)\n\r\n\r\nTo download the distribution for Eclipse and find links to the marketplace entries for Visual Studio Code and Theia, please go visit:\n\r\n\r\n  \nSpring Tools 4: https://spring.io/tools/\n\r\n\r\nSpring Tools 4.12.0 is scheduled to be released in late September 2021.\n\r\nEnjoy!",
          "link": "https://spring.io/blog/2021/08/18/spring-tools-4-11-1-released",
          "publishedOn": "2021-08-18T11:44:09.000Z",
          "wordCount": 554,
          "title": "Spring Tools 4.11.1 released"
        },
        {
          "id": "https://spring.io/blog/2021/08/17/this-week-in-spring-august-17th-2021",
          "author": null,
          "description": "Hi, Spring fans! How’re you doing? I’m alright. I’ve been recuperating from a COVID-19 infection. Today was the first day in a while that I woke up and wasn’t short of breath. Most days, I’ve woken up, hacked a few wads of phlegm into the toilet, and then my breathing was fine. But today I woke up and wasn’t short of breath in the first place. (I still hacked a few wads of phlegm). Thank goodness for vaccines, or I expect my experience of this virus would’ve been much worse as a lifelong asthmatic. Things are looking up! \n\r\nAnd then, as if my fortunes couldn’t get any better, I got to compiling this week’s roundup and there’s a ton of great stuff in it so let’s dive right in!\n\r\n\r\n  \nGet started with Spring Boot and the CQRS framework Axon\n\r\n  \nIn last week’s installment of A Bootiful Podcast: Neo4J CEO and Spring Data cofounder Emil Eifrem on graphs, Neo4J, and more\n\r\n  \nAlexa Request Validation with Spring Cloud Gateway\n\r\n  \nFree Java & OpenJDK Info for Daily Java Usage\n\r\n  \nSpring Authorization Server officially moves to spring-projects\n\r\n  \nSpring Data 2021.0.4 and 2020.0.12 released\n\r\n  \nSpring Data 2021.1.0-M2 released\n\r\n  \nSpring WebClient with Feign\n\r\n  \nGet hands-on with Azure Spring Cloud in 90 minutes.\n\r\n  \nDid you see Cora Iberkleid’s power session on Spring Cloud Gateway? It was awesome!",
          "link": "https://spring.io/blog/2021/08/17/this-week-in-spring-august-17th-2021",
          "publishedOn": "2021-08-17T10:00:00.000Z",
          "wordCount": 601,
          "title": "This Week in Spring - August 17th, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/08/17/spring-authorization-server-officially-moves-to-spring-projects",
          "author": null,
          "description": "We are very excited to announce that Spring Authorization Server has officially moved out of experimental status and into the Spring project’s portfolio!\n\r\n\r\n\r\nThis move coincides with this week’s 0.2.0 release, which is the first officially supported production-ready version backed by our new support policy.\n\r\n\r\n\r\nSince announcing the Spring Authorization Server in April 2020, the implemented features provide support for a large portion of the OAuth 2.1 Authorization Framework and modest support for OpenID Connect 1.0. However, as we move onto the next phase of development, our focus changes to advancing the support for OpenID Connect 1.0.\n\r\n\r\n\r\nOn behalf of the team, I would like to thank everyone who has contributed and helped grow this project in this short time frame. We are confident in the base that we have built so far and are excited for the next phase of the project. We look forward to continuing this work together and ultimately making Spring Authorization Server the de facto framework for OAuth 2 Authorization Server support on the Java platform.\n\r\n\r\n\r\nLet’s get moving onto the next phase!",
          "link": "https://spring.io/blog/2021/08/17/spring-authorization-server-officially-moves-to-spring-projects",
          "publishedOn": "2021-08-17T10:00:00.000Z",
          "wordCount": 557,
          "title": "Spring Authorization Server officially moves to spring-projects"
        },
        {
          "id": "https://spring.io/blog/2021/08/12/spring-data-2021-1-0-m2-released",
          "author": null,
          "description": "On behalf of the team, I’m pleased to announce the availability of the Spring Data 2021.1.0-M2 milestone release.\n\r\nThe release is built on top of Spring Framework 5.3.9.\nFor your convenience, you can consume this release through Spring Boot 2.6.0-M2, which our team mates on the Boot team will release in about a week.\n\r\nTo round things off, here are the links to the artifacts, changelogs, and documentation:\n\r\n\r\n  \nSpring Data Commons 2.6 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data JDBC 2.3 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data JPA 2.6 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data for Apache Cassandra 3.3 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data KeyValue 2.6 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data Neo4j 6.2 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data MongoDB 3.3 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data for Apache Geode 2.6 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data R2DBC 1.4 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data LDAP 2.6 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data Envers 2.6 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data REST 3.6 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data Redis 2.6 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data Elasticsearch 4.3 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data Couchbase 4.3 M2 - Artifacts - Javadoc - Documentation - Changelog",
          "link": "https://spring.io/blog/2021/08/12/spring-data-2021-1-0-m2-released",
          "publishedOn": "2021-08-12T18:50:35.000Z",
          "wordCount": 639,
          "title": "Spring Data 2021.1.0-M2 released"
        }
      ]
    },
    {
      "title": "HashiCorp Blog",
      "feedUrl": "https://www.hashicorp.com/blog/feed.xml",
      "siteUrl": "https://hashicorp.com/blog",
      "articles": [
        {
          "id": "https://www.hashicorp.com/blog/go-big-or-go-small-building-in-azure-caf-with-terraform-cloud",
          "author": null,
          "description": "Learn about the enterprise scale and Cloud Adoption Framework (CAF)  Terraform modules for Azure adoption, and get a demo of the CAF module.",
          "link": "https://www.hashicorp.com/blog/go-big-or-go-small-building-in-azure-caf-with-terraform-cloud",
          "publishedOn": "2021-09-09T19:00:00.000Z",
          "wordCount": 2012,
          "title": "Go Big or Go Small? Building in Azure CAF with Terraform Cloud"
        },
        {
          "id": "https://www.hashicorp.com/blog/terraform-cloud-run-tasks-beta-now-available",
          "author": null,
          "description": "HashiCorp Terraform Cloud run tasks allow you to integrate third-party tools into the pre-apply stage of a Terraform Cloud run. The feature is now available in beta access.",
          "link": "https://www.hashicorp.com/blog/terraform-cloud-run-tasks-beta-now-available",
          "publishedOn": "2021-09-09T16:00:00.000Z",
          "wordCount": 781,
          "title": "Terraform Cloud Run Tasks Beta Now Available"
        },
        {
          "id": "https://www.hashicorp.com/blog/automate-consul-agent-security-with-auto-config",
          "author": null,
          "description": "Auto-Config is a highly scalable method to distribute secure properties and other configuration settings to all Consul agents in a datacenter.",
          "link": "https://www.hashicorp.com/blog/automate-consul-agent-security-with-auto-config",
          "publishedOn": "2021-09-08T16:00:00.000Z",
          "wordCount": 864,
          "title": "Automate Consul Agent Security with Auto-Config"
        },
        {
          "id": "https://www.hashicorp.com/blog/terraform-community-contributions",
          "author": null,
          "description": "We recently added a note to the HashiCorp Terraform contribution guidelines and this blog provides additional clarity and context for our community and commercial customers.",
          "link": "https://www.hashicorp.com/blog/terraform-community-contributions",
          "publishedOn": "2021-09-07T22:00:00.000Z",
          "wordCount": 815,
          "title": "HashiCorp Terraform and Community Contributions"
        },
        {
          "id": "https://www.hashicorp.com/blog/how-different-industries-deal-with-cloud-and-multi-cloud",
          "author": null,
          "description": "According to the HashiCorp State of Cloud Strategy Survey, software companies and telcos lead in getting value from cloud and multi-cloud, while the public sector lags.",
          "link": "https://www.hashicorp.com/blog/how-different-industries-deal-with-cloud-and-multi-cloud",
          "publishedOn": "2021-09-07T19:30:00.000Z",
          "wordCount": 1932,
          "title": "How Different Industries Deal with Cloud and Multi-Cloud"
        },
        {
          "id": "https://www.hashicorp.com/blog/github-f5-okta-among-new-hcp-vault-integrations",
          "author": null,
          "description": "Several new partners have had their integrations validated for cloud-managed HCP Vault.",
          "link": "https://www.hashicorp.com/blog/github-f5-okta-among-new-hcp-vault-integrations",
          "publishedOn": "2021-09-03T16:00:00.000Z",
          "wordCount": 740,
          "title": "GitHub, F5, and Okta Among New HCP Vault Integrations"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-vault-use-cases-and-best-practices-on-azure",
          "author": null,
          "description": "Learn how Vault can help you build zero trust security on Microsoft Azure with five common use cases and five best practices.",
          "link": "https://www.hashicorp.com/blog/hashicorp-vault-use-cases-and-best-practices-on-azure",
          "publishedOn": "2021-09-02T19:00:00.000Z",
          "wordCount": 1621,
          "title": "HashiCorp Vault Use Cases and Best Practices on Azure"
        },
        {
          "id": "https://www.hashicorp.com/blog/how-organizations-are-thinking-about-multi-cloud-networking",
          "author": null,
          "description": "From maturity to security, take a closer look at the networking and service mesh trends uncovered in the new HashiCorp State of Cloud Strategy Survey.",
          "link": "https://www.hashicorp.com/blog/how-organizations-are-thinking-about-multi-cloud-networking",
          "publishedOn": "2021-09-02T16:00:00.000Z",
          "wordCount": 1412,
          "title": "How Organizations Are Thinking About Multi-Cloud Networking"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-consul-terraform-sync-0-3-for-terraform-enterprise",
          "author": null,
          "description": "Compliance-driven network infrastructure automation with Consul-Terraform-Sync 0.3 is now generally available for HashiCorp Terraform Enterprise.",
          "link": "https://www.hashicorp.com/blog/announcing-consul-terraform-sync-0-3-for-terraform-enterprise",
          "publishedOn": "2021-09-01T17:15:00.000Z",
          "wordCount": 1878,
          "title": "Announcing Consul-Terraform-Sync 0.3 for Terraform Enterprise"
        },
        {
          "id": "https://www.hashicorp.com/blog/cisco-citrix-fortinet-among-new-verified-terraform-providers",
          "author": null,
          "description": "We celebrate the growth of our ecosystem and welcome 27 new verified providers.",
          "link": "https://www.hashicorp.com/blog/cisco-citrix-fortinet-among-new-verified-terraform-providers",
          "publishedOn": "2021-08-31T16:00:00.000Z",
          "wordCount": 1566,
          "title": "Cisco, Citrix, and Fortinet Among New Verified Terraform Providers"
        },
        {
          "id": "https://www.hashicorp.com/blog/how-and-why-to-use-approle-correctly-in-hashicorp-vault",
          "author": null,
          "description": "Learn our best and worst practices for secure introduction, and step through using HashiCorp Vault’s AppRole authentication method for this purpose.",
          "link": "https://www.hashicorp.com/blog/how-and-why-to-use-approle-correctly-in-hashicorp-vault",
          "publishedOn": "2021-08-30T16:00:00.000Z",
          "wordCount": 2664,
          "title": "How (and Why) to Use AppRole Correctly in HashiCorp Vault"
        },
        {
          "id": "https://www.hashicorp.com/blog/when-free-isn-t-good-enough-why-companies-buy-infrastructure-tools",
          "author": null,
          "description": "According to the HashiCorp State of Cloud Strategy Survey, infrastructure tool buyers seek support, compliance, and management features — plus a faster ROI.",
          "link": "https://www.hashicorp.com/blog/when-free-isn-t-good-enough-why-companies-buy-infrastructure-tools",
          "publishedOn": "2021-08-27T16:00:00.000Z",
          "wordCount": 1632,
          "title": "When Free Isn’t Good Enough — Why Companies Buy Infrastructure Tools"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-terraform-azuread-provider-2-0",
          "author": null,
          "description": "Terraform AzureAD provider Version 2.0 exclusively uses the Microsoft Graph API and has numerous schema and behavioral changes to align with the new API.",
          "link": "https://www.hashicorp.com/blog/announcing-terraform-azuread-provider-2-0",
          "publishedOn": "2021-08-26T16:00:00.000Z",
          "wordCount": 857,
          "title": "Announcing Terraform AzureAD Provider 2.0"
        },
        {
          "id": "https://www.hashicorp.com/blog/how-to-choose-a-data-protection-method",
          "author": null,
          "description": "Get a clear picture of modern data protection and encryption methods, their tradeoffs, and see HashiCorp Vault’s feature matrix to identify which method is the right fit for you.",
          "link": "https://www.hashicorp.com/blog/how-to-choose-a-data-protection-method",
          "publishedOn": "2021-08-25T16:00:00.000Z",
          "wordCount": 2263,
          "title": "How to Choose a Data Protection Method"
        },
        {
          "id": "https://www.hashicorp.com/blog/azure-managed-identities-with-the-hashicorp-stack-part-3",
          "author": null,
          "description": "HashiCorp Consul and Nomad use Azure managed identities  to authenticate against Azure in order to read tags and manage service principal information.",
          "link": "https://www.hashicorp.com/blog/azure-managed-identities-with-the-hashicorp-stack-part-3",
          "publishedOn": "2021-08-24T16:00:00.000Z",
          "wordCount": 994,
          "title": "Azure Managed Identities with the HashiCorp Stack: Part 3"
        },
        {
          "id": "https://www.hashicorp.com/blog/cloud-budgets-busted-almost-40-overspent-last-year",
          "author": null,
          "description": "If you want to know what’s really happening in the cloud, you have to follow the money. Here’s what we learned from the 2021 HashiCorp State of Cloud Strategy Survey.",
          "link": "https://www.hashicorp.com/blog/cloud-budgets-busted-almost-40-overspent-last-year",
          "publishedOn": "2021-08-23T20:15:00.000Z",
          "wordCount": 1503,
          "title": "Cloud Budgets Busted: Almost 40% Overspent Last Year"
        },
        {
          "id": "https://www.hashicorp.com/blog/new-terraform-planning-options-refresh-false-refresh-only-replace",
          "author": null,
          "description": "Make changes to your infrastructure in Terraform Cloud and Terraform Enterprise faster with the new -refresh=false, -refresh-only, and replace planning options.",
          "link": "https://www.hashicorp.com/blog/new-terraform-planning-options-refresh-false-refresh-only-replace",
          "publishedOn": "2021-08-20T16:00:00.000Z",
          "wordCount": 1287,
          "title": "New Terraform Planning Options: -refresh=false, -refresh-only, -replace"
        },
        {
          "id": "https://www.hashicorp.com/blog/new-workspace-tags-for-terraform-cloud",
          "author": null,
          "description": "HashiCorp Terraform Cloud gives you a quick and easy new way to search and filter workspaces based on tags.",
          "link": "https://www.hashicorp.com/blog/new-workspace-tags-for-terraform-cloud",
          "publishedOn": "2021-08-19T16:00:00.000Z",
          "wordCount": 864,
          "title": "New Workspace Tags for Terraform Cloud"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-state-of-cloud-strategy-survey-offensive-defensive-drivers-multi-cloud",
          "author": null,
          "description": "Based on the HashiCorp State of Cloud Strategy Survey, we take a deep dive into the business and technology factors driving — and blocking — multi-cloud adoption, including a look at the pandemic's complex effects.",
          "link": "https://www.hashicorp.com/blog/hashicorp-state-of-cloud-strategy-survey-offensive-defensive-drivers-multi-cloud",
          "publishedOn": "2021-08-18T16:00:00.000Z",
          "wordCount": 1577,
          "title": "Survey Finds Both Offensive, Defensive Drivers for Multi-Cloud"
        },
        {
          "id": "https://www.hashicorp.com/blog/new-vault-tutorials-vault-1-8-release-highlights",
          "author": null,
          "description": "Try out the new and enhanced features introduced in Vault 1.8 with step-by-step tutorials on HashiCorp Learn.",
          "link": "https://www.hashicorp.com/blog/new-vault-tutorials-vault-1-8-release-highlights",
          "publishedOn": "2021-08-16T16:00:00.000Z",
          "wordCount": 685,
          "title": "New Vault Tutorials: Vault 1.8 Release Highlights"
        }
      ]
    },
    {
      "title": "Elastic Blog - Elasticsearch, Kibana, and ELK Stack",
      "feedUrl": "https://www.elastic.co/blog/feed",
      "siteUrl": "https://www.elastic.co",
      "articles": [
        {
          "id": "https://www.elastic.co/blog/de-watergroep-and-devoteam-build-elastic-observability-pipeline-to-deliver-water-to-millions",
          "author": "David Kravets",
          "description": "De Watergroep is responsible for the supply of water to more than 3 million customers and hundreds of companies in Belgium. An organisation operating in the public sector, De Watergroep's main goal is to continuously ensure the availability of high-quality drinking water.\n\nDe Watergroep also is constantly engaged in technological innovation, focusing on keeping distribution costs low, and making maintenance more cost efficient.\n\nA frontrunner in digitizing its business operations, De Watergroep is extremely dependent on its IT processes to ensure uninterrupted customer service. Some parts of this IT is outsourced to specialized companies. \n\nWatering down the challenge is not an option\nLike any business that depends on third-party suppliers for mission-critical functions, De Watergroep’s di…",
          "link": "https://www.elastic.co/blog/de-watergroep-and-devoteam-build-elastic-observability-pipeline-to-deliver-water-to-millions",
          "publishedOn": "2021-09-09T13:00:00.000Z",
          "wordCount": 989,
          "title": "De Watergroep and Devoteam build Elastic Observability pipeline to deliver water to millions"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-hashicorp-partner-to-bring-infrastructure-as-code-to-elastic-cloud",
          "author": "Omer Kushmaro",
          "description": "Operations and SRE teams often rely on HashiCorp Terraform to safely manage production-related infrastructure using methodologies such as infrastructure as code, which allows you to apply peer-reviewed infrastructure changes in an automated and controlled fashion.\n\nWe’re expanding our partnership with HashiCorp, a leader in multi-cloud infrastructure automation software, to offer a verified Terraform provider — bringing you the best possible infrastructure-as-code experience when you use Terraform to deploy and manage Elastic Cloud.\n\nThe HashiCorp Terraform verified provider for  Elastic Cloud works with Elasticsearch Service on Elastic Cloud, Elastic Cloud Enterprise, and Elasticsearch Service Private environments.\n\nWith the Elastic Cloud Terraform provider, you can use the same automatio…",
          "link": "https://www.elastic.co/blog/elastic-hashicorp-partner-to-bring-infrastructure-as-code-to-elastic-cloud",
          "publishedOn": "2021-09-09T13:00:00.000Z",
          "wordCount": 792,
          "title": "Elastic and HashiCorp partner to bring infrastructure-as-code to Elastic Cloud"
        },
        {
          "id": "https://www.elastic.co/blog/secure-your-deployments-on-elastic-cloud-with-google-cloud-private-service-connect",
          "author": "Fermi Fang,Shubha Anjur Tupil",
          "description": "We are pleased to announce the general availability of the Google Cloud Private Service Connect integration with Elastic Cloud. Elastic Cloud VPC connectivity is now available to all customers across all subscription tiers and cloud providers (AWS, Microsoft Azure, and Google Cloud).\nPrivate Service Connect allows you to create private and secure connections from your clients running in your Google Cloud environments to your Elastic Cloud deployment endpoints running on Google Cloud. Private Service Connect provides service endpoints in your virtual private cloud (VPC) that provide private connectivity and policy enforcement, allowing you to easily connect to services like Elastic Cloud. All the traffic remains within the Google network, and it’s easy to set up and scale. \n \nPrerequisite: …",
          "link": "https://www.elastic.co/blog/secure-your-deployments-on-elastic-cloud-with-google-cloud-private-service-connect",
          "publishedOn": "2021-09-09T13:00:00.000Z",
          "wordCount": 691,
          "title": "Secure your deployments on Elastic Cloud with Google Cloud Private Service Connect"
        },
        {
          "id": "https://www.elastic.co/blog/tracing-aws-lambdas-with-opentelemetry-and-elastic-observability",
          "author": "Michael Hyatt",
          "description": "Why OpenTelemetry?\nOpen Telemetry represents an effort to combine distributed tracing, metrics and logging into a single set of system components and language-specific libraries. Recently, OpenTelemetry became a CNCF incubating project, but it already enjoys quite a significant community and vendor support. OpenTelemetry defines itself as “an observability framework for cloud-native software”, although it should be able to cover more than what we know as “cloud-native software”. Quoting its mission statement, “OpenTelemetry is a collection of tools, APIs, and SDKs” that are used “to instrument, generate, collect, and export telemetry data (metrics, logs, and traces) for analysis to understand the software's performance and behaviour”.\n\nWe at Elastic find the mission statement of OpenTeleme…",
          "link": "https://www.elastic.co/blog/tracing-aws-lambdas-with-opentelemetry-and-elastic-observability",
          "publishedOn": "2021-09-08T17:00:00.000Z",
          "wordCount": 2366,
          "title": "Tracing AWS Lambdas with OpenTelemetry and Elastic Observability"
        },
        {
          "id": "https://www.elastic.co/blog/with-elastic-cloud-on-aws-smarter-city-solutions-ensures-seamless-customer-experience-across-the-smarter-parking-platform",
          "author": "Zack Shachar",
          "description": "Ensuring a seamless customer experience is a growing challenge for digital technology providers. Yet, as functionality and a customer base scale, predictability can become challenging. \n\nAt Smarter City Solutions, which provides tens of thousands of drivers in Australia and New Zealand real-time parking related services through the flagship Smarter Parking Platform, our engineering team faced this challenge when scaling from a few deployments to dozens. Whether it was a scaling issue in infrastructure, a configuration gap in the server, or an update needed in an application, we realized that proactive, unified visibility of the entire stack to detect potential issues was critical if we wanted to ensure a consistent customer experience as we continue to grow. \n\nTo address this challenge, we…",
          "link": "https://www.elastic.co/blog/with-elastic-cloud-on-aws-smarter-city-solutions-ensures-seamless-customer-experience-across-the-smarter-parking-platform",
          "publishedOn": "2021-09-07T17:00:00.000Z",
          "wordCount": 1417,
          "title": "With Elastic Cloud on AWS, Smarter City Solutions ensures seamless customer experience across the Smarter Parking Platform"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-on-elastic-data-collected-to-the-infosec-siem",
          "author": "Aaron Jewitt",
          "description": "The Elastic Infosec Detections and Analytics team is responsible for building, tuning, and maintaining the security detections used to protect all Elastic systems. Within Elastic we call ourselves Customer Zero and we strive to always use the newest versions of our products.  \n  \nIn this series of blog posts we will provide an overview of our architecture, what data we send to our clusters, how and why we use Cross Cluster Search with the Security and Machine Learning (ML) applications, and how we tune, manage and notify analysts for those alerts. \n  \nIn the previous blog post we provided an overview of our internal Elastic infrastructure that we use in Infosec and how we use Cross Cluster Search to connect multiple clusters into a single interface for Security Analysts. In this blog post …",
          "link": "https://www.elastic.co/blog/elastic-on-elastic-data-collected-to-the-infosec-siem",
          "publishedOn": "2021-09-07T13:00:00.000Z",
          "wordCount": 1659,
          "title": "Elastic on Elastic Series: Data collected to the Infosec SIEM"
        },
        {
          "id": "https://www.elastic.co/blog/achieving-the-armys-data-imperatives-at-the-tactical-edge-with-elastic",
          "author": "Kevin Keeney,Michael Young",
          "description": "A modified version of this blog post appeared in the August 2021 issue of Signal magazine.\n\nAs the Industrial Age Army transforms to the Information Age Army, Army leadership recognizes the need for adaptable technologies that enable data exchange at the tactical edge. Not only must these technologies be in lock step with the 8 guiding principles of the DoD Data Strategy, but they must also deliver on the Army’s data imperatives of speed, scale and resilience.\n\nAt Elastic, our role is to help commanders and warfighters use data as a force multiplier with a powerful search platform that securely makes multi-domain data accessible and actionable, enables real-time situational awareness for faster OODA loops, and detects the adversary across domains of responsibility with machine learning. Ou…",
          "link": "https://www.elastic.co/blog/achieving-the-armys-data-imperatives-at-the-tactical-edge-with-elastic",
          "publishedOn": "2021-09-02T15:00:00.000Z",
          "wordCount": 786,
          "title": "Achieving the Army's data imperatives at the tactical edge with Elastic"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-stack-7-14-1-released",
          "author": "David Kyle",
          "description": "Version 7.14.1 of the Elastic Stack was released today. We recommend you upgrade to this latest version.\nThe 7.14.1 patch contains fixes and small enhancements for the stack. One notable change in Elasticsearch fixes a memory leak that may have affected CCR users:\nFix memory/breaker leaks for outbound responses #76474\nFor a full list of changes for each product, please refer to the release notes: \n7.14.1 Release Notes\nElastic Stack\nElasticsearch\nKibana\nBeats\nLogstash\nElastic Enterprise Search\nEnterprise Search\nElastic Observability\nAPM\nElastic Security\nElastic Security Solution",
          "link": "https://www.elastic.co/blog/elastic-stack-7-14-1-released",
          "publishedOn": "2021-09-01T15:00:00.000Z",
          "wordCount": 350,
          "title": "Elastic Stack 7.14.1 released"
        },
        {
          "id": "https://www.elastic.co/blog/deterring-ransomware-for-state-and-local-government",
          "author": "Jared Pane",
          "description": "According to FBI Director, Christopher Wray, when it comes to ransomware disruption and prevention, “...there’s a shared responsibility, not just across government agencies but across the private sector and even the average American.” At Elastic, we’re here to help state and local governments. \n\nRansomware attacks cost the U.S. government more than $18.9 billion in 2020 alone. By taking a proactive security approach, state and local IT teams can make damage from ransomware a thing of the past.\n\nBut where should state and local IT administrators and analysts start, especially when there are resource constraints and competing priorities? At Elastic, we believe there are two proactive techniques that should be a part of every state and local government’s cybersecurity posture in order to stop…",
          "link": "https://www.elastic.co/blog/deterring-ransomware-for-state-and-local-government",
          "publishedOn": "2021-08-31T13:00:00.000Z",
          "wordCount": 732,
          "title": "Deterring ransomware for state and local government"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-on-elastic-deep-dive-into-our-siem-architecture",
          "author": "Aaron Jewitt",
          "description": "Elastic on Elastic \nThe Elastic Infosec Detections and Analytics team is responsible for building, tuning, and maintaining the security detections used to protect all Elastic systems. Within Elastic we call ourselves Customer Zero and we strive to always use the newest versions of our products. \n\nIn this series of blog posts we will provide an overview of our architecture, what data we send to our clusters, how and why we use Cross Cluster Search (CCS) with the Security and Machine Learning (ML) applications, and how we tune, manage and notify analysts for those alerts.\n \nOverview of the Elastic Infosec environment\n\nMany cybersecurity products and security controls are built to support a traditional “Corporate Network” with workstations and servers on a local network, secured by a firewall…",
          "link": "https://www.elastic.co/blog/elastic-on-elastic-deep-dive-into-our-siem-architecture",
          "publishedOn": "2021-08-26T15:00:00.000Z",
          "wordCount": 1846,
          "title": "Elastic on Elastic: Deep dive into our SIEM architecture"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-and-cmd-join-forces-to-help-you-take-command-of-your-cloud-workloads",
          "author": "Ashutosh Kulkarni",
          "description": "We are excited to announce that Elastic is joining forces with Cmd to accelerate our efforts in Cloud security - specifically in cloud workload runtime security. By integrating the capabilities of Cmd's expertise and product into Elastic Security, we will enable customers to detect, prevent, and respond to attacks on their cloud workloads. Adding to our recent announcement to acquire build.security, this will give customers cloud security protections from build-time, to deployment-time, to runtime.\n\nCmd is a leader in infrastructure detection and response (IDR), providing deep and performant visibility into cloud workloads using extended Berkeley Packet Filter (eBPF) technology and performing expert detection and prevention on cloud-native data. eBPF has revolutionized how organizations ob…",
          "link": "https://www.elastic.co/blog/elastic-and-cmd-join-forces-to-help-you-take-command-of-your-cloud-workloads",
          "publishedOn": "2021-08-25T19:55:00.000Z",
          "wordCount": 1655,
          "title": "Elastic and Cmd join forces to help you take command of your cloud workloads"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-customers-success-is-my-passion",
          "author": "Asjad Athick,Nikki Jones",
          "description": "As an Elastic Technical Account Manager (TAM), I’m a trusted advisor who provides the necessary technical lens to help solve key business problems and drive customers towards strategic outcomes by helping teams make the most of their investments in Elastic technologies.\n\nIn this series, you will hear firsthand the insights into some of the many ways we help our customers achieve success. \n\n\n\nAsjad Athick, Elastic Technical Account Manager (TAM)\nFor customers looking to monitor and observe their complex IT environments, I help collect the data needed to quickly and efficiently discover and diagnose issues before they impact their organizations. I also help my customers’ security teams establish robust and resilient SIEM platforms that security analysts can rely on day in and day out. Ultima…",
          "link": "https://www.elastic.co/blog/elastic-customers-success-is-my-passion",
          "publishedOn": "2021-08-25T15:00:00.000Z",
          "wordCount": 906,
          "title": "Elastic customers’ success is my passion"
        },
        {
          "id": "https://www.elastic.co/blog/detection-and-response-for-the-actively-exploited-proxyshell-vulnerabilities",
          "author": "Elastic Security Intelligence & Analytics Team",
          "description": "On August 21, 2021, the Cybersecurity and Infrastructure Security Agency (CISA) released an urgent notice related to the exploitation of ProxyShell vulnerabilities (CVE-2021-31207, CVE-2021-34473, CVE-2021-34523).  By chaining these vulnerabilities together, threat actors are compromising unpatched Microsoft Exchange servers and gaining footholds into enterprise networks. Security vendors and researchers are also observing these attacks tied to post-exploitation behavior such as deploying ransomware to victim environments.  \n  \nElastic Security identified indicators of compromise (IoCs) indicating similar activity as reported by the industry. The details of this activity can be found in our Discuss forum, highlighting our perspective of what we have observed in our own telemetry. \n  \nPlease visit the Discuss forum for full details on our identified IoCs.",
          "link": "https://www.elastic.co/blog/detection-and-response-for-the-actively-exploited-proxyshell-vulnerabilities",
          "publishedOn": "2021-08-25T00:00:00.000Z",
          "wordCount": 407,
          "title": "Detection and response for the actively exploited ProxyShell vulnerabilities"
        },
        {
          "id": "https://www.elastic.co/blog/evolving-and-diversifying-elastics-engineering-team-with-the-elastigrad-program",
          "author": "David Kravets,Lauren Peters",
          "description": "At Elastic, we are continually evolving and growing and with this comes new opportunities. We are excited to announce our latest initiative, the Elastigrad Program, which is focused on recruiting early-career engineers.  \n Ash Kulkarni, Elastic’s Chief Product Officer, is dedicated to creating an even more diverse engineering team, and the Elastigrad Program is a natural extension of our investment in our people. “By recruiting and training early-career engineers, we will have fresh perspectives to help us continue to drive innovation and build solutions to help customers around the world search, observe and protect their organizations.”\nOur Elastigrads will be able to devote their time to key projects and initiatives while partnering closely with experienced engineers. These opportunities…",
          "link": "https://www.elastic.co/blog/evolving-and-diversifying-elastics-engineering-team-with-the-elastigrad-program",
          "publishedOn": "2021-08-24T20:00:00.000Z",
          "wordCount": 601,
          "title": "Evolving and diversifying Elastic’s engineering team with the Elastigrad Program"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-and-build-security-shifting-left-together-to-secure-the-cloud",
          "author": "Ashutosh Kulkarni",
          "description": "Since its inception, Elastic Security has had a clear mission: to protect the world's data and systems from attack.\n\nWe started with SIEM, built on top of the Elastic Stack, applying its fast and scalable search capabilities to detect security vulnerabilities across all threat vectors. Next, we joined forces with Endgame to integrate endpoint security into Elastic Security, and allow customers to prevent, detect, and respond to attacks from a single, unified platform. With the recent release of Elastic Security Limitless XDR and the general availability of Elastic Agent, we furthered our mission.\n\nToday, we are excited to announce the next step in the Elastic Security journey: to extend security enforcement from every endpoint to every cloud workload.\n\nMillions of users trust Elastic for o…",
          "link": "https://www.elastic.co/blog/elastic-and-build-security-shifting-left-together-to-secure-the-cloud",
          "publishedOn": "2021-08-23T10:55:00.000Z",
          "wordCount": 1554,
          "title": "Elastic and build.security: Shifting left together to secure the cloud"
        },
        {
          "id": "https://www.elastic.co/blog/kibana-10-common-questions-formulas-time-series-maps",
          "author": "Graham Hudgins,Adeline Tan",
          "description": "Kibana creates easy ways to do powerful things with all of your data — to ask and answer questions and follow the flow of analysis. Many times the answer to your question requires calculations based on queried data. Formulas allow you to author your own metrics by combining multiple aggregated fields using math operations.\n\nIn addition, moving through and replaying your data in time and space are powerful ways to gain historical context and understand additional insight about the present.\n\nIn the below sections you’ll find 10 examples of questions you can answer with dashboard data and map visualizations in Kibana via formulas, time shifts, and moving through data in time. Try following along with your own data or using Kibana’s sample datasets. Have a question? Head on over to our discuss…",
          "link": "https://www.elastic.co/blog/kibana-10-common-questions-formulas-time-series-maps",
          "publishedOn": "2021-08-18T18:00:00.000Z",
          "wordCount": 1896,
          "title": "10 common questions answered with formulas and time travel in Kibana"
        },
        {
          "id": "https://www.elastic.co/blog/introducing-new-google-cloud-instance-types-on-elastic-cloud",
          "author": "Yoav Derazon,Fermi Fang",
          "description": "We are excited to announce support for Google Compute Engine (GCE) N2 general purpose virtual machine (VM) types, and additional hardware configuration options powered by N2 custom machine types. \n\nN2 VMs leverage Intel 2nd Generation Xeon Scalable processors and provide a balance of compute, memory, and storage. N2 machine types also offer more than a 20% improvement in price-performance over the first-generation N1 machines.\n\n\n\nWhen you provision an Elastic deployment on Google Cloud you will automatically leverage N2 VM types. You can select the default configuration, or choose one of four custom configurations. This optionality allows you to select a combination of vCPU, RAM, and storage to deliver optimal performance for your specific use case. For example, you may select a configurat…",
          "link": "https://www.elastic.co/blog/introducing-new-google-cloud-instance-types-on-elastic-cloud",
          "publishedOn": "2021-08-18T15:00:00.000Z",
          "wordCount": 616,
          "title": "New Google Cloud instance types on Elastic Cloud"
        },
        {
          "id": "https://www.elastic.co/blog/full-cycle-observability-with-the-elastic-stack-and-lightrun",
          "author": "Daliya Spasova,Philipp Krenn",
          "description": "This blog post was written in collaboration with the team at Lightrun: Itai Tieger, Roy Chen, and Tom Granot. Itai is an R&D team leader specializing in cybersecurity, with over 10 years of experience in the industry. Roy is a software engineer with over 6 years of diverse experience in multiple disciplines. Tom is a solution engineer and a former site reliability engineer.\n\nAn application running in production is a difficult beast to tame.\n\nMost experienced developers–ones who spent enough late nights or Saturday mornings trying to break apart a nasty production bug–will try and create the clearest possible picture for their later selves while writing their code, so that they could understand what’s actually going on in the system during an incident. \n\nTo make life easier, developers can …",
          "link": "https://www.elastic.co/blog/full-cycle-observability-with-the-elastic-stack-and-lightrun",
          "publishedOn": "2021-08-17T19:00:00.000Z",
          "wordCount": 3339,
          "title": "Full-cycle observability with the Elastic Stack and Lightrun"
        },
        {
          "id": "https://www.elastic.co/blog/establish-robust-threat-intelligence-with-elastic-security",
          "author": "Haran Kumar",
          "description": "As a powerful search engine, Elasticsearch provides various ways to collect and enrich data with threat intel feeds, while the Elastic Security detection engine helps security analysts to detect alerts with threat indicator matching. In this blog post, we’ll provide an introduction to threat intelligence and demonstrate how Elastic Security can help organizations establish robust cyber threat intelligence (CTI) capabilities.\n\nCTI is contextual information obtained through research and analysis of emerging threats and the application of defensive countermeasures to enhance the protective posture of contested environments. It helps organizations to better understand past, current, and future threats. \n\nThreat feeds that can be obtained from various open source and commercial platforms become…",
          "link": "https://www.elastic.co/blog/establish-robust-threat-intelligence-with-elastic-security",
          "publishedOn": "2021-08-12T17:00:00.000Z",
          "wordCount": 1783,
          "title": "Establish robust threat intelligence with Elastic Security"
        }
      ]
    },
    {
      "title": "Ansible Blog",
      "feedUrl": "https://www.ansible.com/blog/rss.xml",
      "siteUrl": "https://www.ansible.com/blog",
      "articles": [
        {
          "id": "https://www.ansible.com/blog/ansiblefest-2021-network-automation-track",
          "author": "Cindy Russell",
          "description": "This year, we are adapting our signature automation event, AnsibleFest, into a free virtual experience to connect our communities with a wider audience and to collaborate to solve problems. Seasoned pros and new Ansible enthusiasts alike can find answers and learn more about Red Hat Ansible Automation Platform, the platform for building and operating automation at scale and creating an enterprise automation strategy. Have you already automated some type of server or infrastructure management? Use the network automation track to understand the benefits that come with automating network management the Ansible way.",
          "link": "https://www.ansible.com/blog/ansiblefest-2021-network-automation-track",
          "publishedOn": "2021-08-30T16:00:00.000Z",
          "wordCount": 1062,
          "title": "AnsibleFest 2021: Network Automation Track"
        }
      ]
    },
    {
      "title": "Azure DevOps Blog",
      "feedUrl": "https://devblogs.microsoft.com/devops/feed/",
      "siteUrl": "https://devblogs.microsoft.com/devops",
      "articles": [
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62273",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes Episode 53 – Intro to @PulumiCorp with @mattstratton appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-episode-53-intro-to-pulumicorp-with-mattstratton/",
          "publishedOn": "2021-08-31T13:00:23.000Z",
          "wordCount": 1489,
          "title": "AzureFunBytes Episode 53 – Intro to @PulumiCorp with @mattstratton"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62268",
          "author": "Jay Gordon",
          "description": "The top stories from the #AzureDevOps #community for 2021.08.27 are here!\nThe post Top Stories from the Microsoft DevOps Community – 2021.08.27 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-08-27/",
          "publishedOn": "2021-08-27T12:00:35.000Z",
          "wordCount": 1169,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.08.27"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62219",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes Episode 52 – Intro to @GraphQL with @Adron of @HasuraHQ appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-episode-52-intro-to-graphql-with-adron-of-hasurahq/",
          "publishedOn": "2021-08-24T12:00:30.000Z",
          "wordCount": 1353,
          "title": "AzureFunBytes Episode 52 – Intro to @GraphQL with @Adron of @HasuraHQ"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62232",
          "author": "Steven Murawski",
          "description": "Happy Friday! Jay is out of the office this week, so I’m back with some good reading to kick off the weekend.\nThe post Top Stories from the Microsoft DevOps Community – 2021.08.20 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-08-20/",
          "publishedOn": "2021-08-20T16:46:26.000Z",
          "wordCount": 1003,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.08.20"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62215",
          "author": "Gloridel Morales",
          "description": "Update: We received feedback in the Developer Community about an issue after upgrading from Azure DevOps Server 2020.1 Patch 2 to Azure DevOps Server 2020.1.1. Today we are re-releasing Azure DevOps Server 2020.1.1 to fix this issue.\nThe post Updated: Azure DevOps Server 2020.1.1 RTW now available appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azure-devops-server-2020-1-1-rtw-now-available/",
          "publishedOn": "2021-08-17T18:10:37.000Z",
          "wordCount": 1550,
          "title": "Updated: Azure DevOps Server 2020.1.1 RTW now available"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62081",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes Episode 51 – Deploy With ARM Templates with @shankuehn appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-episode-51-deploy-with-arm-templates-with-shankuehn/",
          "publishedOn": "2021-08-17T14:00:08.000Z",
          "wordCount": 1565,
          "title": "AzureFunBytes Episode 51 – Deploy With ARM Templates with @shankuehn"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62194",
          "author": "Jay Gordon",
          "description": "The top stories from the #AzureDevOps #community for 2021.08.13 are here!\nThe post Top Stories from the Microsoft DevOps Community – 2021.08.13 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-08-13/",
          "publishedOn": "2021-08-13T12:00:17.000Z",
          "wordCount": 1206,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.08.13"
        }
      ]
    },
    {
      "title": "Discover Dev",
      "feedUrl": "https://www.discoverdev.io/rss.xml",
      "siteUrl": "http://discoverdev.io",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "http://feeds.feedburner.com/AmazonWebServicesBlog",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "46d5dfdf2f6a6027732ce521a1c8a044fc3a93ef",
          "author": "Channy Yun",
          "description": "In 2015, we launched Amazon Elasticsearch Service (Amazon ES), a fully managed service that makes it easy for you to perform interactive log analytics, real-time application monitoring, website search, and more. Amazon ES has been a popular service for log analytics because of its ability to ingest high volumes of log data. Additionally, with UltraWarm […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/zxVJcxrmQkQ/",
          "publishedOn": "2021-09-08T21:54:41.000Z",
          "wordCount": 1707,
          "title": "Amazon Elasticsearch Service Is Now Amazon OpenSearch Service and Supports OpenSearch 1.0"
        },
        {
          "id": "e680ae7d1d3fd575e2fc991fb49ed3be879bc876",
          "author": "Channy Yun",
          "description": "At AWS re:Invent 2020, we preannounced new deployment options of Amazon Elastic Container Service (Amazon ECS) Anywhere and Amazon Elastic Kubernetes Service (Amazon EKS) Anywhere in your own data center. Today, I am happy to announce the general availability of Amazon EKS Anywhere, a deployment option for Amazon EKS that enables you to easily create […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/1iLrrIF_AjE/",
          "publishedOn": "2021-09-08T18:08:39.000Z",
          "wordCount": 2120,
          "title": "Amazon EKS Anywhere – Now Generally Available to Create and Manage Kubernetes Clusters on Premises"
        },
        {
          "id": "2c845d4a4cf1093ef98aefca06818fc77382f5a6",
          "author": "Julien Simon",
          "description": "What if media were optimized to benefit people? This thought-provoking question is at the core of Harmony Labs‘ mission. A nonprofit organization headquartered in New York City, Harmony Labs strives to better understand the impact of media on society, and build communities and tools to reform and transform media systems. As Brian Wanieswki, Executive Director […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/O6F85xFsK2Y/",
          "publishedOn": "2021-09-03T16:30:42.000Z",
          "wordCount": 1570,
          "title": "Decoding the Social Effects Of Media with Machine Learning"
        },
        {
          "id": "9bf2734a9a0cc7f9b62f12302a109d0a15a0eacb",
          "author": "Marcia Villalba",
          "description": "Welcome to the third annual AWS Storage Day 2021! During Storage Day 2020 and the first-ever Storage Day 2019 we made many impactful announcements for our customers and this year will be no different. The one-day, free AWS Storage Day 2021 virtual event will be hosted on the AWS channel on Twitch. You’ll hear from […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/onb8yrlQHio/",
          "publishedOn": "2021-09-02T15:57:49.000Z",
          "wordCount": 1642,
          "title": "Welcome to AWS Storage Day 2021"
        },
        {
          "id": "31eeed91f20d84c8371d02185b6434cfd36818f1",
          "author": "Channy Yun",
          "description": "Amazon Elastic File System (Amazon EFS) offers four storage classes: two Standard storage classes, Amazon EFS Standard and Amazon EFS Standard-Infrequent Access (EFS Standard-IA), and two One Zone storage classes, Amazon EFS One Zone, and Amazon EFS One Zone-Infrequent Access (EFS One Zone-IA). Standard storage classes store data within and across multiple availability zones (AZ). […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/Zg4VvQhCox4/",
          "publishedOn": "2021-09-02T15:41:02.000Z",
          "wordCount": 1239,
          "title": "New – Amazon EFS Intelligent-Tiering Optimizes Costs for Workloads with Changing Access Patterns"
        },
        {
          "id": "d0cb27424372f775619510a8c1582fa4f2daf084",
          "author": "Alex Casalboni",
          "description": "Building multi-region applications allows you to improve latency for end users, achieve higher availability and resiliency in case of unexpected disasters, and adhere to business requirements related to data durability and data residency. For example, you might want to reduce the overall latency of dynamic API calls to your backend services . Or you might […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/d965iVRL6SA/",
          "publishedOn": "2021-09-02T15:40:33.000Z",
          "wordCount": 2721,
          "title": "How to Accelerate Performance and Availability of Multi-region Applications with Amazon S3 Multi-Region Access Points"
        },
        {
          "id": "da2cf10e52b4ea77d701c365a9ec8802a7030f84",
          "author": "Sean M. Tracey",
          "description": "In 2018, we first launched Amazon S3 Intelligent-Tiering (S3 Intelligent-Tiering). For customers managing data across business units, teams, and products, unpredictable access patterns are often the norm. With the S3 Intelligent-Tiering storage class, S3 automatically optimizes costs by moving data between access tiers as access patterns change. Today, we’re pleased to announce two updates to […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/g5N1bOkflQo/",
          "publishedOn": "2021-09-02T15:39:39.000Z",
          "wordCount": 1035,
          "title": "Amazon S3 Intelligent-Tiering – Improved Cost Optimizations for Short-Lived and Small Objects"
        },
        {
          "id": "a1241623aa1b9528784bc5782f30c04e5f265286",
          "author": "Jeff Barr",
          "description": "Back in 2018 I wrote about the first two members of the Amazon FSx family of fully-managed, highly-reliable, and highly-performant file systems, Amazon FSx for Lustre and Amazon FSx for Windows File Server. Both of these services give you the ability to use popular open source and commercially-licensed file systems without having to deal with […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/IHxuL8Rgrqo/",
          "publishedOn": "2021-09-02T15:38:56.000Z",
          "wordCount": 1796,
          "title": "New – Amazon FSx for NetApp ONTAP"
        },
        {
          "id": "27dd22094272f325d6756471d5bfa893d3d13b25",
          "author": "Danilo Poccia",
          "description": "In December, we introduced the preview of Amazon Managed Grafana, a fully managed service developed in collaboration with Grafana Labs that makes it easy to use the open-source and the enterprise versions of Grafana to visualize and analyze your data from multiple sources. With Amazon Managed Grafana, you can analyze your metrics, logs, and traces […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/bowFRHvvPxk/",
          "publishedOn": "2021-09-01T01:17:06.000Z",
          "wordCount": 1860,
          "title": "Amazon Managed Grafana Is Now Generally Available with Many New Features"
        },
        {
          "id": "77e52244f6e9441bcc3b1c7bc019a835f69a5973",
          "author": "Sébastien Stormacq",
          "description": "Since December 2019, Amazon Virtual Private Cloud (VPC) has allowed you to route all ingress traffic (also known as north – south traffic) to a specific network interface. You might use this capability for a number of reasons. For example, to inspect incoming traffic using an intrusion detection system (IDS) appliance or to route ingress […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/b4dMqFVtVK0/",
          "publishedOn": "2021-08-30T23:41:02.000Z",
          "wordCount": 2136,
          "title": "Amazon VPC Routing Enhancements Allow You to Inspect Traffic Between Subnets In a VPC"
        },
        {
          "id": "1e4059819a26a3d337726ce8dcdb1a2df847c827",
          "author": "Danilo Poccia",
          "description": "One of the great advantages of cloud computing is that you have access to programmable infrastructure. This allows you to manage your infrastructure as code and apply the same practices of application code development to infrastructure provisioning. AWS CloudFormation gives you an easy way to model a collection of related AWS and third-party resources, provision […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/_4X51erKDSU/",
          "publishedOn": "2021-08-30T19:46:51.000Z",
          "wordCount": 2461,
          "title": "New for AWS CloudFormation – Quickly Retry Stack Operations from the Point of Failure"
        },
        {
          "id": "ab1095ff6e13f6a555a78d4d5bb69e424da604a3",
          "author": "Ross Barich",
          "description": "AWS Heroes go above and beyond to share knowledge with the community and help others build better and faster on AWS. Last month we launched the AWS Heroes Content Library, a centralized place where Builders can find inspiration and learn from AWS Hero authored educational content including blogs, videos, slide presentations, podcasts, open source projects, […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/xhYbw-t0kDY/",
          "publishedOn": "2021-08-26T18:28:12.000Z",
          "wordCount": 1380,
          "title": "Announcing the latest AWS Heroes – August 2021"
        },
        {
          "id": "8a88d0376f1e7e50dc00438841148100887bbdaf",
          "author": "Channy Yun",
          "description": "Introduced at AWS re:Invent 2018, Amazon Textract is a machine learning service that automatically extracts text, handwriting and data from scanned documents that goes beyond simple optical character recognition (OCR) to identify, understand, and extract data from forms and tables. In the past few months, we introduced specialized support for processing invoices and receipts and […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/PeEIVdVuy9w/",
          "publishedOn": "2021-08-26T16:03:49.000Z",
          "wordCount": 1332,
          "title": "Amazon Textract Updates: Up to 32% Price Reduction in 8 AWS Regions and Up to 50% Reduction in Asynchronous Job Processing Times"
        },
        {
          "id": "67850536ae98d21f4ff66429ee314dfdad639c1c",
          "author": "Steve Roberts",
          "description": "Today, I’m happy to announce the availability of AWS Backup Audit Manager, a new feature of AWS Backup that helps you monitor and evaluate the compliance status of your backups to meet business and regulatory requirements, and enables you to generate reports that help demonstrate compliance to auditors and regulators. AWS Backup is a fully […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/Vn65TtQiSLo/",
          "publishedOn": "2021-08-24T13:50:02.000Z",
          "wordCount": 1855,
          "title": "Monitor, Evaluate, and Demonstrate Backup Compliance with AWS Backup Audit Manager"
        },
        {
          "id": "26d642d9945ef477f9a2c6443e79a0d085ddbfad",
          "author": "Jeff Barr",
          "description": "Fifteen years ago today I wrote the blog post that launched the Amazon EC2 Beta. As I recall, the launch was imminent for quite some time as we worked to finalize the feature set, the pricing model, and innumerable other details. The launch date was finally chosen and it happened to fall in the middle […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/rwO2ynXIqF8/",
          "publishedOn": "2021-08-23T15:09:54.000Z",
          "wordCount": 1739,
          "title": "Happy 15th Birthday Amazon EC2"
        },
        {
          "id": "c0f4c867c6984fe656087db346b578b038cd1735",
          "author": "Danilo Poccia",
          "description": "Interactive applications need to process requests and respond very quickly, and this requirement extends to all the components of their architecture. That is even more important when you adopt microservices and your architecture is composed of many small independent services that communicate with each other. For this reason, database performance is critical to the success […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/ubxMIL1QGYc/",
          "publishedOn": "2021-08-19T17:42:09.000Z",
          "wordCount": 2403,
          "title": "Introducing Amazon MemoryDB for Redis – A Redis-Compatible, Durable, In-Memory Database Service"
        },
        {
          "id": "f37eb47e4e2a70fab81aae10293c94725350cb8a",
          "author": "Danilo Poccia",
          "description": "Last year, we introduced the sixth generation of EC2 instances powered by AWS-designed Graviton2 processors. We’re now expanding our sixth-generation offerings to include x86-based instances, delivering price/performance benefits for workloads that rely on x86 instructions. Today, I am happy to announce the availability of the new general purpose Amazon EC2 M6i instances, which offer up to […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/LSIPPm7qjYU/",
          "publishedOn": "2021-08-16T21:27:10.000Z",
          "wordCount": 1068,
          "title": "New – Amazon EC2 M6i Instances Powered by the Latest-Generation Intel Xeon Scalable Processors"
        },
        {
          "id": "903ccd8fce8570d9ea1622cb7649dffac71ba65f",
          "author": "Martin Beeby",
          "description": "To be successful in today’s fast-moving world, businesses need to analyze data quickly and take meaningful action. Many of our customers embrace this concept to become data-driven organizations. Data-driven organizations treat data as an asset and use it to improve their insights and make better decisions. They unleash the power of data by using secure […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/6auMmTu8udw/",
          "publishedOn": "2021-08-13T16:38:16.000Z",
          "wordCount": 1681,
          "title": "Cross-Account Data Sharing for Amazon Redshift"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/atom.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2513/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/saturn_hexagon.png\" title=\"Sorry, in SI units that's &quot;there's a big football in there.&quot;\" alt=\"Sorry, in SI units that's &quot;there's a big football in there.&quot;\" />",
          "link": "https://xkcd.com/2513/",
          "publishedOn": "2021-09-08T00:00:00.000Z",
          "wordCount": 185,
          "title": "Saturn Hexagon"
        },
        {
          "id": "https://xkcd.com/2512/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/revelation.png\" title=\"And the heaven departed as a scroll when it is rolled together, but then more heaven kept appearing to replace it, as if the scroll was infinite.\" alt=\"And the heaven departed as a scroll when it is rolled together, but then more heaven kept appearing to replace it, as if the scroll was infinite.\" />",
          "link": "https://xkcd.com/2512/",
          "publishedOn": "2021-09-06T00:00:00.000Z",
          "wordCount": 183,
          "title": "Revelation"
        },
        {
          "id": "https://xkcd.com/2511/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/recreate_the_conditions.png\" title=\"We've almost finished constructing the piña collider.\" alt=\"We've almost finished constructing the piña collider.\" />",
          "link": "https://xkcd.com/2511/",
          "publishedOn": "2021-09-03T00:00:00.000Z",
          "wordCount": 187,
          "title": "Recreate the Conditions"
        },
        {
          "id": "https://xkcd.com/2510/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/modern_tools.png\" title=\"I tried to train an AI to repair my Python environment but it kept giving up and deleting itself.\" alt=\"I tried to train an AI to repair my Python environment but it kept giving up and deleting itself.\" />",
          "link": "https://xkcd.com/2510/",
          "publishedOn": "2021-09-01T00:00:00.000Z",
          "wordCount": 185,
          "title": "Modern Tools"
        }
      ]
    },
    {
      "title": "Software Engineering Daily",
      "feedUrl": "https://softwareengineeringdaily.com/feed/podcast/",
      "siteUrl": "https://softwareengineeringdaily.com/archives/",
      "articles": [
        {
          "id": "https://softwareengineeringdaily.com/?p=11566",
          "author": null,
          "description": "An application network is a way to connect applications, data and devices through APIs that expose some or all of their assets and data on the network. That network allows other consumers from other parts of the business to come in and discover and use those assets (mulesoft.com). The company Tetrate provides the tools necessary\nThe post Tetrate: Application Aware Networking with Varun Talwar appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/09/10/tetrate-application-aware-networking-with-varun-talwar/?utm_source=rss&utm_medium=rss&utm_campaign=tetrate-application-aware-networking-with-varun-talwar",
          "publishedOn": "2021-09-10T09:00:19.000Z",
          "wordCount": null,
          "title": "Tetrate: Application Aware Networking with Varun Talwar",
          "itunes": {
            "duration": "50:31"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED6975002663.mp3",
            "length": "48538158",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11561",
          "author": null,
          "description": "A software engineer will make many mistakes on their career journey.  In time, engineers learn to make smaller mistakes, recognize them faster, and build with appropriate guardrails.  The demands of delivering software in a timely and efficient fashion often demands developers carefully optimize tradeoffs to deliver solutions to the problems at hand. Software Mistakes and\nThe post Software Mistakes and Tradeoffs with Tomasz Lelek appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/09/09/software-mistakes-and-tradeoffs-with-tomasz-lelek/?utm_source=rss&utm_medium=rss&utm_campaign=software-mistakes-and-tradeoffs-with-tomasz-lelek",
          "publishedOn": "2021-09-09T09:00:14.000Z",
          "wordCount": null,
          "title": "Software Mistakes and Tradeoffs with Tomasz Lelek",
          "itunes": {
            "duration": "53:24"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED1053814601.mp3",
            "length": "51310610",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11547",
          "author": null,
          "description": "By most accounts, the first databases came on line in the 1960s. This class of software has continued to evolve alongside the technology it runs on and the applications it supports. In the early days, databases were typically closed source commercial products. Today, databases run in the cloud on distributed systems. Increasingly, the leading tools\nThe post Distributed Open Source Databases with Jonathan Ellis and Spencer Kimball appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/09/08/distributed-open-source-databases-with-jonathan-ellis-and-spencer-kimball/?utm_source=rss&utm_medium=rss&utm_campaign=distributed-open-source-databases-with-jonathan-ellis-and-spencer-kimball",
          "publishedOn": "2021-09-08T09:00:52.000Z",
          "wordCount": null,
          "title": "Distributed Open Source Databases with Jonathan Ellis and Spencer Kimball",
          "itunes": {
            "duration": "1:00:11"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED9731440792.mp3",
            "length": "57819852",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11530",
          "author": null,
          "description": "Instabase is a technology platform for building automation solutions. Users deploy it onto their own infrastructure and can leverage the tools offered by the platform to build complex workflows for handling tasks like income verification and claims processing. In this episode we interview Anant Bhardwaj, founder of Instabase. He describes Instabase as an operating system. \nThe post Instabase with Anant Bhardwaj appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/09/07/instabase-with-anant-bhardwaj/?utm_source=rss&utm_medium=rss&utm_campaign=instabase-with-anant-bhardwaj",
          "publishedOn": "2021-09-07T16:38:25.000Z",
          "wordCount": null,
          "title": "Instabase with Anant Bhardwaj",
          "itunes": {
            "duration": "48:09"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED5806231318.mp3",
            "length": "46266914",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11529",
          "author": null,
          "description": "The Israeli Tech Radar is an opinionated map of the latest technologies and trends in the Israeli tech industry. Now in its fifth edition, the Tech Radar was built in collaboration with Monday, Wix, Riskified, Netapp, Tabula, and other tech companies. Lior Kanfi is the CEO of Tikal. In this episode, we interview Lior about\nThe post The Tech Radar with Lior Kanfi appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/09/03/the-tech-radar-with-lior-kanfi/?utm_source=rss&utm_medium=rss&utm_campaign=the-tech-radar-with-lior-kanfi",
          "publishedOn": "2021-09-03T09:00:38.000Z",
          "wordCount": null,
          "title": "The Tech Radar with Lior Kanfi",
          "itunes": {
            "duration": "45:58"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED3513321205.mp3",
            "length": "44168248",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11522",
          "author": null,
          "description": "This episode is hosted by Kyle Polich of the Data Skeptic podcast. We’re glad to welcome Kyle to the Software Daily team. Becoming a contributor to an existing software project can be a daunting task for an engineer. A common convention is to add a README file to your repository to serve as a trailhead\nThe post The Missing Readme with Chris Riccomini and Dmitriy Ryaboy appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/09/01/the-missing-readme-with-chris-riccomini-and-dmitriy-ryaboy/?utm_source=rss&utm_medium=rss&utm_campaign=the-missing-readme-with-chris-riccomini-and-dmitriy-ryaboy",
          "publishedOn": "2021-09-01T18:37:29.000Z",
          "wordCount": null,
          "title": "The Missing Readme with Chris Riccomini and Dmitriy Ryaboy",
          "itunes": {
            "duration": "47:27"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED8757731657.mp3",
            "length": "45586131",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11517",
          "author": null,
          "description": "Whether organizing projects, working from home, or conducting business, you need to use many necessary apps and cloud services to do the job. Despite these apps being necessary, switching between them and keeping them interconnected and updated is a challenge. They very easily become disorganized which makes using them less efficient. The company ClickUp solves\nThe post ClickUp: Workflow Vision with Zeb Evans appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/31/clickup-workflow-vision-with-zeb-evans/?utm_source=rss&utm_medium=rss&utm_campaign=clickup-workflow-vision-with-zeb-evans",
          "publishedOn": "2021-08-31T09:00:10.000Z",
          "wordCount": null,
          "title": "ClickUp: Workflow Vision with Zeb Evans",
          "itunes": {
            "duration": "40:56"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED7801093102.mp3",
            "length": "39338701",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11513",
          "author": null,
          "description": "Kubernetes is an open source container orchestration service released by Google in 2014. It has quickly grown into a platform with a huge community of enthusiasts and professionals. Besides becoming the de facto standard for container orchestration, it has fostered an ecosystem of related tools and services with increasing power and sophistication (opensource.com). Argo, a\nThe post Argo: Kubernetes-Native Tools with Alex Collins appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/30/argo-kubernetes-native-tools-with-alex-collins/?utm_source=rss&utm_medium=rss&utm_campaign=argo-kubernetes-native-tools-with-alex-collins",
          "publishedOn": "2021-08-30T09:00:33.000Z",
          "wordCount": null,
          "title": "Argo: Kubernetes-Native Tools with Alex Collins",
          "itunes": {
            "duration": "52:38"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED8103700860.mp3",
            "length": "50565579",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11488",
          "author": null,
          "description": "Shinji Kim is Founder and CEO of Select Star. In this episode we discuss data discovery and more. This interview was also recorded as a video podcast. Check out the video on the Software Daily YouTube channel. Sponsorship inquiries: sponsor@softwareengineeringdaily.com\nThe post Data Discovery with Shinji Kim appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/27/data-discovery-with-shinji-kim/?utm_source=rss&utm_medium=rss&utm_campaign=data-discovery-with-shinji-kim",
          "publishedOn": "2021-08-27T09:00:14.000Z",
          "wordCount": null,
          "title": "Data Discovery with Shinji Kim",
          "itunes": {
            "duration": "1:27:25"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED5199899172.mp3",
            "length": "83962294",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11487",
          "author": null,
          "description": "ETL stands for “extract, transform, load” and refers to the process of integrating data from many different sources into one location, usually a data warehouse. This process has become especially important for companies as they use many different services to collect and manage data.  The company Grouparoo provides an open source framework that helps you\nThe post Grouparoo Open Source Data Tools with Brian Leonard appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/26/grouparoo-open-source-data-tools-with-brian-leonard/?utm_source=rss&utm_medium=rss&utm_campaign=grouparoo-open-source-data-tools-with-brian-leonard",
          "publishedOn": "2021-08-26T09:00:13.000Z",
          "wordCount": null,
          "title": "Grouparoo Open Source Data Tools with Brian Leonard",
          "itunes": {
            "duration": "50:55"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED3753719230.mp3",
            "length": "48916054",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11486",
          "author": null,
          "description": "In the late 1970s a printer at MIT kept jamming, resulting in regular pileups of print jobs in the printer’s queue. To solve this problem, some computer scientists wrote a software program that alerted every user in the backed up queue “The printer is jammed, please fix it.” When a man named Richard Stallmen was\nThe post Publishing Open Source Code with William Morgan appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/25/publishing-open-source-code-with-william-morgan/?utm_source=rss&utm_medium=rss&utm_campaign=publishing-open-source-code-with-william-morgan",
          "publishedOn": "2021-08-25T09:00:03.000Z",
          "wordCount": null,
          "title": "Publishing Open Source Code with William Morgan",
          "itunes": {
            "duration": "1:00:33"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED2155281547.mp3",
            "length": "58163405",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11485",
          "author": null,
          "description": "Google uses automated programs called spiders, or crawlers, to index and rank web pages. Then, when a user searches for something, it uses a special algorithm to determine the order of results to display (howstuffworks). This process, of course, applies to web pages on the internet. There are 2 major projects, worked on by the\nThe post Cloud Blockchains: The Google of Blockchain with Nader Dabit appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/24/cloud-blockchains-the-google-of-blockchain-with-nader-dabit/?utm_source=rss&utm_medium=rss&utm_campaign=cloud-blockchains-the-google-of-blockchain-with-nader-dabit",
          "publishedOn": "2021-08-24T09:00:53.000Z",
          "wordCount": null,
          "title": "Cloud Blockchains: The Google of Blockchain with Nader Dabit",
          "itunes": {
            "duration": "1:16:27"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED9943731416.mp3",
            "length": "73432086",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11478",
          "author": null,
          "description": "Application security is usually done with a set of tools and services known as SIEM – Security Information and Event Management. SIEM tools usually try to provide visibility into an organization’s security systems, as well as event log management and security event notifications.  The company Panther takes traditional SIEM security a step further. Panther processes\nThe post Panther: Security as Code with Jack Naglieri appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/23/panther-security-as-code-with-jack-naglieri/?utm_source=rss&utm_medium=rss&utm_campaign=panther-security-as-code-with-jack-naglieri",
          "publishedOn": "2021-08-23T19:09:44.000Z",
          "wordCount": null,
          "title": "Panther: Security as Code with Jack Naglieri",
          "itunes": {
            "duration": "47:18"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED5018835007.mp3",
            "length": "45456881",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11475",
          "author": null,
          "description": "Audible is a non-functional product and I’m taking their market with a new kind of audio product.\nThe post Audible dot con appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/22/audible-dot-con/?utm_source=rss&utm_medium=rss&utm_campaign=audible-dot-con",
          "publishedOn": "2021-08-22T15:41:05.000Z",
          "wordCount": null,
          "title": "Audible dot con",
          "itunes": {
            "duration": "57:25"
          },
          "enclosure": {
            "url": "https://s3-us-west-2.amazonaws.com/sd-profile-pictures/adfree/Music_adfree.mp3",
            "length": "110237491",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11472",
          "author": null,
          "description": "“In October 1958, Physicist William Higinbotham created what is thought to be the first video game. It was a very simple tennis game, similar to the classic 1970s video game Pong, and it was quite a hit at a Brookhaven National Laboratory open house” (aps.org). 63 years have passed, and video games are prolific. The\nThe post Pragma: Video Games with Eden Chen appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/20/pragma-video-games-with-eden-chen/?utm_source=rss&utm_medium=rss&utm_campaign=pragma-video-games-with-eden-chen",
          "publishedOn": "2021-08-20T09:00:30.000Z",
          "wordCount": null,
          "title": "Pragma: Video Games with Eden Chen",
          "itunes": {
            "duration": "58:55"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED2257879477.mp3",
            "length": "56595493",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11450",
          "author": null,
          "description": "Time series data are simply measurements or events that are tracked, monitored, downsampled, and aggregated over time. This could be server metrics, application performance monitoring, network data, sensor data, events, clicks, trades in a market, and many other types of analytics data (influxdata.com). The platform InfluxData is designed for building and operating time series applications.\nThe post InfluxData: Time-Series Data with Russ Savage appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/19/influxdata-time-series-data-with-russ-savage/?utm_source=rss&utm_medium=rss&utm_campaign=influxdata-time-series-data-with-russ-savage",
          "publishedOn": "2021-08-19T17:09:30.000Z",
          "wordCount": null,
          "title": "InfluxData: Time-Series Data with Russ Savage",
          "itunes": {
            "duration": "43:55"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED1043165870.mp3",
            "length": "42195358",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11449",
          "author": null,
          "description": "Domain names are the address of your website that people type into the browser URL bar. Once purchased, a domain name is stored on your behalf by custodians like Google domains. Blockchain domains, on the other hand, are similar to regular domain names except they are stored and controlled in your cryptocurrency wallet. The company\nThe post Unstoppable Domains: Blockchain Domains with Matthew Gould appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/18/unstoppable-domains-blockchain-domains-with-matthew-gould/?utm_source=rss&utm_medium=rss&utm_campaign=unstoppable-domains-blockchain-domains-with-matthew-gould",
          "publishedOn": "2021-08-18T09:00:26.000Z",
          "wordCount": null,
          "title": "Unstoppable Domains: Blockchain Domains with Matthew Gould",
          "itunes": {
            "duration": "51:18"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED4380018449.mp3",
            "length": "49282594",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11448",
          "author": null,
          "description": "Pay-as-you-go pricing has become a strong selling point for modern SaaS companies as well as cloud-based companies. Public cloud providers, for example, typically only charge you for only what you use. But implementing this option is challenging because it requires advanced platform analytics. The company Octane is a drop-in metered billing system that gives you\nThe post getoctane.io: Pay-As-You-Go Pricing with Akash Khanolkar appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/17/octane-io-pay-as-you-go-pricing-with-akash-khanolkar/?utm_source=rss&utm_medium=rss&utm_campaign=octane-io-pay-as-you-go-pricing-with-akash-khanolkar",
          "publishedOn": "2021-08-17T09:00:24.000Z",
          "wordCount": null,
          "title": "getoctane.io: Pay-As-You-Go Pricing with Akash Khanolkar",
          "itunes": {
            "duration": "1:16:32"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED1928379818.mp3",
            "length": "73521406",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11447",
          "author": null,
          "description": "Whether sending messages, shopping in an app, or watching videos, modern consumers expect information and responsiveness to be near-instant in their apps and devices. From a developer’s perspective, this means clean code and a fast database.  Apache Druid is a database built to power real-time analytic workloads for event-driven data, like user-facing applications, streaming, and\nThe post Druid: Event-Driven Data with Eric Tschetter appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/16/druid-event-driven-data-with-eric-tschetter/?utm_source=rss&utm_medium=rss&utm_campaign=druid-event-driven-data-with-eric-tschetter",
          "publishedOn": "2021-08-16T09:00:22.000Z",
          "wordCount": null,
          "title": "Druid: Event-Driven Data with Eric Tschetter",
          "itunes": {
            "duration": "56:26"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED6908668584.mp3",
            "length": "54210337",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11445",
          "author": null,
          "description": "This episode was published on the GeekWire podcast. Subscribe to GeekWire for more great content. Facebook CEO Mark Zuckerberg told employees recently that the company’s long-term goal is to “bring the metaverse to life” — helping to create an interconnected world of physical, virtual and augmented reality spaces that will reshape the way we work, interact with\nThe post How Facebook Works: Comparing its Engineering Process to Google, Microsoft, and Amazon appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/14/how-facebook-works-comparing-its-engineering-process-to-google-microsoft-and-amazon/?utm_source=rss&utm_medium=rss&utm_campaign=how-facebook-works-comparing-its-engineering-process-to-google-microsoft-and-amazon",
          "publishedOn": "2021-08-14T09:00:20.000Z",
          "wordCount": null,
          "title": "How Facebook Works: Comparing its Engineering Process to Google, Microsoft, and Amazon",
          "itunes": {
            "duration": "32:06"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED1720536971.mp3",
            "length": "30860781",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11436",
          "author": null,
          "description": "Auren Hoffman is the CEO of SafeGraph. In this episode we discuss data as a service and more. This interview was also recorded as a video podcast. Check out the video on the Software Daily YouTube channel. Sponsorship inquiries: sponsor@softwareengineeringdaily.com\nThe post DaaS with Auren Hoffman appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/13/daas-with-auren-hoffman/?utm_source=rss&utm_medium=rss&utm_campaign=daas-with-auren-hoffman",
          "publishedOn": "2021-08-13T09:00:25.000Z",
          "wordCount": null,
          "title": "DaaS with Auren Hoffman",
          "itunes": {
            "duration": "1:47:58"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED4822052713.mp3",
            "length": "103687829",
            "type": "audio/mpeg"
          }
        }
      ]
    },
    {
      "title": "Camunda",
      "feedUrl": "https://camunda.com/feed/",
      "siteUrl": "https://camunda.com",
      "articles": [
        {
          "id": "https://camunda.com/?p=29366",
          "author": "Brittany des Vignes",
          "description": "Now live! Listen as Gabor explains why the BPMN-driven testing extension was created as an answer to some developer woes.\nThe post Podcast: ​​Introducing the BPMN-Driven Testing Extension appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/09/podcast-introducing-the-bpmn-driven-testing-extension/",
          "publishedOn": "2021-09-10T15:20:12.000Z",
          "wordCount": 1332,
          "title": "Podcast: ​​Introducing the BPMN-Driven Testing Extension"
        },
        {
          "id": "https://camunda.com/?p=29008",
          "author": "Jakob Freund",
          "description": "Learn why Camunda CEO Jakob Freund thinks process automation can help organizations with legacy technology compete with startups.\nThe post Automation: A Recipe for Disruption appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/09/automation-a-recipe-for-disruption/",
          "publishedOn": "2021-09-09T14:13:20.000Z",
          "wordCount": 1271,
          "title": "Automation: A Recipe for Disruption"
        },
        {
          "id": "https://camunda.com/?p=28533",
          "author": "Brittany des Vignes",
          "description": "In this episode, follow Rin Oliver as he explains what he does at Camunda to enable developers to do what they do better and faster.\nThe post Podcast: Meet the Camundos – Rin Oliver appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/09/podcast-meet-the-camundos-rin-oliver/",
          "publishedOn": "2021-09-03T18:54:38.000Z",
          "wordCount": 1320,
          "title": "Podcast: Meet the Camundos – Rin Oliver"
        },
        {
          "id": "https://camunda.com/?p=27992",
          "author": "Camunda Team",
          "description": "This is Camunda’s second year participating in Hacktoberfest, and we are so excited to showcase bpmn.io and the Camunda Community Hub. \nThe post Join the Fun – Hacktoberfest 2021 appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/09/join-the-fun-hacktoberfest-2021/",
          "publishedOn": "2021-09-01T18:59:53.000Z",
          "wordCount": 1508,
          "title": "Join the Fun – Hacktoberfest 2021"
        },
        {
          "id": "https://camunda.com/?p=27670",
          "author": "Jakob Freund",
          "description": "Instead of dramatic, rip-and-replace events, Camunda CEO Jakob Freund describes how gradual digital transformation can be a more practical and strategic path to automation.\nThe post The Art of Gradual Digital Transformation appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/08/the-art-of-gradual-digital-transformation/",
          "publishedOn": "2021-08-26T16:57:46.000Z",
          "wordCount": 1288,
          "title": "The Art of Gradual Digital Transformation"
        },
        {
          "id": "https://camunda.com/?p=27174",
          "author": "Nele Uhlemann",
          "description": "Camunda Platform and Camunda Cloud are “same same, but different.” Find out the similarities and differences of these workflow engines.\nThe post Same Same, But Different (Workflow Engines) appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/08/same-same-but-different-workflow-engines/",
          "publishedOn": "2021-08-23T14:00:01.000Z",
          "wordCount": 2580,
          "title": "Same Same, But Different (Workflow Engines)"
        },
        {
          "id": "https://camunda.com/?p=27320",
          "author": "Camunda Team",
          "description": "All automation tools are not created equal. It’s important that you choose the right tool for the job.\nThe post How to Choose a Process Automation Tool appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/08/how-to-choose-a-process-automation-tool/",
          "publishedOn": "2021-08-20T19:29:42.000Z",
          "wordCount": 1751,
          "title": "How to Choose a Process Automation Tool"
        },
        {
          "id": "https://camunda.com/?p=26096",
          "author": "Camunda Team",
          "description": "The latest episode of the Camunda Nation podcast is live. Join us on a journey through the BPMN Diagram to find your ideal Camunda Platform architecture. \nThe post Podcast: What Camunda Platform Architecture Are You? appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/08/podcast-what-camunda-platform-architecture-are-you/",
          "publishedOn": "2021-08-16T14:08:25.000Z",
          "wordCount": 1336,
          "title": "Podcast: What Camunda Platform Architecture Are You?"
        },
        {
          "id": "https://camunda.com/?p=26961",
          "author": "Camunda Team",
          "description": "With Kubernetes being pretty ubiquitous today, we decided it was time to help you deploy Camunda Platform on Kubernetes in a snap, so we created the Community Helm Chart.\nThe post Releasing Camunda Platform Community Helm Chart appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/08/releasing-camunda-platform-community-helm-chart/",
          "publishedOn": "2021-08-13T13:19:27.000Z",
          "wordCount": 2127,
          "title": "Releasing Camunda Platform Community Helm Chart"
        },
        {
          "id": "https://camunda.com/?p=26973",
          "author": "Gottfried Sehringer",
          "description": "We’re excited to share two new keynote speakers who we just added to our CamundaCon 2021 agenda, each of whom will be leading important discussions related to process automation. \nThe post CamundaCon 2021 Keynotes Revealed: Angie Jones & Hannah Fry appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/08/camundacon-2021-keynotes-revealedangie-jones-hannah-fry/",
          "publishedOn": "2021-08-12T14:00:00.000Z",
          "wordCount": 1480,
          "title": "CamundaCon 2021 Keynotes Revealed: Angie Jones & Hannah Fry"
        }
      ]
    },
    {
      "title": "となりのヤングジャンプ（ワンパンマン）",
      "feedUrl": "https://tonarinoyj.jp/rss/series/13932016480028984490",
      "siteUrl": "https://tonarinoyj.jp/episode/13932016480028985383",
      "articles": [
        {
          "id": "tonarino_yj:episode:3269754496479987879",
          "author": "原作/ＯＮＥ/漫画/村田雄介",
          "description": "ワンパンマン",
          "link": "https://tonarinoyj.jp/episode/3269754496479987879",
          "publishedOn": "2021-09-02T15:00:00.000Z",
          "wordCount": 101,
          "title": "[第153話] ワンパンマン",
          "enclosure": {
            "url": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/3269754496479987879-24fb75cee700fb5ea50c4465b5b3e0f4",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "tonarino_yj:episode:3269754496462105179",
          "author": "原作/ＯＮＥ/漫画/村田雄介",
          "description": "ワンパンマン",
          "link": "https://tonarinoyj.jp/episode/3269754496462105179",
          "publishedOn": "2021-08-23T15:00:00.000Z",
          "wordCount": 101,
          "title": "[第152話] ワンパンマン",
          "enclosure": {
            "url": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/3269754496462105179-ce968165f07f3621548bc20c299f8d66",
            "length": "0",
            "type": "image/jpeg"
          }
        }
      ]
    }
  ],
  "cliVersion": "1.11.0"
}