{
  "sources": [
    {
      "title": "Spring",
      "feedUrl": "https://spring.io/blog.atom",
      "siteUrl": "https://spring.io/blog",
      "articles": [
        {
          "id": "https://spring.io/blog/2021/11/05/spring-cloud-data-flow-2-8-4-and-2-9-1-released",
          "author": null,
          "description": "Spring Cloud Data Flow team is pleased to announce the release of 2.8.4 and 2.9.1\n\r\nReleases 2.9.1 and 2.8.4 contains a quick bug fix and more changes were made in 2.9.0 and 2.8.3. For complete list of changes for 2.9.x you can see its milestone and rc notes in releases.\nStay in touch…\n\r\nAs always, we welcome feedback and contributions, so please reach out to us on Stackoverflow or GitHub or via Gitter.",
          "link": "https://spring.io/blog/2021/11/05/spring-cloud-data-flow-2-8-4-and-2-9-1-released",
          "publishedOn": "2021-11-05T10:09:09.000Z",
          "wordCount": 453,
          "title": "Spring Cloud Data Flow 2.8.4 and 2.9.1 Released"
        },
        {
          "id": "https://spring.io/blog/2021/11/04/bootiful-podcast-legend-dutchess-founder-devoxx4kids-contributor-and-fellow-java-champion-linda-van-der-pal",
          "author": null,
          "description": "Hi, Spring fans! In this episode Josh Long (@starbuxman) talks to Dutchess founder, Devoxx4Kids Netherlands (@Devoxx4KidsNL) leader, inspiring person, and fellow Java Champion Linda van der Pal (@DuchessFounder).",
          "link": "https://spring.io/blog/2021/11/04/bootiful-podcast-legend-dutchess-founder-devoxx4kids-contributor-and-fellow-java-champion-linda-van-der-pal",
          "publishedOn": "2021-11-04T20:00:00.000Z",
          "wordCount": 423,
          "title": "Bootiful Podcast: Legend, Dutchess founder, Devoxx4Kids contributor, and fellow Java Champion Linda van der Pal"
        },
        {
          "id": "https://spring.io/blog/2021/11/04/spring-cloud-gateway-versions-2-2-10-release-and-3-0-5-are-now-available",
          "author": null,
          "description": "On behalf of the community, I am pleased to announce that Spring Cloud Gateway versions 2.2.10.RELEASE and 3.0.5.\n\r\nThese are primarily security releases with fixes for the CVE-2021-22051. \n\r\nThese versions will be picked up later by the 2020.0.x and 2021.0.x release trains, however, we recommend you upgrade Spring Cloud Gateway in your projects to these most recent versions.",
          "link": "https://spring.io/blog/2021/11/04/spring-cloud-gateway-versions-2-2-10-release-and-3-0-5-are-now-available",
          "publishedOn": "2021-11-04T19:00:34.000Z",
          "wordCount": 443,
          "title": "Spring Cloud Gateway versions 2.2.10.RELEASE and 3.0.5 are now available"
        },
        {
          "id": "https://spring.io/blog/2021/11/03/spring-cloud-2021-0-0-rc1-codename-jubilee-has-been-released",
          "author": null,
          "description": "On behalf of the community, I am pleased to announce that the Release Candidate 1 (RC1) of the Spring Cloud 2021.0 Release Train, codename Jubilee, is available today. The release can be found in Spring Milestone repository. You can check out the 2021.0 release notes for more information.\nNotable Changes in the 2021.0 Release Train\n\r\nRC1 is compatible with Spring Boot 2.6.0-RC1\n\r\nSee the project page for all the issues and pull requests included in this release.\nSpring Cloud Commons\n\r\n\r\n  \nAdds support for per LoadBalancer client properties. (issue)\n\r\n  \nAdds X-Forwarded-* headers when using load-balanced RestTemplate. (issue)\n\r\n\nSpring Cloud Kubernetes\n\r\n\r\n  \nAdds support for disabling Discovery when spring.cloud.kubernetes.enabled=false. (issue)\n\r\n  \nBetter failure handling when a Config…",
          "link": "https://spring.io/blog/2021/11/03/spring-cloud-2021-0-0-rc1-codename-jubilee-has-been-released",
          "publishedOn": "2021-11-03T23:39:00.000Z",
          "wordCount": 778,
          "title": "Spring Cloud 2021.0.0-RC1 (codename Jubilee) Has Been Released"
        },
        {
          "id": "https://spring.io/blog/2021/11/03/spring-tips-controllers-give-http-a-rest",
          "author": null,
          "description": "Hi, Spring fans! In this installment, we’ll continue our exploration of @Controllers, and look at HTTP APIs and SSE with Spring. This time, we’ll use Spring Webflux. \n\r\nThe code is here: github.com/spring-tips/controllers",
          "link": "https://spring.io/blog/2021/11/03/spring-tips-controllers-give-http-a-rest",
          "publishedOn": "2021-11-03T21:00:00.000Z",
          "wordCount": 411,
          "title": "Spring Tips: @Controllers: Give HTTP a REST"
        },
        {
          "id": "https://spring.io/blog/2021/11/02/this-week-in-spring-november-2nd-2021",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring! How’re you doin’? I’ve been busy as all get out emceeing the Reactive Summit 2021 event (it’s free and it’s online!). The event has been awe-inspiring because there are so many amazing speakers from all walks of life present and speaking. Today, the conference welcomed professor Carl Hewitt, the creator of the Actor Paradigm, as its keynote. Then, figuring there was no topping that and figuring they could go for broke, they foolishly ( muahahah! ) asked me to do the day two keynote. So, I’ll be doing tomorrow’s keynote with my friend and Google Developer Advocate James Ward. Join us! It’ll be super fun! \n\r\nWe’ve got a ton of stuff to get to this week though, so let’s dive right into it! \n\r\n\r\n  \nBootiful Podcast: Daniel Mikusa on Buildpacks, Paketo, UPX, Tilt, GraalVM Native Images, Docker Containers and more\n\r\n  \nWant to run the most modern incarnation of what used to be ActiveMQ? On the cloud? Check out the ArtemisCloud Operator which lets you easily stand up an Artemis instance on Kubernetes.\n\r\n  \nCool! Check this out: Google announced Kotlin support for Google protocol buffers\n\r\n  \nA nice tutorial: how to set the logging level with application.properties in Spring Boot \n\r\n  \nHow to update an entity using Spring Data JPA? \n\r\n  \nSpring GraphQL 1.0.0-M3 Released\n\r\n  \nSpring Tips: @Controllers (pt. 1): the “C” in Model 2 MVC\n\r\n  \nSpring Tools 4.12.1 released\n\r\n  \nWe’re hiring! Join us: Staff-Software-Engineer - Cloud-Native-Runtimes–Streaming \n\r\n  \nThe new VMware Tanzu for developers hands-on lab is out!\n\r\n  \nJoin me for this year’s YOW! Conference!\n\r\n  \nAppDynamics - 1 step to activate and monitor Spring Boot apps on Azure Spring Cloud \n\r\n  \nOne cool way to remove developer toil and improve security in Kubernetes, the VMWare Tanzu build service. Check out more and down",
          "link": "https://spring.io/blog/2021/11/02/this-week-in-spring-november-2nd-2021",
          "publishedOn": "2021-11-02T19:00:00.000Z",
          "wordCount": 679,
          "title": "This Week in Spring - November 2nd, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/10/28/bootiful-podcast-daniel-mikusa-on-buildpacks-paketo-upx-tilt-graalvm-native-images-docker-containers-and-more",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks to Paketo contributor Daniel Mikusa about buildpacks, Paketo, containers, UPX, and so much more",
          "link": "https://spring.io/blog/2021/10/28/bootiful-podcast-daniel-mikusa-on-buildpacks-paketo-upx-tilt-graalvm-native-images-docker-containers-and-more",
          "publishedOn": "2021-10-28T22:00:00.000Z",
          "wordCount": 421,
          "title": "Bootiful Podcast: Daniel Mikusa on Buildpacks, Paketo, UPX, Tilt, GraalVM Native Images, Docker Containers and more"
        },
        {
          "id": "https://spring.io/blog/2021/10/28/spring-graphql-1-0-0-m3-released",
          "author": null,
          "description": "The Spring GraphQL team is pleased to announce a 3rd milestone towards a 1.0.0 release, driven with great help from the community .\nBatch Mapping\n\r\nThe 2nd milestone introduced an annotation programming model for GraphQL data controllers with @SchemaMapping methods. The 3rd milestone adds a new @BatchMapping method.\n\r\nIf you’re familiar with GraphQL, you know that navigating an object graph can cause the “N+1 queries problem” if we’re not mapping carefully object relations. We could already leverage the Batching feature from GraphQL Java to solve that problem, but this release introduces dedicated support as well as an @BatchMapping annotation for a smoother experience:\n\r\n@Controller\r\r\npublic class BookController {\r\r\n\r\r\n    @BatchMapping\r\r\n    public Mono<Map<Book, Author>> author(List<Boo…",
          "link": "https://spring.io/blog/2021/10/28/spring-graphql-1-0-0-m3-released",
          "publishedOn": "2021-10-28T15:46:00.000Z",
          "wordCount": 1046,
          "title": "Spring GraphQL 1.0.0-M3 Released"
        },
        {
          "id": "https://spring.io/blog/2021/10/27/spring-tools-4-12-1-released",
          "author": null,
          "description": "Dear Spring Community,\n\r\nI am happy to announce the 4.12.1 release of the Spring Tools 4 for Eclipse, Visual Studio Code, and Theia.\nimportant updates to the Spring Tools 4 for Eclipse distribution\n\r\n\r\n  \nembedded runtime upgraded to JDK17 (across all distributions, including Apple Silicon)\n\r\n  \nJava 17 support available (via separate add-on)\n\r\n  \nearly-access builds for upcoming Eclipse 2021-12 release available\n\r\n  \nearly-access builds for Apple Silicon platform (ARM M1) available\n\r\n\nadditional changes\n\r\n\r\n  \n(Eclipse) fixed: Alway Download sources and javadoc when I open sts (distribution includes latest m2e 1.18.2 release now) (#692)\n\r\n  \n(Eclipse) fixed: docker integration doesn’t work on Apple Silicon (#684)\n\r\n  \n(Eclipse) fixed: Annoying error message on every eclipse startup if CF destination is not reachable (#688)\n\r\n\r\nTo download the distribution for Eclipse and find links to the marketplace entries for Visual Studio Code and Theia, please go visit:\n\r\n\r\n  \nSpring Tools 4: https://spring.io/tools/\n\r\n\r\nDetailed changes can be found here: https://github.com/spring-projects/sts4/wiki/Changelog#2021-10-27-4121-release-no-language-server-updates\n\r\nSpring Tools 4.13.0 is scheduled to be released in late December 2021.\n\r\nEnjoy!",
          "link": "https://spring.io/blog/2021/10/27/spring-tools-4-12-1-released",
          "publishedOn": "2021-10-27T19:00:00.000Z",
          "wordCount": 533,
          "title": "Spring Tools 4.12.1 released"
        },
        {
          "id": "https://spring.io/blog/2021/10/27/spring-tips-controllers-pt-1-the-c-in-model-2-mvc",
          "author": null,
          "description": "Hi, Spring fans! In this installment, the first of a series, Josh Long looks at the venerable @Controller annotation and its use supporting Model 2 MVC-style web applications.",
          "link": "https://spring.io/blog/2021/10/27/spring-tips-controllers-pt-1-the-c-in-model-2-mvc",
          "publishedOn": "2021-10-27T07:00:00.000Z",
          "wordCount": 415,
          "title": "Spring Tips: @Controllers (pt. 1): the \"C\" in Model 2 MVC"
        },
        {
          "id": "https://spring.io/blog/2021/10/26/this-week-in-spring-october-26th-2021",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring! How are you? \n\r\nI’m doing well, as always. I literally just wrapped up presenting a fun session at the Russian Joker conference all about Spring and GraphQL. I got a ton of great questions from an enthusiastic audience. Thanks so much for joining me, everyone. I’ve got to get to other meetings, though, so let’s get this wonderful week in Spring out of the way! \n\r\n\r\n  \nSpring Tips: refreshable configuration with Spring Cloud Bus, and the Spring Cloud Config Monitor\n\r\n  \nIn last week’s A Bootiful Podcast, I talked to RabbitMQ and Weaveworks founder Alexis Richardson about RabbitMQ, Pivotal, Spring, Kubernetes, and FluxCD\n\r\n  \nA great article that @Javinpaul linked me to: What is @PropertySource in Spring Framework? \n\r\n  …",
          "link": "https://spring.io/blog/2021/10/26/this-week-in-spring-october-26th-2021",
          "publishedOn": "2021-10-26T18:00:00.000Z",
          "wordCount": 779,
          "title": "This Week in Spring - October 26th, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/10/26/security-reports-for-spring-framework-spring-data-rest-spring-amqp-and-spring-cloud-openfeign",
          "author": null,
          "description": "The recently released Spring Boot 2.5.6 and 2.4.12 releases contain fixes for the following security vulnerabilities:\n\r\n\r\n  \nCVE-2021-22096 for the Spring Framework\n\r\n  \nCVE-2021-22047 for Spring Data REST\n\r\n  \nCVE-2021-22097 for Spring AMQP\n\r\n\r\nIn addition, Spring Cloud OpenFeign has released versions 3.0.5 and 2.2.10, based on the same Spring Boot versions, and containing a fix for the following security vulnerability:\n\r\n\r\n  \nCVE-2021-22044 for Spring Cloud OpenFeign\n\r\n\r\nPlease, review the reports and upgrade!",
          "link": "https://spring.io/blog/2021/10/26/security-reports-for-spring-framework-spring-data-rest-spring-amqp-and-spring-cloud-openfeign",
          "publishedOn": "2021-10-26T17:00:00.000Z",
          "wordCount": 461,
          "title": "Security Reports for Spring Framework, Spring Data REST, Spring AMQP, and Spring Cloud OpenFeign"
        },
        {
          "id": "https://spring.io/blog/2021/10/26/spring-cloud-openfeign-versions-2-2-10-release-3-0-5-and-3-1-0-m4-are-now-available",
          "author": null,
          "description": "On behalf of the community, I am pleased to announce that Spring Cloud OpenFeign versions 2.2.10.RELEASE, 3.0.5 and 3.1.0-M4 have been released.\n\r\nThese are primarily security releases with fixes for the CVE-2021-22044. \n\r\nApplications using type-level @RequestMappingannotations over Feign client interfaces, can be involuntarily exposing endpoints corresponding to @RequestMapping-annotated interface methods. Although a response is not returned for a request sent in this way, it does reach the corresponding server-side endpoint.\n\r\nThe practice of using a type-level @RequestMapping on a Feign client interface has been discouraged in the documentation, but we’re now taking the step to reject it completely.\n\r\nThese versions will be picked up later by the 2020.0.x and 2021.0.x release trains, however, we recommend you already upgrade Spring Cloud OpenFeign in your projects to these most recent versions.\n\r\nSee all issues included in 2.2.10.RELEASE here\nSee all issues included in 3.1.0-M4 here\nNo additional issues were included for 3.0.5.",
          "link": "https://spring.io/blog/2021/10/26/spring-cloud-openfeign-versions-2-2-10-release-3-0-5-and-3-1-0-m4-are-now-available",
          "publishedOn": "2021-10-26T17:00:00.000Z",
          "wordCount": 535,
          "title": "Spring Cloud OpenFeign versions 2.2.10.RELEASE, 3.0.5 and 3.1.0-M4 are now available"
        },
        {
          "id": "https://spring.io/blog/2021/10/26/new-features-for-spring-cloud-kubernetes-in-spring-cloud-2021-0-0-m3",
          "author": null,
          "description": "When we got the results back from the latest State Of Spring survey, 67% of you said you would like to see better support for service discovery and configuration management on Kubernetes.\n\r\nWith the release of Spring Cloud 2021.0.0-M3, we are taking a big step forward to addressing both of these concerns!\n\r\nSpring Cloud Kubernetes has offered a DiscoveryClient implementation since its inception. However, the implementation required the application to have permissions to use the Kubernetes API server. This proved to be a major barrier for many Spring Cloud user’s, as Kubernetes administrators were hesitant to give apps permissions to make API requests to the Kubernetes API server.\n\r\nConfiguration management using Spring Cloud Kubernetes also suffered from the same requirement of needing acc…",
          "link": "https://spring.io/blog/2021/10/26/new-features-for-spring-cloud-kubernetes-in-spring-cloud-2021-0-0-m3",
          "publishedOn": "2021-10-26T07:00:00.000Z",
          "wordCount": 1443,
          "title": "New Features For Spring Cloud Kubernetes In Spring Cloud 2021.0.0-M3"
        },
        {
          "id": "https://spring.io/blog/2021/10/25/spot-every-spring-boot-application-issue-on-the-spot-using-appdynamics",
          "author": null,
          "description": "Today, we are excited to announce the integration of AppDynamics in the Azure Spring Cloud for full stack observability.\n\r\nOver the past 20 months, we worked with many enterprise customers to learn about the scenarios they face. Many of these customers have thousands of Spring Boot applications running in on-premises data centers. As they migrate these applications to the cloud, they need to instrument them for application performance monitoring (APM) using solutions their developers are familiar with and have been using for years. In addition, they must ensure continuity for desktop and mobile applications that are already pre-instrumented for end-to-end monitoring using agents like AppDynamics, which automatically discovers and maps all applications, microservices, and infrastructure as …",
          "link": "https://spring.io/blog/2021/10/25/spot-every-spring-boot-application-issue-on-the-spot-using-appdynamics",
          "publishedOn": "2021-10-25T16:00:00.000Z",
          "wordCount": 1745,
          "title": "Spot every Spring Boot application issue on the spot using AppDynamics!"
        },
        {
          "id": "https://spring.io/blog/2021/10/25/spring-cloud-square-0-4-0-m3-is-available",
          "author": null,
          "description": "On behalf of the community, I am pleased to announce that the Milestone 3 (M3) of the Spring Cloud Square 0.4.0 is available today. The release can be found in Spring Milestone repository. You can check out the 0.4.0-M3 release notes for more information.\n\r\nThis is primarily a bugfix release. See all issues included in this release here.\n\r\nThe documentation for this milestone can be found here.",
          "link": "https://spring.io/blog/2021/10/25/spring-cloud-square-0-4-0-m3-is-available",
          "publishedOn": "2021-10-25T11:00:00.000Z",
          "wordCount": 444,
          "title": "Spring Cloud Square 0.4.0-M3 is available."
        },
        {
          "id": "https://spring.io/blog/2021/10/21/a-bootiful-podcast-rabbitmq-and-weaveworks-founder-alexis-richardson-on-rabbitmq-pivotal-spring-kubernetes-and-fluxcd",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talk to RabbitMQ and Weaveworks founder Alexis Richardson (@monadic) about RabbitMQ, Pivotal, Spring, Kubernetes, and FluxCD. NB: this interview was done a year ago, and I was just playing with FluxCD these last few weeks and I figured it was finally time to release this episode! Thanks so much Alexis for sharing and teaching us so much!",
          "link": "https://spring.io/blog/2021/10/21/a-bootiful-podcast-rabbitmq-and-weaveworks-founder-alexis-richardson-on-rabbitmq-pivotal-spring-kubernetes-and-fluxcd",
          "publishedOn": "2021-10-21T22:27:00.000Z",
          "wordCount": 463,
          "title": "A Bootiful Podcast: RabbitMQ and Weaveworks founder Alexis Richardson on RabbitMQ, Pivotal, Spring, Kubernetes, and FluxCD"
        },
        {
          "id": "https://spring.io/blog/2021/10/21/spring-boot-2-6-0-rc1-is-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.6.0-RC1 has been released and is now available from https://repo.spring.io/milestone.\n\r\nThis release includes 85 bug fixes, documentation improvements, and dependency upgrades. New and Noteworthy features in this release include:\n\r\n\r\n  \nJava runtime information is optionally available in the /actuator/info endpoint\n\r\n  \nSupport has been added for Log4j2 composite configurations\n\r\n  \nAdditional configuration options have been added for buildpacks\n\r\n  \nSameSite cookie attributes are now supported with the servlet stack\n\r\n\r\nFor a complete list of the updates along with upgrading instructions, please take a look at the release notes.\n\r\nThanks to all those who have contributed with issue reports and pull requests. Spring Boot 2.6.0 is due to be released Nov 18, 2021.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/10/21/spring-boot-2-6-0-rc1-is-available-now",
          "publishedOn": "2021-10-21T22:00:00.000Z",
          "wordCount": 555,
          "title": "Spring Boot 2.6.0-RC1 is available now"
        },
        {
          "id": "https://spring.io/blog/2021/10/21/spring-boot-2-5-6-is-now-available",
          "author": null,
          "description": "Update (2021-10-26): Multiple Spring projects included in this release contain fixes for security issues. Please, read the related announcement.\n\r\nOn behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.5.6 has been released and is now available from Maven Central.\n\r\nThis release includes 43 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/10/21/spring-boot-2-5-6-is-now-available",
          "publishedOn": "2021-10-21T13:17:00.000Z",
          "wordCount": 501,
          "title": "Spring Boot 2.5.6 is now available"
        },
        {
          "id": "https://spring.io/blog/2021/10/21/spring-boot-2-4-12-is-now-available",
          "author": null,
          "description": "Update (2021-10-26): Multiple Spring projects included in this release contain fixes for security issues. Please, read the related announcement.\n\r\nOn behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.4.12 has been released and is now available from Maven Central.\n\r\nThis release includes 36 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/10/21/spring-boot-2-4-12-is-now-available",
          "publishedOn": "2021-10-21T12:20:00.000Z",
          "wordCount": 501,
          "title": "Spring Boot 2.4.12 is now available"
        }
      ]
    },
    {
      "title": "HashiCorp Blog",
      "feedUrl": "https://www.hashicorp.com/blog/feed.xml",
      "siteUrl": "https://hashicorp.com/blog",
      "articles": [
        {
          "id": "https://www.hashicorp.com/blog/plans-to-archive-unmaintained-packer-provisioner-plugins",
          "author": null,
          "description": "We plan to archive some unmaintained HashiCorp Packer provisioner plugins. Here’s what that means for practitioners.",
          "link": "https://www.hashicorp.com/blog/plans-to-archive-unmaintained-packer-provisioner-plugins",
          "publishedOn": "2021-11-05T16:00:00.000Z",
          "wordCount": 859,
          "title": "Plans to Archive Unmaintained Packer Provisioner Plugins"
        },
        {
          "id": "https://www.hashicorp.com/blog/why-use-the-vault-agent-for-secrets-management",
          "author": null,
          "description": "Learn how HashiCorp’s Vault Agent can help you achieve zero trust security in a simple manner, consistently across all application teams.",
          "link": "https://www.hashicorp.com/blog/why-use-the-vault-agent-for-secrets-management",
          "publishedOn": "2021-11-03T16:00:00.000Z",
          "wordCount": 1622,
          "title": "Why Use the Vault Agent for Secrets Management?"
        },
        {
          "id": "https://www.hashicorp.com/blog/hcp-vault-adds-3-new-observability-integrations",
          "author": null,
          "description": "New integrations with Datadog, Grafana Cloud, and Splunk offer pre-built dashboards for usage and performance monitoring in HCP Vault.",
          "link": "https://www.hashicorp.com/blog/hcp-vault-adds-3-new-observability-integrations",
          "publishedOn": "2021-11-02T16:30:00.000Z",
          "wordCount": 904,
          "title": "HCP Vault Adds 3 New Observability Integrations"
        },
        {
          "id": "https://www.hashicorp.com/blog/highlights-from-hashiconf-global-2021-for-enterprises",
          "author": null,
          "description": "A recap of key announcements and presentations from HashiConf Global 2021 — focused on the needs and interests of enterprises.",
          "link": "https://www.hashicorp.com/blog/highlights-from-hashiconf-global-2021-for-enterprises",
          "publishedOn": "2021-10-29T16:00:00.000Z",
          "wordCount": 2570,
          "title": "Highlights From HashiConf Global 2021 for Enterprises"
        },
        {
          "id": "https://www.hashicorp.com/blog/hcp-consul-updates-new-terraform-module-for-eks-and-ec2-ecs-guide",
          "author": null,
          "description": "New quickstart video demos walk you through our new Terraform module for Amazon EKS and EC2, and show how to test managing Consul features on Amazon ECS.",
          "link": "https://www.hashicorp.com/blog/hcp-consul-updates-new-terraform-module-for-eks-and-ec2-ecs-guide",
          "publishedOn": "2021-10-28T18:00:00.000Z",
          "wordCount": 776,
          "title": "HCP Consul Updates: New Terraform Module for EKS and EC2, and an ECS Learn Guide"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-cdk-for-terraform-0-7",
          "author": null,
          "description": "Cloud Development Kit for Terraform 0.7 introduces a tech preview for compatibility with AWS CDK constructs, a simplified provider API, and improved documentation.",
          "link": "https://www.hashicorp.com/blog/announcing-cdk-for-terraform-0-7",
          "publishedOn": "2021-10-27T16:00:00.000Z",
          "wordCount": 1030,
          "title": "Announcing CDK for Terraform 0.7"
        },
        {
          "id": "https://www.hashicorp.com/blog/volunteer-for-hashicorp-certified-vault-operations-professional-beta-exam",
          "author": null,
          "description": "Take the beta exam for the newest level of Vault certification — for free — and you’ll have a chance to be one of the first certified Vault Ops Pros.",
          "link": "https://www.hashicorp.com/blog/volunteer-for-hashicorp-certified-vault-operations-professional-beta-exam",
          "publishedOn": "2021-10-25T16:00:00.000Z",
          "wordCount": 711,
          "title": "Volunteer for HashiCorp Certified: Vault Operations Professional Beta Exam"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-global-2021-delivers-deep-learning-for-practitioners",
          "author": null,
          "description": "Watch the keynotes and some of the most informative sessions for practitioners from HashiConf Global 2021.",
          "link": "https://www.hashicorp.com/blog/hashicorp-global-2021-delivers-deep-learning-for-practitioners",
          "publishedOn": "2021-10-22T20:00:00.000Z",
          "wordCount": 1027,
          "title": "HashiCorp Global 2021 Delivers Deep Learning for Practitioners"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-hashicorp-consul-api-gateway",
          "author": null,
          "description": "The new Consul API Gateway is a dedicated ingress solution for intelligently routing traffic to applications running on the HashiCorp Consul service mesh.",
          "link": "https://www.hashicorp.com/blog/announcing-hashicorp-consul-api-gateway",
          "publishedOn": "2021-10-20T16:00:00.000Z",
          "wordCount": 1039,
          "title": "Introducing the Consul API Gateway"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-hashicorp-consul-1-11",
          "author": null,
          "description": "HashiCorp Consul 1.11 adds important new features: multi-tenancy with administrative partitions and a new installation-and-management Consul Kubernetes CLI.",
          "link": "https://www.hashicorp.com/blog/announcing-hashicorp-consul-1-11",
          "publishedOn": "2021-10-20T16:00:00.000Z",
          "wordCount": 1060,
          "title": "Announcing HashiCorp Consul 1.11 Beta"
        },
        {
          "id": "https://www.hashicorp.com/blog/share-your-nomad-packs-for-a-pack-contest",
          "author": null,
          "description": "Get a HashiCorp backpack! Contributors who share their open source templates in the Nomad Pack Registry can win a variety of Nomad-themed prizes.",
          "link": "https://www.hashicorp.com/blog/share-your-nomad-packs-for-a-pack-contest",
          "publishedOn": "2021-10-19T17:00:00.000Z",
          "wordCount": 576,
          "title": "Share Your Nomad Packs for a Pack Contest"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-the-public-beta-of-hcp-packer",
          "author": null,
          "description": "The free public beta of HCP Packer lets DevOps teams track and automate build updates across their HashiCorp Packer and Terraform workflows.",
          "link": "https://www.hashicorp.com/blog/announcing-the-public-beta-of-hcp-packer",
          "publishedOn": "2021-10-19T16:00:00.000Z",
          "wordCount": 1320,
          "title": "Announcing the Public Beta of HCP Packer"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-vault-surpasses-100-integrations-with-75-partners",
          "author": null,
          "description": "HashiCorp Vault now supports more than 100 integrations with 75 partners, including Cisco, Datadog, F5, MongoDB, Palo Alto Networks, Red Hat, ServiceNow, and Snowflake.",
          "link": "https://www.hashicorp.com/blog/hashicorp-vault-surpasses-100-integrations-with-75-partners",
          "publishedOn": "2021-10-18T14:30:00.000Z",
          "wordCount": 1490,
          "title": "HashiCorp Vault Surpasses 100 Integrations with 75 Partners"
        },
        {
          "id": "https://www.hashicorp.com/blog/aws-hashicorp-collaborate-new-terraform-modules",
          "author": null,
          "description": "AWS and HashiCorp are collaborating to develop Terraform modules.",
          "link": "https://www.hashicorp.com/blog/aws-hashicorp-collaborate-new-terraform-modules",
          "publishedOn": "2021-10-15T07:00:00.000Z",
          "wordCount": 649,
          "title": "AWS and HashiCorp Collaborate on New Terraform Modules"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-hashicorp-waypoint-0-6",
          "author": null,
          "description": "HashiCorp Waypoint 0.6 focuses on Kubernetes by integrating Helm, showing Kubernetes resources in the UI, adding pod auto-scaling, and supporting Ingresses.",
          "link": "https://www.hashicorp.com/blog/announcing-hashicorp-waypoint-0-6",
          "publishedOn": "2021-10-14T19:00:00.000Z",
          "wordCount": 1877,
          "title": "Announcing HashiCorp Waypoint 0.6"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-hashicorp-nomad-1-2",
          "author": null,
          "description": "Nomad 1.2 and Nomad Pack deliver exciting new features, workflows, and tools to the HashiCorp Nomad ecosystem.",
          "link": "https://www.hashicorp.com/blog/announcing-hashicorp-nomad-1-2",
          "publishedOn": "2021-10-14T18:00:00.000Z",
          "wordCount": 1470,
          "title": "Announcing HashiCorp Nomad 1.2 Beta"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-consul-terraform-sync-0-4-for-terraform-cloud",
          "author": null,
          "description": "Compliance-driven network infrastructure automation with Consul-Terraform-Sync 0.4 is now generally available for HashiCorp Terraform Cloud.",
          "link": "https://www.hashicorp.com/blog/announcing-consul-terraform-sync-0-4-for-terraform-cloud",
          "publishedOn": "2021-10-14T15:00:00.000Z",
          "wordCount": 1464,
          "title": "Announcing Consul-Terraform-Sync 0.4 for Terraform Cloud"
        },
        {
          "id": "https://www.hashicorp.com/blog/cdk-for-terraform-in-production-learning-from-pocket",
          "author": null,
          "description": "With a live demo, two engineers from Mozilla’s Pocket show how they use CDK for Terraform to define and provision infrastructure in a TypeScript application.",
          "link": "https://www.hashicorp.com/blog/cdk-for-terraform-in-production-learning-from-pocket",
          "publishedOn": "2021-10-12T16:00:00.000Z",
          "wordCount": 1131,
          "title": "CDK for Terraform in Production: Learning from Pocket"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-learning-resources-reference-guide",
          "author": null,
          "description": "Read this curated list of HashiCorp learning resources to help practitioners and organizations better understand the cloud operating model.",
          "link": "https://www.hashicorp.com/blog/hashicorp-learning-resources-reference-guide",
          "publishedOn": "2021-10-11T16:00:00.000Z",
          "wordCount": 1811,
          "title": "HashiCorp Learning Resources Reference Guide"
        }
      ]
    },
    {
      "title": "Elastic Blog - Elasticsearch, Kibana, and ELK Stack",
      "feedUrl": "https://www.elastic.co/blog/feed",
      "siteUrl": "https://www.elastic.co",
      "articles": [
        {
          "id": "https://www.elastic.co/blog/culture-someone-like-me-yannick-fhima-on-overcoming-differences-and-finding-fulfillment-in-tech",
          "author": "David Kravets",
          "description": "In this edition of our Someone Like Me series, we meet Yannick Fhima, Senior Manager, Solutions Architecture, EMEA South who although was born with a disability didn’t stop him from excelling in sports, finding a fulfilling career in tech which lead him to finding his passion for managing a team.",
          "link": "https://www.elastic.co/blog/culture-someone-like-me-yannick-fhima-on-overcoming-differences-and-finding-fulfillment-in-tech",
          "publishedOn": "2021-11-05T15:00:00.000Z",
          "wordCount": 617,
          "title": "Someone Like Me | Yannick Fhima on overcoming differences and finding fulfillment in tech"
        },
        {
          "id": "https://www.elastic.co/blog/eview-testing-methods-for-elastic-integrations-using-the-elastic-package-tool",
          "author": "Marcin Tojek",
          "description": "The elastic-package tool provides different testing methods for Elastic Integrations - asset, pipeline, static and system tests. We'll review the most useful options based on existing integrations.",
          "link": "https://www.elastic.co/blog/eview-testing-methods-for-elastic-integrations-using-the-elastic-package-tool",
          "publishedOn": "2021-11-05T15:00:00.000Z",
          "wordCount": 1138,
          "title": "Review testing methods for Elastic integrations using the elastic-package tool"
        },
        {
          "id": "https://www.elastic.co/blog/culture-someone-like-me-yannick-fhima-on-overcoming-differences-and-finding-fulfillment-in-tech",
          "author": "David Kravets",
          "description": ",\nWe all want to work for a company where we fit in. That’s why Elastic built a Source Code\n that encourages all to come as they are. In the Someone Like Me blog \nseries, we highlight Elasticians who have a unique story — one, perhaps,\n just as unique as yours.\nIn this edition, we meet Yannick Fhima, Senior Manager, Solutions \nArchitecture, EMEA South who although was born with a disability, was \nable to excel in sports and find a fulfilling career in tech which \neventually led him to finding his passion for managing a team.     \nBorn with a disability, Yannick faced multiple surgeries on his hands\n in addition to having to overcome his differences from classmates. \nWhile traditionally that may have impacted his ability to participate in\n and play sports, Yannick actually outperformed peer…",
          "link": "https://www.elastic.co/blog/culture-someone-like-me-yannick-fhima-on-overcoming-differences-and-finding-fulfillment-in-tech",
          "publishedOn": "2021-11-05T15:00:00.000Z",
          "wordCount": 617,
          "title": "Someone Like Me | Yannick Fhima on overcoming differences and finding fulfillment in tech"
        },
        {
          "id": "https://www.elastic.co/blog/eview-testing-methods-for-elastic-integrations-using-the-elastic-package-tool",
          "author": "Marcin Tojek",
          "description": ",\nAs observed products and services evolve or their authors introduce new features, it’s essential to preserve compatibility between the product and the corresponding integration and detect inconsistencies as soon as possible.\nAt Elastic, we use the elastic-package on a daily basis to create and maintain integrations. Today, we'll review existing testing methods for integrations and learn how to verify integrity between Elastic Agent and observed products.\nReview following testing methods and adopt them in your integrations to increase test coverage for pipelines, manifests, fields, etc. Adopting at least a few of them will prevent hours of manual testing and bug hunting.\nPreparation for tests (cheatsheet)\nAll testing methods require the Elastic stack to be present for testing. Boot up the…",
          "link": "https://www.elastic.co/blog/eview-testing-methods-for-elastic-integrations-using-the-elastic-package-tool",
          "publishedOn": "2021-11-05T15:00:00.000Z",
          "wordCount": 1138,
          "title": "Review testing methods for Elastic integrations using the elastic-package tool"
        },
        {
          "id": "https://www.elastic.co/blog/tackle-cloud-based-digital-transformation-with-elastic-cloud-an-aws-workload-migration-partner",
          "author": "Antony Prasad Thevaraj, AWS,Uday Theepireddy",
          "description": "After an extensive technical review by an AWS ISV Workload Migration Partner team, Elastic is now a certified AWS Workload Migration Partner. Learn how Elastic's designation as an AWS Workload Migration Partner can streamline your cloud journey.",
          "link": "https://www.elastic.co/blog/tackle-cloud-based-digital-transformation-with-elastic-cloud-an-aws-workload-migration-partner",
          "publishedOn": "2021-11-03T13:00:00.000Z",
          "wordCount": 806,
          "title": "Migrating Elasticsearch workloads to AWS? We can help."
        },
        {
          "id": "https://www.elastic.co/blog/tackle-cloud-based-digital-transformation-with-elastic-cloud-an-aws-workload-migration-partner",
          "author": "Antony Prasad Thevaraj, AWS,Uday Theepireddy",
          "description": ",\nElastic Cloud is now a certified partner of the AWS ISV Workload Migration Program (WMP), which supports the migration of ISV workloads to AWS with onboarding guidance, migration resources, and AWS infrastructure credits and funding assistance.\nCustomers work with Elastic Cloud to leave behind the burden of costly-to-operate legacy systems, siloed data, and rigid on-premises data centers. They also recognize the benefits of cloud-based digital transformation and the ability to bring new products and services to market more quickly, allowing them to stay competitive.\nOrganizations can now access migration guidance to quickly leverage the benefits of a cloud environment.\nStreamline migration with a best practices methodology\nOnce you’ve decided to migrate, the next step is working with an …",
          "link": "https://www.elastic.co/blog/tackle-cloud-based-digital-transformation-with-elastic-cloud-an-aws-workload-migration-partner",
          "publishedOn": "2021-11-03T13:00:00.000Z",
          "wordCount": 806,
          "title": "Migrating Elasticsearch workloads to AWS? We can help."
        },
        {
          "id": "https://www.elastic.co/blog/streamline-it-budgeting-with-new-data-driven-insights-and-a-prepaid-cloud-consumption-model",
          "author": "Bogdan Andrei Sturzoiu,Fermi Fang",
          "description": "Take advantage of more flexible and predictable billing with data-driven insights into your contract and usage of the new prepaid consumption model on Elastic Cloud.",
          "link": "https://www.elastic.co/blog/streamline-it-budgeting-with-new-data-driven-insights-and-a-prepaid-cloud-consumption-model",
          "publishedOn": "2021-11-01T16:00:00.000Z",
          "wordCount": 592,
          "title": "Stay on top of your spend with data-driven insights for the new prepaid consumption model on Elastic Cloud"
        },
        {
          "id": "https://www.elastic.co/blog/streamline-it-budgeting-with-new-data-driven-insights-and-a-prepaid-cloud-consumption-model",
          "author": "Bogdan Andrei Sturzoiu,Fermi Fang",
          "description": ",\nElastic Cloud customers who are leveraging the prepaid consumption model can now view more granular reporting into their usage for improved cost-analysis and up-to-the-hour detail. This more detailed breakdown of costs and billing history helps you plan ahead and stay within your allocated budget.\nView more detailed usage information\nWhen you buy Elastic Consumption Units to pay for your Elasticsearch Service usage, they are contracted through a purchase order consisting of one or more order lines. A newly added section to the Billing overview page (accessible through the user menu - Account & Billing) shows order line details such as: start date and expiration date for the purchased credits, original credit amount, remaining credits, credits used, and some additional purchase cost infor…",
          "link": "https://www.elastic.co/blog/streamline-it-budgeting-with-new-data-driven-insights-and-a-prepaid-cloud-consumption-model",
          "publishedOn": "2021-11-01T16:00:00.000Z",
          "wordCount": 592,
          "title": "Stay on top of your spend with data-driven insights for the new prepaid consumption model on Elastic Cloud"
        },
        {
          "id": "https://www.elastic.co/blog/helping-elastic-customers-succeed-elastic-tams-partner-with-organizations-to-maximize-their-investments",
          "author": "Nikki Jones,Chad Pryor",
          "description": "Realizing business objectives and successful outcomes with our customers is at the core of what we do. In this series, learn some of the many ways Elastic Technical Account Managers partner with organizations to accomplish these goals. Interview with Chad Pryor.",
          "link": "https://www.elastic.co/blog/helping-elastic-customers-succeed-elastic-tams-partner-with-organizations-to-maximize-their-investments",
          "publishedOn": "2021-11-01T13:00:00.000Z",
          "wordCount": 1193,
          "title": "Helping Elastic Customers Succeed | Elastic TAMs partner with organizations to maximize their investments"
        },
        {
          "id": "https://www.elastic.co/blog/helping-elastic-customers-succeed-elastic-tams-partner-with-organizations-to-maximize-their-investments",
          "author": "Nikki Jones,Chad Pryor",
          "description": ",\nElastic Consulting helps our customers drive impactful business outcomes. From preventing fraud in the financial space, to taking actions on botnets across eCommerce platforms. In this part of our series, Nikki Jones, Customer Success Lead, and Chad Pryor, Elastic Technical Account Manager (TAM), discuss the secret recipe for helping customers achieve success, and the value of the TAM/customer relationship.\nHow do Elastic Technical Account Managers support our customers? \nWe provide a personal connection, a bridge of success to enable our customers to derive the most value from their investment in our products and services. We are solution providers who proactively guide the technology landscape, help resolve challenges before they occur, and provide a gateway into the Elastic ecosystem …",
          "link": "https://www.elastic.co/blog/helping-elastic-customers-succeed-elastic-tams-partner-with-organizations-to-maximize-their-investments",
          "publishedOn": "2021-11-01T13:00:00.000Z",
          "wordCount": 1193,
          "title": "Helping Elastic Customers Succeed | Elastic TAMs partner with organizations to maximize their investments"
        },
        {
          "id": "https://www.elastic.co/blog/elasticon-global-telco",
          "author": "Rick Fernandez",
          "description": "At this year’s ElasticON Global, we held several sessions showcasing how the Elastic Search Platform is solving top challenges across the telecommunications industry, as well as the benefits that organizations are realizing with Elastic.",
          "link": "https://www.elastic.co/blog/elasticon-global-telco",
          "publishedOn": "2021-10-28T15:00:00.000Z",
          "wordCount": 637,
          "title": "Powering real-time insights for telcos and media services like T-Mobile and Netflix"
        },
        {
          "id": "https://www.elastic.co/blog/elasticon-global-telco",
          "author": "Rick Fernandez",
          "description": ",\nAt this year’s ElasticON Global, our annual user conference, we held several industry-specific sessions showcasing how the Elastic Search Platform is solving top challenges across the telecommunications and communications services industry, as well as the return on investment that organizations in all industries are realizing with Elastic.\nAll industries today are faced with an always-on and connected consumer, with expectations on the rise. In the telecommunications and communications services industry in particular, customers are comparing their experiences with service providers against other digital experiences. The advanced analytics, flexibility, and speed of the Elastic Search Platform can help telcos meet these rising needs.\nReal-time insights at scale\nThe session Enable real-tim…",
          "link": "https://www.elastic.co/blog/elasticon-global-telco",
          "publishedOn": "2021-10-28T15:00:00.000Z",
          "wordCount": 637,
          "title": "Powering real-time insights for telcos and media services like T-Mobile and Netflix"
        },
        {
          "id": "https://www.elastic.co/blog/eglobal-banks-on-elastic-to-excel-as-a-leader-in-the-credit-card-transactions-sector",
          "author": "Ander Murillo Zohn",
          "description": "Learn how eGlobal — which processes electronic credit card transactions from more than 70 million national and international cardholders — leveraged Elastic to reduce costs, add customers, and enhance the customer experience.",
          "link": "https://www.elastic.co/blog/eglobal-banks-on-elastic-to-excel-as-a-leader-in-the-credit-card-transactions-sector",
          "publishedOn": "2021-10-27T13:00:00.000Z",
          "wordCount": 801,
          "title": "eGlobal banks on Elastic to excel as a leader in the credit card transactions sector"
        },
        {
          "id": "https://www.elastic.co/blog/eglobal-banks-on-elastic-to-excel-as-a-leader-in-the-credit-card-transactions-sector",
          "author": "Ander Murillo Zohn",
          "description": ",\nAs the head of the Data Science Division at eGlobal, I knew we needed a digital transformation makeover to meet our strategic objectives, which were first and foremost to increase revenue by retaining and attracting new clients and enhancing eGlobal’s products and services.\nOur legacy, proprietary solutions and data warehouse model were barriers to reaching our goals. We needed to optimize resources, reduce operational costs, and have real-time analytics. As a first step in our makeover, we had to ensure that our internal clients had solutions that were easy to implement and operate, and capable of delivering added value across the organization. \nWhile our services help carry out more than 2.6 billion credit card transactions that add up to 50 billion dollars annually, choosing Elastic t…",
          "link": "https://www.elastic.co/blog/eglobal-banks-on-elastic-to-excel-as-a-leader-in-the-credit-card-transactions-sector",
          "publishedOn": "2021-10-27T13:00:00.000Z",
          "wordCount": 801,
          "title": "eGlobal banks on Elastic to excel as a leader in the credit card transactions sector"
        },
        {
          "id": "https://www.elastic.co/blog/culture-this-directors-two-step-approach-for-creating-a-burnout-resistant-engineering-culture",
          "author": "Katherine Plumhoff",
          "description": "",
          "link": "https://www.elastic.co/blog/culture-this-directors-two-step-approach-for-creating-a-burnout-resistant-engineering-culture",
          "publishedOn": "2021-10-26T13:00:00.000Z",
          "wordCount": 2212,
          "title": "This director’s 2-step approach for creating a burnout-resistant engineering culture"
        },
        {
          "id": "https://www.elastic.co/blog/culture-this-directors-two-step-approach-for-creating-a-burnout-resistant-engineering-culture",
          "author": "Katherine Plumhoff",
          "description": ",\nStacey King Poling knows that tornadoes don’t really sneak up on you.\nGrowing up in Texas and living around the west, including in Oklahoma, Stacey knew what to look and listen for regarding the powerful storms: the National Weather Service warnings, the emergency sirens, the regular instructions on where to go and how to protect yourself. All that preparation and advanced warning helped Stacey and her family live through the 2013 El Reno tornado, the widest tornado ever recorded, and escape unscathed.\nIf only burnout had the same warning system.\nWith a 25-year career in engineering, Stacey, who is currently the Director of Engineering for Cloud Productivity at Elastic, has worked on her fair share of high-stress projects. She loves solving hard problems and always found herself energize…",
          "link": "https://www.elastic.co/blog/culture-this-directors-two-step-approach-for-creating-a-burnout-resistant-engineering-culture",
          "publishedOn": "2021-10-26T13:00:00.000Z",
          "wordCount": 2212,
          "title": "This director’s 2-step approach for creating a burnout-resistant engineering culture"
        },
        {
          "id": "https://www.elastic.co/blog/getting-started-with-elastic-package",
          "author": "Julien Lind",
          "description": "We will present and use elastic-package tool which is the official developer tool, used to create your own integrations that will be run by the Elastic Agent.",
          "link": "https://www.elastic.co/blog/getting-started-with-elastic-package",
          "publishedOn": "2021-10-25T17:00:00.000Z",
          "wordCount": 744,
          "title": "How to quickly start a full Elastic Stack by using elastic-package"
        },
        {
          "id": "https://www.elastic.co/blog/getting-started-with-elastic-package",
          "author": "Julien Lind",
          "description": ",\nIn this getting starting guide you will learn how elastic-package can help you quickly start a full Elastic Stack.\nElastic-package is an open source tool that will help you shorten your development time by providing pre-built commands. For example it will help you lint, format, test, build, and promote your packages.\nEach and every developer that wants to contribute by creating their own integrations should use elastic-package. It will provide a ready-to-code environment.\nGetting started with elastic-package\nAs a developer you can use elastic-package in two ways, the first one is through binary usage and the second one is by pulling elastic-package github repository.\nFor binary usage, start by downloading the latest version.\nPull the archive that you need and unarchive it locally.\njulien…",
          "link": "https://www.elastic.co/blog/getting-started-with-elastic-package",
          "publishedOn": "2021-10-25T17:00:00.000Z",
          "wordCount": 744,
          "title": "How to quickly start a full Elastic Stack by using elastic-package"
        },
        {
          "id": "https://www.elastic.co/blog/elasticon-global-financial-services",
          "author": "Ben Pruden",
          "description": "How to accelerate open banking, personalize experiences, and build a secure and trustworthy reputation with Elastic",
          "link": "https://www.elastic.co/blog/elasticon-global-financial-services",
          "publishedOn": "2021-10-21T17:00:00.000Z",
          "wordCount": 813,
          "title": "Unifying data to accelerate growth in financial services"
        },
        {
          "id": "https://www.elastic.co/blog/elasticon-global-financial-services",
          "author": "Ben Pruden",
          "description": ",\nAt this year’s ElasticON Global, our annual user conference, we held multiple sessions focused on the financial services industry and how leading financial institutions are solving their data challenges with Elastic.\nAccording to Boston Consulting Group, there is $300 million in potential revenue opportunity for every $100 billion in assets under management at banks through hyper personalization. Both banks and non-bank financial institutions are rallying around this opportunity by focusing on customer experiences and open banking initiatives and by building more interconnected microservices. This focus, while being good for customers, has introduced challenges such as acceleration of counterparty data sharing and ensuring the open banking ecosystem is secure.\n\nTurning data into a strate…",
          "link": "https://www.elastic.co/blog/elasticon-global-financial-services",
          "publishedOn": "2021-10-21T17:00:00.000Z",
          "wordCount": 813,
          "title": "Unifying data to accelerate growth in financial services"
        }
      ]
    },
    {
      "title": "Ansible Blog",
      "feedUrl": "https://www.ansible.com/blog/rss.xml",
      "siteUrl": "https://www.ansible.com/blog",
      "articles": [
        {
          "id": "https://www.ansible.com/blog/the-power-of-ai-and-the-science-of-operations-part-1",
          "author": "Anthony Lin",
          "description": "A variety of industry experts cite Artificial Intelligence and Automation as key emerging trends.  But if you look around your organizations, you will see the evidence of AI projects and also an increasing focus on using automation in a variety of ways.  IBM and Red Hat together can help you build on and apply these trends to your IT operations.",
          "link": "https://www.ansible.com/blog/the-power-of-ai-and-the-science-of-operations-part-1",
          "publishedOn": "2021-11-04T13:00:00.000Z",
          "wordCount": 1822,
          "title": "The Power of AI and the Science of Operations (Part 1)"
        },
        {
          "id": "https://www.ansible.com/blog/anisblefest-2021-what-means-for-partners",
          "author": "Nelson Hsu",
          "description": "As the weather turns to Fall, the seasons seem to parallel that of the technology cycles. Over the past couple of decades, we have seen various transformations within the high-tech area:",
          "link": "https://www.ansible.com/blog/anisblefest-2021-what-means-for-partners",
          "publishedOn": "2021-11-02T15:00:00.000Z",
          "wordCount": 1878,
          "title": "AnisbleFest 2021 - What it means for Partners"
        },
        {
          "id": "https://www.ansible.com/blog/boost-your-cloud-native-deployments-with-red-hat-openshift",
          "author": "Alina Buzachis",
          "description": "Cloud-native deployments are becoming the new normal. Being able to keep full control of the application lifecycle (deployment, updates, and integrations) is a strategic advantage. This article will explain how the latest release of the Ansible Content Collection for Red Hat OpenShift takes the redhat.openshift Collection to the next level, improving the performance of large automation tasks.",
          "link": "https://www.ansible.com/blog/boost-your-cloud-native-deployments-with-red-hat-openshift",
          "publishedOn": "2021-10-28T13:00:00.000Z",
          "wordCount": 1497,
          "title": "Boost your cloud-native deployments with Red Hat OpenShift"
        },
        {
          "id": "https://www.ansible.com/blog/ansible-for-aws-introduction-to-spot-instance-automation",
          "author": "Mandar Vijay Kulkarni",
          "description": "What are Spot Instance and Spot Instance Requests?\n \r\nA Spot Instance is an instance that uses spare AWS EC2 capacity that is available for less than the On-Demand price. Because Spot Instances provide the ability to request unused EC2 instances at steep discounts, it can lower your Amazon EC2 costs significantly.",
          "link": "https://www.ansible.com/blog/ansible-for-aws-introduction-to-spot-instance-automation",
          "publishedOn": "2021-10-27T13:00:00.000Z",
          "wordCount": 1719,
          "title": "Ansible for AWS: Introduction to Spot Instance Automation"
        },
        {
          "id": "https://www.ansible.com/blog/whats-new-the-ansible-aws-collection-2.0-release",
          "author": "Alina Buzachis",
          "description": "When it comes to Amazon Web Services (AWS) infrastructure automation, the latest release of the Ansible amazon.aws Collection brings a set of fresh features to build, manage and govern various public and hybrid cloud use cases while accelerating the process from development to production.",
          "link": "https://www.ansible.com/blog/whats-new-the-ansible-aws-collection-2.0-release",
          "publishedOn": "2021-10-25T13:00:00.000Z",
          "wordCount": 2079,
          "title": "What's New: The Ansible AWS Collection 2.0 Release"
        },
        {
          "id": "https://www.ansible.com/blog/ansible-automation-platform-2-migration-strategy-considerations",
          "author": "Craig Brandt",
          "description": "Red Hat Ansible Automation Platform 2 introduces an updated architecture, new tools and an improved but familiar experience to automation teams. However, there are multiple considerations for your planning and strategy to migrate your current deployment to Ansible Automation Platform 2.",
          "link": "https://www.ansible.com/blog/ansible-automation-platform-2-migration-strategy-considerations",
          "publishedOn": "2021-10-12T13:00:00.000Z",
          "wordCount": 1768,
          "title": "Red Hat Ansible Automation Platform 2: Migration strategy considerations"
        }
      ]
    },
    {
      "title": "Azure DevOps Blog",
      "feedUrl": "https://devblogs.microsoft.com/devops/feed/",
      "siteUrl": "https://devblogs.microsoft.com/devops",
      "articles": [
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62647",
          "author": "Jay Gordon",
          "description": "The top stories from the #AzureDevOps #community for 2021.10.29 are here!\nThe post Top Stories from the Microsoft DevOps Community – 2021.10.29 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-10-29/",
          "publishedOn": "2021-10-29T08:01:00.000Z",
          "wordCount": 1284,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.10.29"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62636",
          "author": "Martina",
          "description": "Copy Dashboard Phase 2\nThe post Copy Dashboard – Public Preview Phase 2 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/copy-dashboard-public-preview-phase-2/",
          "publishedOn": "2021-10-28T15:25:20.000Z",
          "wordCount": 1114,
          "title": "Copy Dashboard – Public Preview Phase 2"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62630",
          "author": "Gloridel Morales",
          "description": "This month, we are releasing fixes that impact our self-hosted product, Azure DevOps Server.\nPreviously, Azure DevOps Server could only create connections to GitHub Enterprise Server. With this patch, project administrators can create connections between Azure DevOps Server and repositories on GitHub.com.\nThe post October patches for Azure DevOps Server appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/october-patches-for-azure-devops-server/",
          "publishedOn": "2021-10-26T18:55:50.000Z",
          "wordCount": 1984,
          "title": "October patches for Azure DevOps Server"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62622",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes Episode 60 – DevOps Solutions on @Azure with @TheAprilEdwards appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-episode-60-devops-solutions-on-azure-with-theapriledwards/",
          "publishedOn": "2021-10-26T14:20:22.000Z",
          "wordCount": 1552,
          "title": "AzureFunBytes Episode 60 – DevOps Solutions on @Azure with @TheAprilEdwards"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62603",
          "author": "Jay Gordon",
          "description": "The top stories from the #AzureDevOps #community for 2021.10.22 are here!\nThe post Top Stories from the Microsoft DevOps Community – 2021.10.22 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-10-22/",
          "publishedOn": "2021-10-22T08:00:42.000Z",
          "wordCount": 1342,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.10.22"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62585",
          "author": "Jay Gordon",
          "description": "The top stories from the #AzureDevOps #community for 2021.10.15 are here!\nThe post Top Stories from the Microsoft DevOps Community – 2021.10.15 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-10-15/",
          "publishedOn": "2021-10-15T11:00:53.000Z",
          "wordCount": 1371,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.10.15"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62550",
          "author": "Eric van Wijk",
          "description": "Introduction\nThe post Hosted Pipelines Image Deprecation appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/hosted-pipelines-image-deprecation/",
          "publishedOn": "2021-10-14T08:30:24.000Z",
          "wordCount": 1536,
          "title": "Hosted Pipelines Image Deprecation"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62501",
          "author": "Jay Gordon",
          "description": "Microsoft’s Donovan Brown defines DevOps as, “the union of people, process, and products to enable continuous delivery of value to our end users.” Microsoft Create is back again and by popular demand, we are going to talk about everything DevOps. Join us at “Create: DevOps”\nThe post Join us at #MSCreate: DevOps on @LearnTV October 21, 2021 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/join-us-at-mscreate-devops-on-learntv-october-21-2021/",
          "publishedOn": "2021-10-14T08:00:51.000Z",
          "wordCount": 1616,
          "title": "Join us at #MSCreate: DevOps on @LearnTV October 21, 2021"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62536",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes Episode 59 – Remote Possibilities with @burkeholland appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-episode-59-remote-possibilities-with-burkeholland/",
          "publishedOn": "2021-10-12T20:22:39.000Z",
          "wordCount": 1411,
          "title": "AzureFunBytes Episode 59 – Remote Possibilities with @burkeholland"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62519",
          "author": "Gloridel Morales",
          "description": "On September 28, 2021, Azure DevOps was notified by Axosoft of a vulnerability in a dependency of their popular git GUI client – GitKraken. This vulnerability led to the GitKraken client generating insecure SSH keys.\nThe post Azure DevOps Response to GitKraken SSH Bug appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azure-devops-response-to-gitkraken-ssh-bug/",
          "publishedOn": "2021-10-11T17:04:57.000Z",
          "wordCount": 1134,
          "title": "Azure DevOps Response to GitKraken SSH Bug"
        }
      ]
    },
    {
      "title": "Discover Dev",
      "feedUrl": "https://www.discoverdev.io/rss.xml",
      "siteUrl": "http://discoverdev.io",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "http://feeds.feedburner.com/AmazonWebServicesBlog",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "0ddead23befe1433cf15ad8e1e4a4ea58038b1c6",
          "author": "Channy Yun",
          "description": "Two years ago, we introduced Amazon SageMaker Studio, the industry’s first fully integrated development environment (IDE) for machine learning (ML). Amazon SageMaker Studio provides a single, web-based visual interface where you can perform all ML development steps, improving data science team productivity by up to 10 times Many data scientists love the R project, an […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/bf3gizZac_A/",
          "publishedOn": "2021-11-02T19:35:30.000Z",
          "wordCount": 1854,
          "title": "Announcing Fully Managed RStudio on Amazon SageMaker for Data Scientists"
        },
        {
          "id": "58ff26983ab74e9116e26ec67e44852d5ab372ce",
          "author": "Channy Yun",
          "description": "We recently introduced Amazon EC2 M6i instances powered by the latest generation Intel® Xeon® Scalable processors with an all-core turbo frequency of 3.5 GHz, which offer customers up to 15% improvement in price performance compared to M5 instances. Today, I am happy to announce the availability of the new compute-optimized Amazon EC2 C6i instances, which […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/PVgpgKzV2TM/",
          "publishedOn": "2021-10-28T22:05:31.000Z",
          "wordCount": 935,
          "title": "New – Amazon EC2 C6i Instances Powered by the Latest Generation Intel Xeon Scalable Processors"
        },
        {
          "id": "c49cbf1a684657d2d6c1cb4fa064a78b2ab04c08",
          "author": "Sébastien Stormacq",
          "description": "Many of our customers are telling us they want to move away from proprietary database vendors to avoid expensive costs and burdensome licensing terms. But migrating away from commercial and legacy databases can be time-consuming and resource-intensive. When migrating your databases, you can automate the migration of your database schema and data using the AWS […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/EAA6v27KD08/",
          "publishedOn": "2021-10-28T20:56:54.000Z",
          "wordCount": 1907,
          "title": "Goodbye Microsoft SQL Server, Hello Babelfish"
        },
        {
          "id": "3d39d9ceb38f954d93ed92346f5c37e06ee363fe",
          "author": "Danilo Poccia",
          "description": "The first AWS service I used, more than ten years ago, was Amazon Elastic Compute Cloud (Amazon EC2). Over time, EC2 has added a wide selection of instance types optimized to fit different use cases, with a varying combination of CPU/GPU, memory, storage, and networking capacity to give you the flexibility to choose the appropriate […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/dJIwSdsSLDs/",
          "publishedOn": "2021-10-27T21:05:46.000Z",
          "wordCount": 2221,
          "title": "New – Attribute-Based Instance Type Selection for EC2 Auto Scaling and EC2 Fleet"
        },
        {
          "id": "1286bfacea703cc5f6cf0a6ec9ec02e8da004157",
          "author": "Jeff Barr",
          "description": "There are more applications today for deep learning than ever before. Natural language processing, recommendation systems, image recognition, video recognition, and more can all benefit from high-quality, well-trained models. The process of building such a model is iterative: construct an initial model, train it on the ground truth data, do some test inferences, refine the […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/kT4AywJOLW8/",
          "publishedOn": "2021-10-26T20:21:12.000Z",
          "wordCount": 1064,
          "title": "New – EC2 Instances Powered by Gaudi Accelerators for Training Deep Learning Models"
        },
        {
          "id": "08e94bdba33ee3a9bde2a667e0c729331ea1712a",
          "author": "Sébastien Stormacq",
          "description": "Today, we are opening three new AWS Local Zones in Las Vegas, New York City (located in New Jersey), and Portland metro areas. We are now at a total of 14 Local Zones in 13 cities since Jeff Barr announced the first Local Zone in Los Angeles in December 2019. These three new Local Zones […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/MFSYp_zqmfo/",
          "publishedOn": "2021-10-26T19:03:37.000Z",
          "wordCount": 1276,
          "title": "AWS Local Zones Are Now Open in Las Vegas, New York City, and Portland"
        },
        {
          "id": "3b4cda05885324e5d32490bd1276e5a6555d06a9",
          "author": "Channy Yun",
          "description": "Managing databases in self-managed environments such as on premises or Amazon Elastic Compute Cloud (Amazon EC2) requires customers to spend time and resources doing database administration tasks such as provisioning, scaling, patching, backups, and configuring for high availability. So, hundreds of thousands of AWS customers use Amazon Relational Database Service (Amazon RDS) because it automates […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/pmaZP4xBz8Y/",
          "publishedOn": "2021-10-26T17:48:20.000Z",
          "wordCount": 1938,
          "title": "Amazon RDS Custom for Oracle – New Control Capabilities in Database Environment"
        },
        {
          "id": "77fab76e6d668a7c6a06a9119500629ac4ff9ade",
          "author": "Sean M. Tracey",
          "description": "Earlier this year, we launched the AWS BugBust Challenge, the world’s first global competition to fix one million code bugs and reduce technical debt by over $100 million. As part of this endeavor, we are launching the first AWS BugBust re:Invent Challenge at this year’s AWS re:Invent conference, from 10 a.m. (PST) November 29 to […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/-3su2F7Vo7k/",
          "publishedOn": "2021-10-25T20:50:52.000Z",
          "wordCount": 1216,
          "title": "Help Make BugBusting History at AWS re:Invent 2021"
        },
        {
          "id": "285a4222bec560f367b41ec232d51291e601b373",
          "author": "Steve Roberts",
          "description": "Determining viable strategies for successful application migration and modernization to the cloud takes time. It can also require significant effort, depending on the size and complexity of the application portfolio to analyze. To date, the analysis process has been largely manual and nonstandard in nature, making it difficult to apply at scale on large portfolios. […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/dDzJv_bbUGw/",
          "publishedOn": "2021-10-25T20:13:52.000Z",
          "wordCount": 2794,
          "title": "New Strategy Recommendations Service Helps Streamline AWS Cloud Migration and Modernization"
        },
        {
          "id": "bb64b081a33e0e139a0be82e2486b897d168e908",
          "author": "Sébastien Stormacq",
          "description": "Today, the AWS Panorama Appliance is generally available to all of you. The AWS Panorama Appliance is a computer vision (CV) appliance designed to be deployed on your network to analyze images provided by your on-premises cameras. Every week, I read about new and innovative use cases for computer vision. Some customers are using CV […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/JoLbC_gpGfQ/",
          "publishedOn": "2021-10-20T17:57:42.000Z",
          "wordCount": 2623,
          "title": "Computer Vision at the Edge with AWS Panorama"
        },
        {
          "id": "c4673307b7ed8b0999036138fd06f046349261cb",
          "author": "Jeff Barr",
          "description": "Back in 2019 I told you about AWS Data Exchange and showed you how to Find, Subscribe To, and Use Data Products. Today, you can choose from over 3600 data products in ten categories: In my introductory post I showed you how could subscribe to data products and then download the data sets into an […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/e4hxlIIKsqk/",
          "publishedOn": "2021-10-19T21:51:02.000Z",
          "wordCount": 1556,
          "title": "New – AWS Data Exchange for Amazon Redshift"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/atom.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2538/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/snack.png\" title=\"Although grad students, suddenly reminded that food exists, tend to just grab and devour both without further discussion.\" alt=\"Although grad students, suddenly reminded that food exists, tend to just grab and devour both without further discussion.\" />",
          "link": "https://xkcd.com/2538/",
          "publishedOn": "2021-11-05T00:00:00.000Z",
          "wordCount": 183,
          "title": "Snack"
        },
        {
          "id": "https://xkcd.com/2537/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/painbow_award.png\" title=\"This year, our team took home the dark blue ribbon, better than the midnight blue we got last year but still short of the winning navy blue.\" alt=\"This year, our team took home the dark blue ribbon, better than the midnight blue we got last year but still short of the winning navy blue.\" />",
          "link": "https://xkcd.com/2537/",
          "publishedOn": "2021-11-03T00:00:00.000Z",
          "wordCount": 185,
          "title": "Painbow Award"
        },
        {
          "id": "https://xkcd.com/2536/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/wirecutter.png\" title=\"This was always going to be a controversial Wirecutter post, but what really got them in trouble were their 'budget' and 'upgrade' picks.\" alt=\"This was always going to be a controversial Wirecutter post, but what really got them in trouble were their 'budget' and 'upgrade' picks.\" />",
          "link": "https://xkcd.com/2536/",
          "publishedOn": "2021-11-01T00:00:00.000Z",
          "wordCount": 183,
          "title": "Wirecutter"
        },
        {
          "id": "https://xkcd.com/2535/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/common_cold_viruses.png\" title=\"&quot;It's not an influenza, but the onset has notes of the '09 H1N1 strain.&quot; &quot;Ah yes, that was a good year for H1N1.&quot;\" alt=\"&quot;It's not an influenza, but the onset has notes of the '09 H1N1 strain.&quot; &quot;Ah yes, that was a good year for H1N1.&quot;\" />",
          "link": "https://xkcd.com/2535/",
          "publishedOn": "2021-10-29T00:00:00.000Z",
          "wordCount": 187,
          "title": "Common Cold Viruses"
        }
      ]
    },
    {
      "title": "Camunda",
      "feedUrl": "https://camunda.com/feed/",
      "siteUrl": "https://camunda.com",
      "articles": [
        {
          "id": "https://camunda.com/?p=35871",
          "author": "Amy Johnston",
          "description": "Learn why companies are ditching BPMS and applying process modeling and automation practices to their customer-facing processes instead. \nThe post 5 Factors Impacting Your Business Process Management appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/11/how-process-automation-can-ignite-your-business-process-management/",
          "publishedOn": "2021-11-05T14:00:00.000Z",
          "wordCount": 1935,
          "title": "5 Factors Impacting Your Business Process Management"
        },
        {
          "id": "https://camunda.com/?p=35654",
          "author": "David Simmons",
          "description": "Having trouble setting your variable sometimes? Find out how to check if your variable is set and why it can occasionally appear non-existent.\nThe post Q&A: The One with the Non-existent Variable appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/11/qa-the-one-with-the-non-existent-variable/",
          "publishedOn": "2021-11-04T13:30:00.000Z",
          "wordCount": 1577,
          "title": "Q&A: The One with the Non-existent Variable"
        },
        {
          "id": "https://camunda.com/?p=35255",
          "author": "Niall Deehan",
          "description": "If you’re going to be communicating with the Camunda engine from any kind of third-party system, you’re going to need to know a little bit about what Camunda’s REST API can do out of the box.\nThe post Start and Step Through a Process with REST (feat. SwaggerUI) appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/10/start-and-step-through-a-process-with-rest-feat-swaggerui/",
          "publishedOn": "2021-11-01T08:00:04.000Z",
          "wordCount": 2124,
          "title": "Start and Step Through a Process with REST (feat. SwaggerUI)"
        },
        {
          "id": "https://camunda.com/?p=35220",
          "author": "Amy Johnston",
          "description": "Get the bonus insight and answers we didn't have time to share during our recent Camunda Platform 7.16 release webinar.\nThe post Camunda Platform 7.16 Webinar Recap appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/10/camunda-platform-7-16-webinar-recap/",
          "publishedOn": "2021-10-29T13:30:00.000Z",
          "wordCount": 2208,
          "title": "Camunda Platform 7.16 Webinar Recap"
        },
        {
          "id": "https://camunda.com/?p=34955",
          "author": "Tassilo Weidner",
          "description": "Discover how our latest Camunda Platform Runtime 7.16.0 release introduces a new Quarkus Extension allowing you to add an embedded process engine.\nThe post Camunda Platform: Deploy a Process to Kubernetes with Quarkus appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/10/camunda-platform-deploy-a-process-to-kubernetes-with-quarkus/",
          "publishedOn": "2021-10-25T15:50:38.000Z",
          "wordCount": 2468,
          "title": "Camunda Platform: Deploy a Process to Kubernetes with Quarkus"
        },
        {
          "id": "https://camunda.com/?p=34809",
          "author": "Bryan Grover",
          "description": "Outgrowing your monolithic architecture? Explore our best practices and tips on leveraging microservices in your automation program.\nThe post Migrating from Monolith to Microservices appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/10/migrating-from-monolith-to-microservices/",
          "publishedOn": "2021-10-25T13:30:00.000Z",
          "wordCount": 1529,
          "title": "Migrating from Monolith to Microservices"
        },
        {
          "id": "https://camunda.com/?p=33053",
          "author": "David Simmons",
          "description": "Are your models hard to understand? Find out why it's better to model everything and leave nothing out. Future you will thank you later.\nThe post Q&A: The One with the Model No One Understands appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/10/qa-the-one-with-the-model-no-one-understands/",
          "publishedOn": "2021-10-22T13:00:00.000Z",
          "wordCount": 1756,
          "title": "Q&A: The One with the Model No One Understands"
        },
        {
          "id": "https://camunda.com/?p=33092",
          "author": "Camunda Optimize Team",
          "description": "Tired of bottlenecks slowing down your productivity? Learn how to solve your bottleneck and provide proof to your team that it's fixed.\nThe post The Ultimate Guide to Solving Bottlenecks with Camunda: Part 2 appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/10/the-ultimate-guide-to-solving-bottlenecks-with-camunda-part-2/",
          "publishedOn": "2021-10-21T07:00:00.000Z",
          "wordCount": 2425,
          "title": "The Ultimate Guide to Solving Bottlenecks with Camunda: Part 2"
        },
        {
          "id": "https://camunda.com/?p=32773",
          "author": "Garth Knudson",
          "description": "Is less really more? Maximus embraced microservices orchestration to gain reduced software license, implementation and infrastructure costs.\nThe post Maximus Modernizing and Maximizing Their Potential appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/10/maximus-modernizing-and-maximizing-their-potential/",
          "publishedOn": "2021-10-19T13:00:00.000Z",
          "wordCount": 1635,
          "title": "Maximus Modernizing and Maximizing Their Potential"
        },
        {
          "id": "https://camunda.com/?p=32691",
          "author": "Camunda Optimize Team",
          "description": "Learn how to use Camunda Optimize to find and solve your bottlenecks with business processes, and apply best practices from the manufacturing industry. \nThe post The Ultimate Guide to Solving Bottlenecks with Camunda: Part 1 appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/10/the-ultimate-guide-to-solving-bottlenecks-with-camunda-part-1/",
          "publishedOn": "2021-10-14T13:00:00.000Z",
          "wordCount": 2218,
          "title": "The Ultimate Guide to Solving Bottlenecks with Camunda: Part 1"
        }
      ]
    },
    {
      "title": "となりのヤングジャンプ（ワンパンマン）",
      "feedUrl": "https://tonarinoyj.jp/rss/series/13932016480028984490",
      "siteUrl": "https://tonarinoyj.jp/episode/13932016480028985383",
      "articles": [
        {
          "id": "tonarino_yj:episode:3269754496572306855",
          "author": "原作/ＯＮＥ/漫画/村田雄介",
          "description": "ワンパンマン",
          "link": "https://tonarinoyj.jp/episode/3269754496572306855",
          "publishedOn": "2021-10-29T15:00:00.000Z",
          "wordCount": 102,
          "title": "[第196話] ワンパンマン",
          "enclosure": {
            "url": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/3269754496572306855-ca964ddb7c7eacb659e970d2998cbba5",
            "length": "0",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.com/blog/all.atom",
      "siteUrl": "https://github.blog",
      "articles": [
        {
          "id": "https://github.blog/2021-11-04-github-availability-report-october-2021/",
          "author": null,
          "description": "In October, we experienced one incident resulting in significant impact and degraded state of availability for the GitHub Codespaces service.",
          "link": "https://github.blog/2021-11-04-github-availability-report-october-2021/",
          "publishedOn": "2021-11-04T20:37:09.000Z",
          "wordCount": 453,
          "title": "GitHub Availability Report: October 2021"
        },
        {
          "id": "https://github.blog/2021-11-04-10-github-actions-resources-basics-ci-cd/",
          "author": null,
          "description": "Tips on how to get started using GitHub Actions and resources to learn more about making it work for you.",
          "link": "https://github.blog/2021-11-04-10-github-actions-resources-basics-ci-cd/",
          "publishedOn": "2021-11-04T15:57:06.000Z",
          "wordCount": 1188,
          "title": "10 GitHub Actions resources to bookmark from the basics to CI/CD"
        },
        {
          "id": "https://github.blog/2021-11-03-building-the-next-phase-of-github-together/",
          "author": null,
          "description": "This morning, I shared the following post with Hubbers in response to Nat’s announcement about his next adventure. I am thrilled to take on the role of CEO to build the next phase of GitHub for our global community of software developers.",
          "link": "https://github.blog/2021-11-03-building-the-next-phase-of-github-together/",
          "publishedOn": "2021-11-03T15:08:47.000Z",
          "wordCount": 757,
          "title": "Building the next phase of GitHub, together"
        },
        {
          "id": "https://github.blog/2021-11-03-thank-you-github/",
          "author": null,
          "description": "This morning, I sent the following post to the GitHub team. TL;DR: I’m moving on to my next adventure, and Thomas Dohmke (currently Chief Product Officer) will be GitHub’s next CEO.",
          "link": "https://github.blog/2021-11-03-thank-you-github/",
          "publishedOn": "2021-11-03T15:08:17.000Z",
          "wordCount": 1059,
          "title": "Thank you, GitHub"
        },
        {
          "id": "https://github.blog/2021-11-02-blue-teaming-create-security-advisory-process/",
          "author": null,
          "description": "This blog post is the first in a series about hardening the security of the Exiv2 project. My goal is to share tips that will help you harden the security of your own project.",
          "link": "https://github.blog/2021-11-02-blue-teaming-create-security-advisory-process/",
          "publishedOn": "2021-11-02T16:16:01.000Z",
          "wordCount": 1571,
          "title": "Blue-teaming for Exiv2, part 1: creating a security advisory process"
        },
        {
          "id": "https://github.blog/2021-11-01-game-off-2021-theme-announcement/",
          "author": null,
          "description": "The theme for this year’s Game Off is… &#8230;BUG! Your challenge, should you choose to accept it, is to create a game between now and December 1 incorporating the theme somehow, and submit it to",
          "link": "https://github.blog/2021-11-01-game-off-2021-theme-announcement/",
          "publishedOn": "2021-11-01T20:30:06.000Z",
          "wordCount": 646,
          "title": "Game Off 2021 theme announcement"
        },
        {
          "id": "https://github.blog/2021-11-01-cybersecurity-spotlight-bug-bounty-researcher-yvvdwf/",
          "author": null,
          "description": "We’re excited to highlight another top contributing researcher to GitHub’s Bug Bounty Program: @yvvdwf",
          "link": "https://github.blog/2021-11-01-cybersecurity-spotlight-bug-bounty-researcher-yvvdwf/",
          "publishedOn": "2021-11-01T17:00:37.000Z",
          "wordCount": 1094,
          "title": "Cybersecurity spotlight on bug bounty researcher @yvvdwf"
        },
        {
          "id": "https://github.blog/2021-11-01-github-keeps-getting-better-for-open-source-maintainers/",
          "author": null,
          "description": "Maintainers can now limit who can approve and request changes on pull requests. You can also close issues and block users via your phone.",
          "link": "https://github.blog/2021-11-01-github-keeps-getting-better-for-open-source-maintainers/",
          "publishedOn": "2021-11-01T16:00:25.000Z",
          "wordCount": 863,
          "title": "GitHub keeps getting better for open source maintainers"
        },
        {
          "id": "https://github.blog/2021-10-29-thirteen-short-and-scary-games-plus-source-to-play-or-hack-this-halloween/",
          "author": null,
          "description": "It’s that time of year again where I like to share seasonally spooktacular games plus source code—a goldmine of material for (a) those looking for coffee-break entertainment, (b) those interested in learning more about game",
          "link": "https://github.blog/2021-10-29-thirteen-short-and-scary-games-plus-source-to-play-or-hack-this-halloween/",
          "publishedOn": "2021-10-29T08:01:42.000Z",
          "wordCount": 1391,
          "title": "13 short and scary games plus source to play (or hack) this Halloween 🎃"
        },
        {
          "id": "https://github.blog/2021-10-27-everything-new-from-universe-2021/",
          "author": null,
          "description": "Since last year’s GitHub Universe, we’ve shipped more than 20,000 improvements to GitHub for developers, open source communities, and enterprise teams. Here’s a comprehensive overview of what we’re announcing at Universe this week.",
          "link": "https://github.blog/2021-10-27-everything-new-from-universe-2021/",
          "publishedOn": "2021-10-27T15:30:56.000Z",
          "wordCount": 2020,
          "title": "Everything new from Universe 2021"
        }
      ]
    },
    {
      "title": "Martin Kleppmann's blog",
      "feedUrl": "https://feeds.feedburner.com/martinkl",
      "siteUrl": "http://martin.kleppmann.com/",
      "articles": []
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "http://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/552be631c113",
          "author": "Netflix Technology Blog",
          "description": "by Christos G. Bampis, Chao Chen, Anush K. Moorthy and Zhi Li",
          "link": "https://netflixtechblog.com/netflix-video-quality-at-scale-with-cosmos-microservices-552be631c113?source=rss----2615bd06b42e---4",
          "publishedOn": "2021-11-02T17:04:55.000Z",
          "wordCount": 1954,
          "title": "Netflix Video Quality at Scale with Cosmos Microservices"
        },
        {
          "id": "https://medium.com/p/a1fcc5f64906",
          "author": "Netflix Technology Blog",
          "description": "As part of our “Data Engineers of Netflix” series, Pallavi Phadnis shares her journey to Data Engineering at Netflix.",
          "link": "https://netflixtechblog.com/data-engineers-of-netflix-interview-with-pallavi-phadnis-a1fcc5f64906?source=rss----2615bd06b42e---4",
          "publishedOn": "2021-10-28T17:30:19.000Z",
          "wordCount": 1152,
          "title": "Data Engineers of Netflix — Interview with Pallavi Phadnis"
        },
        {
          "id": "https://medium.com/p/75ff465f0d60",
          "author": "Netflix Technology Blog",
          "description": "Netflix’s ML Platform has made a new addition to Open Source",
          "link": "https://netflixtechblog.com/open-sourcing-a-monitoring-gui-for-metaflow-75ff465f0d60?source=rss----2615bd06b42e---4",
          "publishedOn": "2021-10-27T21:58:06.000Z",
          "wordCount": 2151,
          "title": "Open-Sourcing a Monitoring GUI for Metaflow"
        },
        {
          "id": "https://medium.com/p/6943995cf3a8",
          "author": "Netflix Technology Blog",
          "description": "Martin Tingley with Wenjing Zheng, Simon Ejdemyr, Stephanie Lane, and Colin McFarland",
          "link": "https://netflixtechblog.com/interpreting-a-b-test-results-false-negatives-and-power-6943995cf3a8?source=rss----2615bd06b42e---4",
          "publishedOn": "2021-10-26T15:45:24.000Z",
          "wordCount": 2535,
          "title": "Interpreting A/B test results: false negatives and power"
        },
        {
          "id": "https://medium.com/p/4c978b79843f",
          "author": "Netflix Technology Blog",
          "description": "By Ian Haken",
          "link": "https://netflixtechblog.com/revisiting-bettertls-certificate-path-building-4c978b79843f?source=rss----2615bd06b42e---4",
          "publishedOn": "2021-10-14T18:56:19.000Z",
          "wordCount": 4177,
          "title": "Revisiting BetterTLS: Certificate Path Building"
        },
        {
          "id": "https://medium.com/p/96777ae12fe2",
          "author": "Netflix Technology Blog",
          "description": "Joel Sole, Mariana Afonso, Lukas Krasula, Zhi Li, Pulkit Tandon",
          "link": "https://netflixtechblog.com/cambi-a-banding-artifact-detector-96777ae12fe2?source=rss----2615bd06b42e---4",
          "publishedOn": "2021-10-14T17:00:33.000Z",
          "wordCount": 2064,
          "title": "CAMBI, a banding artifact detector"
        }
      ]
    },
    {
      "title": "Google AI Blog",
      "feedUrl": "http://feeds.feedburner.com/blogspot/gJZg",
      "siteUrl": "http://ai.googleblog.com/",
      "articles": [
        {
          "id": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/LfcpfSFd0cE/another-step-towards-breakeven-fusion.html",
          "author": null,
          "description": "Posted by Ted Baltz, Senior Staff Software Engineer, Google Research  \nFor more than 70 years, plasma physicists have dreamed of controlled “breakeven” fusion, where a system is capable of releasing more energy in a fusion reaction than it takes to initiate and sustain those reactions. The challenge is that the reactor must create a plasma at a temperature of tens of millions of degrees, which requires a highly complex, finely tuned system to confine and sustain. Further, creating the plasma and maintaining it, requires substantial amounts of energy, which, to date, have exceeded that released in the fusion reaction itself. Nevertheless, if a “breakeven” system could be achieved, it could provide ample zero-carbon electricity, the potential impact of which has driven interest by government…",
          "link": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/LfcpfSFd0cE/another-step-towards-breakeven-fusion.html",
          "publishedOn": "2021-11-05T19:03:00.000Z",
          "wordCount": 2319,
          "title": "Another Step Towards Breakeven Fusion"
        },
        {
          "id": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/sOxjdGbrMN0/self-supervised-reversibility-aware.html",
          "author": null,
          "description": "Posted by Johan Ferret, Student Researcher, Google Research, Brain Team    \nAn approach commonly used to train agents for a range of applications from robotics to chip design is reinforcement learning (RL). While RL excels at discovering how to solve tasks from scratch, it can struggle in training an agent to understand the reversibility of its actions, which can be crucial to ensure that agents behave in a safe manner within their environment. For instance, robots are generally costly and require maintenance, so one wants to avoid taking actions that might lead to broken components. Estimating if an action is reversible or not (or better, how easily it can be reversed) requires a working knowledge of the physics of the environment in which the agent is operating. However, in the standard …",
          "link": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/sOxjdGbrMN0/self-supervised-reversibility-aware.html",
          "publishedOn": "2021-11-03T18:11:00.003Z",
          "wordCount": 2945,
          "title": "Self-Supervised Reversibility-Aware Reinforcement Learning"
        },
        {
          "id": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/PmNQ5-q9nsU/goemotions-dataset-for-fine-grained.html",
          "author": null,
          "description": "Posted by Dana Alon and Jeongwoo Ko, Software Engineers, Google Research \nEmotions are a key aspect of social interactions, influencing the way people behave and shaping relationships. This is especially true with language — with only a few words, we're able to express a wide variety of subtle and complex emotions. As such, it’s been a long-term goal among the research community to enable machines to understand context and emotion, which would, in turn, enable a variety of applications, including empathetic chatbots, models to detect harmful online behavior, and improved customer support interactions. \nIn the past decade, the NLP research community has made available several datasets for language-based emotion classification. The majority of those are constructed manually and cover targete…",
          "link": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/PmNQ5-q9nsU/goemotions-dataset-for-fine-grained.html",
          "publishedOn": "2021-10-28T18:14:00.003Z",
          "wordCount": 2551,
          "title": "GoEmotions: A Dataset for Fine-Grained Emotion Classification"
        },
        {
          "id": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/eoT5Hz-uPuA/grammar-correction-as-you-type-on-pixel.html",
          "author": null,
          "description": "Posted by Tony Mak, Software Engineer, Google Research and Simon Tong, Principal Engineer, Google Research, Brain Team \nDespite the success and widespread adoption of smartphones, using them to compose longer pieces of text is still quite cumbersome. As one writes, grammatical errors can often creep into the text (especially undesirable in formal situations), and correcting these errors can be time consuming on a small display with limited controls. \n  \nTo address some of these challenges, we are launching a grammar correction feature that is directly built into Gboard on Pixel 6 that works entirely on-device to preserve privacy, detecting and suggesting corrections for grammatical errors while the user is typing. Building such functionality required addressing a few key obstacles: memory …",
          "link": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/eoT5Hz-uPuA/grammar-correction-as-you-type-on-pixel.html",
          "publishedOn": "2021-10-27T20:31:00.002Z",
          "wordCount": 2323,
          "title": "Grammar Correction as You Type, on Pixel 6"
        },
        {
          "id": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/Z1YDHbG3p88/deciding-which-tasks-should-train.html",
          "author": null,
          "description": "Posted by Christopher Fifty, Research Engineer, Google Research, Brain Team \nMany machine learning (ML) models typically focus on learning one task at a time. For example, language models predict the probability of a next word given a context of past words, and object detection models identify the object(s) that are present in an image. However, there may be instances when learning from many related tasks at the same time would lead to better modeling performance. This is addressed in the domain of multi-task learning, a subfield of ML in which multiple objectives are trained within the same model at the same time. \nConsider a real-world example: the game of ping-pong. When playing ping-pong, it is often advantageous to judge the distance, spin, and imminent trajectory of the ping-pong bal…",
          "link": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/Z1YDHbG3p88/deciding-which-tasks-should-train.html",
          "publishedOn": "2021-10-25T17:17:00.000Z",
          "wordCount": 1913,
          "title": "Deciding Which Tasks Should Train Together in Multi-Task Neural Networks"
        },
        {
          "id": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/_1_YMVFz4Ck/practical-differentially-private.html",
          "author": null,
          "description": "Posted by Alisa Chang, Software Engineer, Google Cloud and Pritish Kamath, Research Scientist, Google Research \nOver the last several years, progress has been made on privacy-safe approaches for handling sensitive data, for example, while discovering insights into human mobility and through use of federated analytics such as RAPPOR. In 2019, we released an open source library to enable developers and organizations to use techniques that provide differential privacy, a strong and widely accepted mathematical notion of privacy. Differentially-private data analysis is a principled approach that enables organizations to learn and release insights from the bulk of their data while simultaneously providing a mathematical guarantee that those results do not allow any individual user's data to be …",
          "link": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/_1_YMVFz4Ck/practical-differentially-private.html",
          "publishedOn": "2021-10-21T20:07:00.000Z",
          "wordCount": 2379,
          "title": "Practical Differentially Private Clustering"
        },
        {
          "id": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/NrWLVnG4ocM/predicting-spreadsheet-formulas-from.html",
          "author": null,
          "description": "Posted by Rishabh Singh, Research Scientist and Max Lin, Software Engineer, Google Research \nHundreds of millions of people use spreadsheets, and formulas in those spreadsheets allow users to perform sophisticated analyses and transformations on their data. Although formula languages are simpler than general-purpose programming languages, writing these formulas can still be tedious and error-prone, especially for end-users. We've previously developed tools to understand patterns in spreadsheet data to automatically fill missing values in a column, but they were not built to support the process of writing formulas. \nIn \"SpreadsheetCoder: Formula Prediction from Semi-structured Context\", published at ICML 2021, we describe a new model that learns to automatically generate formulas based on t…",
          "link": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/NrWLVnG4ocM/predicting-spreadsheet-formulas-from.html",
          "publishedOn": "2021-10-20T20:45:00.000Z",
          "wordCount": 1647,
          "title": "Predicting Spreadsheet Formulas from Semi-structured Contexts"
        },
        {
          "id": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/Iw2Y608H7U0/how-underspecification-presents.html",
          "author": null,
          "description": "Posted by Alex D’Amour and Katherine Heller, Research Scientists, Google Research \nMachine learning (ML) models are being used more widely today than ever before and are becoming increasingly impactful. However, they often exhibit unexpected behavior when they are used in real-world domains. For example, computer vision models can exhibit surprising sensitivity to irrelevant features, while natural language processing models can depend unpredictably on demographic correlations not directly indicated by the text. Some reasons for these failures are well-known: for example, training ML models on poorly curated data, or training models to solve prediction problems that are structurally mismatched with the application domain. Yet, even when these known problems are handled, model behavior can …",
          "link": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/Iw2Y608H7U0/how-underspecification-presents.html",
          "publishedOn": "2021-10-18T18:02:00.000Z",
          "wordCount": 2534,
          "title": "How Underspecification Presents Challenges for Machine Learning"
        },
        {
          "id": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/K6BXPlCIQc4/simvlm-simple-visual-language-model-pre.html",
          "author": null,
          "description": "Posted by Zirui Wang, Student Researcher and Yuan Cao, Research Scientist, Google Research, Brain Team \nVision-language modeling grounds language understanding in corresponding visual inputs, which can be useful for the development of important products and tools. For example, an image captioning model generates natural language descriptions based on its understanding of a given image. While there are various challenges to such cross-modal work, significant progress has been made in the past few years on vision-language modeling thanks to the adoption of effective vision-language pre-training (VLP). This approach aims to learn a single feature space from both visual and language inputs, rather than learning two separate feature spaces, one each for visual inputs and another for language in…",
          "link": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/K6BXPlCIQc4/simvlm-simple-visual-language-model-pre.html",
          "publishedOn": "2021-10-15T19:14:00.001Z",
          "wordCount": 2650,
          "title": "SimVLM: Simple Visual Language Model Pre-training with Weak Supervision"
        },
        {
          "id": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/6q0aEDND7Bo/baselines-for-uncertainty-and.html",
          "author": null,
          "description": "Posted by Zachary Nado, Research Engineer and Dustin Tran, Research Scientist, Google Research, Brain Team \nMachine learning (ML) is increasingly being used in real-world applications, so understanding the uncertainty and robustness of a model is necessary to ensure performance in practice. For example, how do models behave when deployed on data that differs from the data on which they were trained? How do models signal when they are likely to make a mistake? \nTo get a handle on an ML model's behavior, its performance is often measured against a baseline for the task of interest. With each baseline, researchers must try to reproduce results only using descriptions from the corresponding papers , which results in serious challenges for replication. Having access to the code for experiments …",
          "link": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/6q0aEDND7Bo/baselines-for-uncertainty-and.html",
          "publishedOn": "2021-10-14T17:37:00.000Z",
          "wordCount": 1913,
          "title": "Baselines for Uncertainty and Robustness in Deep Learning"
        },
        {
          "id": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/Jsa88i6V21M/an-ml-based-framework-for-covid-19.html",
          "author": null,
          "description": "Posted by Joel Shor, Software Engineer, Google Research and Sercan Arik, Research Scientist, Google Research, Cloud AI Team \nOver the past 20 months, the COVID-19 pandemic has had a profound impact on daily life, presented logistical challenges for businesses planning for supply and demand, and created difficulties for governments and organizations working to support communities with timely public health responses. While there have been well-studied epidemiology models that can help predict COVID-19 cases and deaths to help with these challenges, this pandemic has generated an unprecedented amount of real-time publicly-available data, which makes it possible to use more advanced machine learning techniques in order to improve results. \nIn \"A prospective evaluation of AI-augmented epidemiol…",
          "link": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/Jsa88i6V21M/an-ml-based-framework-for-covid-19.html",
          "publishedOn": "2021-10-13T21:26:00.002Z",
          "wordCount": 2559,
          "title": "An ML-Based Framework for COVID-19 Epidemiology"
        },
        {
          "id": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/2U8Nsi8dFH0/self-supervised-learning-advances.html",
          "author": null,
          "description": "Posted by Shekoofeh Azizi, AI Resident, Google Research \nIn recent years, there has been increasing interest in applying deep learning to medical imaging tasks, with exciting progress in various applications like radiology, pathology and dermatology. Despite the interest, it remains challenging to develop medical imaging models, because high-quality labeled data is often scarce due to the time-consuming effort needed to annotate medical images. Given this, transfer learning is a popular paradigm for building medical imaging models. With this approach, a model is first pre-trained using supervised learning on a large labeled dataset (like ImageNet) and then the learned generic representation is fine-tuned on in-domain medical data.  \nOther more recent approaches that have proven successful …",
          "link": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/2U8Nsi8dFH0/self-supervised-learning-advances.html",
          "publishedOn": "2021-10-13T17:01:00.000Z",
          "wordCount": 2430,
          "title": "Self-Supervised Learning Advances Medical Image Classification"
        },
        {
          "id": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/8ZMVByJmhHA/google-at-iccv-2021.html",
          "author": null,
          "description": "Posted by Cat Armato, Program Manager, Google Research \nThe International Conference on Computer Vision 2021 (ICCV 2021), one of the world's premier conferences on computer vision, starts this week. A Champion Sponsor and leader in computer vision research, Google will have a strong presence at ICCV 2021 with more than 50 research presentations and involvement in the organization of a number of workshops and tutorials. \nIf you are attending ICCV this year, we hope you’ll check out the work of our researchers who are actively pursuing the latest innovations in computer vision. Learn more about our research being presented in the list below (Google affilitation in bold). \n    \nOrganizing Committee\n  Diversity and Inclusion Chair: Negar Rostamzadeh\n  Area Chairs: Andrea Tagliasacchi, Boqing G…",
          "link": "http://feedproxy.google.com/~r/blogspot/gJZg/~3/8ZMVByJmhHA/google-at-iccv-2021.html",
          "publishedOn": "2021-10-11T19:30:00.001Z",
          "wordCount": 2756,
          "title": "Google at ICCV 2021"
        }
      ]
    }
  ],
  "cliVersion": "1.11.3"
}