{
  "sources": [
    {
      "title": "Spring",
      "feedUrl": "https://spring.io/blog.atom",
      "siteUrl": "https://spring.io/blog",
      "articles": [
        {
          "id": "https://spring.io/blog/2022/10/06/spring-cloud-2022-0-0-m5-is-now-available",
          "author": null,
          "description": "On behalf of the community, I am pleased to announce that the Milestone 5 (M5) of the Spring Cloud 2022.0.0 Release Train is available today. The release can be found in Spring Milestone repository. You can check out the 2022.0.0 release notes for more information.\nNotable Changes in the 2022.00-M5 Release Train\nSpring Cloud Netflix\n\r\n\r\n  \nUpdated to Eureka 2.0.0-rc.3. Eureka 2.0.0 is a new branch of Eureka unrelated to the old 2.x-archive experiment from 7 years ago. The new 2.x branch is for compatibility with JakartaEE. This allows Spring Cloud Netflix to be compatible with Spring Framework 6.0 and Spring Boot 3.0. This is the first milestone that Spring Cloud Netflix has participated in the 2022.0 release train.\n\r\n\nSpring Cloud Consul\n\r\n\r\n  \nAdded runtime hints to enable native image s…",
          "link": "https://spring.io/blog/2022/10/06/spring-cloud-2022-0-0-m5-is-now-available",
          "publishedOn": "2022-10-06T20:57:00.000Z",
          "wordCount": 920,
          "title": "Spring Cloud 2022.0.0-M5 is now available",
          "imageUrl": "https://avatars.githubusercontent.com/u/594085?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/06/a-bootiful-podcast-spring-and-java-community-legend-marten-deinum",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks to longtime Spring community member and legend Marten Deinum (@mdeinum) about scuba diving, software, Spring, community, and more. \n\r\nAlso: I fixed the odd silence in the middle of the last few episodes! thanks for suffering through it with me. I have no idea what went wrong but I know now how to fix it\n\r\n\r\nWant to meet more amazing people in our ecosystem, like Marten? SpringOne 2022 is almost here! I feel like it’s that anxious, exciting time before, sort of important holiday where you get given gifts! And with it, Spring Boot 3 and Spring Framework 6. We’re going to be announcing everything right here on the Spring blog, of course, but if you want a chance to learn from the source, then I hope you’ll join us 6-8 December 2022, right here in my hometown of San Francisco, my favorite west coast city in the USA, and my hometown. (Psst.: If you register now, there’s a $200 discount from the pass price with this code S1VM22_Advocate_200.)",
          "link": "https://spring.io/blog/2022/10/06/a-bootiful-podcast-spring-and-java-community-legend-marten-deinum",
          "publishedOn": "2022-10-06T07:00:00.000Z",
          "wordCount": 699,
          "title": "A Bootiful Podcast: Spring and Java community legend Marten Deinum",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/05/spring-shell-2-1-2-and-3-0-0-m1-are-now-available",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Shell 2.1.2 and 3.0.0-M1 has been released and is now available from https://repo.spring.io/release, Maven Central and https://repo.spring.io/milestone respectively.\n\r\n3.0.0-M1 is first milestone which builds on Spring Boot 3.x and requires JDK 17.\n\r\nPlease see the release notes 2.1.2 and release notes 3.0.0-M1 for more details.\n\r\nThanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nProject Page | GitHub | Issues | Documentation",
          "link": "https://spring.io/blog/2022/10/05/spring-shell-2-1-2-and-3-0-0-m1-are-now-available",
          "publishedOn": "2022-10-05T10:08:06.000Z",
          "wordCount": 602,
          "title": "Spring Shell 2.1.2 and 3.0.0-M1 are now available",
          "imageUrl": "https://avatars.githubusercontent.com/u/50398?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/05/spring-batch-5-0-0-m7-available-now",
          "author": null,
          "description": "On behalf of the team and all contributors, I am pleased to announce that Spring Batch 5.0.0-M7 is now available from our milestone repository.\n\r\nThe main theme of this milestone is the improvement of job parameters handling in Spring Batch. Two main changes were introduced in this release:\n\r\n\r\n  \nAdd support to use any type as a job parameter\n\r\n  \nImprove job parameters conversion\n\r\n\r\nThis blog post walks through these two major changes in details. For the complete list of changes, please check the release notes.\nAdd support to use any type as a job parameter\n\r\nUp to version 4, Spring Batch supported only 4 types that can be used as job parameters, which are long, double, String and Date. While this was convenient to simplify job parameters handling on the framework’s side, it turns out t…",
          "link": "https://spring.io/blog/2022/10/05/spring-batch-5-0-0-m7-available-now",
          "publishedOn": "2022-10-05T08:00:00.000Z",
          "wordCount": 1096,
          "title": "Spring Batch 5.0.0-M7 available now!",
          "imageUrl": "https://avatars.githubusercontent.com/u/1210553?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/04/this-week-in-spring-october-4th-2022",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring! It’s October 4th, 2022, and I’m in Austin, TX, for the new version of show formerly known as the Kafka Summit, here to talk to folks about the amazing opportunities for Spring Boot and Apache Kafka. On the 12th, I’ll be in Antwerp, Belgium, for the amazing Devoxx show. On October 17-20th, I’ll be in Las Vegas, for the new version of JavaOne. And, well, there’s more but I can’t say exactly. Stay tuned!\n\r\nAnd as for now, well, I’m excited to be here! We’ve got a ton of cool stuff to cover this week, so let’s dive right into it!\n\r\n\r\n  \nA Bootiful Podcast: thought leader Chris Richardson (and no, I’m not using that title ironically!)\n\r\n  \nGetting a URL Attribute Value in Thymeleaf\n\r\n  \nRabbitMQ 3.11 Feature Preview: Super …",
          "link": "https://spring.io/blog/2022/10/04/this-week-in-spring-october-4th-2022",
          "publishedOn": "2022-10-04T08:00:00.000Z",
          "wordCount": 967,
          "title": "This Week in Spring - October 4th, 2022",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/09/29/a-bootiful-podcast-thought-leader-chris-richardson-and-no-i-m-not-using-that-title-ironically",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks to his friend Chris Richardson (@crichardson), who helped articulate and advance cloud computing, reactive programming, microservices, domain-driven design, event sourcing, and so much more years before the zeitgeist. Also, we used to work together! \n\r\n\r\nWant to meet more amazing people in our ecosystem, like Chris? SpringOne 2022 is almost here! I feel like it’s that anxious, exciting time before, sort of important holiday where you get given gifts! And with it, Spring Boot 3 and Spring Framework 6. We’re going to be announcing everything right here on the Spring blog, of course, but if you want a chance to learn from the source, then I hope you’ll join us 6-8 December 2022, right here in my hometown of San Francisco, my favorite west coast city in the USA, and my hometown. (Psst.: If you register now, there’s a $200 discount from the pass price with this code S1VM22_Advocate_200.)",
          "link": "https://spring.io/blog/2022/09/29/a-bootiful-podcast-thought-leader-chris-richardson-and-no-i-m-not-using-that-title-ironically",
          "publishedOn": "2022-09-29T07:00:00.000Z",
          "wordCount": 689,
          "title": "A Bootiful Podcast:   thought leader Chris Richardson (and no, I'm not using that title ironically!)",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/09/27/delete-passwords-passwordless-connections-for-spring-boot-apps-to-azure-services",
          "author": null,
          "description": "Using username/password credentials to access one application from another presents a huge security risk for many\r\r\n    reasons. Today, we are announcing the preview of passwordless connections for Java applications to Azure database\r\r\n    and eventing services, letting you finally shift away from using passwords. \n\r\nSecurity Challenges with Passwords\n\r\nPasswords should be used with caution, and developers must never place passwords in an unsecure location. Many Java\r\r\n    applications connect to backend data, cache, messaging, and eventing services using usernames and passwords, or other sensitive credentials such as access tokens or connection strings.\r\r\n    If exposed, the passwords could be used to gain unauthorized access to sensitive information such as a sales catalog\r\r\n    that you…",
          "link": "https://spring.io/blog/2022/09/27/delete-passwords-passwordless-connections-for-spring-boot-apps-to-azure-services",
          "publishedOn": "2022-09-27T09:22:00.000Z",
          "wordCount": 1533,
          "title": "Delete Passwords: Passwordless Connections for Spring Boot  Apps to Azure Services",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/09/27/this-week-in-spring-september-27th-2022",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring!\n\r\nIt’s the last week of September, already! The year’s more done than not. The days are receding into darkness earlier. And the Pumpkin Spice Lattes are upon us. The darker and colder days are kind of a bummer, but I’m stil excited and overjoyed this time of year. You know why?\n\r\nSpringOne 2022 is almost here! I feel like it’s that anxious, exciting time before sort of important holiday where you get given gifts! And with it, Spring Boot 3 and Spring Framework 6. We’re going to be announcing everything right here on the Spring blog, of course, but if you want a chance to learn from the source, then I hope you’ll join us 6-8 December, 2022, right here in my hometown of San Francisco, my favorite west coast city in the U…",
          "link": "https://spring.io/blog/2022/09/27/this-week-in-spring-september-27th-2022",
          "publishedOn": "2022-09-27T07:00:00.000Z",
          "wordCount": 868,
          "title": "This Week in Spring - September 27th, 2022",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/09/26/native-support-in-spring-boot-3-0-0-m5",
          "author": null,
          "description": "The Spring Team has been working on native image support for Spring Applications for quite some time. After 3+ years of incubation in the Spring Native experimental project with Spring Boot 2, native support is moving to General Availability with Spring Framework 6 and Spring Boot 3!\n\r\nNative images provide almost instant startup time and reduced memory consumption for Java applications. The recent Spring Boot 3.0.0-M5 release marks the first time we’re asking for broader community feedback on our native story. If you need to catch-up on the basics, please refer to the Ahead Of Time basics blog post from late March. You can also learn how to prepare your applications for Spring Boot 3.0.\n\r\nA lot has happened since March! We’ve improved compatibility with a larger number of use cases and li…",
          "link": "https://spring.io/blog/2022/09/26/native-support-in-spring-boot-3-0-0-m5",
          "publishedOn": "2022-09-26T11:33:00.000Z",
          "wordCount": 1518,
          "title": "Native Support in Spring Boot 3.0.0-M5",
          "imageUrl": "https://avatars.githubusercontent.com/u/490484?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/09/23/my-springone-2022",
          "author": null,
          "description": "It has taken me an embarrassingly long time to appreciate and understand that the devil is in the details regarding software development. Writing happy-path business logic isn’t the hard part! It’s the failure cases, observability, resilience, and process. It’s security and other so-called non-functional requirements. It’s architecting for agility. It’s production. Spring is unique because it sits at the crossroads of many exciting application development discussions. \n\r\nSpring’s community contains multitudes and is one of the key defining features. This diversity of discussion means that any conference that endeavors to cover the full sweep of ideas has its work cut out. I don’t know of any other show - and I’ve spoken at many thousands of shows and events in my life! - that completely co…",
          "link": "https://spring.io/blog/2022/09/23/my-springone-2022",
          "publishedOn": "2022-09-23T07:00:00.000Z",
          "wordCount": 1388,
          "title": "My SpringOne 2022",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/09/22/spring-boot-3-0-0-m5-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 3.0.0-M5 has been released and is now available from https://repo.spring.io/milestone.\n\r\nThis release includes 153 enhancements, documentation improvements, dependency upgrades, and bug fixes. Notable new features include:\n\r\n\r\n  \nImproved Ahead-of-Time (AOT) processing and native image support\n\r\n  \nImproved actuator endpoints sanitization\n\r\n  \nJersey support re-instated\n\r\n\r\nPlease see the release notes for more details and upgrade instructions.\n\r\nThanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2022/09/22/spring-boot-3-0-0-m5-available-now",
          "publishedOn": "2022-09-22T22:30:55.000Z",
          "wordCount": 646,
          "title": "Spring Boot 3.0.0-M5 available now",
          "imageUrl": "https://avatars.githubusercontent.com/u/60661?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/09/22/a-bootiful-podcast-couchbase-and-cloud-legend-laurent-doguin",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks to his friend, fellow Java Champion, and director of developer relations and strategy at Couchbase, Laurent Doguin (@ldoguin)\n\r\n\r\nSpringOne 2022 is almost here! This is our first in-person event since the pandemic and it’s when we release Spring Framework 6 and Spring Boot 3, the next generation of Spring and Spring Boot respectively. It’s running 6-8 December in my sunny San Francisco, CA! Register now at SpringOne.io and use the code S1VM22_Advocate_200 to get $200 off the current registration price.",
          "link": "https://spring.io/blog/2022/09/22/a-bootiful-podcast-couchbase-and-cloud-legend-laurent-doguin",
          "publishedOn": "2022-09-22T18:00:00.000Z",
          "wordCount": 609,
          "title": "A Bootiful Podcast: Couchbase and Cloud legend Laurent Doguin",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/09/22/spring-boot-2-7-4-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.7.4 has been released and is now available from Maven Central.\n\r\nThis release includes 48 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nJava 19\n\r\nFollowing its GA release earlier this week, Java 19 is now supported.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2022/09/22/spring-boot-2-7-4-available-now",
          "publishedOn": "2022-09-22T12:06:26.000Z",
          "wordCount": 629,
          "title": "Spring Boot 2.7.4 available now",
          "imageUrl": "https://avatars.githubusercontent.com/u/914682?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/09/22/spring-boot-2-6-12-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.6.12 has been released and is now available from Maven Central.\n\r\nThis release includes 33 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nJava 19\n\r\nFollowing its GA release earlier this week, Java 19 is now supported.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2022/09/22/spring-boot-2-6-12-available-now",
          "publishedOn": "2022-09-22T09:58:00.000Z",
          "wordCount": 629,
          "title": "Spring Boot 2.6.12 available now",
          "imageUrl": "https://avatars.githubusercontent.com/u/914682?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/09/22/spring-batch-5-0-0-m6-and-4-3-7-are-out",
          "author": null,
          "description": "I am pleased to announce that Spring Batch 5.0.0-M6 is now available from our milestone repository and that 4.3.7 is available from Maven Central. Version 4.3.7 is a patch release that can be used as a drop-in replacement for 4.3.6. You can find its release notes here. This blog post is more about the new milestone release, version 5.0.0-M6. In this milestone, we focused on improving the configuration process of Spring Batch to make it more flexible and straightforward. This blog post walks through the major changes in this area of the framework and presents the new features introduced in this milestone release. For the complete list of changes, see the release notes.\nNew Annotation Attributes in EnableBatchProcessing\n\r\nIn this release, the @EnableBatchProcessing annotation introduced new …",
          "link": "https://spring.io/blog/2022/09/22/spring-batch-5-0-0-m6-and-4-3-7-are-out",
          "publishedOn": "2022-09-22T08:00:00.000Z",
          "wordCount": 1311,
          "title": "Spring Batch 5.0.0-M6 and 4.3.7 are out!",
          "imageUrl": "https://avatars.githubusercontent.com/u/1210553?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/09/21/spring-integration-6-0-0-m5-and-5-5-15-available",
          "author": null,
          "description": "Dear Spring community,\n\r\n\r\n\r\nI’d like to share with you an availability of the latest Milestone 5 of new Spring Integration 6.0 generation.\n\r\n\r\n\r\nIt can be obtained from Spring Milestone repository:\n\r\n\r\n\r\n\r\ndependencyManagement {\r\n    imports {\r\n        mavenBom 'org.springframework.integration:spring-integration-bom:6.0.0-M5'\r\n    }\r\n}\n\r\n\r\n\r\n\r\nAlso, Spring Integration 5.5.15 has been released with some critical bug fixed and upstream dependencies deprecation resolutions.\r\nIt is recommended to upgrade if you have missed some intermediate releases before or just pull it transitively from upcoming Spring Boot 2.6.12 or 2.7.4!\n\r\n\r\n\r\nWith the whole Spring portfolio move to Java 17 and Jakarta EE, it was a tremendous internal framework refactoring to support new Java language level and jakarta …",
          "link": "https://spring.io/blog/2022/09/21/spring-integration-6-0-0-m5-and-5-5-15-available",
          "publishedOn": "2022-09-21T17:55:30.000Z",
          "wordCount": 1101,
          "title": "Spring Integration 6.0.0-M5 and 5.5.15 Available",
          "imageUrl": "https://avatars.githubusercontent.com/u/1071590?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/09/21/spring-authorization-server-1-0-0-m2-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, it is my pleasure to announce the general availability of Spring Authorization Server 1.0.0-M2.\n\r\n\r\n\r\nYou can download it from repo.spring.io milestone repository by using the module coordinates:\n\r\n\r\n\r\n\r\nimplementation 'org.springframework.security:spring-security-oauth2-authorization-server:1.0.0-M2'\n\r\n\r\n\r\n\r\nSee the release notes for complete details.\n\r\n\r\n\r\nTo get started using Spring Authorization Server, see the Getting Started chapter of the reference documentation and the samples to become familiar with setup and configuration.\n\r\n\r\n\r\nWe would love to gather your feedback as we strive to improve and build upon this release.\n\r\n\r\n\r\nProject Page | GitHub Issues | ZenHub Board",
          "link": "https://spring.io/blog/2022/09/21/spring-authorization-server-1-0-0-m2-available-now",
          "publishedOn": "2022-09-21T14:00:00.000Z",
          "wordCount": 610,
          "title": "Spring Authorization Server 1.0.0-M2 available now",
          "imageUrl": "https://avatars.githubusercontent.com/u/10884212?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/09/21/spring-authorization-server-0-4-0-m2-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, it is my pleasure to announce the general availability of Spring Authorization Server 0.4.0-M2.\n\r\n\r\n\r\nYou can download it from repo.spring.io milestone repository by using the module coordinates:\n\r\n\r\n\r\n\r\nimplementation 'org.springframework.security:spring-security-oauth2-authorization-server:0.4.0-M2'\n\r\n\r\n\r\n\r\nSee the release notes for complete details.\n\r\n\r\n\r\nTo get started using Spring Authorization Server, see the Getting Started chapter of the reference documentation and the samples to become familiar with setup and configuration.\n\r\n\r\n\r\nWe would love to gather your feedback as we strive to improve and build upon this release.\n\r\n\r\n\r\nProject Page | GitHub Issues | ZenHub Board",
          "link": "https://spring.io/blog/2022/09/21/spring-authorization-server-0-4-0-m2-available-now",
          "publishedOn": "2022-09-21T14:00:00.000Z",
          "wordCount": 610,
          "title": "Spring Authorization Server 0.4.0-M2 available now",
          "imageUrl": "https://avatars.githubusercontent.com/u/10884212?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/09/20/spring-session-2022-0-0-m3-released",
          "author": null,
          "description": "On behalf of the team, I’m pleased to announce the release of Spring Session 2022.0.0-M3. These releases deliver, enhancements, bug fixes, and dependency upgrades.\nFor your convenience, Spring Boot will pick up these artifacts with its upcoming releases.\n\r\nThe following modules were updated as part of 2022.0.0-M3:\n\r\n\r\n  \nSpring Session Core 3.0.0-M4 - release notes\n\r\n  \nSpring Session Data Redis 3.0.0-M4 - release notes\n\r\n  \nSpring Session JDBC 3.0.0-M4 - release notes\n\r\n  \nSpring Session Hazelcast 3.0.0-M4 - release notes",
          "link": "https://spring.io/blog/2022/09/20/spring-session-2022-0-0-m3-released",
          "publishedOn": "2022-09-21T04:06:00.000Z",
          "wordCount": 584,
          "title": "Spring Session 2022.0.0-M3 Released",
          "imageUrl": "https://avatars.githubusercontent.com/u/362503?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/09/20/spring-cloud-dataflow-2-10-0-m2-released",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Cloud Dataflow 2.10.0-M2 has been released and is now available from https://repo.spring.io/milestone.\n\r\nThis release contains an update of the Spring Boot version and adds back in support for MySQL. See the release notes for more information.\nStay in touch…\n\r\nAs always, we welcome feedback and contributions, so please reach out to us on Stackoverflow or GitHub.",
          "link": "https://spring.io/blog/2022/09/20/spring-cloud-dataflow-2-10-0-m2-released",
          "publishedOn": "2022-09-20T19:00:00.000Z",
          "wordCount": 582,
          "title": "Spring Cloud Dataflow 2.10.0-M2 Released",
          "imageUrl": "https://avatars.githubusercontent.com/u/28907971?v=4?s=200"
        }
      ]
    },
    {
      "title": "HashiCorp Blog",
      "feedUrl": "https://www.hashicorp.com/blog/feed.xml",
      "siteUrl": "https://hashicorp.com/blog",
      "articles": [
        {
          "id": "https://www.hashicorp.com/blog/nomad-1-4-adds-nomad-variables-and-updates-service-discovery",
          "author": null,
          "description": "The GA release of HashiCorp Nomad 1.4 enhances native service discovery support with health checks and introduces Nomad Variables, which lets users store configuration values.",
          "link": "https://www.hashicorp.com/blog/nomad-1-4-adds-nomad-variables-and-updates-service-discovery",
          "publishedOn": "2022-10-06T16:00:00.000Z",
          "wordCount": 5183,
          "title": "Nomad 1.4 Adds Nomad Variables and Updates Service Discovery",
          "imageUrl": "https://www.datocms-assets.com/2885/1620083839-blog-library-product-nomad-dark-graphics.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-hcp-waypoint-public-beta",
          "author": null,
          "description": "HashiCorp Waypoint — now available on the HashiCorp Cloud Platform in public beta — lets users standardize application delivery across platforms.",
          "link": "https://www.hashicorp.com/blog/announcing-hcp-waypoint-public-beta",
          "publishedOn": "2022-10-06T16:00:00.000Z",
          "wordCount": 2296,
          "title": "Announcing HCP Waypoint Public Beta",
          "imageUrl": "https://www.datocms-assets.com/2885/1655842512-blog-library-product-hcp-waypoint.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/terraform-gains-visibility-self-service-and-compliance-upgrades",
          "author": null,
          "description": "Continuous validation, no-code provisioning, native OPA support for Terraform Cloud, and other new features are key upgrades to HashiCorp Terraform introduced at HashiConf Global 2022.",
          "link": "https://www.hashicorp.com/blog/terraform-gains-visibility-self-service-and-compliance-upgrades",
          "publishedOn": "2022-10-06T16:00:00.000Z",
          "wordCount": 3209,
          "title": "Terraform Gains Visibility, Self-Service, and Compliance Upgrades",
          "imageUrl": "https://www.datocms-assets.com/2885/1620081857-blog-library-product-terraform-dark-gradient.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/hcp-boundary-now-ga-bolsters-hashicorp-s-zero-trust-security-solution",
          "author": null,
          "description": "General availability of HCP Boundary lets developers access critical systems with fine-grained authorizations — without managing credentials or exposing your network.",
          "link": "https://www.hashicorp.com/blog/hcp-boundary-now-ga-bolsters-hashicorp-s-zero-trust-security-solution",
          "publishedOn": "2022-10-05T16:00:00.000Z",
          "wordCount": 2713,
          "title": "HCP Boundary — Now GA — Bolsters HashiCorp's Zero Trust Security Solution",
          "imageUrl": "https://www.datocms-assets.com/2885/1655842506-blog-library-product-hcp-boundary.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/hcp-vault-on-microsoft-azure-now-in-public-beta",
          "author": null,
          "description": "In addition to its availability on AWS, HCP Vault can now be deployed on Microsoft Azure infrastructure.",
          "link": "https://www.hashicorp.com/blog/hcp-vault-on-microsoft-azure-now-in-public-beta",
          "publishedOn": "2022-10-05T16:00:00.000Z",
          "wordCount": 1339,
          "title": "HCP Vault on Microsoft Azure Now in Public Beta",
          "imageUrl": "https://www.datocms-assets.com/2885/1664831430-blog-thumbnail-hcp_diagram_onblack_vault_azure.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-developer-your-new-experience-for-docs-and-tutorials",
          "author": null,
          "description": "HashiCorp Developer is your one-stop shop for interactive labs, sample code, videos, tutorials, and in-depth documentation.",
          "link": "https://www.hashicorp.com/blog/hashicorp-developer-your-new-experience-for-docs-and-tutorials",
          "publishedOn": "2022-10-05T16:00:00.000Z",
          "wordCount": 1949,
          "title": "HashiCorp Developer: Your New Experience for Docs and Tutorials",
          "imageUrl": "https://www.datocms-assets.com/2885/1664569797-dev-dot-home.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/consul-1-14-beta-announcing-simplified-service-mesh-deployments",
          "author": null,
          "description": "HashiCorp Consul 1.14 enhances traffic management and failover, and adds a new deployment method: Consul dataplane. AWS Lambda updates and beta Windows VM support were also added.",
          "link": "https://www.hashicorp.com/blog/consul-1-14-beta-announcing-simplified-service-mesh-deployments",
          "publishedOn": "2022-10-05T16:00:00.000Z",
          "wordCount": 5578,
          "title": "Consul 1.14 Beta: Announcing Simplified Service Mesh Deployments",
          "imageUrl": "https://www.datocms-assets.com/2885/1620083627-blog-library-product-consul-dark-graphics.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/introducing-a-new-hcp-based-management-plane-for-consul",
          "author": null,
          "description": "The HashiCorp Cloud Platform (HCP) adds new visibility and management controls for self-managed and HCP-managed Consul deployments.",
          "link": "https://www.hashicorp.com/blog/introducing-a-new-hcp-based-management-plane-for-consul",
          "publishedOn": "2022-10-05T16:00:00.000Z",
          "wordCount": 2603,
          "title": "Introducing a New HCP-Based Management Plane for Consul",
          "imageUrl": "https://www.datocms-assets.com/2885/1655842467-blog-library-product-hcp-consul.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-the-2022-hashicorp-technology-partner-award-winners",
          "author": null,
          "description": "The 2022 HashiCorp Technology Partner Awards have been announced. Find out who the winners are in our four categories this year.",
          "link": "https://www.hashicorp.com/blog/announcing-the-2022-hashicorp-technology-partner-award-winners",
          "publishedOn": "2022-10-04T22:30:00.000Z",
          "wordCount": 1675,
          "title": "Announcing the 2022 HashiCorp Technology Partner Award Winners",
          "imageUrl": "https://www.datocms-assets.com/2885/1600142862-blog-library-product-hashicorp.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/dungeons-dragons-for-team-building",
          "author": null,
          "description": "The HashiCorp Community team used a custom Dungeons & Dragons campaign as a team building exercise. Check out the highlights and then try it yourself.",
          "link": "https://www.hashicorp.com/blog/dungeons-dragons-for-team-building",
          "publishedOn": "2022-09-29T16:00:00.000Z",
          "wordCount": 1920,
          "title": "Dungeons & Dragons for Team Building",
          "imageUrl": "https://www.datocms-assets.com/2885/1664466398-dnd.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/terraform-enterprise-adds-run-metrics-versioned-docs-and-more",
          "author": null,
          "description": "Terraform Enterprise enhances observability and cuts operational burden with improved run metrics, identity-based storage authentication, and versioned documentation.",
          "link": "https://www.hashicorp.com/blog/terraform-enterprise-adds-run-metrics-versioned-docs-and-more",
          "publishedOn": "2022-09-27T16:00:00.000Z",
          "wordCount": 1727,
          "title": "Terraform Enterprise Adds Run Metrics, Versioned Docs, and More",
          "imageUrl": "https://www.datocms-assets.com/2885/1620083068-blog-library-product-terraform-black.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/terraform-1-3-improves-extensibility-and-maintainability-of-terraform-modules",
          "author": null,
          "description": "Now generally available, HashiCorp Terraform 1.3 introduces optional object type attributes with defaults, and enhancements to moved blocks, improving extensibility and maintainability of Terraform modules.",
          "link": "https://www.hashicorp.com/blog/terraform-1-3-improves-extensibility-and-maintainability-of-terraform-modules",
          "publishedOn": "2022-09-21T16:00:00.000Z",
          "wordCount": 2386,
          "title": "Terraform 1.3 Improves Extensibility and Maintainability of Terraform Modules",
          "imageUrl": "https://www.datocms-assets.com/2885/1620083055-blog-library-product-terraform-dark-graphics.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/vagrant-2-3-introduces-go-runtime",
          "author": null,
          "description": "HashiCorp Vagrant 2.3 introduces a new Vagrant executable written in Golang, tying the Vagrant architecture more closely into the broader HashiCorp ecosystem.",
          "link": "https://www.hashicorp.com/blog/vagrant-2-3-introduces-go-runtime",
          "publishedOn": "2022-09-19T18:00:00.000Z",
          "wordCount": 1611,
          "title": "Vagrant 2.3 Introduces Go Runtime",
          "imageUrl": "https://www.datocms-assets.com/2885/1620083141-blog-library-product-vagrant-logo-dark-graphics.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/how-drift-detection-helps-maintain-a-secure-infrastructure",
          "author": null,
          "description": "Drift detection is essential to maintaining efficiency while minimizing risk and giving teams confidence in your infrastructure as code (IaC) provisioning workflow.",
          "link": "https://www.hashicorp.com/blog/how-drift-detection-helps-maintain-a-secure-infrastructure",
          "publishedOn": "2022-09-16T17:00:00.000Z",
          "wordCount": 2999,
          "title": "How Drift Detection Helps Maintain a Secure Infrastructure",
          "imageUrl": "https://www.datocms-assets.com/2885/1599960706-blog-library-abstract-00006.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-tools-explained-using-a-minecraft-world",
          "author": null,
          "description": "Visit our Minecraft world and learn how HashiCorp Vault, Consul, Nomad, and Boundary all work through fun analogies. Join us at HashiConf Global 2022 — in Los Angeles or online Oct. 4-6.",
          "link": "https://www.hashicorp.com/blog/hashicorp-tools-explained-using-a-minecraft-world",
          "publishedOn": "2022-09-15T16:00:00.000Z",
          "wordCount": 2483,
          "title": "HashiCorp Tools Explained Using a Minecraft World",
          "imageUrl": "https://www.datocms-assets.com/2885/1663251427-2022-minecraft-world.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/waypoint-0-10-brings-custom-pipelines-and-nomad-plugin-updates",
          "author": null,
          "description": "HashiCorp Waypoint 0.10 — now generally available — introduces the tech preview of custom pipelines and improvements to the Nomad integration.",
          "link": "https://www.hashicorp.com/blog/waypoint-0-10-brings-custom-pipelines-and-nomad-plugin-updates",
          "publishedOn": "2022-09-13T20:00:00.000Z",
          "wordCount": 7658,
          "title": "Waypoint 0.10 Brings Custom Pipelines and Nomad Plugin Updates",
          "imageUrl": "https://www.datocms-assets.com/2885/1620083907-blog-library-product-waypoint-dark-graphics.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/f5-new-relic-and-sophos-among-new-consul-integrations",
          "author": null,
          "description": "The HashiCorp Consul ecosystem continues its growth with the addition of 15 new self-managed, enterprise, and HCP Consul integrations.",
          "link": "https://www.hashicorp.com/blog/f5-new-relic-and-sophos-among-new-consul-integrations",
          "publishedOn": "2022-09-13T12:00:00.000Z",
          "wordCount": 2480,
          "title": "F5, New Relic, and Sophos Highlight New Consul Integrations",
          "imageUrl": "https://www.datocms-assets.com/2885/1663082712-q3consulintegrationsgraphic.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/consul-terraform-sync-0-7-adds-high-availability-and-redundancy",
          "author": null,
          "description": "General availability of HashiCorp Consul-Terraform-Sync 0.7 represents a key step in the maturity of our Network Infrastructure Automation solution.",
          "link": "https://www.hashicorp.com/blog/consul-terraform-sync-0-7-adds-high-availability-and-redundancy",
          "publishedOn": "2022-09-12T19:00:00.000Z",
          "wordCount": 3624,
          "title": "Consul-Terraform-Sync 0.7 Adds High Availability and Redundancy",
          "imageUrl": "https://www.datocms-assets.com/2885/1620082169-blog-library-product-terraform-consul-dark-logomark-lockup.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/drift-detection-for-terraform-cloud-is-now-generally-available",
          "author": null,
          "description": "Drift Detection for Terraform Cloud continuously checks infrastructure state to detect and notify operators of any changes, minimizing risk, downtime, and costs.",
          "link": "https://www.hashicorp.com/blog/drift-detection-for-terraform-cloud-is-now-generally-available",
          "publishedOn": "2022-09-12T13:00:00.000Z",
          "wordCount": 2536,
          "title": "Drift Detection for Terraform Cloud is Now Generally Available",
          "imageUrl": "https://www.datocms-assets.com/2885/1620073839-blog-library-product-terraform-cloud-tfc-black-corner-iconography.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/how-to-make-interns-a-dynamic-part-of-your-team",
          "author": null,
          "description": "Figuring out where interns fit into larger team goals can be tough. One HashiCorp manager shares three essential tips to encourage success for everyone involved.",
          "link": "https://www.hashicorp.com/blog/how-to-make-interns-a-dynamic-part-of-your-team",
          "publishedOn": "2022-09-09T16:00:00.000Z",
          "wordCount": 3309,
          "title": "How To Make Interns a Dynamic Part of Your Team",
          "imageUrl": "https://www.datocms-assets.com/2885/1658166656-hashicorp-early-career-program-intern-logo.png"
        }
      ]
    },
    {
      "title": "Elastic Blog - Elasticsearch, Kibana, and ELK Stack",
      "feedUrl": "https://www.elastic.co/blog/feed",
      "siteUrl": "https://www.elastic.co",
      "articles": [
        {
          "id": "https://www.elastic.co/blog/elastic-wins-2022-cybersecurity-breakthrough-award-for-threat-intelligence-platform-of-the-year",
          "author": "Jennifer Ellard",
          "description": "We are excited to announce that Elastic Security has been honored with the 2022 CyberSecurity Breakthrough Award for Threat Intelligence Platform of the Year.",
          "link": "https://www.elastic.co/blog/elastic-wins-2022-cybersecurity-breakthrough-award-for-threat-intelligence-platform-of-the-year",
          "publishedOn": "2022-10-06T00:00:00.000Z",
          "wordCount": 9866,
          "title": "Elastic Wins 2022 CyberSecurity Breakthrough Award for Threat Intelligence Platform of the Year",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt20948cd013dc875e/633dc3e314e81b11862b149d/cybersecurity-breakthrough-award.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/stateless-your-new-state-of-find-with-elasticsearch",
          "author": "Leaf Lin,Tim Brooks,Quin Hoxie",
          "description": "Discover this future of stateless Elasticsearch. Learn how we’re investing in building a new fully cloud native architecture to push the boundaries of scale and speed.",
          "link": "https://www.elastic.co/blog/stateless-your-new-state-of-find-with-elasticsearch",
          "publishedOn": "2022-10-06T00:00:00.000Z",
          "wordCount": 12875,
          "title": "Stateless — your new state of find with Elasticsearch",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltd1b895c2415afc7e/6297bad13d4e745ed3ae45e2/enterprise-search-search-bar-pattern-dark-1680x980.png"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-wins-2022-cybersecurity-breakthrough-award-for-threat-intelligence-platform-of-the-year",
          "author": "Jennifer Ellard",
          "description": ",\nWe are excited to announce that Elastic has been honored with the 2022 CyberSecurity Breakthrough Award for Threat Intelligence Platform of the Year, recognizing the cutting-edge threat intelligence capabilities of Elastic Security, which enable organizations to better understand current and emerging threats and respond more quickly to adversaries. \n\nCyberSecurity Breakthrough recognizes today’s best information security companies and products and is driven by an independent panel of experts who thoroughly review and evaluate each entry.\nStreamlined, actionable threat intelligence for all\nIt’s no secret that cyberattacks continue to evolve rapidly. To combat these ongoing threats, organizations cannot rely on technology alone. They must have a deeper understanding of today’s threat lands…",
          "link": "https://www.elastic.co/blog/elastic-wins-2022-cybersecurity-breakthrough-award-for-threat-intelligence-platform-of-the-year",
          "publishedOn": "2022-10-06T00:00:00.000Z",
          "wordCount": 9866,
          "title": "Elastic Wins 2022 CyberSecurity Breakthrough Award for Threat Intelligence Platform of the Year",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt20948cd013dc875e/633dc3e314e81b11862b149d/cybersecurity-breakthrough-award.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/stateless-your-new-state-of-find-with-elasticsearch",
          "author": "Leaf Lin,Tim Brooks,Quin Hoxie",
          "description": ",\nWhere we started\nThe first version of Elasticsearch was released in 2010 as a distributed scalable search engine allowing users to quickly search for and surface critical insights. Twelve years and over 65,000 commits later, Elasticsearch continues to provide users with battle-tested solutions to a wide variety of search problems. Thanks to the efforts of over 1,500 contributors, including hundreds of full-time Elastic employees, Elasticsearch has constantly evolved to meet the new challenges that arise in the field of search.\n\nEarly in Elasticsearch's life when data loss concerns were raised, the Elastic team underwent a multiyear effort to rewrite the cluster coordination system to guarantee that acknowledged data is stored safely. When it became clear that managing indices in large cl…",
          "link": "https://www.elastic.co/blog/stateless-your-new-state-of-find-with-elasticsearch",
          "publishedOn": "2022-10-06T00:00:00.000Z",
          "wordCount": 12875,
          "title": "Stateless — your new state of find with Elasticsearch",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltd1b895c2415afc7e/6297bad13d4e745ed3ae45e2/enterprise-search-search-bar-pattern-dark-1680x980.png"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-stack-8-4-3-released",
          "author": "David Roberts",
          "description": "Version 8.4.3 of the Elastic Stack was released today. We recommend you upgrade to this latest version. We recommend 8.4.3 over the previous patch versions in 8.4.x.\nThe 8.4.2 release introduced a bug in Elasticsearch that may fail queries that use the cross_fields type at search time with an error message containing totalTermFreq must be at least docFreq. Users of the cross_fields type are recommended to upgrade to 8.4.3 to avoid hitting this bug.\nFor details of the issues that have been fixed and a full list of changes for each product in this version, refer to the release notes: \n8.4.3 Release Notes\nElastic Stack\nElasticsearch\nKibana\nBeats\nLogstash\nElastic Enterprise Search\nEnterprise Search\nElastic Observability\nAPM\nElastic Security\nElastic Security Solution",
          "link": "https://www.elastic.co/blog/elastic-stack-8-4-3-released",
          "publishedOn": "2022-10-05T00:00:00.000Z",
          "wordCount": 8962,
          "title": "Elastic Stack 8.4.3 released",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt9c35d17afad9d20d/5f122812c31823015df6ef0a/blog-thumb-rocket-launch.png"
        },
        {
          "id": "https://www.elastic.co/blog/dont-miss-the-elastic-event-of-the-year-elasticon",
          "author": "Steve Kearns",
          "description": "We’re excited to bring you an all-new ElasticON experience by offering both virtual and in-person options for attending our biggest user conference of the year.",
          "link": "https://www.elastic.co/blog/dont-miss-the-elastic-event-of-the-year-elasticon",
          "publishedOn": "2022-10-05T00:00:00.000Z",
          "wordCount": 10768,
          "title": "ElasticON, Elastic’s biggest event of the year, is back and coming to a city near you",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltcb3d3dc34147a6bb/633b304140abbe169f6d34f9/ElasticON_Banner_Option_1_(720_×_420_px).png"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-stack-8-4-3-released",
          "author": "David Roberts",
          "description": "Read about the updates and bug fixes that have been included in this release.",
          "link": "https://www.elastic.co/blog/elastic-stack-8-4-3-released",
          "publishedOn": "2022-10-05T00:00:00.000Z",
          "wordCount": 8962,
          "title": "Elastic Stack 8.4.3 released",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt9c35d17afad9d20d/5f122812c31823015df6ef0a/blog-thumb-rocket-launch.png"
        },
        {
          "id": "https://www.elastic.co/blog/dont-miss-the-elastic-event-of-the-year-elasticon",
          "author": "Steve Kearns",
          "description": ",\nElasticON is here! Our signature conference series brings the Elastic community — customers, partners, analysts, experts, and more — together to get inspired and learn from one another as we explore new possibilities with Elastic.\n\nElastic leaders will share product roadmaps, expert advice, and information about Elastic's future plans. And customer speakers will join us to discuss their experiences using Elastic for observability, security, and search applications. We’d love to see you there!\nWhere you can attend ElasticON\nOur ElasticON Global event will take place virtually from March 7–9, 2023. But we’re not waiting until March to engage. We’re taking ElasticON on the road with the ElasticON Comes to You event series in six cities worldwide leading up to our global multi-day virtual ev…",
          "link": "https://www.elastic.co/blog/dont-miss-the-elastic-event-of-the-year-elasticon",
          "publishedOn": "2022-10-05T00:00:00.000Z",
          "wordCount": 10768,
          "title": "ElasticON, Elastic’s biggest event of the year, is back and coming to a city near you",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltcb3d3dc34147a6bb/633b304140abbe169f6d34f9/ElasticON_Banner_Option_1_(720_×_420_px).png"
        },
        {
          "id": "https://www.elastic.co/blog/oct-2022-launch-elastic-enterprise-search",
          "author": "The Elastic Enterprise Search team",
          "description": "Elastic Enterprise Search, the best platform for builders of search experiences, continues to improve relevance with simplified, improved vector search functionality.",
          "link": "https://www.elastic.co/blog/oct-2022-launch-elastic-enterprise-search",
          "publishedOn": "2022-10-04T16:00:00.000Z",
          "wordCount": 10489,
          "title": "Elastic Enterprise Search: Build with speed, search with ease",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltbb4996d39a786d20/5ffe05b822252d41f72866fc/blog-thumb-release-enterprise-search.png"
        },
        {
          "id": "https://www.elastic.co/blog/oct-2022-launch-elastic-profiling",
          "author": "David Hope,Sean Heelan",
          "description": "Elastic Universal Profiling™ allows you to see what your code is doing at all times, in all languages, in both user-space and kernel-space code. It lets you profile everywhere, all the time and filter powerfully with total observability.",
          "link": "https://www.elastic.co/blog/oct-2022-launch-elastic-profiling",
          "publishedOn": "2022-10-04T16:00:00.000Z",
          "wordCount": 11702,
          "title": "Elastic Universal Profiling™ helps you deliver fast, affordable, and efficient services",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltc6b258344937b95e/633b46e426327a24983279d7/ElasticObservability-UniversalProfiling-Oct2022Launch.png"
        },
        {
          "id": "https://www.elastic.co/blog/oct-2022-launch-elasticsearch-kibana-cloud",
          "author": "Bianca Laurendine,George Kobar,Evan Castle,Bernhard Suhm,Brian Bergholm",
          "description": "Get started from the AWS marketplace in just 3 clicks. Discover a vision for serverless built on a new stateless Elasticsearch architecture. Benefit accelerated time to insights, ease of use for a wide range of ML models, including vector search.",
          "link": "https://www.elastic.co/blog/oct-2022-launch-elasticsearch-kibana-cloud",
          "publishedOn": "2022-10-04T16:00:00.000Z",
          "wordCount": 12643,
          "title": "Elastic Stack & Cloud: Start from AWS in 3 clicks, learn about Elastic’s serverless vision",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltd2b695348ddc99f3/62fcf82cbcca746334bc3ddc/blog-thumb-release-platform.png"
        },
        {
          "id": "https://www.elastic.co/blog/oct-2022-launch-elastic-enterprise-search",
          "author": "The Elastic Enterprise Search team",
          "description": ",\nElastic continues to help everyone find what they need faster with Elastic Enterprise Search, a comprehensive solution for building search-powered applications.\n\nElastic Enterprise Search elevates relevance and precision at scale with a new combination of traditional and machine learning-assisted techniques.\nElastic delivers the best platform for search builders\nElastic’s open source roots have allowed us to build the most powerful platform for search-powered solutions in the market. From the beginning, we’ve made it easy for developers to build search capabilities into their applications with a combination of out-of-the-box and flexible developer tools to build their own experiences. Our vast community of developers helps us drive innovation and take search technology in new directions.…",
          "link": "https://www.elastic.co/blog/oct-2022-launch-elastic-enterprise-search",
          "publishedOn": "2022-10-04T16:00:00.000Z",
          "wordCount": 10489,
          "title": "Elastic Enterprise Search: Build with speed, search with ease",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltbb4996d39a786d20/5ffe05b822252d41f72866fc/blog-thumb-release-enterprise-search.png"
        },
        {
          "id": "https://www.elastic.co/blog/oct-2022-launch-elastic-profiling",
          "author": "David Hope,Sean Heelan",
          "description": ",\nSo, what is Universal Profiling™? Universal Profiling™ is fast emerging as an important component of observability. A standard feature inside hyperscalers since approximately 2010, the technology is slowly percolating into the wider industry. Universal Profiling™ allows you to see what your code is doing all the time, in production across a wide range of languages and can profile both user-space and kernel-space code. It can be used in containerized or non-containerized environments, and provides a powerful UI to unearth inefficiencies and optimization opportunities throughout your entire fleet. \n\n\nAs recently as two to three years ago, very few fleet-wide continuous profiling products existed. As of 2022, there is a plethora of APM vendors and other projects that provide some form of co…",
          "link": "https://www.elastic.co/blog/oct-2022-launch-elastic-profiling",
          "publishedOn": "2022-10-04T16:00:00.000Z",
          "wordCount": 11702,
          "title": "Elastic Universal Profiling™ helps you deliver fast, affordable, and efficient services",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltc6b258344937b95e/633b46e426327a24983279d7/ElasticObservability-UniversalProfiling-Oct2022Launch.png"
        },
        {
          "id": "https://www.elastic.co/blog/oct-2022-launch-elasticsearch-kibana-cloud",
          "author": "Bianca Laurendine,George Kobar,Evan Castle,Bernhard Suhm,Brian Bergholm",
          "description": ",\nElastic Stack and Cloud are introducing new capabilities to accelerate time to insights, increase ease of use for a range of machine learning models, including vector search, and create a vision for a new stateless Elasticsearch architecture. This architecture will pave the way to a fully-managed serverless Elastic stack. \nThese new capabilities allow you to:\n\nSimplify onboarding on your favorite cloud provider\nGain complete support for machine learning, including vector search\nDiscover a future vision for stateless Elasticsearch\n\nReady to roll up your sleeves and get started? We have the links you need:\n\nGet started with the Elastic Stack on Elastic Cloud\nDownload Elasticsearch, Kibana, Integrations\n\nIt’s never been easier to get started on Elastic Cloud\nWhether you prefer to take advan…",
          "link": "https://www.elastic.co/blog/oct-2022-launch-elasticsearch-kibana-cloud",
          "publishedOn": "2022-10-04T16:00:00.000Z",
          "wordCount": 12643,
          "title": "Elastic Stack & Cloud: Start from AWS in 3 clicks, learn about Elastic’s serverless vision",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltd2b695348ddc99f3/62fcf82cbcca746334bc3ddc/blog-thumb-release-platform.png"
        },
        {
          "id": "https://www.elastic.co/blog/oct-2022-launch-announcement",
          "author": "Dan Courcy",
          "description": "Discover how the Elastic Search Platform can help your organization transform an avalanche of data into actionable insights that enable you to keep pace with customer and employee demands, ensure operational resilience, and mitigate security risks.",
          "link": "https://www.elastic.co/blog/oct-2022-launch-announcement",
          "publishedOn": "2022-10-04T07:00:00.000Z",
          "wordCount": 11306,
          "title": "Unlock the full potential of your data with Elastic Search Platform",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt878ebe7fdc0cc140/62fd52a434503410d4c0701f/blog-thumbnail-generic-release.png"
        },
        {
          "id": "https://www.elastic.co/blog/oct-2022-launch-elastic-security",
          "author": "Mike Nichols,Dhrumil Patel",
          "description": "Elastic continues to provide customers the ability to modernize their security operations programs. Today’s launch celebrates several initiatives that together equip customers to modernize security operations.",
          "link": "https://www.elastic.co/blog/oct-2022-launch-elastic-security",
          "publishedOn": "2022-10-04T07:00:00.000Z",
          "wordCount": 10767,
          "title": "Elastic modernizes security teams with SOAR and automates actionable threat intelligence within SIEM",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt69323019f723d794/5ffe0811f093203f68d42e54/blog-thumb-release-security.png"
        },
        {
          "id": "https://www.elastic.co/blog/oct-2022-launch-announcement",
          "author": "Dan Courcy",
          "description": ",\nElastic, the company behind both Elasticsearch and the ELK Stack, today introduces the latest innovations in the Elastic Search Platform — the data analytics platform for search-powered solutions.\n\n\nAs organizations navigate today’s always-on and connected world, technology leaders face immense pressure to keep pace with customer and employee demands, to ensure operational resilience, and to mitigate security risks — challenges that are all connected by a single common denominator — an exponential avalanche of data.\n\n\nAccording to Accenture, 8 in 10 businesses today lack a comprehensive data strategy — and just as many do not have a centralized digital platform to manage data.\n\n\nThis is where the Elastic Search Platform comes in. Designed to address the complete data lifecycle, for any t…",
          "link": "https://www.elastic.co/blog/oct-2022-launch-announcement",
          "publishedOn": "2022-10-04T07:00:00.000Z",
          "wordCount": 11306,
          "title": "Unlock the full potential of your data with Elastic Search Platform",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt878ebe7fdc0cc140/62fd52a434503410d4c0701f/blog-thumbnail-generic-release.png"
        },
        {
          "id": "https://www.elastic.co/blog/oct-2022-launch-elastic-security",
          "author": "Mike Nichols,Dhrumil Patel",
          "description": ",\nElastic continues to provide customers the ability to modernize their security operations programs. Today’s launch celebrates several initiatives that together equip customers to modernize security operations, including:\n\nRecently announced SOAR features that reduce MTTR by accelerating analyst workflows\nKey enhancements to our threat intelligence function that decrease an analysts’ time to review threat intelligence and take action on it\nThe continuing evolution of built-in cloud security and endpoint security capabilities\n\nSoar into XDR\nExtended detection and response (XDR) continues to be a key approach to modernizing security operations. We are adding endpoint and cloud response actions, including automated response, rollback, and workflow capabilities. These new actions further redu…",
          "link": "https://www.elastic.co/blog/oct-2022-launch-elastic-security",
          "publishedOn": "2022-10-04T07:00:00.000Z",
          "wordCount": 10767,
          "title": "Elastic modernizes security teams with SOAR and automates actionable threat intelligence within SIEM",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt69323019f723d794/5ffe0811f093203f68d42e54/blog-thumb-release-security.png"
        },
        {
          "id": "https://www.elastic.co/blog/oct-2022-launch-elastic-observability",
          "author": "Amena Siddiqi",
          "description": "From its inception as a powerhouse for logging, Elastic Observability has grown into a comprehensive solution for full-stack, cloud-native observability. Upcoming enhancements include “always-on” eBPF-based application profiling and all-new synthetic monitoring.",
          "link": "https://www.elastic.co/blog/oct-2022-launch-elastic-observability",
          "publishedOn": "2022-10-04T00:00:00.000Z",
          "wordCount": 14830,
          "title": "Cloud-native observability from customer to kernel",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt768f7c3181bf8d4d/633b4723eb84042358356ffb/ElasticObservability-Oct22Launch.png"
        },
        {
          "id": "https://www.elastic.co/blog/oct-2022-launch-elastic-observability",
          "author": "Amena Siddiqi",
          "description": ",\nFrom its inception as a powerhouse for logging, Elastic Observability has grown into a comprehensive solution for full-stack multi and hybrid-cloud observability. Given the increasing complexity of the cloud-native world, the major challenge for observability is twofold: getting deeper and more frictionless visibility at all levels of applications, services, and infrastructure, and making sense of the overwhelming amount of data that is available. \nTowards this end, recent and future areas of innovation for Elastic Observability, include:\n\nZero-instrumentation “always-on” Universal ProfilingTM based on eBPF (currently in beta)\nA fully reimagined cloud and developer first synthetic monitoring offering, including a cloud-based global testing infrastructure, point-and-click script recorder,…",
          "link": "https://www.elastic.co/blog/oct-2022-launch-elastic-observability",
          "publishedOn": "2022-10-04T00:00:00.000Z",
          "wordCount": 14830,
          "title": "Cloud-native observability from customer to kernel",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt768f7c3181bf8d4d/633b4723eb84042358356ffb/ElasticObservability-Oct22Launch.png"
        }
      ]
    },
    {
      "title": "Ansible Blog",
      "feedUrl": "https://www.ansible.com/blog/rss.xml",
      "siteUrl": "https://www.ansible.com/blog",
      "articles": [
        {
          "id": "https://www.ansible.com/blog/ansible-and-packer-why-they-are-better-together",
          "author": "scavanau@redhat.com (Sean Cavanaugh)",
          "description": "Red Hat Ansible Automation Platform can help you orchestrate, operationalize and govern your hybrid cloud deployments.  In my last public cloud blog, I talked about Two Simple Ways Automation Can Save You Money on Your AWS Bill and similarly to Ashton’s blog Bringing Order to the Cloud: Day 2 Operations in AWS with Ansible, we both wanted to look outside the common public cloud use-case of provisioning and deprovisioning resources and instead look at automating common operational tasks.  For this blog post I want to cover how the Technical Marketing team for Ansible orchestrates a pipeline for demos and workshops with Ansible and how we integrate that with custom AMIs (Amazon Machine Images) created with Packer.  Packer is an open source tool that allows IT operators to standardize and automate the process of building system images.",
          "link": "https://www.ansible.com/blog/ansible-and-packer-why-they-are-better-together",
          "publishedOn": "2022-10-03T13:00:00.000Z",
          "wordCount": 3645,
          "title": "Using Ansible and Packer, From Provisioning to Orchestration",
          "imageUrl": "https://lh6.googleusercontent.com/z95BNeupD4B20SB-bsp_c3yUweZUTdjlUCR8RWalV4lRr1o0nmZSpFa2rdYqCnytvowXIRNcx-vv_JD-Vyp9HF5n7TW7Lyfi_mbbBKzHq5zHuIcDyeF38v-ddQLWkn0luR-ZhxKztPrMdiqNOIgN8rmeWtUZBNJ1lBtVkxsU_NBUZCRWqtlKIKoAsg"
        },
        {
          "id": "https://www.ansible.com/blog/dynamic-inventory-plugin-collection-for-network-device-management",
          "author": "Eric McLeroy",
          "description": "Tackling the complexities of enterprise inventories\n \r\nOne common challenge our customers face is the need to track hosts from multiple sources: LDAP, cloud providers, and enterprise CMDB systems. Using a dynamic inventory allows users to integrate with these systems and update the Ansible inventory as it varies over time, with hosts spinning up and shutting down in response to business demands.",
          "link": "https://www.ansible.com/blog/dynamic-inventory-plugin-collection-for-network-device-management",
          "publishedOn": "2022-09-28T13:00:00.000Z",
          "wordCount": 3336,
          "title": "Dynamic inventory plugin collection for network device management",
          "imageUrl": "https://www.ansible.com/hubfs/network%20device%20management%20blog.png"
        },
        {
          "id": "https://www.ansible.com/blog/migrate-to-azure-monitor-agent-on-azure-arc-using-red-hat-ansible-automation-platform",
          "author": "Scott Harwell",
          "description": "Azure Arc is becoming the default Microsoft Azure service for connecting non-Azure infrastructure into Azure monitoring and administration.  Azure has also issued a deprecation notice for the Azure Log Analytics Agents; Microsoft Monitoring Agent and Log Analytics (OMS).  Azure Monitor Agent replaces these agents, introducing a simplified, flexible method of configuring collection configuration called Data Collection Rules. To leverage Azure Monitor Agent with their non-Azure servers, customers will need to onboard their machines to Azure Arc-enabled servers.",
          "link": "https://www.ansible.com/blog/migrate-to-azure-monitor-agent-on-azure-arc-using-red-hat-ansible-automation-platform",
          "publishedOn": "2022-09-26T13:00:00.000Z",
          "wordCount": 4424,
          "title": "Migrate to Azure Monitor Agent on Azure Arc using Red Hat Ansible Automation Platform",
          "imageUrl": "https://www.ansible.com/hubfs/azure%20arc%20blog.png"
        },
        {
          "id": "https://www.ansible.com/blog/why-event-driven-matters",
          "author": "nmartins@redhat.com (Nuno Martins)",
          "description": "Life comes down to moments. These events are often how we define our achievements, successes, and failures throughout life. Just like our daily lives, IT organizations and teams can also have these defining moments, where you will often hear phrases like the \"great database crash of '98.\" Many of these memorable IT  moments occur from limiting ourselves to a reactive approach when it comes to managing our IT assets. This is where event-driven automation can help us move from reactive to proactive IT management – well before we have the next great issue or moment in our IT teams.",
          "link": "https://www.ansible.com/blog/why-event-driven-matters",
          "publishedOn": "2022-09-21T13:00:00.000Z",
          "wordCount": 3202,
          "title": "Why Event-Driven Automation Matters",
          "imageUrl": "https://www.ansible.com/hubfs/Event%20driven%20automation%20blog.png"
        },
        {
          "id": "https://www.ansible.com/blog/how-network-engineers-can-get-more-sleep-using-red-hat-ansible-automation-platform-your-guide-to-ansiblefest-2022",
          "author": "Cindy Russell",
          "description": "Since connectivity is critical to all types of business applications including cloud apps, managing and maintaining the network often falls into the overnight hours. This is great for the business, but it puts a large wrinkle in your work-life balance. Luckily, AnsibleFest is here to help you get more sleep!",
          "link": "https://www.ansible.com/blog/how-network-engineers-can-get-more-sleep-using-red-hat-ansible-automation-platform-your-guide-to-ansiblefest-2022",
          "publishedOn": "2022-09-19T13:00:00.000Z",
          "wordCount": 3091,
          "title": "How network engineers can get more sleep using Red Hat Ansible Automation Platform: Your guide to AnsibleFest 2022",
          "imageUrl": "https://www.ansible.com/hubfs/Screen%20Shot%202022-09-07%20at%2011.09.29%20AM.png"
        },
        {
          "id": "https://www.ansible.com/blog/ansible-vs.-terraform-demystified",
          "author": "scavanau@redhat.com (Sean Cavanaugh)",
          "description": "Update \nCheck out the new article Ansible vs. Terraform, clarified on RedHat.com",
          "link": "https://www.ansible.com/blog/ansible-vs.-terraform-demystified",
          "publishedOn": "2022-09-13T12:30:00.000Z",
          "wordCount": 5283,
          "title": "Ansible vs. Terraform Demystified",
          "imageUrl": "https://www.ansible.com/hubfs/customer%20ref%20%284%29.png"
        },
        {
          "id": "https://www.ansible.com/blog/the-anatomy-of-automation-execution-environments",
          "author": "Anshul Behl",
          "description": "Red Hat Ansible Automation Platform 2 introduced  major architectural changes, like automation mesh and automation execution environments, that help extend Ansible automation across your organization in a flexible manner, providing a single solution to all your organizational and hybrid cloud automation needs.",
          "link": "https://www.ansible.com/blog/the-anatomy-of-automation-execution-environments",
          "publishedOn": "2022-09-12T13:00:00.000Z",
          "wordCount": 4495,
          "title": "The anatomy of automation execution environments",
          "imageUrl": "https://www.ansible.com/hubfs/anatomy%20of%20EE%20blog.png"
        }
      ]
    },
    {
      "title": "Azure DevOps Blog",
      "feedUrl": "https://devblogs.microsoft.com/devops/feed/",
      "siteUrl": "https://devblogs.microsoft.com/devops/",
      "articles": [
        {
          "id": "https://devblogs.microsoft.com/devops/?p=65804",
          "author": "Dan Hellem",
          "description": "Sprint 211 was a busy one. We were able to complete a lot of bugs and yet introduce some new exciting features. We also enabled a “Try the New Boards Hub” banner and popup to the legacy boards experience on select organizations.\nThe post New Boards Hub, Sprint 211 Update appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/new-boards-hub-sprint-211-update/",
          "publishedOn": "2022-10-07T14:28:43.000Z",
          "wordCount": 4831,
          "title": "New Boards Hub, Sprint 211 Update",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/10/boards-211-feature1.gif"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=65737",
          "author": "Dan Hellem",
          "description": "We spent most of sprint 210 focusing on accessibility issues and bug fixes. Here is a list of the items that have been resolved.\nIssue\nUnable to create a branch from card\nThe post New Boards Hub, Sprint 210 Update appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/new-boards-hub-sprint-210-update/",
          "publishedOn": "2022-09-15T17:35:54.000Z",
          "wordCount": 4610,
          "title": "New Boards Hub, Sprint 210 Update",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2018/08/vstsfeature.png"
        }
      ]
    },
    {
      "title": "Discover Dev",
      "feedUrl": "https://www.discoverdev.io/rss.xml",
      "siteUrl": "http://discoverdev.io",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "http://feeds.feedburner.com/AmazonWebServicesBlog",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "4ed417884c91622d902ab22f2b9f806063ec1a09",
          "author": "Jeff Barr",
          "description": "In late 2019 I told you about the AWS Local Zone in Los Angeles, California. In that post I described Local Zones as a new type of AWS infrastructure deployment that brings select AWS services very close to a particular geographic area. A year after that launch, I announced our plans to add 3 more […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-local-zones-expansion-taipei-and-delhi/",
          "publishedOn": "2022-10-05T21:30:38.000Z",
          "wordCount": 1331,
          "title": "AWS Local Zones Expansion: Taipei and Delhi",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/10/04/Site-Merch_AWS-Local-Zones_Blog.png"
        },
        {
          "id": "b52baf93c46bb68d0030598dd7ae15d1a9913d72",
          "author": "Veliswa Boya",
          "description": "In June 2022 AWS announced a preview of Amazon Connect Cases, a feature of Amazon Connect that simplifies these customer interactions and reduces the average handle times of issues. Today I am excited to announce the general availability of Amazon Connect Cases. Cases, a feature of Amazon Connect, makes it easy for your contact center […]",
          "link": "https://aws.amazon.com/blogs/aws/announcing-general-availability-of-amazon-connect-cases/",
          "publishedOn": "2022-10-03T20:41:27.000Z",
          "wordCount": 1258,
          "title": "Announcing General Availability of Amazon Connect Cases",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/10/03/Site-Merch_Amazon-Connect-Keystone-Gardner_Blog.png"
        },
        {
          "id": "ae5d0488bf0646507a69e9e761f48098a248df55",
          "author": "Danilo Poccia",
          "description": "This post is part of our Week in Review series. Check back each week for a quick roundup of interesting news and announcements from AWS! A new week and a new month just started. Curious which were the most significant AWS news from the previous seven days? I got you covered with this post. Last […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-october-3-2022/",
          "publishedOn": "2022-10-03T18:32:35.000Z",
          "wordCount": 1281,
          "title": "AWS Week in Review – October 3, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/10/03/AWS-WIR-10.3.22.png"
        },
        {
          "id": "732ba82c2e85ba6a2394bf8a29ee95a5e73a4c90",
          "author": "Antje Barth",
          "description": "Artificial intelligence (AI) is all around us. AI sends certain emails to our spam folders. It powers autocorrect, which helps us fix typos when we text. And now we can use it to solve business problems. In business, data-driven insights have become increasingly valuable. These insights are often discovered with the help of machine learning […]",
          "link": "https://aws.amazon.com/blogs/aws/new-hands-on-course-for-business-analysts-practical-decision-making-using-no-code-ml-on-aws/",
          "publishedOn": "2022-10-03T16:26:34.000Z",
          "wordCount": 1830,
          "title": "New Hands-On Course for Business Analysts – Practical Decision Making using No-Code ML on AWS",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/27/Amazon-SageMaker-Canvas_Blog.png"
        },
        {
          "id": "5ab6ca4c7fbca6e707e93106cb015a859442a687",
          "author": "Sébastien Stormacq",
          "description": "I am pleased to announce today the availability of Amazon File Cache, a new high-speed cache service on AWS designed for processing file data stored in disparate locations—including on premises. File Cache accelerates and simplifies your most demanding cloud bursting and hybrid workflows by giving your applications access to files using a fast and familiar […]",
          "link": "https://aws.amazon.com/blogs/aws/amazon-file-cache-a-high-performance-cache-on-aws-for-your-on-premises-file-systems/",
          "publishedOn": "2022-09-30T14:56:40.000Z",
          "wordCount": 2218,
          "title": "Amazon File Cache – A High Performance Cache On AWS For Your On-Premises File Systems",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/29/Site-Merch_Amazon-File-Cache_Blog.png"
        },
        {
          "id": "f345653beefe2e326410b05edcca8bc0fdf98a41",
          "author": "Sébastien Stormacq",
          "description": "At AWS, we love to give our customers choices: the choice of infrastructure to deploy your workloads, to store your most important data, or the operating systems for your virtual desktops. Many of you choose Amazon Workspaces to provision and distribute virtual desktops securely and at scale to your workforce. Our customers choose Workspaces when […]",
          "link": "https://aws.amazon.com/blogs/aws/amazon-workspaces-introduces-ubuntu-desktops/",
          "publishedOn": "2022-09-29T16:48:05.000Z",
          "wordCount": 1596,
          "title": "Amazon WorkSpaces Introduces Ubuntu Desktops",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/29/Site-Merch_Ubuntu-Desktop-for-Workspaces_Blog-1.png"
        },
        {
          "id": "852c2e070c6cea86911d87c790881d8de55886cb",
          "author": "Channy Yun",
          "description": "Today we announce the general availability of AWS IoT FleetWise, a fully managed AWS service that makes it easier to collect, transform, and transfer vehicle data to the cloud. Last AWS re:Invent 2021, we previewed AWS IoT FleetWise, heard customer feedback, and improved features for various use cases of near-real-time vehicle data processing. With AWS […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-iot-fleetwise-now-generally-available-easily-collect-vehicle-data-and-send-to-the-cloud/",
          "publishedOn": "2022-09-27T16:54:48.000Z",
          "wordCount": 2460,
          "title": "AWS IoT FleetWise Now Generally Available – Easily Collect Vehicle Data and Send to the Cloud",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/22/Site-Merch_AWS-IoT-FleetWise_Blog.png"
        },
        {
          "id": "7ba7c22c89a95d2ced12a3220867b6146d0a2db5",
          "author": "Sébastien Stormacq",
          "description": "It looks like my travel schedule is coupled with this Week In Review series of blog posts. This week, I am traveling to Fort-de-France in the French Caribbean islands to meet our customers and partners. I enjoy the travel time when I am offline. It gives me the opportunity to reflect on the past or […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-september-26-2022/",
          "publishedOn": "2022-09-26T23:21:36.000Z",
          "wordCount": 1699,
          "title": "AWS Week In Review — September 26, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/24/AWS-WIR-9.26.22.png"
        },
        {
          "id": "44f16a5754d845987d5a9cddff8e927e1897ca2b",
          "author": "Sébastien Stormacq",
          "description": "I am pleased to announce the availability of local clusters for Amazon Elastic Kubernetes Service (Amazon EKS) on AWS Outposts. It means that starting today, you can deploy your Amazon EKS cluster entirely on Outposts: both the Kubernetes control plane and the nodes. Amazon EKS is a managed Kubernetes service that makes it easy for […]",
          "link": "https://aws.amazon.com/blogs/aws/deploy-your-amazon-eks-clusters-locally-on-aws-outposts/",
          "publishedOn": "2022-09-20T16:05:47.000Z",
          "wordCount": 2133,
          "title": "Deploy your Amazon EKS Clusters Locally on AWS Outposts",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/13/Site-Merch_Amazon-Elastic-Kubernetes-Service_EKS-on-Outposts_Blog.png"
        },
        {
          "id": "c87835feafb2eecd408bc548fd91e06e13509083",
          "author": "Jeff Barr",
          "description": "Things are heating up in Seattle, with preparation for AWS re:Invent 2022 well underway. Later this month the entire News Blog team will participate in our now-legendary “speed storming” event. Over the course of three or four days, each of the AWS service teams with a launch in the works for re:Invent will give us […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-september-19-2022/",
          "publishedOn": "2022-09-19T19:13:12.000Z",
          "wordCount": 1795,
          "title": "AWS Week in Review – September 19, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/19/AWS-WIR-9.19.22.png"
        },
        {
          "id": "6d089016af02ca1b0fdb9d5d59d86f2aae0f62a3",
          "author": "Steve Roberts",
          "description": "Today, we announced direct VPC routing for AWS Outposts rack. This enables you to connect Outposts racks and on-premises networks using simplified IP address management. Direct VPC routing automatically advertises Amazon Virtual Private Cloud (Amazon VPC) subnet CIDR addresses to on-premises networks. This enables you to use the private IP addresses of resources in your […]",
          "link": "https://aws.amazon.com/blogs/aws/new-direct-vpc-routing-between-on-premises-networks-and-aws-outposts-rack/",
          "publishedOn": "2022-09-14T22:03:53.000Z",
          "wordCount": 1281,
          "title": "New – Direct VPC Routing Between On-Premises Networks and AWS Outposts Rack",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/827bfc458708f0b442009c9c9836f7e4b65557fb/2020/06/03/Blog-Post_thumbnail.png"
        },
        {
          "id": "e12120d49afe56b0cb9f9b01c88fc4cb655ae305",
          "author": "Sébastien Stormacq",
          "description": "I am working from London, UK, this week to record sessions for the upcoming Innovate EMEA online conference—more about this in a future Week In Review. While I was crossing the channel, I took the time to review what happened on AWS last week. Last Week’s Launches Here are some launches that got my attention: […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-september-12-2022/",
          "publishedOn": "2022-09-12T23:07:28.000Z",
          "wordCount": 1320,
          "title": "AWS Week In Review – September 12, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/09/AWS-WIR-9.12.22.png"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/atom.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2682/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/easy_or_hard.png\" title=\"&quot;Friction-driven static electrification is familiar and fundamental in daily life, industry, and technology, but its basics have long been unknown and have continually perplexed scientists from ancient Greece to the high-tech era. [...] To date, no single theory can satisfactorily explain this mysterious but fundamental phenomenon.&quot; --Eui-Cheol Shin et. al. (2022)\" alt=\"&quot;Friction-driven static electrification is familiar and fundamental in daily life, industry, and technology, but its basics have long been unknown and have continually perplexed scientists from ancient Greece to the high-tech era. [...] To date, no single theory can satisfactorily explain this mysterious but fundamental phenomenon.&quot; --Eui-Cheol Shin et. al. (2022)\" />",
          "link": "https://xkcd.com/2682/",
          "publishedOn": "2022-10-07T00:00:00.000Z",
          "wordCount": 234,
          "title": "Easy or Hard",
          "imageUrl": "https://imgs.xkcd.com/comics/easy_or_hard_2x.png"
        },
        {
          "id": "https://xkcd.com/2681/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/archimedes_principle.png\" title=\"&quot;I've always wanted to run naked through town, but I don't want to get in trouble with the king or be remembered by history as a weirdo. I wonder how I could ... EUREKA!&quot;\" alt=\"&quot;I've always wanted to run naked through town, but I don't want to get in trouble with the king or be remembered by history as a weirdo. I wonder how I could ... EUREKA!&quot;\" />",
          "link": "https://xkcd.com/2681/",
          "publishedOn": "2022-10-05T00:00:00.000Z",
          "wordCount": 232,
          "title": "Archimedes Principle",
          "imageUrl": "https://imgs.xkcd.com/comics/archimedes_principle_2x.png"
        },
        {
          "id": "https://xkcd.com/2680/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/battery_life.png\" title=\"It's okay, I'm at 10%, so I'm good for another month or two.\" alt=\"It's okay, I'm at 10%, so I'm good for another month or two.\" />",
          "link": "https://xkcd.com/2680/",
          "publishedOn": "2022-10-03T00:00:00.000Z",
          "wordCount": 232,
          "title": "Battery Life",
          "imageUrl": "https://imgs.xkcd.com/comics/battery_life_2x.png"
        },
        {
          "id": "https://xkcd.com/2679/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/quantified_self.png\" title=\"It's made me way more excited about ferris wheels, subways, car washes, waterslides, and store entrances that have double doors with a divider in the middle.\" alt=\"It's made me way more excited about ferris wheels, subways, car washes, waterslides, and store entrances that have double doors with a divider in the middle.\" />",
          "link": "https://xkcd.com/2679/",
          "publishedOn": "2022-09-30T00:00:00.000Z",
          "wordCount": 232,
          "title": "Quantified Self",
          "imageUrl": "https://imgs.xkcd.com/comics/quantified_self_2x.png"
        }
      ]
    },
    {
      "title": "Camunda",
      "feedUrl": "https://camunda.com/feed/",
      "siteUrl": "https://camunda.com/",
      "articles": [
        {
          "id": "https://camunda.com/?p=64132",
          "author": "Niall Deehan",
          "description": "What is FEEL As a part of the Decision Model and Notation (DMN) specification, the OMG also defined the Friendly Enough Expression Language (FEEL).  Since DMN is intended to be used by designers and business analysts who would like to build decision tables, FEEL needed to be designed as an uncomplicated and human-readable expression language that would help readers understand the logic being described or executed by the DMN table.  Expression languages are typically used by developers to evaluate data to produce a result based on query parameters or conditions. This means it’s syntactically closer to code than human-readable sentences. Since one of the goals of FEEL is to be “process analyst friendly,” it prioritizes readability more than other expression...\nThe post Using FEEL with Camunda 8 appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/09/using-feel-with-camunda-8/",
          "publishedOn": "2022-09-30T16:53:40.000Z",
          "wordCount": 4140,
          "title": "Using FEEL with Camunda 8",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/09/Camunda_using-FEEL-C8_blog-ftd-image_1200x630.png"
        },
        {
          "id": "https://camunda.com/?p=63983",
          "author": "Bernd Ruecker",
          "description": "Scaling process automation across an enterprise naturally includes a wide array of challenges. To counter these challenges, more and more organizations are evolving their organizational structures accordingly, often creating Centers of Excellence (CoE) and/or communities of practice (CoP). Please note that during this post we will use the term CoE, but keep in mind your organization might call this very differently. That said, in Camunda Platform 8, we included new functionalities that will help companies to scale process automation successfully.  This blog post discusses different aspects of scaling process automation, the role of CoEs, and how new Camunda 8 features support those initiatives.  What does scaling mean? Organizations that want to create a competitive edge through digital transformation (and frankly: which...\nThe post How Camunda 8 supports process automation at enterprise scale appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/09/how-camunda-8-supports-process-automation-at-enterprise-scale/",
          "publishedOn": "2022-09-29T19:30:00.000Z",
          "wordCount": 3879,
          "title": "How Camunda 8 supports process automation at enterprise scale",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/09/Camund_Blog_Process-Automation-at-Enterprise-Scale_1200x630-1.png"
        },
        {
          "id": "https://camunda.com/?p=63832",
          "author": "Josh Wulf",
          "description": "Microservices are an architectural style that structures an application as a collection of services that are: Highly maintainable and testable Loosely coupled Independently deployable Organized around business capabilities Owned by a small team Conway’s Law states that “any organization that designs a system (defined broadly) will produce a design whose structure is a copy of the organization’s communication structure”. If your organization has multiple teams working on different parts of a larger system, then microservices can serve as a separation of concerns that map an independent, encapsulated service to a specific team. These teams have clear boundaries of responsibility and can deploy on their own schedule. These factors lend themselves to a polyglot approach. What this means is that because...\nThe post 7 Best Programming Languages for Microservices appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/09/seven-best-programming-languages-for-microservices/",
          "publishedOn": "2022-09-29T13:30:00.000Z",
          "wordCount": 5111,
          "title": "7 Best Programming Languages for Microservices",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/09/Camunda_Blog_7-Best-Programming-Languages-Microservices_1200x630-1.png"
        },
        {
          "id": "https://camunda.com/?p=63238",
          "author": "Christopher Zell",
          "description": "During Summer Hackdays 2022, I worked on a project called “Zeebe chaos” (zbchaos), a fault injection command-line interface (CLI) tool. This allows us engineers to more easily run chaos experiments against Zeebe, build up confidence in the system’s capabilities, and discover potential weaknesses. Requirements To understand this blog post, it is useful to have a certain understanding of Kubernetes and Zeebe itself. Summer Hackdays: Hackdays are a regular event at Camunda, where people from different departments (engineering, consulting, DevRel, etc.) work together on new ideas, pet projects, and more. Check out previous Summer Hackdays here: Summer Hackdays 2020 Summer Hackdays 2019 Zeebe chaos CLI Working on the Zeebe project is not only about engineering a distributed system or a process...\nThe post Zbchaos — A new fault injection tool for Zeebe appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/09/zbchaos-a-new-fault-injection-tool-for-zeebe/",
          "publishedOn": "2022-09-27T18:00:00.000Z",
          "wordCount": 3683,
          "title": "Zbchaos — A new fault injection tool for Zeebe",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/09/Camunda_blog-ftd-image_2022_zbchaos_1200x630-1.png"
        },
        {
          "id": "https://camunda.com/?p=63178",
          "author": "Jakob Freund",
          "description": "The API economy is taking off, propelled by an explosion of activity across API tools and platforms. According to a 2021 report from Postman, developers reported spending nearly half of their time working on APIs, and 94% of companies planned to increase their investments in APIs in 2022. API-first development is also gaining traction, with an impressive 67% of companies embracing this methodology. Companies like Twilio and Stripe emerged as early winners in this new economy, with the promise of many more to come.  APIs offer organizations an opportunity to tap into best-of-breed software components without having to spend precious time or development resources creating them from scratch. With that said, an often-overlooked aspect of the API economy is how...\nThe post Could Process Orchestration be the “Glue” for the API Economy? appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/09/process-orchestration-api-econom/",
          "publishedOn": "2022-09-23T14:00:00.000Z",
          "wordCount": 2760,
          "title": "Could Process Orchestration be the “Glue” for the API Economy?",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/09/Glue.png"
        },
        {
          "id": "https://camunda.com/?p=63034",
          "author": "Shane Ernest",
          "description": "FEEL (Friendly Enough Expression Language) was created by the Object Management Group (OMG) “as part of the DMN standard”. Its goal is to be easy to understand, and at the same time, be full-featured enough to handle decision tables and literal expressions. When business and IT often work together on complex projects, writing expressions in a (relatively) accessible way reduces miscommunications and helps align teams. Camunda uses FEEL to map and transform business process data dynamically. For example, a loan application process pulls a credit score from an API call into a decision table. The decision table automates the next step of the process depending on the rules in the table. The data from the decision automation can then be...\nThe post FEEL more confident transforming data appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/09/feel-more-confident-transforming-data/",
          "publishedOn": "2022-09-22T14:00:00.000Z",
          "wordCount": 2644,
          "title": "FEEL more confident transforming data",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/09/Feel_Header-1024x589.gif"
        },
        {
          "id": "https://camunda.com/?p=62440",
          "author": "Luca Buchholz",
          "description": "Since the first day I joined Camunda (which is already over four years ago – time really does fly when you are having fun), I was amazed at how many dedicated, passionate, and invested Camunda Community members there are. Numerous times, I have met individuals who spoke with such excitement about Camunda’s technologies and what the community means to them, that you had to believe it even if you would have never heard of Camunda before. Not only are Camunda Community members passionate about the products, many also actively contribute and give back to the community in several ways. Just to name a few examples: they contribute code and help improve Camunda products, organize meetups, answer questions from fellow users...\nThe post Are you the next Camunda Champion? appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/09/are-you-the-next-camunda-champion/",
          "publishedOn": "2022-09-20T09:48:00.000Z",
          "wordCount": 2594,
          "title": "Are you the next Camunda Champion?",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/09/Camunda-Champion-Program-Cohort_featured-blog-image_1200x630.png"
        },
        {
          "id": "https://camunda.com/?p=62079",
          "author": "Nele Uhlemann",
          "description": "There are multiple angles to look at workflows one of which is patterns. The Workflow Patterns initiative differentiates between control, data, and resource perspectives. They are not just focusing on the modeling language as such but have workflow systems in mind too. It’s valuable to have a closer look at those patterns and discuss which parts of it can be shown and even automated in BPMN, and which parts are taken care of in the technical implementation. I have seen BPMN diagrams that try to include every aspect in the diagram itself. This often leads to overloaded BPMN models with a lack of clear transparency of the business flow. Therefore, it is important to focus on all aspects of workflow...\nThe post Workflow diagram and pattern examples using BPMN models appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/09/workflow-diagram-and-pattern-examples-using-bpmn-models/",
          "publishedOn": "2022-09-16T09:00:00.000Z",
          "wordCount": 4492,
          "title": "Workflow diagram and pattern examples using BPMN models",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/09/workflow-diagram-pattern-examples-BPMN-models_Camunda_2022_Blog-featured-image_1200x630.png"
        },
        {
          "id": "https://camunda.com/?p=62651",
          "author": "Andrea Davis",
          "description": "Our annual process orchestration conference, CamundaCon, is back this October 5-6 with a new hybrid format. Join us online from the comfort of your desk or meet us in person in Berlin, Germany. No matter how you CamundaCon, it will be a fun and insightful event! This year’s agenda is jam-packed with an all-star line-up of experts who will share their experience automating, orchestrating, and improving core business processes. You’ll hear real-world use cases and best practices from companies across all industries that have found innovative ways to deliver better customer experiences through orchestration. Here’s a sneak peek at a few of the sessions you won’t want to miss: Navdeep Singh of Walmart will share how they manage customer experiences...\nThe post CamundaCon 2022 preview – A conference for all things process orchestration appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/09/camunda-con-2022-preview/",
          "publishedOn": "2022-09-15T21:43:37.000Z",
          "wordCount": 2411,
          "title": "CamundaCon 2022 preview – A conference for all things process orchestration",
          "enclosure": {
            "url": "https://www.camundacon.com/wp-content/uploads/2022/09/CCon_2022_Agenda-Announcement_30-seconds_September-update_Social.mp4",
            "length": "4884178",
            "type": "video/mp4"
          },
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/09/2022_CamundaCon_Web-Preview_Featured-Image_Home_Register-Now-1024x536-1.png"
        },
        {
          "id": "https://camunda.com/?p=62542",
          "author": "Annie Talvasto",
          "description": "We’re excited to announce new regions for Camunda Platform 8 SaaS that further strengthen the resilience, performance, and data requirements for our SaaS customers. Enterprise customers can now choose to create their clusters in a number of regions including Europe West, US Central, US East, and the most recent addition, Australia South East. This provides multiple benefits, such as increasing availability, allowing to set up fail-safes, adhering to regulatory requirements for regional data storage, and reduced latency due to closer physical proximity. Resilience and redundancy in technology are important for all modern organizations and are top of mind for many. Across industries, organizations need a solution that scales effectively and is resilient to provide a good base for process orchestration....\nThe post Increase your resilience with new regions in Camunda Platform 8 SaaS appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/09/increase-your-resilience-with-new-regions-in-camunda-platform-8-saas/",
          "publishedOn": "2022-09-15T11:00:00.000Z",
          "wordCount": 2588,
          "title": "Increase your resilience with new regions in Camunda Platform 8 SaaS",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/09/Screen-Shot-2022-09-14-at-12.42.06-PM.png"
        }
      ]
    },
    {
      "title": "となりのヤングジャンプ（ワンパンマン）",
      "feedUrl": "https://tonarinoyj.jp/rss/series/13932016480028984490",
      "siteUrl": "https://tonarinoyj.jp/episode/13932016480028985383",
      "articles": [
        {
          "id": "tonarino_yj:episode:316112896867289136",
          "author": "原作/ＯＮＥ/漫画/村田雄介",
          "description": "ワンパンマン",
          "link": "https://tonarinoyj.jp/episode/316112896867289136",
          "publishedOn": "2022-09-21T15:00:00.000Z",
          "wordCount": 211,
          "title": "[第216話] ワンパンマン",
          "enclosure": {
            "url": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/316112896867289136-ec72dd1edd1d2bc1dd7149719034eb96",
            "length": "0",
            "type": "image/jpeg"
          },
          "imageUrl": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/316112896867289136-ec72dd1edd1d2bc1dd7149719034eb96"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.com/blog/all.atom",
      "siteUrl": "https://github.blog/",
      "articles": [
        {
          "id": "https://github.blog/2022-10-06-developers-are-now-included-in-the-wipo-global-innovation-index/",
          "author": null,
          "description": "We’re excited that the World Intellectual Property Organization (WIPO) has launched the 2022 edition of its Global Innovation Index (GII) with an indicator of developer creative outputs based on GitHub commits.",
          "link": "https://github.blog/2022-10-06-developers-are-now-included-in-the-wipo-global-innovation-index/",
          "publishedOn": "2022-10-06T21:00:36.000Z",
          "wordCount": 1033,
          "title": "Developers are now included in the WIPO Global Innovation Index",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/10/global_innovation_index_2022_1200.jpeg?fit=1200%2C630"
        },
        {
          "id": "https://github.blog/2022-10-06-githubs-supply-chain-security-features-now-support-dart/",
          "author": null,
          "description": "Cross-platform apps built with the popular Flutter toolkit can now benefit from Dependabot alerts.",
          "link": "https://github.blog/2022-10-06-githubs-supply-chain-security-features-now-support-dart/",
          "publishedOn": "2022-10-06T18:00:44.000Z",
          "wordCount": 1268,
          "title": "GitHub’s supply chain security features now support Dart",
          "imageUrl": "https://github.blog/wp-content/uploads/2021/12/github-security_orange-banner.png"
        },
        {
          "id": "https://github.blog/2022-10-06-js13k-2022-winners/",
          "author": null,
          "description": "The eleventh annual js13kGames coding competition, challenging participants to create games in 13kB or less of JavaScript in a month, just wrapped up. This post highlights the top thirteen entries.",
          "link": "https://github.blog/2022-10-06-js13k-2022-winners/",
          "publishedOn": "2022-10-06T07:01:42.000Z",
          "wordCount": 1522,
          "title": "js13kGames 2022 winners 🏆",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/10/js13k.png"
        },
        {
          "id": "https://github.blog/2022-10-05-detect-secrets-in-your-code-more-accurately-with-dry-runs-for-custom-patterns/",
          "author": null,
          "description": "Learn how you can seamlessly define trusted custom secret patterns to detect secrets unique to your organization with GitHub Advanced Security.",
          "link": "https://github.blog/2022-10-05-detect-secrets-in-your-code-more-accurately-with-dry-runs-for-custom-patterns/",
          "publishedOn": "2022-10-05T18:00:51.000Z",
          "wordCount": 1417,
          "title": "Detect secrets in your code more accurately with dry runs for custom patterns now available in GitHub Advanced Security",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/08/Security-Product@2x.png"
        },
        {
          "id": "https://github.blog/2022-10-05-github-availability-report-september-2022/",
          "author": null,
          "description": "In September, we experienced one incident that resulted in degraded performance across GitHub services. We also experienced one incident resulting in significant impact to Codespaces. We are still investigating that incident and will include it in next month’s report. This report also sheds light into an incident that impacted Codespaces in August and an incident that impacted Actions in August.",
          "link": "https://github.blog/2022-10-05-github-availability-report-september-2022/",
          "publishedOn": "2022-10-05T16:00:34.000Z",
          "wordCount": 1722,
          "title": "GitHub Availability Report: September 2022",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/03/Engineering-Product@2x-1.png?fit=2400%2C1260"
        },
        {
          "id": "https://github.blog/2022-10-05-working-on-a-creative-project-unleash-your-originality-and-start-to-tinker-with-the-aspiring-creatives-experience/",
          "author": null,
          "description": "Develop your design and collaboration skills to get your clever intentions off the ground.",
          "link": "https://github.blog/2022-10-05-working-on-a-creative-project-unleash-your-originality-and-start-to-tinker-with-the-aspiring-creatives-experience/",
          "publishedOn": "2022-10-05T15:00:22.000Z",
          "wordCount": 1020,
          "title": "Working on a creative project? Unleash your originality and start to tinker with the Aspiring Creatives Experience",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/10/aspiringcreatives-header.png"
        },
        {
          "id": "https://github.blog/2022-10-05-two-ways-you-can-experience-github-universe/",
          "author": null,
          "description": "GitHub Universe is back and more robust than ever, with two great ways to engage with everything this global developer event has to offer.",
          "link": "https://github.blog/2022-10-05-two-ways-you-can-experience-github-universe/",
          "publishedOn": "2022-10-05T13:01:44.000Z",
          "wordCount": 1744,
          "title": "Two ways you can experience GitHub Universe",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/08/Universe-Blog-1-Header.jpg"
        },
        {
          "id": "https://github.blog/2022-10-04-expand-your-open-source-contributions-during-hacktoberfest-2022/",
          "author": null,
          "description": "Give back to open source projects during the month of October! This year, we’re encouraging more than code contributions: writing, design, advocacy, and financial donations.",
          "link": "https://github.blog/2022-10-04-expand-your-open-source-contributions-during-hacktoberfest-2022/",
          "publishedOn": "2022-10-04T12:00:20.000Z",
          "wordCount": 1016,
          "title": "Expand your open source contributions during Hacktoberfest 2022",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/10/hacktoberfestbanner.jpeg?fit=1200%2C630"
        },
        {
          "id": "https://github.blog/2022-10-03-highlights-from-git-2-38/",
          "author": null,
          "description": "Another new release of Git is here! Take a look at some of our highlights on what's new in Git 2.38.",
          "link": "https://github.blog/2022-10-03-highlights-from-git-2-38/",
          "publishedOn": "2022-10-03T18:01:04.000Z",
          "wordCount": 3060,
          "title": "Highlights from Git 2.38",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/09/git238-header.png"
        },
        {
          "id": "https://github.blog/2022-09-29-github-supports-internet-freedom-and-global-availability-in-iran/",
          "author": null,
          "description": "Access to the open internet is essential to defending human rights, and developers have an important role in promoting freedom of expression and transparency. GitHub is committed to keeping Iranians connected to the global developer community.",
          "link": "https://github.blog/2022-09-29-github-supports-internet-freedom-and-global-availability-in-iran/",
          "publishedOn": "2022-09-29T19:11:29.000Z",
          "wordCount": 1356,
          "title": "GitHub supports internet freedom and global availability in Iran",
          "imageUrl": "https://github.blog/wp-content/uploads/2021/11/GitHub-Policy-blog-banner.png"
        }
      ]
    },
    {
      "title": "Martin Kleppmann's blog",
      "feedUrl": "https://feeds.feedburner.com/martinkl",
      "siteUrl": "http://martin.kleppmann.com/",
      "articles": []
    },
    {
      "title": "Kubernetes – Production-Grade Container Orchestration",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": [
        {
          "id": "https://kubernetes.io/blog/2022/10/05/current-state-2019-third-party-audit/",
          "author": null,
          "description": "Authors (in alphabetical order): Cailyn Edwards (Shopify), Pushkar Joglekar (VMware), Rey Lejano (SUSE) and Rory McCune (DataDog)\nWe expect the brand new Third Party Security Audit of Kubernetes will be\npublished later this month (Oct 2022).\nIn preparation for that, let's look at the state of findings that were made\npublic as part of the last third party security audit of\n2019\nthat was based on Kubernetes v1.13.4.\nMotivation\nCraig Ingram has graciously attempted over the years to keep track of the\nstatus of the findings reported in the last audit in this issue:\nkubernetes/kubernetes#81146.\nThis blog post will attempt to dive deeper into this, address any gaps\nin tracking and become a point in time summary of the state of the\nfindings reported from 2019.\nThis article should also help reader…",
          "link": "https://kubernetes.io/blog/2022/10/05/current-state-2019-third-party-audit/",
          "publishedOn": "2022-10-05T00:00:00.000Z",
          "wordCount": 3934,
          "title": "Blog: Current State: 2019 Third Party Security Audit of Kubernetes",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/10/04/introducing-kueue/",
          "author": null,
          "description": "Authors: Abdullah Gharaibeh (Google), Aldo Culquicondor (Google)\nWhether on-premises or in the cloud, clusters face real constraints for resource usage, quota, and cost management reasons. Regardless of the autoscalling capabilities, clusters have finite capacity. As a result, users want an easy way to fairly and\nefficiently share resources.\nIn this article, we introduce Kueue,\nan open source job queueing controller designed to manage batch jobs as a single unit.\nKueue leaves pod-level orchestration to existing stable components of Kubernetes.\nKueue natively supports the Kubernetes Job\nAPI and offers hooks for integrating other custom-built APIs for batch jobs.\nWhy Kueue?\nJob queueing is a key feature to run batch workloads at scale in both on-premises and cloud environments. The main goal…",
          "link": "https://kubernetes.io/blog/2022/10/04/introducing-kueue/",
          "publishedOn": "2022-10-04T00:00:00.000Z",
          "wordCount": 4487,
          "title": "Blog: Introducing Kueue",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/10/03/userns-alpha/",
          "author": null,
          "description": "Authors: Rodrigo Campos (Microsoft), Giuseppe Scrivano (Red Hat)\nKubernetes v1.25 introduces the support for user namespaces.\nThis is a major improvement for running secure workloads in\nKubernetes. Each pod will have access only to a limited subset of the\navailable UIDs and GIDs on the system, thus adding a new security\nlayer to protect from other pods running on the same system.\nHow does it work?\nA process running on Linux can use up to 4294967296 different UIDs and\nGIDs.\nUser namespaces is a Linux feature that allows mapping a set of users\nin the container to different users in the host, thus restricting what\nIDs a process can effectively use.\nFurthermore, the capabilities granted in a new user namespace do not\napply in the host initial namespaces.\nWhy is it important?\nThere are mainly t…",
          "link": "https://kubernetes.io/blog/2022/10/03/userns-alpha/",
          "publishedOn": "2022-10-03T00:00:00.000Z",
          "wordCount": 3356,
          "title": "Blog: Kubernetes 1.25: alpha support for running Pods with user namespaces",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/09/29/enforce-immutability-using-cel/",
          "author": null,
          "description": "Author: Alexander Zielenski (Google)\nImmutable fields can be found in a few places in the built-in Kubernetes types.\nFor example, you can't change the .metadata.name of an object. Specific objects\nhave fields where changes to existing objects are constrained; for example, the\n.spec.selector of a Deployment.\nAside from simple immutability, there are other common design patterns such as\nlists which are append-only, or a map with mutable values and immutable keys.\nUntil recently the best way to restrict field mutability for CustomResourceDefinitions\nhas been to create a validating\nadmission webhook:\nthis means a lot of complexity for the common case of making a field immutable.\nBeta since Kubernetes 1.25, CEL Validation Rules allow CRD authors to express\nvalidation constraints on their fields…",
          "link": "https://kubernetes.io/blog/2022/09/29/enforce-immutability-using-cel/",
          "publishedOn": "2022-09-29T00:00:00.000Z",
          "wordCount": 5307,
          "title": "Blog: Enforce CRD Immutability with CEL Transition Rules",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/09/26/storage-in-tree-to-csi-migration-status-update-1.25/",
          "author": null,
          "description": "Author: Jiawei Wang (Google)\nThe Kubernetes in-tree storage plugin to Container Storage Interface (CSI) migration infrastructure has already been beta since v1.17. CSI migration was introduced as alpha in Kubernetes v1.14.\nSince then, SIG Storage and other Kubernetes special interest groups are working to ensure feature stability and compatibility in preparation for CSI Migration feature to go GA.\nSIG Storage is excited to announce that the core CSI Migration feature is generally available in Kubernetes v1.25 release!\nSIG Storage wrote a blog post in v1.23 for CSI Migration status update which discussed the CSI migration status for each storage driver. It has been a while and this article is intended to give a latest status update on each storage driver for their CSI Migration status in Ku…",
          "link": "https://kubernetes.io/blog/2022/09/26/storage-in-tree-to-csi-migration-status-update-1.25/",
          "publishedOn": "2022-09-26T00:00:00.000Z",
          "wordCount": 4077,
          "title": "Blog: Kubernetes 1.25: Kubernetes In-Tree to CSI Volume Migration Status Update",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/09/23/crd-validation-rules-beta/",
          "author": null,
          "description": "Authors: Joe Betz (Google), Cici Huang (Google), Kermit Alexander (Google)\nIn Kubernetes 1.25, Validation rules for CustomResourceDefinitions (CRDs) have graduated to Beta!\nValidation rules make it possible to declare how custom resources are validated using the Common Expression Language (CEL). For example:\napiVersion: apiextensions.k8s.io/v1\nkind: CustomResourceDefinition\n ...\n openAPIV3Schema:\n type: object\n properties:\n spec:\n type: object\n x-kubernetes-validations:\n - rule: \"self.minReplicas <= self.replicas && self.replicas <= self.maxReplicas\"\n message: \"replicas should be in the range minReplicas..maxReplicas.\"\n properties:\n replicas:\n type: integer\n ...\n\n\nValidation rules support a wide range of use cases. To get a sense of some of the capabilities, let's look at a few examples:\nV…",
          "link": "https://kubernetes.io/blog/2022/09/23/crd-validation-rules-beta/",
          "publishedOn": "2022-09-23T00:00:00.000Z",
          "wordCount": 4323,
          "title": "Blog: Kubernetes 1.25: CustomResourceDefinition Validation Rules Graduate to Beta",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/09/21/kubernetes-1-25-use-secrets-while-expanding-csi-volumes-on-node-alpha/",
          "author": null,
          "description": "Author: Humble Chirammal (Red Hat), Louis Koo (deeproute.ai)\nKubernetes v1.25, released earlier this month, introduced a new feature\nthat lets your cluster expand storage volumes, even when access to those\nvolumes requires a secret (for example: a credential for accessing a SAN fabric)\nto perform node expand operation. This new behavior is in alpha and you\nmust enable a feature gate (CSINodeExpandSecret) to make use of it.\nYou must also be using CSI\nstorage; this change isn't relevant to storage drivers that are built in to Kubernetes.\nTo turn on this new, alpha feature, you enable the CSINodeExpandSecret feature\ngate for the kube-apiserver and kubelet, which turns on a mechanism to send secretRef\nconfiguration as part of NodeExpansion by the CSI drivers thus make use of\nthe same to perfor…",
          "link": "https://kubernetes.io/blog/2022/09/21/kubernetes-1-25-use-secrets-while-expanding-csi-volumes-on-node-alpha/",
          "publishedOn": "2022-09-21T00:00:00.000Z",
          "wordCount": 3976,
          "title": "Blog: Kubernetes 1.25: Use Secrets for Node-Driven Expansion of CSI Volumes",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/09/19/local-storage-capacity-isolation-ga/",
          "author": null,
          "description": "Author: Jing Xu (Google)\nLocal ephemeral storage capacity isolation was introduced as a alpha feature in Kubernetes 1.7 and it went beta in 1.9. With Kubernetes 1.25 we are excited to announce general availability(GA) of this feature.\nPods use ephemeral local storage for scratch space, caching, and logs. The lifetime of local ephemeral storage does not extend beyond the life of the individual pod. It is exposed to pods using the container’s writable layer, logs directory, and EmptyDir volumes. Before this feature was introduced, there were issues related to the lack of local storage accounting and isolation, such as Pods not knowing how much local storage is available and being unable to request guaranteed local storage. Local storage is a best-effort resource and pods can be evicted due t…",
          "link": "https://kubernetes.io/blog/2022/09/19/local-storage-capacity-isolation-ga/",
          "publishedOn": "2022-09-19T00:00:00.000Z",
          "wordCount": 3881,
          "title": "Blog: Kubernetes 1.25: Local Storage Capacity Isolation Reaches GA",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/09/15/app-rollout-features-reach-stable/",
          "author": null,
          "description": "Authors: Ravi Gudimetla (Apple), Filip Křepinský (Red Hat), Maciej Szulik (Red Hat)\nThis blog describes the two features namely minReadySeconds for StatefulSets and maxSurge for DaemonSets that SIG Apps is happy to graduate to stable in Kubernetes 1.25.\nSpecifying minReadySeconds slows down a rollout of a StatefulSet, when using a RollingUpdate value in .spec.updateStrategy field, by waiting for each pod for a desired time.\nThis time can be used for initializing the pod (e.g. warming up the cache) or as a delay before acknowledging the pod.\nmaxSurge allows a DaemonSet workload to run multiple instances of the same pod on a node during a rollout when using a RollingUpdate value in .spec.updateStrategy field.\nThis helps to minimize the downtime of the DaemonSet for consumers.\nThese features …",
          "link": "https://kubernetes.io/blog/2022/09/15/app-rollout-features-reach-stable/",
          "publishedOn": "2022-09-15T00:00:00.000Z",
          "wordCount": 3563,
          "title": "Blog: Kubernetes 1.25: Two Features for Apps Rollouts Graduate to Stable",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/09/14/pod-has-network-condition/",
          "author": null,
          "description": "Author:\nDeep Debroy (Apple)\nKubernetes 1.25 introduces Alpha support for a new kubelet-managed pod condition\nin the status field of a pod: PodHasNetwork. The kubelet, for a worker node,\nwill use the PodHasNetwork condition to accurately surface the initialization\nstate of a pod from the perspective of pod sandbox creation and network\nconfiguration by a container runtime (typically in coordination with CNI\nplugins). The kubelet starts to pull container images and start individual\ncontainers (including init containers) after the status of the PodHasNetwork\ncondition is set to \"True\". Metrics collection services that report latency of\npod initialization from a cluster infrastructural perspective (i.e. agnostic of\nper container characteristics like image size or payload) can utilize the\nPodHas…",
          "link": "https://kubernetes.io/blog/2022/09/14/pod-has-network-condition/",
          "publishedOn": "2022-09-14T00:00:00.000Z",
          "wordCount": 3729,
          "title": "Blog: Kubernetes 1.25: PodHasNetwork Condition for Pods",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/09/12/k8s-cve-feed-alpha/",
          "author": null,
          "description": "Author: Pushkar Joglekar (VMware)\nA long-standing request from the Kubernetes community has been to have a\nprogrammatic way for end users to keep track of Kubernetes security issues\n(also called \"CVEs\", after the database that tracks public security issues across\ndifferent products and vendors). Accompanying the release of Kubernetes v1.25,\nwe are excited to announce availability of such\na feed as an alpha\nfeature. This blog will cover the background and scope of this new service.\nMotivation\nWith the growing number of eyes on Kubernetes, the number of CVEs related to\nKubernetes have increased. Although most CVEs that directly, indirectly, or\ntransitively impact Kubernetes are regularly fixed, there is no single place for\nthe end users of Kubernetes to programmatically subscribe or pull the…",
          "link": "https://kubernetes.io/blog/2022/09/12/k8s-cve-feed-alpha/",
          "publishedOn": "2022-09-12T00:00:00.000Z",
          "wordCount": 3345,
          "title": "Blog: Announcing the Auto-refreshing Official Kubernetes CVE Feed",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/09/09/kms-v2-improvements/",
          "author": null,
          "description": "Authors: Anish Ramasekar, Rita Zhang, Mo Khan, and Xander Grzywinski (Microsoft)\nWith Kubernetes v1.25, SIG Auth is introducing a new v2alpha1 version of the Key Management Service (KMS) API. There are a lot of improvements in the works, and we're excited to be able to start down the path of a new and improved KMS!\nWhat is KMS?\nOne of the first things to consider when securing a Kubernetes cluster is encrypting persisted API data at rest. KMS provides an interface for a provider to utilize a key stored in an external key service to perform this encryption.\nEncryption at rest using KMS v1 has been a feature of Kubernetes since version v1.10, and is currently in beta as of version v1.12.\nWhat’s new in v2alpha1?\nWhile the original v1 implementation has been successful in helping Kubernetes us…",
          "link": "https://kubernetes.io/blog/2022/09/09/kms-v2-improvements/",
          "publishedOn": "2022-09-09T00:00:00.000Z",
          "wordCount": 3670,
          "title": "Blog: Kubernetes 1.25: KMS V2 Improvements",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "http://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/1abf249ba95f",
          "author": "Netflix Technology Blog",
          "description": "by Kostas Christidis",
          "link": "https://netflixtechblog.com/timestone-netflixs-high-throughput-low-latency-priority-queueing-system-with-built-in-support-1abf249ba95f?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-09-28T15:40:35.000Z",
          "wordCount": 5424,
          "title": "Timestone: Netflix’s High-Throughput, Low-Latency Priority Queueing System with Built-in Support…",
          "imageUrl": "https://miro.medium.com/focal/1200/632/46/46/1*JvNLSZmWCDB1WjDDUamU_g.png"
        }
      ]
    },
    {
      "title": "Google AI Blog",
      "feedUrl": "http://feeds.feedburner.com/blogspot/gJZg",
      "siteUrl": "http://ai.googleblog.com/",
      "articles": [
        {
          "id": "http://ai.googleblog.com/2022/10/audiolm-language-modeling-approach-to.html",
          "author": null,
          "description": "Posted by Zalán Borsos, Research Software Engineer, and Neil Zeghidour, Research Scientist, Google Research \nGenerating realistic audio requires modeling information represented at different scales. For example, just as music builds complex musical phrases from individual notes, speech combines temporally local structures, such as phonemes or syllables, into words and sentences. Creating well-structured and coherent audio sequences at all these scales is a challenge that has been addressed by coupling audio with transcriptions that can guide the generative process, be it text transcripts for speech synthesis or MIDI representations for piano. However, this approach breaks when trying to model untranscribed aspects of audio, such as speaker characteristics necessary to help people with spee…",
          "link": "http://ai.googleblog.com/2022/10/audiolm-language-modeling-approach-to.html",
          "publishedOn": "2022-10-06T20:05:00.000Z",
          "wordCount": 6844,
          "title": "AudioLM: a Language Modeling Approach to Audio Generation",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/10/large-motion-frame-interpolation.html",
          "author": null,
          "description": "Posted by Fitsum Reda and Janne Kontkanen, Google Research \nFrame interpolation is the process of synthesizing in-between images from a given set of images. The technique is often used for temporal up-sampling to increase the refresh rate of videos or to create slow motion effects. Nowadays, with digital cameras and smartphones, we often take several photos within a few seconds to capture the best picture. Interpolating between these “near-duplicate” photos can lead to engaging videos that reveal scene motion, often delivering an even more pleasing sense of the moment than the original photos.  \n  \nFrame interpolation between consecutive video frames, which often have small motion, has been studied extensively. Unlike videos, however, the temporal spacing between near-duplicate photos can …",
          "link": "http://ai.googleblog.com/2022/10/large-motion-frame-interpolation.html",
          "publishedOn": "2022-10-04T18:43:00.002Z",
          "wordCount": 7573,
          "title": "Large Motion Frame Interpolation",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/09/quantization-for-fast-and.html",
          "author": null,
          "description": "Posted by Srivatsan Krishnan, Student Researcher, and Aleksandra Faust, Senior Staff Research Scientist, Google Research, Brain Team   \nDeep reinforcement learning (RL) continues to make great strides in solving real-world sequential decision-making problems such as balloon navigation, nuclear physics, robotics, and games. Despite its promise, one of its limiting factors is long training times. While the current approach to speed up RL training on complex and difficult tasks leverages distributed training scaling up to hundreds or even thousands of computing nodes, it still requires the use of significant hardware resources which makes RL training expensive, while increasing its environmental impact. However, recent work [1, 2] indicates that performance optimizations on existing hardware …",
          "link": "http://ai.googleblog.com/2022/09/quantization-for-fast-and.html",
          "publishedOn": "2022-09-27T17:32:00.000Z",
          "wordCount": 6946,
          "title": "Quantization for Fast and Environmentally Sustainable Reinforcement Learning",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/09/tensorstore-for-high-performance.html",
          "author": null,
          "description": "Posted by Jeremy Maitin-Shepard and Laramie Leavitt, Software Engineers, Connectomics at Google\nMany exciting contemporary applications of computer science and machine learning (ML) manipulate multidimensional datasets that span a single large coordinate system, for example, weather modeling from atmospheric measurements over a spatial grid or medical imaging predictions from multi-channel image intensity values in a 2d or 3d scan. In these settings, even a single dataset may require terabytes or petabytes of data storage. Such datasets are also challenging to work with as users may read and write data at irregular intervals and varying scales, and are often interested in performing analyses using numerous machines working in parallel.  \nToday we are introducing TensorStore, an open-source…",
          "link": "http://ai.googleblog.com/2022/09/tensorstore-for-high-performance.html",
          "publishedOn": "2022-09-22T21:33:00.006Z",
          "wordCount": 7855,
          "title": "TensorStore for High-Performance, Scalable Array Storage",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/09/view-synthesis-with-transformers.html",
          "author": null,
          "description": "Posted by Carlos Esteves and Ameesh Makadia, Research Scientists, Google Research \nA long-standing problem in the intersection of computer vision and computer graphics, view synthesis is the task of creating new views of a scene from multiple pictures of that scene. This has received increased attention [1, 2, 3] since the introduction of neural radiance fields (NeRF). The problem is challenging because to accurately synthesize new views of a scene, a model needs to capture many types of information — its detailed 3D structure, materials, and illumination —  from a small set of reference images.  \nIn this post, we present recently published deep learning models for view synthesis. In “Light Field Neural Rendering” (LFNR), presented at CVPR 2022, we address the challenge of accurately repro…",
          "link": "http://ai.googleblog.com/2022/09/view-synthesis-with-transformers.html",
          "publishedOn": "2022-09-21T19:27:00.000Z",
          "wordCount": 7635,
          "title": "View Synthesis with Transformers",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/09/findit-generalized-object-localization.html",
          "author": null,
          "description": "Posted by Weicheng Kuo and Anelia Angelova, Research Scientists, Google Research, Brain Team  \nNatural language enables flexible descriptive queries about images. The interaction between text queries and images grounds linguistic meaning in the visual world, facilitating a better understanding of object relationships, human intentions towards objects, and interactions with the environment. The research community has studied object-level visual grounding through a range of tasks, including referring expression comprehension, text-based localization, and more broadly object detection, each of which require different skills in a model. For example, object detection seeks to find all objects from a predefined set of classes, which requires accurate localization and classification, while referr…",
          "link": "http://ai.googleblog.com/2022/09/findit-generalized-object-localization.html",
          "publishedOn": "2022-09-20T17:00:00.008Z",
          "wordCount": 7272,
          "title": "FindIt: Generalized Object Localization with Natural Language Queries",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/09/google-at-interspeech-2022.html",
          "author": null,
          "description": "Posted by Cat Armato, Program Manager, Google \nThis week, the 23rd Annual Conference of the International Speech Communication Association (INTERSPEECH 2022) is being held in Incheon, South Korea, representing one of the world’s most extensive conferences on research and technology of spoken language understanding and processing. Over 2,000 experts in speech-related research fields gather to take part in oral presentations and poster sessions and to collaborate with streamed events across the globe. \nWe are excited to be a Diamond Sponsor of INTERSPEECH 2022, where we will be showcasing nearly 50 research publications and supporting a number of workshops, special sessions and tutorials. We welcome in-person attendees to drop by the Google booth to meet our researchers and participate in Q&…",
          "link": "http://ai.googleblog.com/2022/09/google-at-interspeech-2022.html",
          "publishedOn": "2022-09-18T02:00:00.002Z",
          "wordCount": 7737,
          "title": "Google at Interspeech 2022",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/09/robust-online-allocation-with-dual.html",
          "author": null,
          "description": "Posted by Santiago Balseiro, Staff Research Scientist, Google Research, and Associate Professor at Columbia University, and Vahab Mirrokni, Distinguished Scientist, Google Research \nThe emergence of digital technologies has transformed decision making across commercial sectors such as airlines, online retailing, and internet advertising. Today, real-time decisions need to be repeatedly made in highly uncertain and rapidly changing environments. Moreover, organizations usually have limited resources, which need to be efficiently allocated across decisions. Such problems are referred to as online allocation problems with resource constraints, and applications abound. Some examples include: \n \nBidding with Budget Constraints: Advertisers increasingly purchase ad slots using auction-based mark…",
          "link": "http://ai.googleblog.com/2022/09/robust-online-allocation-with-dual.html",
          "publishedOn": "2022-09-16T20:35:00.000Z",
          "wordCount": 7904,
          "title": "Robust Online Allocation with Dual Mirror Descent",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/09/pali-scaling-language-image-learning-in.html",
          "author": null,
          "description": "Posted by Xi Chen and Xiao Wang, Software Engineers, Google Research \nAdvanced language models (e.g., GPT, GLaM, PaLM and T5) have demonstrated diverse capabilities and achieved impressive results across tasks and languages by scaling up their number of parameters. Vision-language (VL) models can benefit from similar scaling to address many tasks, such as image captioning, visual question answering (VQA), object recognition, and in-context optical-character-recognition (OCR). Increasing the success rates for these practical tasks is important for everyday interactions and applications. Furthermore, for a truly universal system, vision-language models should be able to operate in many languages, not just one. \nIn “PaLI: A Jointly-Scaled Multilingual Language-Image Model”, we introduce a uni…",
          "link": "http://ai.googleblog.com/2022/09/pali-scaling-language-image-learning-in.html",
          "publishedOn": "2022-09-15T19:16:00.003Z",
          "wordCount": 8092,
          "title": "PaLI: Scaling Language-Image Learning in 100+ Languages",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/09/lolnerf-learn-from-one-look.html",
          "author": null,
          "description": "Posted by Daniel Rebain, Student Researcher, and Mark Matthews, Senior Software Engineer, Google Research, Perception Team \nAn important aspect of human vision is our ability to comprehend 3D shape from the 2D images we observe. Achieving this kind of understanding with computer vision systems has been a fundamental challenge in the field. Many successful approaches rely on multi-view data, where two or more images of the same scene are available from different perspectives, which makes it much easier to infer the 3D shape of objects in the images. \nThere are, however, many situations where it would be useful to know 3D structure from a single image, but this problem is generally difficult or impossible to solve. For example, it isn’t necessarily possible to tell the difference between an …",
          "link": "http://ai.googleblog.com/2022/09/lolnerf-learn-from-one-look.html",
          "publishedOn": "2022-09-13T21:18:00.000Z",
          "wordCount": 6738,
          "title": "LOLNeRF: Learn from One Look",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/09/learning-to-walk-in-wild-from-terrain.html",
          "author": null,
          "description": "Posted by Yuxiang Yang, Student Researcher, Robotics at Google \nAn important promise for quadrupedal robots is their potential to operate in complex outdoor environments that are difficult or inaccessible for humans. Whether it’s to find natural resources deep in the mountains, or to search for life signals in heavily-damaged earthquake sites, a robust and versatile quadrupedal robot could be very helpful. To achieve that, a robot needs to perceive the environment, understand its locomotion challenges, and adapt its locomotion skill accordingly. While recent advances in perceptive locomotion have greatly enhanced the capability of quadrupedal robots, most works focus on indoor or urban environments, thus they cannot effectively handle the complexity of off-road terrains. In these environme…",
          "link": "http://ai.googleblog.com/2022/09/learning-to-walk-in-wild-from-terrain.html",
          "publishedOn": "2022-09-09T19:25:00.000Z",
          "wordCount": 7692,
          "title": "Learning to Walk in the Wild from Terrain Semantics",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/09/a-multi-axis-approach-for-vision.html",
          "author": null,
          "description": "Posted by Zhengzhong Tu and Yinxiao Li, Software Engineers, Google Research \nConvolutional neural networks have been the dominant machine learning architecture for computer vision since the introduction of AlexNet in 2012. Recently, inspired by the evolution of Transformers in natural language processing, attention mechanisms have been prominently incorporated into vision models. These attention methods boost some parts of the input data while minimizing other parts so that the network can focus on small but important parts of the data. The Vision Transformer (ViT) has created a new landscape of model designs for computer vision that is completely free of convolution. ViT regards image patches as a sequence of words, and applies a Transformer encoder on top. When trained on sufficiently la…",
          "link": "http://ai.googleblog.com/2022/09/a-multi-axis-approach-for-vision.html",
          "publishedOn": "2022-09-08T17:43:00.000Z",
          "wordCount": 7204,
          "title": "A Multi-Axis Approach for Vision Transformer and MLP Models",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        }
      ]
    },
    {
      "title": "Seth Godin's Blog on marketing, tribes and respect",
      "feedUrl": "https://feeds.feedblitz.com/sethsblog",
      "siteUrl": "https://seths.blog",
      "articles": [
        {
          "id": "https://seths.blog/?p=42926",
          "author": "Seth Godin",
          "description": "You might want to make something that a lot of people want a little… Or you could make something that a few people want a lot. It’s usually neither. It’s rarely (very rarely) both. If you work hard and make intentional choices, though, you might end up with one or the other.",
          "link": "https://feeds.feedblitz.com/~/714697006/0/sethsblog~A-lot-is-a-choice/",
          "publishedOn": "2022-10-07T07:40:00.000Z",
          "wordCount": 1043,
          "title": "A lot is a choice",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061314.jpg"
        },
        {
          "id": "https://seths.blog/?p=41946",
          "author": "Seth Godin",
          "description": "The phone in your pocket cost $600, but that was two years ago, so now, it seems to be free and fully paid for. The upgrade has a slightly better camera and a slightly faster processor. Here’s the question: “If you could have chosen between the phone you have now and the phone you want […]",
          "link": "https://feeds.feedblitz.com/~/714577306/0/sethsblog~For-the-upgrade/",
          "publishedOn": "2022-10-06T09:23:00.000Z",
          "wordCount": 1129,
          "title": "For the upgrade",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061310-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=39824",
          "author": "Seth Godin",
          "description": "If, every time there’s a dish in the sink, you load and run the dishwasher and scrub the entire kitchen, you’re never going to get anything else done. On the other hand, if you wait until the sink is overflowing and the kitchen is filthy before you work on it, you’re going to spend a […]",
          "link": "https://feeds.feedblitz.com/~/714475796/0/sethsblog~Steady-state-and-the-trigger-for-change/",
          "publishedOn": "2022-10-05T09:42:00.000Z",
          "wordCount": 1112,
          "title": "Steady state and the trigger for change",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061311.jpg"
        },
        {
          "id": "https://seths.blog/?p=42866",
          "author": "Seth Godin",
          "description": "What do the dishwashers eat for lunch? What’s the user experience of accounts payable for that big tech company? How does the head of sales treat the receptionist? If it’s good enough for your customers, it should be good enough for your team, your vendors and your friends. And vice versa. The key is this: […]",
          "link": "https://feeds.feedblitz.com/~/714357438/0/sethsblog~Front-of-houseback-of-house/",
          "publishedOn": "2022-10-04T08:27:00.000Z",
          "wordCount": 1082,
          "title": "Front of house/back of house",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061315.jpg"
        },
        {
          "id": "https://seths.blog/?p=43913",
          "author": "Seth Godin",
          "description": "This common question no longer means anything. Every TV show is on. All the time. Our record collection streams every record ever recorded. And our readers can find and display just about any book we can name. We haven’t thought about the impacts of this abundance nearly as much as it deserves. Live matters less, […]",
          "link": "https://feeds.feedblitz.com/~/714183706/0/sethsblog~Whats-on-tonight/",
          "publishedOn": "2022-10-03T08:24:00.000Z",
          "wordCount": 1083,
          "title": "“What’s on tonight?”",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061314.jpg"
        },
        {
          "id": "https://seths.blog/?p=41944",
          "author": "Seth Godin",
          "description": "One way to serve the community is to see it as a market and solve one of its problems. When people choose to buy something, it’s ostensibly because the thing you sell is worth more to them than it costs. And so value is created. And when you make a profit selling something and pay […]",
          "link": "https://feeds.feedblitz.com/~/714030826/0/sethsblog~For-the-good-of-the-community/",
          "publishedOn": "2022-10-02T09:20:00.000Z",
          "wordCount": 1119,
          "title": "For the good of the community",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061318.jpg"
        },
        {
          "id": "https://seths.blog/?p=41942",
          "author": "Seth Godin",
          "description": "Some people say, “we’re not changing it, because this is the way it’s done.” And some people say, “the way it’s done isn’t good enough, let’s make it better.” In a given situation, you might encounter one or the other type of response. In fact, each of us might adopt one posture or the other. […]",
          "link": "https://feeds.feedblitz.com/~/713913222/0/sethsblog~The-way-its-done/",
          "publishedOn": "2022-10-01T09:37:00.000Z",
          "wordCount": 1091,
          "title": "The way it’s done",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061317.jpg"
        },
        {
          "id": "https://seths.blog/?p=42905",
          "author": "Seth Godin",
          "description": "Nerds, geeks, early adopters: they do things because they’re fresh and new and might not work. They’re novel. Most people, though, hesitate in the face of novelty. Because novelty is risky. Shoes with goldfish in the heels. The latest techno-ska-punk track. The new kind of phone… The reason we haven’t taken systemic action is that […]",
          "link": "https://feeds.feedblitz.com/~/713757642/0/sethsblog~Novelty-vs-action/",
          "publishedOn": "2022-09-30T08:38:00.000Z",
          "wordCount": 1078,
          "title": "Novelty vs action",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061318.jpg"
        },
        {
          "id": "https://seths.blog/?p=43900",
          "author": "Seth Godin",
          "description": "When a brand is successful, there’s often a desire to extend it. Disneyland was an extension of Disney movies. It reflected some of the magic of the movies, but created something new and valuable as well. Disneyland had some of the Disney essence and then built something additive and new. Apple did the same thing […]",
          "link": "https://feeds.feedblitz.com/~/713592854/0/sethsblog~Extensions-and-souvenirs/",
          "publishedOn": "2022-09-29T08:38:00.000Z",
          "wordCount": 1213,
          "title": "Extensions and souvenirs",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061311.jpg"
        },
        {
          "id": "https://seths.blog/?p=43095",
          "author": "Seth Godin",
          "description": "When innovation arrives, the logistics people have to scramble to keep up, because innovation always makes it hard to do things the way we used to. Over time, an innovative company thrives if it can get its logistics in order. Ship the right stuff to the right people on time and on budget. Once this […]",
          "link": "https://feeds.feedblitz.com/~/713418636/0/sethsblog~Logistics-vs-and-innovation/",
          "publishedOn": "2022-09-28T09:33:00.000Z",
          "wordCount": 1120,
          "title": "Logistics vs (and) innovation",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061313.jpg"
        }
      ]
    },
    {
      "title": "The JetBrains Blog",
      "feedUrl": "https://blog.jetbrains.com/feed/",
      "siteUrl": "https://blog.jetbrains.com",
      "articles": [
        {
          "id": "https://blog.jetbrains.com/?post_type=dataspell&p=284781",
          "author": "Valeria Letusheva",
          "description": "In the first EAP build for DataSpell 2022.3, you will find the ability to track and revert changes made to Jupyter notebooks, as well as a better in-editor experience for formatting multiline code blocks in Jupyter notebooks and searching within them. This first build also enriches support for web outputs by making it possible to […]",
          "link": "https://blog.jetbrains.com/dataspell/2022/10/2022-3-eap-1/",
          "publishedOn": "2022-10-07T12:52:30.000Z",
          "wordCount": 2392,
          "title": "DataSpell 2022.3 EAP 1 Is Out!",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/Blog_Social_share_image_1280x720_DataSpell-2x-1.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=go&p=284780",
          "author": "Sergey Kozlovskiy",
          "description": "The second build of our 2022.3 Early Access Program is out now. You can get the EAP build via the Toolbox App, download it from our website, use a snap package (for Ubuntu), or from inside GoLand, select Check IDE updates for Early Access Program in Preferences / Settings | Appearance & Behavior | System […]",
          "link": "https://blog.jetbrains.com/go/2022/10/07/the-go-workspace-file-action-and-performance-improvements-in-goland-eap-2022-3-2/",
          "publishedOn": "2022-10-07T11:58:12.000Z",
          "wordCount": 2431,
          "title": "The Go Workspace File Action and Performance Improvements in GoLand EAP 2022.3 #2",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/09/Blog_Social_share_image_1280x720_GoLand-2x.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=appcode&p=283624",
          "author": "Anastasia Kazakova",
          "description": "Hi everyone, Today we are starting the Early Access Program for AppCode 2022.3, and the first build (223.6160.86) is already available for download. Give the free EAP builds a try and let us know what you think about the changes! Share your feedback in the comments or submit it to our issue tracker. DOWNLOAD APPCODE […]",
          "link": "https://blog.jetbrains.com/appcode/2022/10/appcode-starts-the-2022-3-eap/",
          "publishedOn": "2022-10-07T11:16:01.000Z",
          "wordCount": 2393,
          "title": "AppCode Starts the 2022.3 EAP",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/09/Blog_Social_share_image_1280x720_AppCode-2x.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=datalore&p=284740",
          "author": "Alena Guzharina",
          "description": "While the Datalore team is getting ready for the major 2022.3 release, we’d like to share two recently published stories from Datalore customers, Chainalysis and The Center for New Data. We hope these case studies inspire you to switch your team to Datalore Enterprise – it’s free for teams of up to four people! Maybe you […]",
          "link": "https://blog.jetbrains.com/datalore/2022/10/07/how-data-teams-use-datalore-nbsp-2-new-stories/",
          "publishedOn": "2022-10-07T09:42:46.000Z",
          "wordCount": 1900,
          "title": "How Data Teams Use Datalore – 2 New Stories",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/Blog_Social_share_image_1280x720-3.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=datalore&p=284504",
          "author": "Alena Guzharina",
          "description": "What is ad hoc analysis? In Latin, ad hoc means “created or done for a particular purpose as necessary”. Accordingly, ad hoc analysis is conducted only once and is designed to answer a specific data question. Regular reporting vs. ad hoc reporting For most important business metrics, analysts perform regular reporting. Reports can be generated […]",
          "link": "https://blog.jetbrains.com/datalore/2022/10/06/what-is-ad-hoc-analysis-a-python-example-in-datalore/",
          "publishedOn": "2022-10-06T14:08:49.000Z",
          "wordCount": 2367,
          "title": "What Is Ad Hoc Analysis? A Python Example in Datalore",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/dl-yellow-blog-social-share-image-1280x720-1.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=webstorm&p=282645",
          "author": "David Watson",
          "description": "We’re continuing our build-up to WebStorm 2022.3 with our second EAP build. To catch up on all of the new features, check out our previous EAP blog posts. The Toolbox App is the easiest way to get the EAP builds and keep your stable and EAP versions up to date. You can also manually download […]",
          "link": "https://blog.jetbrains.com/webstorm/2022/10/webstorm-2022-3-eap-2/",
          "publishedOn": "2022-10-06T13:31:28.000Z",
          "wordCount": 2097,
          "title": "WebStorm 2022.3 EAP #2: Code Vision for JS and TS, Intention Action Preview, and Vue Improvements",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/09/WebStorm-2022-3EAP-social-media-share.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=dotnet&p=284121",
          "author": "Rachel Appel",
          "description": "Did you know? According to Statista, as of July 2022 there are 4.66 billion active internet users worldwide. That’s 59.5% of the global population. Of this total, 92.6% have accessed the internet via mobile devices.  .NET news Arm64 Performance Improvements in .NET 7 Experimental WebTransport over HTTP/3 support in Kestrel .NET MAUI in .NET 7 […]",
          "link": "https://blog.jetbrains.com/dotnet/2022/10/06/net-annotated-monthly-october-2022/",
          "publishedOn": "2022-10-06T12:36:18.000Z",
          "wordCount": 3528,
          "title": ".NET Annotated Monthly | October 2022",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/dotnet-annotated-blog-social-share-image-1280x720-1.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=phpstorm&p=284376",
          "author": "Brent Roose",
          "description": "We’ve released PhpStorm 2022.2.3, the third minor release for PhpStorm 2022.2. You can update by using the Toolbox App or from right inside the IDE. You can also download PhpStorm 2022.2.3 from our website. These are the most notable changes and bug fixes: Fixed: Language Injection causes large slowdowns (IDEA-292182)  Fixed: Quick Documentation popup doesn’t […]",
          "link": "https://blog.jetbrains.com/phpstorm/2022/10/phpstorm-2022-2-3-is-now-available/",
          "publishedOn": "2022-10-06T11:55:09.000Z",
          "wordCount": 1844,
          "title": "PhpStorm 2022.2.3 is now available",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/ps-release-blog-social-share-image-1280x720-1.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=idea&p=282014",
          "author": "Maria Kosukhina",
          "description": "IntelliJ IDEA 2022.3 EAP 2 is now available, bringing some cool new features for you to test out! We’ve updated the IntelliJ Profiler, making snapshots more convenient to work with, boosted the IDE performance on startup, and more.  You can get the latest build from our website, the free Toolbox App, or via snaps for […]",
          "link": "https://blog.jetbrains.com/idea/2022/10/intellij-idea-2022-3-eap-2/",
          "publishedOn": "2022-10-06T08:15:53.000Z",
          "wordCount": 2460,
          "title": "IntelliJ IDEA 2022.3 EAP 2: Improved IntelliJ Profiler, Faster IDE Startup, and More",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2019/02/intellij-idea_social.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=pycharm&p=284279",
          "author": "Valeria Letusheva",
          "description": "The second EAP build for PyCharm 2022.3 provides a convenient way to check the outcome of the intention action you are about to use, and features a new way to copy-paste a line without needing to select it first. The Toolbox App is the easiest way to get the EAP builds and keep your stable […]",
          "link": "https://blog.jetbrains.com/pycharm/2022/10/2022-3-eap-2/",
          "publishedOn": "2022-10-05T22:04:18.000Z",
          "wordCount": 2326,
          "title": "The Second EAP Build for PyCharm 2022.3 Is Out!",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/09/Blog_Featured_image_1280x600_PyCharm-2x-1.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=idea&p=284096",
          "author": "Maria Kosukhina",
          "description": "The third bug-fix update for v2022.2 is now available. You can update to this version from inside the IDE, using the Toolbox App, or using snaps if you are a Ubuntu user. You can also download it from our website. Here are the most notable fixes and updates that IntelliJ IDEA 2022.2.3 brings: The IDE […]",
          "link": "https://blog.jetbrains.com/idea/2022/10/intellij-idea-2022-2-3/",
          "publishedOn": "2022-10-05T17:57:45.000Z",
          "wordCount": 1749,
          "title": "IntelliJ IDEA 2022.2.3 is Out!",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2019/02/intellij-idea_social.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=education&p=284126",
          "author": "Anastasiia Pogorelova",
          "description": "As we prepare to celebrate World Teachers’ Day this week, we want to express our appreciation to all the teachers around the world for their diligent efforts and the important role they play in developing the future generations. This year, the theme for World Teachers’ Day is “the transformation of education begins with teachers”, which […]",
          "link": "https://blog.jetbrains.com/education/2022/10/05/interview-online-computer-science-education/",
          "publishedOn": "2022-10-05T12:41:07.000Z",
          "wordCount": 2455,
          "title": "Teachers at JetBrains: Insights About Online Computer Science Education",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/Social_TeachersDay22_Banner_1280x720.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}