{
  "sources": [
    {
      "title": "Spring",
      "feedUrl": "https://spring.io/blog.atom",
      "siteUrl": "https://spring.io/blog",
      "articles": [
        {
          "id": "https://spring.io/blog/2021/12/02/a-bootiful-podcast-datastax-s-christopher-bradford-on-the-apache-cassandra-operator-for-kubernetes-k8ssandra",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks to DataStax’s Christopher Bradford on the Apache Cassandra operator for Kubernetes, K8ssandra.\n\r\n\r\n  \nKubeCon Talk blogpost part 1\n\r\n  \nKubeCon Talk blogpost part 2\n\r\n  \nWe Pushed Helm to the Limit, then Built a Kubernetes Operator \n\r\n  \nA Case for Databases on Kubernetes from a Former Skeptic",
          "link": "https://spring.io/blog/2021/12/02/a-bootiful-podcast-datastax-s-christopher-bradford-on-the-apache-cassandra-operator-for-kubernetes-k8ssandra",
          "publishedOn": "2021-12-03T01:00:00.000Z",
          "wordCount": 446,
          "title": "A Bootiful Podcast: DataStax's Christopher Bradford on the Apache Cassandra operator for Kubernetes, K8ssandra"
        },
        {
          "id": "https://spring.io/blog/2021/12/02/spring-cloud-2021-0-0-codename-jubilee-has-been-released",
          "author": null,
          "description": "On behalf of the community, I am pleased to announce the General Availability of the Spring Cloud 2021.0 Release Train, codename Jubilee, is available today. The release can be found in Maven Central. You can check out the 2021.0 release notes for more information.\nNotable Changes in the 2021.0 Release Train\n\r\n2021.0.0 is compatible with Spring Boot 2.6.1\n\r\nSee the project page for all the issues and pull requests included in this release.\nSpring Cloud Commons\n\r\n\r\n  \nSupport for per LoadBalancer configuration properties (added as well to Gateway, Contract and OpenFeign).\n\r\n\nSpring Cloud Config\n\r\n\r\n  \nIntegration with AWS Secrets Manager, AWS Parameter Store and GCP Secret Manager.\n\r\n\nSpring Cloud Function\n\r\n\r\n  \nSupport for gRPC, FunctionCatalog via actuator endpoint, AWS improvements, Clo…",
          "link": "https://spring.io/blog/2021/12/02/spring-cloud-2021-0-0-codename-jubilee-has-been-released",
          "publishedOn": "2021-12-02T21:45:00.000Z",
          "wordCount": 775,
          "title": "Spring Cloud 2021.0.0 (codename Jubilee) Has Been Released"
        },
        {
          "id": "https://spring.io/blog/2021/12/02/spring-cloud-function-3-2-is-out",
          "author": null,
          "description": "Spring Cloud 2021.0.0 is finally out and with it you have Spring Cloud Function 3.2\n\r\nWhile the full list of features, enhancements and bug fixes is available here, I’d like to call out few of them in this post and provide some details.\ngRPC Support\n\r\nIn addition to an already existing support for invoking function via AWS Lambda, RSocket, Spring Cloud Stream etc., Spring Cloud Function now allows you to invoke function via gRPC.\nTwo ways to benefit from it. \nSpring Message\n\r\nGiven the wide adaption of Spring Messaging, one way of benefiting from gRPC support is by embracing Spring’s Message.\nSpring Cloud Function provides GrpcSpringMessage schema modeled after Spring’s Message. It is internally converted to Spring Message to benefit from all of the existing support for Spring Messaging. \n…",
          "link": "https://spring.io/blog/2021/12/02/spring-cloud-function-3-2-is-out",
          "publishedOn": "2021-12-02T18:54:00.000Z",
          "wordCount": 1168,
          "title": "Spring Cloud Function 3.2 is out!"
        },
        {
          "id": "https://spring.io/blog/2021/12/01/accelerate-spring-apps-to-cloud-at-scale-discussion-with-azure-spring-cloud-customers",
          "author": null,
          "description": "Hi, Spring fans! I love the Azure Spring Cloud platform - jointly developed with the Spring team and Microsoft - and I’m not alone! So do its users! Check out this panel discussion moderated by Adib Sakali and Asir Selvasingh with Morgan Stanley, Bosch, and Digital Realty Trust.",
          "link": "https://spring.io/blog/2021/12/01/accelerate-spring-apps-to-cloud-at-scale-discussion-with-azure-spring-cloud-customers",
          "publishedOn": "2021-12-01T18:00:00.000Z",
          "wordCount": 441,
          "title": "Accelerate Spring Apps to Cloud at Scale - Discussion with Azure Spring Cloud Customers"
        },
        {
          "id": "https://spring.io/blog/2021/12/01/spring-authorization-server-0-2-1-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, it is my pleasure to announce the general availability of Spring Authorization Server 0.2.1.\n\r\n\r\n\r\nYou can download it from Maven Central by using the module coordinates:\n\r\n\r\n\r\n\r\ncompile 'org.springframework.security:spring-security-oauth2-authorization-server:0.2.1'\n\r\n\r\n\r\n\r\nSee the release notes for complete details.\n\r\n\r\n\r\nTo get started using Spring Authorization Server, see the sample to become familiar with setup and configuration.\n\r\n\r\n\r\nWe would love to gather your feedback as we strive to improve and build upon this release.\n\r\n\r\n\r\nProject Page | GitHub Issues |  ZenHub Board",
          "link": "https://spring.io/blog/2021/12/01/spring-authorization-server-0-2-1-available-now",
          "publishedOn": "2021-12-01T14:00:00.000Z",
          "wordCount": 464,
          "title": "Spring Authorization Server 0.2.1 available now"
        },
        {
          "id": "https://spring.io/blog/2021/12/01/spring-tips-controllers-and-rsocket",
          "author": null,
          "description": "Hi, Spring fans! In this installment of Spring Tips (@SpringTipsLive), we continue our tour of all things @Controller, this time focusing on the Spring support for RSocket. You might also want to watch the expanded discussion of RSocket in earlier Spring Tips  videos: \n\r\n\r\n  \nThe RSocket Revolution - watch this next!\n\r\n  \nRaw RSocket support\n\r\n  \nRSocket Messaging and the @Controller component model\n\r\n  \nRSocket and Spring Security\n\r\n  \nSpring Retrosocket",
          "link": "https://spring.io/blog/2021/12/01/spring-tips-controllers-and-rsocket",
          "publishedOn": "2021-12-01T08:00:00.000Z",
          "wordCount": 441,
          "title": "Spring Tips: @Controllers and RSocket"
        },
        {
          "id": "https://spring.io/blog/2021/11/30/this-week-in-spring-november-30th-2021",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring! This last week’s been nutty! Here in the US, we just celebrated the Thanksgiving holiday, and I am fat with turkey and pie, and lazy. But happy. I hope you’re well fed and happy, too. Time’s flying. (Also: can you believe we’re a month away from the new year? I think there’s like four or five weeks (and thus _This Week in Spring_s!) left in the year!) \n\r\nWe’ve got a ton of stuff to get into this week, so let’s go:\n\r\n\r\n  \nSecurity Report for Spring AMQP (Spring for RabbitMQ)\n\r\n  \nSpring Boot 2.6.1 is now available\n\r\n  \nSpring Data MongoDB - Relation Modelling\n\r\n  \nThymeleaf 3.0.13 now available! This new version includes security improvements, make sure to check the release notes\n\r\n  \nIn last week’s installmetn of A Bootiful Podcast, I talked about reactive-systems with functional programming legend Debasish Ghosh\n\r\n  \nThe Apache Cassandra project is working hard to officially support JDK 17 in the next Apache Cassandra major release.\n\r\n  \nI love to see how far the JVM has come. One great indicator of its progress: its garbage collector. Check out this post on garbage collection progress from JDK 8 to JDK 17\n\r\n  \nThis is so cool! There’s now an Oracle Database Kubernetes Operator\n\r\n  \nJEP 420: Pattern Matching for switch (Second Preview)\n\r\n  \nJava on Visual Studio Code Update – October 2021\n\r\n  \nFor a lot of folks, the days of using Docker Desktop for free are numbered. You might be interested in this blog on Rancher Desktop - A Docker Desktop Replacement",
          "link": "https://spring.io/blog/2021/11/30/this-week-in-spring-november-30th-2021",
          "publishedOn": "2021-11-30T19:00:00.000Z",
          "wordCount": 639,
          "title": "This Week in Spring - November 30th, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/11/29/security-report-for-spring-amqp-spring-for-rabbitmq",
          "author": null,
          "description": "The recently released versions of Spring AMQP (2.4.0, 2.3.12, 2.2.20) contain a fix for CVE-2021-22095, which can cause a potential OutOfMemoryError for very large messages.\n\r\n\r\n\r\nSpring Boot version 2.6.0 and 2.5.7 will bring in the 2.4.0 and 2.3.12 versions of spring-amqp respectively. Users of Boot 2.4.x should override the spring-amqp and spring-rabbit versions to 2.3.12; users of Spring Boot 2.3.x should override the versions to 2.2.20.",
          "link": "https://spring.io/blog/2021/11/29/security-report-for-spring-amqp-spring-for-rabbitmq",
          "publishedOn": "2021-11-29T17:11:25.000Z",
          "wordCount": 447,
          "title": "Security Report for Spring AMQP (Spring for RabbitMQ)"
        },
        {
          "id": "https://spring.io/blog/2021/11/29/spring-boot-2-6-1-is-now-available",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.6.1 has been released and is now available from Maven Central.\n\r\nThis release includes 11 bug fixes and documentation improvements. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/11/29/spring-boot-2-6-1-is-now-available",
          "publishedOn": "2021-11-29T13:49:03.000Z",
          "wordCount": 480,
          "title": "Spring Boot 2.6.1 is now available"
        },
        {
          "id": "https://spring.io/blog/2021/11/29/spring-data-mongodb-relation-modelling",
          "author": null,
          "description": "MongoDB’s flexible schema allows for multiple patterns when it comes to modeling relationships between entities. Also, for many use cases, a denormalized data model (storing related data right within a single document) might be the best choice, because all information is kept in one place, so that the application requires fewer queries to fetch all data. However, this approach also has its downsides, such as potential data duplication, larger documents, and the maximum document size.\n\r\n\r\n\r\nIn general, MongoDB recommends using normalized data models when the advantages of embedding are neglected by the implications of duplication. In this blog post, we take a look at the different possibilities of linking documents with manual references and DBRefs when the need occurs to work with relation…",
          "link": "https://spring.io/blog/2021/11/29/spring-data-mongodb-relation-modelling",
          "publishedOn": "2021-11-29T09:30:00.000Z",
          "wordCount": 1825,
          "title": "Spring Data MongoDB - Relation Modelling"
        },
        {
          "id": "https://spring.io/blog/2021/11/25/a-bootiful-podcast-reactive-system-and-functional-programming-legend-debasish-ghosh",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks to functional programming- and reactive systems-legend Debasish Ghosh (@debasishg). And Happy Thanksgiving, if you celebrate!",
          "link": "https://spring.io/blog/2021/11/25/a-bootiful-podcast-reactive-system-and-functional-programming-legend-debasish-ghosh",
          "publishedOn": "2021-11-25T09:00:00.000Z",
          "wordCount": 410,
          "title": "A Bootiful Podcast: Reactive-System and Functional Programming legend Debasish Ghosh"
        },
        {
          "id": "https://spring.io/blog/2021/11/23/this-week-in-spring-happy-thanksgiving-november-23rd-2021",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring! \n\r\nHi, Spring fans! Welcome to another installment of This Week in Spring. This Thursday is Thanksgiving here in the US, where I live. it’s a time during which we Americans try to be thankful for what we have. And me, personally? I’ve got a lot of things for which I am grateful, this week and always. \n\r\nI am thankful for my family and friends. A person is the company they keep, and I am lucky to have excellent company in my life. \n\r\nI am thankful for my health. Right now, pandemic be danged, I’m healthy and happy, something for which I am endlessly grateful because I know what it’s like not to be healthy. \n\r\nI am thankful for the fantastic Spring ecosystem. It’s an endlessly replenishing fount of awesomeness. Have you …",
          "link": "https://spring.io/blog/2021/11/23/this-week-in-spring-happy-thanksgiving-november-23rd-2021",
          "publishedOn": "2021-11-23T09:00:00.000Z",
          "wordCount": 866,
          "title": "This Week in Spring (Happy Thanksgiving!) - November 23rd, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/11/22/spring-hateoas-1-4-released",
          "author": null,
          "description": "I am excited to announce that Spring HATEOAS 1.4 GA has been part of the cascade of releases that lead to the Spring Boot 2.6 last week.\r\nThe release ships a couple of new features and all bug fixes we have incorporated in the 1.3.x line.\r\nThe most notable new features are:\n\r\n\r\n\r\n\r\n\r\nFull support for level 4 URI templates\n\r\n\r\n\r\nSupport for non-composite request parameter rendering\n\r\n\r\n\r\nImproved HAL-FORMS support (additional property constraints, custom media types)\n\r\n\r\n\r\nAdditional HTML input types (checkbox, radio, file)\n\r\n\r\n\r\nGeneral dependency upgrades, including Spring Framework 5.3.13 and Jackson 2.13.9.\n\r\n\r\n\r\n\r\n\r\nFind more detailed information about all changes made in the 1.4 line in the release’s change log.\r\nThe release was included in the Spring Boot 2.6 release announced last week.\r\nIn other words, if you have upgraded to that, you’ve already successfully upgraded to Spring HATEOAS 1.4.\n\r\n\r\n\r\nWe have also released maintenance versions for the 1.3 and 1.2 lines.\r\nPlease note, that 1.2.11 is the last release of that branch and 1.2 is going out of OSS maintenance.\r\nFind more about the support timelines for each branch in the newly introduced tab of our project homepage.\n\r\n\r\n\r\nAlso note, that due to a typo during the release procedure for 1.2.11, a 1.12.11 release has made it onto Maven Central.\r\nThe binaries are logically equivalent to 1.2.11, but their presence is likely to cause trouble with tools automating library upgrades.\r\nWe’re currently working with Sonatype to investigate options to potentially remove the invalid artifacts.",
          "link": "https://spring.io/blog/2021/11/22/spring-hateoas-1-4-released",
          "publishedOn": "2021-11-22T21:00:00.000Z",
          "wordCount": 616,
          "title": "Spring HATEOAS 1.4 released"
        },
        {
          "id": "https://spring.io/blog/2021/11/19/spring-boot-2-6-is-now-available",
          "author": null,
          "description": "On behalf of the Spring Boot team and everyone that has contributed, I am pleased to announce that Spring Boot 2.6.0 has been released and is available from Maven Central. \n\r\nThis release adds a significant number of new features and improvements. For full upgrade instructions and new and noteworthy features please see the release notes.\nWhat’s new in 2.6\n\r\n\r\n  \nSupport for SameSite attributes on session cookies for servlet applications\n\r\n  \nSupport for configuring health groups on the main or management port\n\r\n  \nEnhanced /info endpoint with Java Runtime information\n\r\n  \nSupport for testing Spring MVC using WebTestClient\n\r\n  \nAuto-configuration for spring-rabbit-stream\n\r\n  \nSupport for pluggable rules for sanitizing properties in /env and configprops\n\r\n\nDependency upgrades\n\r\nSpring Boot 2.6 moves to new versions of several Spring projects:\n\r\n\r\n  \nSpring Data 2021.1\n\r\n  \nSpring HATEOAS 1.4\n\r\n  \nSpring AMQP 2.4\n\r\n  \nSpring Kafka 2.8\n\r\n  \nSpring Security 5.6\n\r\n  \nSpring Session 2021.1\n\r\n\r\nWe’ve also upgraded to the latest stable releases of other third-party libraries wherever possible. Please see the release notes for details.\nOther changes\n\r\nThere’s a whole host of other changes and improvements that are documented in the release notes. You can also find a list of deprecated classes and methods that we plan to remove in the next version.\n\r\nAdditionally, Spring Boot 2.4.0 has now reached end of OSS support. More information on Spring Boot’s support dates can be found here.\nThank you\n\r\nWe want to take this opportunity to again thank all our users and contributors.\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask at stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/11/19/spring-boot-2-6-is-now-available",
          "publishedOn": "2021-11-19T08:39:41.000Z",
          "wordCount": 660,
          "title": "Spring Boot 2.6 is now available"
        },
        {
          "id": "https://spring.io/blog/2021/11/19/get-to-know-a-kubernetes-operator",
          "author": null,
          "description": ".logo {\r\r\n --gutter: 10px;  \r\r\n --logo-width : 200px;\r\r\n grid-area: logo ;\r\r\n border: 1px solid white ;\r\r\n width: var(--logo-width) ;\r\r\n background-color: white ; \r\r\n padding: var(--gutter);\r\r\n border-radius: var(--gutter);  \r\r\n\r\r\n} \r\r\n\r\nHi, Spring fans! It’s Friday, and you know what that means? Some poor schlub somewhere is trying fruitlessly to get something deployed to production, or at least rolled back consistently, in time for dinner. And it’s not working. I’ve been there. Deployments are hard. There’s nuance in deployment. I love Kubernetes as much as the next Operator, but let’s not pretend it’s the pinnacle of productivity. Quite the contrary. There’s a whole cottage industry around simplifying application deployments with Kubernetes. See for example KNative,  Cloud Foundry on Ku…",
          "link": "https://spring.io/blog/2021/11/19/get-to-know-a-kubernetes-operator",
          "publishedOn": "2021-11-19T08:00:00.000Z",
          "wordCount": 2323,
          "title": "Get to Know a Kubernetes Operator!"
        },
        {
          "id": "https://spring.io/blog/2021/11/18/spring-amqp-spring-for-rabbitmq-2-4-is-now-available",
          "author": null,
          "description": "I am pleased to announce that Spring AMQP 2.4.0 is now available.\n\r\n\r\n\r\nNotable Changes\n\r\n\r\n\r\n\r\nInitial support for the RabbitMQ Stream Plugin\n\r\n\r\n\r\nSupport for remoting using Spring Framework’s RMI support is deprecated\n\r\n\r\n\r\n\r\n\r\nFor information about all changes in this release, see What’s New.\n\r\n\r\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/11/18/spring-amqp-spring-for-rabbitmq-2-4-is-now-available",
          "publishedOn": "2021-11-19T01:36:00.000Z",
          "wordCount": 438,
          "title": "Spring AMQP (Spring for RabbitMQ) 2.4 is Now Available"
        },
        {
          "id": "https://spring.io/blog/2021/11/18/spring-for-apache-kafka-2-8-is-now-available",
          "author": null,
          "description": "I am pleased to announce that Spring for Apache Kafka 2.8.0 is now available.\n\r\n\r\n\r\nNotable Changes\n\r\n\r\n\r\n\r\nThis version uses the 3.0.0 kafka-clients version\n\r\n\r\n\r\nOut of order manual commits are now supported\n\r\n\r\n\r\nThe same container factory can now be used for both batch and record listeners\n\r\n\r\n\r\nSeparate record and batch error handlers have been replaced with common error handlers\n\r\n\r\n\r\nKafkaTemplate can now be used to receive specific records from known partitions/offsets\n\r\n\r\n\r\n\r\n\r\nFor information about all changes in this release, see What’s New.\n\r\n\r\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/11/18/spring-for-apache-kafka-2-8-is-now-available",
          "publishedOn": "2021-11-19T01:28:00.000Z",
          "wordCount": 475,
          "title": "Spring for Apache Kafka 2.8 is Now Available"
        },
        {
          "id": "https://spring.io/blog/2021/11/18/a-bootiful-podcast-fellow-java-champion-kate-stanley-on-kubernetes-and-apache-kafka",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of A Bootiful Podcast! This week - a week before Thanksgiving here in the US - Josh Long (@starbuxman) wants you to know he and the Spring team are_thankful_ for you, and then he talks to newly minted Java Champion and Java ecosystem legend Kate Stanley (@KateStanley91) about Kubernetes and Apache Kafka.",
          "link": "https://spring.io/blog/2021/11/18/a-bootiful-podcast-fellow-java-champion-kate-stanley-on-kubernetes-and-apache-kafka",
          "publishedOn": "2021-11-18T21:00:00.000Z",
          "wordCount": 450,
          "title": "A Bootiful Podcast: Fellow Java Champion Kate Stanley on Kubernetes and Apache Kafka"
        },
        {
          "id": "https://spring.io/blog/2021/11/18/spring-boot-2-5-7-is-now-available",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.5.7 has been released and is now available from Maven Central.\n\r\nThis release includes 35 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/11/18/spring-boot-2-5-7-is-now-available",
          "publishedOn": "2021-11-18T11:53:54.000Z",
          "wordCount": 482,
          "title": "Spring Boot 2.5.7 is now available"
        },
        {
          "id": "https://spring.io/blog/2021/11/18/spring-boot-2-4-13-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.4.13 has been released and is now available from Maven Central.\n\r\nThis release includes 26 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nEnd of OSS Support\n\r\n2.4.x has now reached the end of its OSS support period and regular releases will no longer be made. If you are still on this version, please consider upgrading at your earliest convenience. If you cannot upgrade at this time, commercial support is available.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/11/18/spring-boot-2-4-13-available-now",
          "publishedOn": "2021-11-18T09:12:00.000Z",
          "wordCount": 527,
          "title": "Spring Boot 2.4.13 available now"
        }
      ]
    },
    {
      "title": "HashiCorp Blog",
      "feedUrl": "https://www.hashicorp.com/blog/feed.xml",
      "siteUrl": "https://hashicorp.com/blog",
      "articles": [
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-teams-with-aws-on-new-control-tower-account-factory-for-terraform",
          "author": null,
          "description": "AWS Control Tower Account Factory for HashiCorp Terraform (AFT), the evolution of Terraform Landing Zones, offers an easy way to set up and govern a secure, multi-account AWS environment.",
          "link": "https://www.hashicorp.com/blog/hashicorp-teams-with-aws-on-new-control-tower-account-factory-for-terraform",
          "publishedOn": "2021-11-29T23:45:00.000Z",
          "wordCount": 921,
          "title": "HashiCorp Teams with AWS on New Control Tower Account Factory for Terraform"
        },
        {
          "id": "https://www.hashicorp.com/blog/terraform-aws-provider-continues-to-expand-coverage",
          "author": null,
          "description": "During 2021, HashiCorp and Amazon Web Services have partnered to bring hundreds of new services and features to the Terraform providers for AWS and AWS Cloud Control.",
          "link": "https://www.hashicorp.com/blog/terraform-aws-provider-continues-to-expand-coverage",
          "publishedOn": "2021-11-29T17:00:00.000Z",
          "wordCount": 917,
          "title": "Terraform AWS Provider Continues to Expand Coverage"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-at-aws-re-invent-breakouts-experts-demos-and-more",
          "author": null,
          "description": "Visit us at AWS re:Invent 2021 in Las Vegas, Nov. 29 - Dec. 3 for breakout sessions, expert talks, and product demos to accelerate your cloud strategy.",
          "link": "https://www.hashicorp.com/blog/hashicorp-at-aws-re-invent-breakouts-experts-demos-and-more",
          "publishedOn": "2021-11-23T17:00:00.000Z",
          "wordCount": 1220,
          "title": "HashiCorp at AWS re:Invent: Breakouts, Experts, Demos, and More"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-boundary-0-7",
          "author": null,
          "description": "Boundary 0.7 adds support for partner plugins, dynamic host catalogs, UI support for managed groups and resource filtering, and more.",
          "link": "https://www.hashicorp.com/blog/hashicorp-boundary-0-7",
          "publishedOn": "2021-11-22T17:00:00.000Z",
          "wordCount": 889,
          "title": "HashiCorp Boundary 0.7 Brings New Automated Host Discovery"
        },
        {
          "id": "https://www.hashicorp.com/blog/pagerduty-palo-alto-networks-and-splunk-among-new-verified-terraform-providers",
          "author": null,
          "description": "We welcome 17 new verified providers to the growing HashiCorp Terraform ecosystem.",
          "link": "https://www.hashicorp.com/blog/pagerduty-palo-alto-networks-and-splunk-among-new-verified-terraform-providers",
          "publishedOn": "2021-11-18T18:00:00.000Z",
          "wordCount": 1121,
          "title": "PagerDuty, Palo Alto Networks, and Splunk Among New Verified Terraform Providers"
        },
        {
          "id": "https://www.hashicorp.com/blog/vault-1-9",
          "author": null,
          "description": "Vault 1.9 can act as an OIDC provider, includes general availability of a key management secrets engine for Google Cloud, and updates to Transform, Namespaces, and the UI.",
          "link": "https://www.hashicorp.com/blog/vault-1-9",
          "publishedOn": "2021-11-17T17:00:00.000Z",
          "wordCount": 1684,
          "title": "Announcing HashiCorp Vault 1.9"
        },
        {
          "id": "https://www.hashicorp.com/blog/consul-service-mesh-on-amazon-ecs-now-generally-available",
          "author": null,
          "description": "HashiCorp Consul service mesh on Amazon ECS is now generally available and ready for production environments.",
          "link": "https://www.hashicorp.com/blog/consul-service-mesh-on-amazon-ecs-now-generally-available",
          "publishedOn": "2021-11-17T17:00:00.000Z",
          "wordCount": 789,
          "title": "Consul Service Mesh on Amazon ECS Now Generally Available"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-hashicorp-nomad-1-2",
          "author": null,
          "description": "Nomad 1.2 introduces Nomad Pack, which simplifies application deployment and lifecycle management on Nomad.",
          "link": "https://www.hashicorp.com/blog/announcing-hashicorp-nomad-1-2",
          "publishedOn": "2021-11-16T18:00:00.000Z",
          "wordCount": 1530,
          "title": "Announcing General Availability of HashiCorp Nomad 1.2"
        },
        {
          "id": "https://www.hashicorp.com/blog/terraform-cloud-variable-sets-beta-now-available",
          "author": null,
          "description": "HashiCorp Terraform Cloud variable sets let you simplify the management of reusable variables across an entire organization. This feature is now available in public beta.",
          "link": "https://www.hashicorp.com/blog/terraform-cloud-variable-sets-beta-now-available",
          "publishedOn": "2021-11-11T17:00:00.000Z",
          "wordCount": 1147,
          "title": "Terraform Cloud Variable Sets Beta Now Available"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-terraform-cloud-wins-2021-crn-tech-innovator-award",
          "author": null,
          "description": "HashiCorp Terraform Cloud takes home the prize in the DevOps Platforms category of the 2021 CRN Tech Innovator Awards.",
          "link": "https://www.hashicorp.com/blog/hashicorp-terraform-cloud-wins-2021-crn-tech-innovator-award",
          "publishedOn": "2021-11-10T17:00:00.000Z",
          "wordCount": 957,
          "title": "HashiCorp Terraform Cloud Wins 2021 CRN Tech Innovator Award"
        }
      ]
    },
    {
      "title": "Elastic Blog - Elasticsearch, Kibana, and ELK Stack",
      "feedUrl": "https://www.elastic.co/blog/feed",
      "siteUrl": "https://www.elastic.co",
      "articles": [
        {
          "id": "https://www.elastic.co/blog/detect-block-unknown-knowndlls-windows-acl-hardening-attacks-cache-poisoning-escalation",
          "author": "Gabriel Landau",
          "description": "This is the second in a two-part series discussing a still-unpatched userland Windows privilege escalation. The exploit enables attackers to perform highly privileged actions that typically require a kernel driver.",
          "link": "https://www.elastic.co/blog/detect-block-unknown-knowndlls-windows-acl-hardening-attacks-cache-poisoning-escalation",
          "publishedOn": "2021-12-03T14:00:00.000Z",
          "wordCount": 1066,
          "title": "Detecting and blocking unknown KnownDlls"
        },
        {
          "id": "https://www.elastic.co/blog/detect-block-unknown-knowndlls-windows-acl-hardening-attacks-cache-poisoning-escalation",
          "author": "Gabriel Landau",
          "description": ",\nThis is the second in a two-part series discussing a still-unpatched userland Windows privilege escalation. The exploit enables attackers to perform highly privileged actions that typically require a kernel driver.\nPart 1 of this blog series showed how to block these attacks via ACL hardening. If you haven’t already, please read the first part of this series, because it lays an important foundation for this article. Interested readers can also check out the excellent Unknown Known DLLs ... and other Code Integrity Trust Violations for a deeper understanding of code integrity and protected processes.\nIn part 2 of this series, I’ll show how to detect these attacks in real time, gaining greater visibility into your environment.\nExploit refresher\nAt a high level, the exploit, previously desc…",
          "link": "https://www.elastic.co/blog/detect-block-unknown-knowndlls-windows-acl-hardening-attacks-cache-poisoning-escalation",
          "publishedOn": "2021-12-03T14:00:00.000Z",
          "wordCount": 1066,
          "title": "Detecting and blocking unknown KnownDlls"
        },
        {
          "id": "https://www.elastic.co/blog/monitoring-elastic-enterprise-search-performance-using-elastic-apm",
          "author": "Pius Fung",
          "description": "New Elastic APM integration for Elastic Enterprise Search enables our developers to quickly pinpoint performance bottlenecks in Enterprise Search.",
          "link": "https://www.elastic.co/blog/monitoring-elastic-enterprise-search-performance-using-elastic-apm",
          "publishedOn": "2021-11-24T15:00:00.000Z",
          "wordCount": 982,
          "title": "Monitoring Elastic Enterprise Search performance using Elastic APM"
        },
        {
          "id": "https://www.elastic.co/blog/monitoring-elastic-enterprise-search-performance-using-elastic-apm",
          "author": "Pius Fung",
          "description": ",\nElastic APM is a free, open and powerful observability tool that provides intelligence into application performance for a myriad of production applications (e.g., throughput, error rates, latency, resource usage, transaction traces).  You can now enable Elastic APM integration to gain deep insight into the performance behaviors of your Elastic Enterprise Search deployment! \nThis article provides step-by-step instructions for enabling the integration between Elastic's APM and Enterprise Search products and showcases how our Enterprise Search team leverages Elastic APM to capture additional intelligence to improve Enterprise Search performance during the development lifecycle.  \nThe data collected by the APM Ruby agent in Enterprise Search is shipped to an Elastic APM Server and indexed in…",
          "link": "https://www.elastic.co/blog/monitoring-elastic-enterprise-search-performance-using-elastic-apm",
          "publishedOn": "2021-11-24T15:00:00.000Z",
          "wordCount": 982,
          "title": "Monitoring Elastic Enterprise Search performance using Elastic APM"
        },
        {
          "id": "https://www.elastic.co/blog/helping-elastic-customers-succeed-how-elastic-partners-with-organizations-to-maximise-their-investments",
          "author": "Nikki Jones,Taha Derouiche",
          "description": "Realizing business objectives and successful outcomes with our customers is at the core of what we do. In this series, learn some of the many ways Elastic Technical Account Managers partner with organizations to accomplish these goals.",
          "link": "https://www.elastic.co/blog/helping-elastic-customers-succeed-how-elastic-partners-with-organizations-to-maximise-their-investments",
          "publishedOn": "2021-11-24T06:00:00.000Z",
          "wordCount": 901,
          "title": "Helping Elastic Customers Succeed | How Elastic partners with organizations to maximise their investments"
        },
        {
          "id": "https://www.elastic.co/blog/helping-elastic-customers-succeed-how-elastic-partners-with-organizations-to-maximise-their-investments",
          "author": "Nikki Jones,Taha Derouiche",
          "description": ",\nFrom improving safety in planes to reducing times to detect and respond to threats, Elastic Consulting helps our customers drive impactful business outcomes. \nTechnical\n Account Managers (TAM) play an essential role in supporting our \ncustomers throughout their journey. In this latest post from our series,\n Nikki Jones, Customer Success Lead interviews Taha Derouiche, Elastic \nTAM. \nhttps://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt91e834ee19477d83/619d2b6c9b3c850ceca03d3a/taha.jpg,taha.jpg,Can you give an example of what kind of business challenges you help our customers solve, and what value you help them unlock?\n\nWe are a trusted advisor who is a recurring touch point for technical questions that really allow our customers to find greater value in their Elastic investment…",
          "link": "https://www.elastic.co/blog/helping-elastic-customers-succeed-how-elastic-partners-with-organizations-to-maximise-their-investments",
          "publishedOn": "2021-11-24T06:00:00.000Z",
          "wordCount": 901,
          "title": "Helping Elastic Customers Succeed | How Elastic partners with organizations to maximise their investments"
        },
        {
          "id": "https://www.elastic.co/blog/optimizing-sort-queries-in-elasticsearch-for-faster-results",
          "author": "Mayya Sharipova",
          "description": "Learn about recent optimizations that speed up sorted queries in Elasticsearch for numeric and date fields, making sorted queries up to an order of magnitude faster. Sorted queries are very common regardless of a search domain (e-commerce, security, observability etc.), and making them faster benefits any application that uses search.",
          "link": "https://www.elastic.co/blog/optimizing-sort-queries-in-elasticsearch-for-faster-results",
          "publishedOn": "2021-11-23T13:00:00.000Z",
          "wordCount": 1082,
          "title": "Optimizing sort queries in Elasticsearch for faster results"
        },
        {
          "id": "https://www.elastic.co/blog/optimizing-sort-queries-in-elasticsearch-for-faster-results",
          "author": "Mayya Sharipova",
          "description": ",\nIt is very common in Elasticsearch to request results to be sorted by a certain field. We have invested a great deal of time and effort to optimize sort queries to make them faster for our users. This blog will describe some of the sort optimizations for numeric and date fields.\nHow sorted queries work\nWhen you want to find documents matching a filter and request results to be sorted by a certain field, Elasticsearch would examine this field’s doc values for all documents matched by the filter and choose the top K documents with the top values. In the worst case of a very broad filter (e.g. match_all query), we have to examine and compare doc values for all documents in an index. For big indices, this may take a substantial amount of time. \nOne way to optimize sort queries on a particula…",
          "link": "https://www.elastic.co/blog/optimizing-sort-queries-in-elasticsearch-for-faster-results",
          "publishedOn": "2021-11-23T13:00:00.000Z",
          "wordCount": 1082,
          "title": "Optimizing sort queries in Elasticsearch for faster results"
        },
        {
          "id": "https://www.elastic.co/blog/embracing-invokedynamic-to-tame-class-loaders-in-java-agents",
          "author": "Felix Barnsteiner,Rafael Winterhalter",
          "description": "Byte Buddy makes it easy to write Java agents without bytecode know-how. But class loaders and other complexities can still ruin your day. Here's a novel invokedynamic-based architecture that simplifies agent development.",
          "link": "https://www.elastic.co/blog/embracing-invokedynamic-to-tame-class-loaders-in-java-agents",
          "publishedOn": "2021-11-22T14:00:00.000Z",
          "wordCount": 2585,
          "title": "Embracing invokedynamic to tame class loaders in Java agents"
        },
        {
          "id": "https://www.elastic.co/blog/embracing-invokedynamic-to-tame-class-loaders-in-java-agents",
          "author": "Felix Barnsteiner,Rafael Winterhalter",
          "description": ",\nOne of the nicest things about Byte Buddy is that it allows you to write a Java agent without manually having to deal with byte code. To instrument a method, agent authors can simply write the code they want to inject in pure Java. This makes writing Java agents much more accessible and avoids complicated on-boarding requirements.\nAfter the first successful experiments, agent authors often get hit by a wall of complexity that the JVM throws at them: class loaders (OSGi, oh my!), class visibility, dependence on internal APIs, class path scanners, and version conflicts to name a few. \nIn this article, we'll look at a relatively novel approach to break through this wall of complexity. The architecture, which is based on the invokedynamic bytecode instruction, a bytecode that is best known f…",
          "link": "https://www.elastic.co/blog/embracing-invokedynamic-to-tame-class-loaders-in-java-agents",
          "publishedOn": "2021-11-22T14:00:00.000Z",
          "wordCount": 2585,
          "title": "Embracing invokedynamic to tame class loaders in Java agents"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-cloud-with-aws-firelens-accelerate-time-to-insight-with-agentless-data-ingestion",
          "author": "Akshay Saraswat,Uday Theepireddy",
          "description": "Ship logs directly to Elastic Cloud with AWS FireLens, a container log router for Amazon ECS launch types: Amazon EC2 and AWS Fargate. Monitor, manage, and secure your logs and events from FireLens with Elastic Observability and Elastic Security.",
          "link": "https://www.elastic.co/blog/elastic-cloud-with-aws-firelens-accelerate-time-to-insight-with-agentless-data-ingestion",
          "publishedOn": "2021-11-22T13:30:00.000Z",
          "wordCount": 995,
          "title": "Elastic Cloud with AWS FireLens: Accelerate time to insight with agentless data ingestion"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-cloud-with-aws-firelens-accelerate-time-to-insight-with-agentless-data-ingestion",
          "author": "Akshay Saraswat,Uday Theepireddy",
          "description": ",\nCustomers can now directly ship container logs and events to Elastic Cloud with Amazon Web Services (AWS) FireLens. AWS FireLens is a container log router for Amazon Elastic Container Service (Amazon ECS) launch types: Amazon Elastic Compute Cloud (Amazon EC2) and AWS Fargate. This integration enables DevOps and DevSecOps experts to streamline AWS log management from shipping and cost-efficient log retention, to monitoring and analyzing threats.  \nIn this blog, we will cover how to get started with agentless data ingestion to Elastic Cloud using AWS FireLens. \nStreamline log and event shipping\nTraditionally, shipping container logs and events to different destinations has been a lengthy and challenging process. Say goodbye to time-consuming tasks like sending logs to Cloudwatch, maintain…",
          "link": "https://www.elastic.co/blog/elastic-cloud-with-aws-firelens-accelerate-time-to-insight-with-agentless-data-ingestion",
          "publishedOn": "2021-11-22T13:30:00.000Z",
          "wordCount": 995,
          "title": "Elastic Cloud with AWS FireLens: Accelerate time to insight with agentless data ingestion"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-and-aws-accelerate-your-cloud-migration-journey",
          "author": "Uday Theepireddy,Amena Siddiqi",
          "description": "Learn how Elastic enables organizations to monitor, analyze, and protect AWS and on-premise workloads within a single pane of glass — at every stage of a cloud adoption journey. This can help teams stay on budget and on time.",
          "link": "https://www.elastic.co/blog/elastic-and-aws-accelerate-your-cloud-migration-journey",
          "publishedOn": "2021-11-22T13:00:00.000Z",
          "wordCount": 1411,
          "title": "Elastic and AWS: Accelerating the cloud migration journey"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-and-aws-accelerate-your-cloud-migration-journey",
          "author": "Uday Theepireddy,Amena Siddiqi",
          "description": ",\nCloud offerings deliver cost-efficiency and agility; however, the migration process and management complexity can pose challenges. Elastic enables organizations to monitor, analyze, and protect their Amazon Web Services (AWS) and on-premises workloads within a single unified platform — at every stage of their cloud adoption journey — even as they migrate workloads. This can help ensure time-and-cost savings while reducing risk. \nIn this blog, we will discuss how Elastic and AWS work together to accelerate the workload migration journey and ensure a smooth transition to the cloud.\nBenefits and challenges of cloud adoption\nThere are many business drivers behind digital transformation, from delivering better customer outcomes and improved employee productivity to supporting application mode…",
          "link": "https://www.elastic.co/blog/elastic-and-aws-accelerate-your-cloud-migration-journey",
          "publishedOn": "2021-11-22T13:00:00.000Z",
          "wordCount": 1411,
          "title": "Elastic and AWS: Accelerating the cloud migration journey"
        },
        {
          "id": "https://www.elastic.co/blog/culture-elastic-puts-employee-safety-first-with-covid-19-vaccine-mandate",
          "author": "Shay Banon",
          "description": "Elastic CEO Shay Banon explains how the company decided on a vaccine mandate for in-office employees and why: “We’re putting the safety and comfort of our employees first.”",
          "link": "https://www.elastic.co/blog/culture-elastic-puts-employee-safety-first-with-covid-19-vaccine-mandate",
          "publishedOn": "2021-11-18T15:00:00.000Z",
          "wordCount": 785,
          "title": "Elastic puts employee safety first with COVID-19 vaccine mandate"
        },
        {
          "id": "https://www.elastic.co/blog/culture-elastic-puts-employee-safety-first-with-covid-19-vaccine-mandate",
          "author": "Shay Banon",
          "description": ",\nThis is an internal email I sent that outlines our approach to vaccine mandates and we are sharing a version here to let everyone know the actions we are taking to ensure the safety and well-being of our employees and community.\nWe've thought long and hard about our approach to vaccine mandates. Like most of our decisions on managing COVID-19 to date, we're putting the safety and comfort of our employees first. At the same time,  we did not want to be the first out of the gate and rush into decisions. \nWe can all agree that while things are improving globally, we're still seeing concerning developments with new and mutant variants that we feel a strong need to support vaccination programs. After a lot of work by our workplace safety, legal, and HR teams, who carried out very detailed due…",
          "link": "https://www.elastic.co/blog/culture-elastic-puts-employee-safety-first-with-covid-19-vaccine-mandate",
          "publishedOn": "2021-11-18T15:00:00.000Z",
          "wordCount": 785,
          "title": "Elastic puts employee safety first with COVID-19 vaccine mandate"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-on-microsoft-azure-adds-the-power-of-search-for-accelerated-data-insights",
          "author": "Bryan Nairn,Osman Ishaq",
          "description": "Learn more about deploying Elastic on Microsoft Azure to quickly turn data into valuable insights with end-to-end visibility to monitor and secure your environment.",
          "link": "https://www.elastic.co/blog/elastic-on-microsoft-azure-adds-the-power-of-search-for-accelerated-data-insights",
          "publishedOn": "2021-11-18T13:30:00.000Z",
          "wordCount": 1261,
          "title": "Elastic on Microsoft Azure adds the power of search for accelerated data insights"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-on-microsoft-azure-adds-the-power-of-search-for-accelerated-data-insights",
          "author": "Bryan Nairn,Osman Ishaq",
          "description": ",\nWith Elastic Cloud and Microsoft Azure, you can remove data silos and uncover insights across your Microsoft Azure and on-premises environments. DevOps and IT practitioners can get the most out of their Azure infrastructure and data with Elastic, which adds the power of search to help teams monitor, manage, and protect environments. With Elastic on Azure, practitioners can analyze data logs and events to obtain insights, while DevSecOps and other security engineers can protect against threats by layering endpoint security and security event monitoring.\nIn this blog, we will review how to leverage end-to-end visibility across your Azure environment. We will also cover new enhancements to the Elasticsearch native integration on Azure offering, and subscription options. \nAdding value to you…",
          "link": "https://www.elastic.co/blog/elastic-on-microsoft-azure-adds-the-power-of-search-for-accelerated-data-insights",
          "publishedOn": "2021-11-18T13:30:00.000Z",
          "wordCount": 1261,
          "title": "Elastic on Microsoft Azure adds the power of search for accelerated data insights"
        },
        {
          "id": "https://www.elastic.co/blog/culture-how-two-elastic-community-contributor-award-winners-became-amazing-elasticians",
          "author": "David Kravets",
          "description": "We created the Elastic Contributor Program to recognize and reward folks for sharing code, organizing and presenting at community events, and for writing about Elastic. Two Elastic Contributor winners are now Elasticians. This is their journey.",
          "link": "https://www.elastic.co/blog/culture-how-two-elastic-community-contributor-award-winners-became-amazing-elasticians",
          "publishedOn": "2021-11-17T14:00:00.000Z",
          "wordCount": 1045,
          "title": "How two Elastic Community Contributor award winners became amazing Elasticians"
        },
        {
          "id": "https://www.elastic.co/blog/culture-how-two-elastic-community-contributor-award-winners-became-amazing-elasticians",
          "author": "David Kravets",
          "description": ",\nEvery year Elastic recognizes exceptional community members from across the globe with the Elastic Contributor Program. These Elastic champions have earned points for organizing events, delivering presentations, contributing code, writing or translating articles, and creating video tutorials -- all to advance in their careers. \nTwo of our recent Elastic Contributor Program winners took their love of Elastic and our technology to the next level by becoming full-time Elasticians. We couldn’t be prouder to share the journeys of Peter Steenbergen and Philipp Kahr, from contributor to Elastician.\nPeter Steenbergen, Senior Solutions Architect, Netherlands \nhttps://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt47808c58035e16ae/618c608700783f138785de70/elastic-blog-Peter-Steenbergen.jpg…",
          "link": "https://www.elastic.co/blog/culture-how-two-elastic-community-contributor-award-winners-became-amazing-elasticians",
          "publishedOn": "2021-11-17T14:00:00.000Z",
          "wordCount": 1045,
          "title": "How two Elastic Community Contributor award winners became amazing Elasticians"
        }
      ]
    },
    {
      "title": "Ansible Blog",
      "feedUrl": "https://www.ansible.com/blog/rss.xml",
      "siteUrl": "https://www.ansible.com/blog",
      "articles": [
        {
          "id": "https://www.ansible.com/blog/introducing-red-hat-ansible-automation-platform-2.1",
          "author": "scavanau@redhat.com (Sean Cavanaugh)",
          "description": "We are thrilled to announce the general availability of Red Hat Ansible Automation Platform 2.1. This is the follow-on to the Ansible Automation Platform 2.0 Early Access released this summer, and announced at AnsibleFest 2021. Red Ansible Automation Platform 2.1 introduces major features that allow customers to onboard more easily with even more flexible automation architectures and use cases. Ansible Automation Platform 2.1 is the culmination of many years of reimagining how enterprise automators automate for today and tomorrow.",
          "link": "https://www.ansible.com/blog/introducing-red-hat-ansible-automation-platform-2.1",
          "publishedOn": "2021-12-02T13:30:00.000Z",
          "wordCount": 2742,
          "title": "Introducing Red Hat Ansible Automation Platform 2.1"
        },
        {
          "id": "https://www.ansible.com/blog/2022-the-year-for-edge-automation",
          "author": "Dafné Mendoza",
          "description": "Seamlessly, every single day, we wake up and check our health statistics in smart watches, scan QR codes to validate information, pay using credit cards in different locations, use surveillance cameras to record our neighborhoods, and connect our smartphones to distributed WiFi access points in our restaurants or coffee shops. According to the Statista, in the Forecast number of mobile users worldwide 2020-2025[1] report, the number of mobile users worldwide reached 7.1 billion in 2021, and this number is projected to grow. This initiates a new set of use cases for edge devices due to the explosive growth of network-connected entry points.",
          "link": "https://www.ansible.com/blog/2022-the-year-for-edge-automation",
          "publishedOn": "2021-11-22T19:13:15.000Z",
          "wordCount": 2424,
          "title": "Why 2022 will be the year for edge automation"
        },
        {
          "id": "https://www.ansible.com/blog/automation-for-the-cloud-cloud-field-day-12-recap",
          "author": "scavanau@redhat.com (Sean Cavanaugh)",
          "description": "I recently had the opportunity to present our Red Hat Ansible Automation Platform cloud strategy at Cloud Field Day 12. \nCloud Field Day 12 was a three day event that focused on the impact of cloud on enterprise IT. As a presenter, you can use any combination of slides and live demos to foster a discussion with a group of thought leaders. This roundtable included people from many different companies, skill sets, backgrounds and favorite tools. Check out the Cloud Field Day website to see the delegate panel, their backgrounds and Twitter handles. I quite enjoyed, and preferred, the conversational tone of Cloud Field Day, and the delegates who asked questions during the demo made it a lot more interactive.",
          "link": "https://www.ansible.com/blog/automation-for-the-cloud-cloud-field-day-12-recap",
          "publishedOn": "2021-11-18T13:45:00.000Z",
          "wordCount": 1221,
          "title": "Automation for the cloud: Cloud Field Day 12 recap"
        },
        {
          "id": "https://www.ansible.com/blog/automation-controller-workflow-deployment-as-code",
          "author": "Sean Sullivan",
          "description": "Background: The Automation Controller Collection\n \r\nThe Automation Controller Collection allows Ansible Playbooks to automate the interaction with automation controller. For example, manually interacting via the Web-based UI or the API can now be automated just as the targets it manages.",
          "link": "https://www.ansible.com/blog/automation-controller-workflow-deployment-as-code",
          "publishedOn": "2021-11-15T14:00:00.000Z",
          "wordCount": 2101,
          "title": "Automation controller workflow deployment as code"
        },
        {
          "id": "https://www.ansible.com/blog/automating-execution-environment-image-builds-with-github-actions",
          "author": "cmcnaugh@redhat.com (Colin McNaughton)",
          "description": "Ansible Automation Platform 2 leverages containers dubbed automation execution environments which bundle in collection, python and platform dependencies to provide predictable, self-contained automation spaces that can be easily distributed across an organization.",
          "link": "https://www.ansible.com/blog/automating-execution-environment-image-builds-with-github-actions",
          "publishedOn": "2021-11-11T14:00:00.000Z",
          "wordCount": 924,
          "title": "Automating execution environment image builds with GitHub Actions"
        }
      ]
    },
    {
      "title": "Azure DevOps Blog",
      "feedUrl": "https://devblogs.microsoft.com/devops/feed/",
      "siteUrl": "https://devblogs.microsoft.com/devops",
      "articles": [
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62907",
          "author": "Jay Gordon",
          "description": "Welcome back! I am Jay Gordon and every week I try to bring you the latest updates from around the DevOps on Azure community. If you have a post you’d like to have me include, I am always listening. You can reach out on Twitter or LinkedIn and I will be sure to share your latest post with the community.\nThe post Top Stories from the Microsoft DevOps Community – 2021.12.03 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-12-03/",
          "publishedOn": "2021-12-03T11:00:31.000Z",
          "wordCount": 1494,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.12.03"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62906",
          "author": "April Edwards",
          "description": "Azure Static Web Apps were launched earlier in 2021 and out of the box they had the capability to integrate your existing repository and deploy your Static Web App from Azure DevOps. You can reference the full getting started guide for the end-to-end deployment setup.\nThe post Automating Azure Static Web Apps in Azure Pipelines appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/automating-azure-static-web-apps-in-azure-pipelines/",
          "publishedOn": "2021-12-02T16:56:59.000Z",
          "wordCount": 1144,
          "title": "Automating Azure Static Web Apps in Azure Pipelines"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62880",
          "author": "Jay Gordon",
          "description": "After a short break for some Microsoft streaming events, AzureFunBytes returns to LearnTV for another fun conversation about the products, people, and services that make for a delightful Azure experience.\nThe post AzureFunBytes Episode 62 – Supercharge your Java Apps on Azure with @rorypreddy appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-episode-62-supercharge-your-java-apps-on-azure-with-rorypreddy/",
          "publishedOn": "2021-12-02T10:00:43.000Z",
          "wordCount": 1608,
          "title": "AzureFunBytes Episode 62 – Supercharge your Java Apps on Azure with @rorypreddy"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62891",
          "author": "Rajesh Ramamurthy (MSFT)",
          "description": "Due to the potential for future protocol downgrade attacks and other Transport Layer Security (TLS) protocol versions 1.0 and 1.1 vulnerabilities not specific to Microsoft’s implementation, it is required that dependencies on all security protocols older than TLS 1.2 be removed wherever possible.\nThe post Deprecating weak cryptographic standards (TLS 1.0 and TLS 1.1) in Azure DevOps appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/deprecating-weak-cryptographic-standards-tls-1-0-and-tls-1-1-in-azure-devops/",
          "publishedOn": "2021-11-30T19:41:48.000Z",
          "wordCount": 1629,
          "title": "Deprecating weak cryptographic standards (TLS 1.0 and TLS 1.1) in Azure DevOps"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62857",
          "author": "Martina",
          "description": "The team is excited to release the public preview of the Ux modernization for Azure Boards! The web platform has been updated to provide a faster Ux, consistency with other parts of the product, and accessibility compliance.\nThe post Azure Boards Ux Modernization – Public Preview appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azure-boards-ux-modernization-public-preview/",
          "publishedOn": "2021-11-29T16:41:30.000Z",
          "wordCount": 2291,
          "title": "Azure Boards Ux Modernization – Public Preview"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62849",
          "author": "Jay Gordon",
          "description": "The top stories from the #AzureDevOps #community for 2021.11.26 are here!\nThe post Top Stories from the Microsoft DevOps Community – 2021.11.26 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-11-26/",
          "publishedOn": "2021-11-26T11:00:58.000Z",
          "wordCount": 1597,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.11.26"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62832",
          "author": "Jay Gordon",
          "description": "Welcome back! I am Jay Gordon and every week I try to bring you the latest updates from around the DevOps on Azure community. If you have a post you’d like to have me include, I am always listening. You can reach out on Twitter or LinkedIn and I will be sure to share your latest post with the community.\nThe post Top Stories from the Microsoft DevOps Community – 2021.11.19 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-11-19/",
          "publishedOn": "2021-11-19T11:00:35.000Z",
          "wordCount": 1456,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.11.19"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62801",
          "author": "Jay Gordon",
          "description": "Welcome back! I am Jay Gordon and every week I try to bring you the latest updates from around the DevOps on Azure community. If you have a post you’d like to have me include, I am always listening. You can reach out on Twitter or LinkedIn and I will be sure to share your latest post with the community.\nThe post Top Stories from the Microsoft DevOps Community – 2021.11.12 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-11-12/",
          "publishedOn": "2021-11-12T10:00:58.000Z",
          "wordCount": 1415,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.11.12"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62780",
          "author": "pazand",
          "description": "If you’ve run into trouble while trying to publish an Azure DevOps or Visual Studio extension to the Visual Studio Marketplace, please ask your administrator if they have enabled the new policy to restrict the creation of global personal access tokens (PATs).\nThe post Known issue with publishing extensions: “Your ability to create global personal access tokens (PATs) is restricted by your organization.” appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/issue-with-extension-publishing/",
          "publishedOn": "2021-11-09T19:04:40.000Z",
          "wordCount": 1275,
          "title": "Known issue with publishing extensions: “Your ability to create global personal access tokens (PATs) is restricted by your organization.”"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62700",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes Episode 61 – Deploying to @Azure is one “git push” away with @juliendubois appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-episode-61-deploying-to-azure-is-one-git-push-away-with-juliendubois/",
          "publishedOn": "2021-11-09T13:00:07.000Z",
          "wordCount": 1454,
          "title": "AzureFunBytes Episode 61 – Deploying to @Azure is one “git push” away with @juliendubois"
        }
      ]
    },
    {
      "title": "Discover Dev",
      "feedUrl": "https://www.discoverdev.io/rss.xml",
      "siteUrl": "http://discoverdev.io",
      "articles": [
        {
          "id": "http://discoverdev.io/archive/2021-11-24.html",
          "author": null,
          "description": "CarbonJ: A high performance, high-scale, drop-in replacement for carbon-cache and carbon-relay \n \n          \n            \n Mobile Performance @ Lyft \n \n          \n            \n Presentation: eBPF - Superpowers for Cloud Native Operations \n \n          \n            \n How do CRDTs solve distributed data consistency challenges? \n \n          \n            \n Grammar Correction as You Type, on Pixel 6",
          "link": "http://discoverdev.io/archive/2021-11-24.html",
          "publishedOn": "2021-11-24T00:00:00.000Z",
          "wordCount": 84,
          "title": "DiscoverDev - curated engineering articles for Wed, 24 Nov 2021"
        }
      ]
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "http://feeds.feedburner.com/AmazonWebServicesBlog",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "7d40e463227e81077de707dea4aea2845e47e6b2",
          "author": "Channy Yun",
          "description": "Last AWS re:Invent 2020, we announced FreeRTOS Long Term Support (LTS) that offers a more stable foundation than standard releases, as manufacturers deploy and later update devices in the field. FreeRTOS is an open source, real-time operating system for microcontrollers that makes small, low-power edge devices easy to program, deploy, secure, connect, and manage. In […]",
          "link": "https://aws.amazon.com/blogs/aws/new-freertos-extended-maintenance-plan-for-up-to-10-years/",
          "publishedOn": "2021-12-02T18:21:16.000Z",
          "wordCount": 1239,
          "title": "New – FreeRTOS Extended Maintenance Plan for Up to 10 Years"
        },
        {
          "id": "52c5a244baa151c58d56f8df62c2df1d96c3c3b5",
          "author": "Steve Roberts",
          "description": "The internet is an excellent resource for well-intentioned guidance and answers. However, it can sometimes be hard to tell if what you’re reading is, in fact, advice you should follow. Also, some users have a preference toward using a single, trusted online community rather than the open internet to provide them with reliable, vetted, and […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-repost-a-reimagined-qa-experience-for-the-aws-community/",
          "publishedOn": "2021-12-02T18:06:29.000Z",
          "wordCount": 1078,
          "title": "AWS re:Post – A Reimagined Q&A Experience for the AWS Community"
        },
        {
          "id": "f1fac23aefd780d5623728bb3569f0b331f5fa54",
          "author": "Alex Casalboni",
          "description": "The AWS Well-Architected Framework has been helping AWS customers improve their cloud architectures since 2015. The framework consists of design principles, questions, and best practices across multiple pillars: Operational Excellence, Security, Reliability, Performance Efficiency, and Cost Optimization. Today we are introducing a new Sustainability Pillar to help organizations learn, measure, and improve their workloads using […]",
          "link": "https://aws.amazon.com/blogs/aws/sustainability-pillar-well-architected-framework/",
          "publishedOn": "2021-12-02T18:05:16.000Z",
          "wordCount": 1460,
          "title": "New – Sustainability Pillar for AWS Well-Architected Framework"
        },
        {
          "id": "baeea21fcb7d874432a757c3ba44fce9acd8b91b",
          "author": "Steve Roberts",
          "description": "Today, I’m happy to announce that both the Construct Hub and AWS Cloud Development Kit (AWS CDK) version 2 are now generally available (GA). The AWS CDK is an open-source framework that simplifies working with cloud resources using familiar programming languages: C#, TypeScript, Java, Python, and Go (in developer preview). Within their applications, developers create […]",
          "link": "https://aws.amazon.com/blogs/aws/announcing-general-availability-of-construct-hub-and-aws-cloud-development-kit-version-2/",
          "publishedOn": "2021-12-02T17:48:12.000Z",
          "wordCount": 1669,
          "title": "Announcing General Availability of Construct Hub and AWS Cloud Development Kit Version 2"
        },
        {
          "id": "699ccea03204f481929c95c6a5aa2c90f42d3171",
          "author": "Sébastien Stormacq",
          "description": "Last year at AWS re:Invent, Jeff Barr wrote about the exciting availability of Amazon Elastic Compute Cloud (Amazon EC2) Mac instances. Today, we’re announcing the preview of a new EC2 M1 Mac instance. The introduction of EC2 Mac instances brought the flexibility, scalability, and cost benefits of AWS to all Apple developers. EC2 Mac instances […]",
          "link": "https://aws.amazon.com/blogs/aws/use-amazon-ec2-m1-mac-instances-to-build-test-macos-ios-ipados-tvos-and-watchos-apps/",
          "publishedOn": "2021-12-02T16:38:32.000Z",
          "wordCount": 1316,
          "title": "Use New Amazon EC2 M1 Mac Instances to Build & Test Apps for iPhone, iPad, Mac, Apple Watch, and Apple TV"
        },
        {
          "id": "55ab2625372c8e72c8276741e6a5057f4a9040ab",
          "author": "Sébastien Stormacq",
          "description": "We are launching AWS Direct Connect SiteLink, a new capability of AWS Direct Connect that lets you create connections between your on-premises networks through the AWS global network backbone. Until today, when you needed direct connectivity between your data centers or branch offices, you had to rely on public internet or expensive and hard-to-deploy fixed […]",
          "link": "https://aws.amazon.com/blogs/aws/new-site-to-site-connectivity-with-aws-direct-connect-sitelink/",
          "publishedOn": "2021-12-01T23:35:03.000Z",
          "wordCount": 1125,
          "title": "New – Site-to-Site Connectivity with AWS Direct Connect SiteLink"
        },
        {
          "id": "8644204a7230b8ce822a50054999a4a95a9027bb",
          "author": "Alex Casalboni",
          "description": "Hundreds of thousands of customers use Amazon Simple Queue Service (SQS) to build message-based applications to decouple and scale microservices, distributed systems, and serverless apps. When a message cannot be successfully processed by the queue consumer, you can configure SQS to store it in a dead-letter queue (DLQ). As a software developer or architect, you’d […]",
          "link": "https://aws.amazon.com/blogs/aws/enhanced-dlq-management-sqs/",
          "publishedOn": "2021-12-01T23:29:08.000Z",
          "wordCount": 1685,
          "title": "New – Enhanced Dead-letter Queue Management Experience for Amazon SQS Standard Queues"
        },
        {
          "id": "91077886bb96f2e3b9a037e2c2d884a56171b3cb",
          "author": "Steve Roberts",
          "description": "Managing, monitoring, and auditing IP address allocation for at-scale networks, as the growth in cloud workloads and connected devices continues at a rapid pace, is a complex, time-consuming, and potentially error-prone task. Traditionally, network administrators have resorted to using combinations of spreadsheets, home-grown tools, and scripts to track address assignments across multiple accounts, virtual private […]",
          "link": "https://aws.amazon.com/blogs/aws/network-address-management-and-auditing-at-scale-with-amazon-vpc-ip-address-manager/",
          "publishedOn": "2021-12-01T23:25:37.000Z",
          "wordCount": 1623,
          "title": "Network Address Management and Auditing at Scale with Amazon VPC IP Address Manager"
        },
        {
          "id": "82f2efc595c375405b34fa67c8fc70587c4a2d27",
          "author": "Jeff Barr",
          "description": "If you are a member of your organization’s networking, cloud operations, or security teams, you are going to love this new feature. The new Amazon VPC Network Access Analyzer helps you identify network configurations that lead to unintended network access. As you will see in a moment, it will point out ways that you can […]",
          "link": "https://aws.amazon.com/blogs/aws/new-amazon-vpc-network-access-analyzer/",
          "publishedOn": "2021-12-01T23:24:12.000Z",
          "wordCount": 1562,
          "title": "New – Amazon VPC Network Access Analyzer"
        },
        {
          "id": "25af4ed6c26e6c324812d06b1d417d07416f6636",
          "author": "Channy Yun",
          "description": "In 2016, we launched AWS Shield, a managed Distributed Denial of Service (DDoS) protection service that safeguards applications running on AWS. AWS Shield provides always-on detection and automatic inline mitigations that minimize application downtime and latency without needing to contact AWS Support. There are two tiers of AWS Shield: Standard and Advanced. All AWS customers […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-shield-advanced-update-automatic-application-layer-ddos-mitigation/",
          "publishedOn": "2021-12-01T23:22:49.000Z",
          "wordCount": 1361,
          "title": "AWS Shield Advanced Update – Automatic Application Layer DDoS Mitigation"
        },
        {
          "id": "36dd9d3bf20f530368ca29c6cf90d04d91dc31f4",
          "author": "Antje Barth",
          "description": "As a woman working in information technology (IT) for many years, it has always been close to my heart to challenge long-standing gender stereotypes and inspire more young learners to consider a career in tech. With artificial intelligence (AI) and machine learning (ML) defining the future of technology, this future also depends on diverse representation. […]",
          "link": "https://aws.amazon.com/blogs/aws/new-aws-scholarship-program-helps-underrepresented-and-underserved-students-prep-for-careers-in-ai-and-ml/",
          "publishedOn": "2021-12-01T18:30:24.000Z",
          "wordCount": 1518,
          "title": "New AWS Scholarship Program Helps Underrepresented and Underserved Students Prep for Careers in AI and ML"
        },
        {
          "id": "1927d6ce6648e935cc728859b8d14b9d628b7745",
          "author": "Antje Barth",
          "description": "Our mission at AWS is to make machine learning (ML) more accessible. Through many conversations over the past years, I learned about barriers that many ML beginners face. Existing ML environments are often too complex for beginners, or too limited to support modern ML experimentation. Beginners want to quickly start learning and not worry about […]",
          "link": "https://aws.amazon.com/blogs/aws/now-in-preview-amazon-sagemaker-studio-lab-a-free-service-to-learn-and-experiment-with-ml/",
          "publishedOn": "2021-12-01T18:25:48.000Z",
          "wordCount": 1693,
          "title": "Now in Preview – Amazon SageMaker Studio Lab, a Free Service to Learn and Experiment with ML"
        },
        {
          "id": "57696c6a1a2c6cfda41e948287037f5b21ead2e8",
          "author": "Sean M. Tracey",
          "description": "Today, we’re pleased to announce Amazon SageMaker Inference Recommender — a brand-new Amazon SageMaker Studio capability that automates load testing and optimizes model performance across machine learning (ML) instances. Ultimately, it reduces the time it takes to get ML models from development to production and optimizes the costs associated with their operation. Until now, no […]",
          "link": "https://aws.amazon.com/blogs/aws/announcing-amazon-sagemaker-inference-recommender/",
          "publishedOn": "2021-12-01T18:07:08.000Z",
          "wordCount": 998,
          "title": "Announcing Amazon SageMaker Inference Recommender"
        },
        {
          "id": "9062a6f94e60c2751154482eb447547bf95806bb",
          "author": "Sean M. Tracey",
          "description": "Today, we’re pleased to announce Amazon SageMaker Training Compiler, a new Amazon SageMaker capability that can accelerate the training of deep learning (DL) models by up to 50%. As DL models grow in complexity, so too does the time it can take to optimize and train them. For example, it can take 25,000 GPU-hours to […]",
          "link": "https://aws.amazon.com/blogs/aws/new-introducing-sagemaker-training-compiler/",
          "publishedOn": "2021-12-01T18:06:17.000Z",
          "wordCount": 1238,
          "title": "New – Introducing SageMaker Training Compiler"
        },
        {
          "id": "15e2986b6ad7e2ed810c28b51458fd55c9ec0c01",
          "author": "Sean M. Tracey",
          "description": "Today, we’re very excited to offer three new enhancements to our Amazon SageMaker Studio service. As of now, users of SageMaker Studio can create, terminate, manage, discover, and connect to Amazon EMR clusters running within a single AWS account and in shared accounts across an organization—all directly from SageMaker Studio. Furthermore, SageMaker Studio Notebook users […]",
          "link": "https://aws.amazon.com/blogs/aws/new-create-and-manage-emr-clusters-and-spark-jobs-with-amazon-sagemaker-studio/",
          "publishedOn": "2021-12-01T18:03:48.000Z",
          "wordCount": 1240,
          "title": "New – Create and Manage EMR Clusters and Spark Jobs with Amazon SageMaker Studio"
        },
        {
          "id": "90908fa995f0be9abc2109eedc874cd9fc8553ef",
          "author": "Sean M. Tracey",
          "description": "Today, we’re pleased to announce the latest service in the Amazon SageMaker suite that will make labeling datasets easier than ever before. Ground Truth Plus is a turn-key service that uses an expert workforce to deliver high-quality training datasets fast, and reduces costs by up to 40 percent. The Challenges of Machine Learning Model Creation […]",
          "link": "https://aws.amazon.com/blogs/aws/announcing-amazon-sagemaker-ground-truth-plus/",
          "publishedOn": "2021-12-01T18:00:17.000Z",
          "wordCount": 1607,
          "title": "Announcing Amazon SageMaker Ground Truth Plus"
        },
        {
          "id": "0ca1e66606cb25277f37424382ba8f4fc650c532",
          "author": "Marcia Villalba",
          "description": "Today we are announcing Amazon DynamoDB Standard-Infrequent Access (DynamoDB Standard-IA). A new table class for DynamoDB that reduces storage costs by 60 percent compared to existing DynamoDB Standard tables, and that delivers the same performance, durability, and scaling. Nowadays, many customers are moving their infrequently accessed data between DynamoDB and Amazon Simple Storage Service (Amazon […]",
          "link": "https://aws.amazon.com/blogs/aws/new-dynamodb-table-class-save-up-to-60-in-your-dynamodb-costs/",
          "publishedOn": "2021-12-01T16:58:46.000Z",
          "wordCount": 1042,
          "title": "New DynamoDB Table Class – Save Up To 60% in Your DynamoDB Costs"
        },
        {
          "id": "0a304ebf551106001072e05ee8faa86c88be77c3",
          "author": "Channy Yun",
          "description": "On October 26, 2021, we launched Amazon RDS Custom for Oracle, a managed database service for applications that require customization of the underlying operating system and database environment. RDS Custom lets you access and customize your database server host and operating system, for example, by applying special patches and changing the database software settings to […]",
          "link": "https://aws.amazon.com/blogs/aws/new-amazon-rds-custom-for-sql-server-is-generally-available/",
          "publishedOn": "2021-12-01T16:54:46.000Z",
          "wordCount": 1689,
          "title": "New – Amazon RDS Custom for SQL Server Is Generally Available"
        },
        {
          "id": "0babac98dfd335531b1699c60e9d6bf5ef545aec",
          "author": "Marcia Villalba",
          "description": "Today we are announcing Amazon DevOps Guru for RDS, a new capability for Amazon DevOps Guru. It allows developers to easily detect, diagnose, and resolve performance and operational issues in Amazon Aurora. Hundreds of thousands of customers nowadays are using Amazon Aurora because it is highly available, scalable, and durable. But as applications grow in […]",
          "link": "https://aws.amazon.com/blogs/aws/new-amazon-devops-guru-for-rds-to-detect-diagnose-and-resolve-amazon-aurora-related-issues-using-ml/",
          "publishedOn": "2021-12-01T16:51:42.000Z",
          "wordCount": 1454,
          "title": "New – Amazon DevOps Guru for RDS to Detect, Diagnose, and Resolve Amazon Aurora-Related Issues using ML"
        },
        {
          "id": "761df4d7e43dcf9cf7d21b7218211e17b9e6ca4a",
          "author": "Sébastien Stormacq",
          "description": "Today, we are announcing two additional capabilities of Amazon FSx for Lustre. First, a full bi-directional synchronization of your file systems with Amazon Simple Storage Service (Amazon S3), including deleted files and objects. Second, the ability to synchronize your file systems with multiple S3 buckets or prefixes. Lustre is a large scale, distributed parallel file […]",
          "link": "https://aws.amazon.com/blogs/aws/enhanced-amazon-s3-integration-for-amazon-fsx-for-lustre/",
          "publishedOn": "2021-12-01T00:21:40.000Z",
          "wordCount": 2000,
          "title": "Enhanced Amazon S3 Integration for Amazon FSx for Lustre"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/atom.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2550/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/webb.png\" title=\"Each one contains a chocolate shaped like a famous spacecraft and, for the later numbers, a pamphlet on managing anxiety.\" alt=\"Each one contains a chocolate shaped like a famous spacecraft and, for the later numbers, a pamphlet on managing anxiety.\" />",
          "link": "https://xkcd.com/2550/",
          "publishedOn": "2021-12-03T00:00:00.000Z",
          "wordCount": 183,
          "title": "Webb"
        },
        {
          "id": "https://xkcd.com/2549/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/edge_cake.png\" title=\"Every time IERS adds or removes a leap second, they send me a birthday cake out of superstition.\" alt=\"Every time IERS adds or removes a leap second, they send me a birthday cake out of superstition.\" />",
          "link": "https://xkcd.com/2549/",
          "publishedOn": "2021-12-01T00:00:00.000Z",
          "wordCount": 185,
          "title": "Edge Cake"
        },
        {
          "id": "https://xkcd.com/2548/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/awful_people.png\" title=\"Hm, this burger place has a couple of good reviews, but LakeSlayer7 says he got food poisoning there and everyone should try this other place down by the lake instead.\" alt=\"Hm, this burger place has a couple of good reviews, but LakeSlayer7 says he got food poisoning there and everyone should try this other place down by the lake instead.\" />",
          "link": "https://xkcd.com/2548/",
          "publishedOn": "2021-11-29T00:00:00.000Z",
          "wordCount": 185,
          "title": "Awful People"
        },
        {
          "id": "https://xkcd.com/2547/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/siren.png\" title=\"Directions from CITY OF TROY to ITHACA / Total time: 10y 54d 14h 25m / Warning: Route crosses an international border / route includes capture by the goddess Calypso / route includes a ferry\" alt=\"Directions from CITY OF TROY to ITHACA / Total time: 10y 54d 14h 25m / Warning: Route crosses an international border / route includes capture by the goddess Calypso / route includes a ferry\" />",
          "link": "https://xkcd.com/2547/",
          "publishedOn": "2021-11-26T00:00:00.000Z",
          "wordCount": 183,
          "title": "Siren"
        }
      ]
    },
    {
      "title": "Camunda",
      "feedUrl": "https://camunda.com/feed/",
      "siteUrl": "https://camunda.com",
      "articles": [
        {
          "id": "https://camunda.com/?p=37914",
          "author": "Christian Connors",
          "description": "Get details on how solutions built with Camunda enabled Covea to organize data more effectively and create an even-stronger user experience.\nThe post The Secret Behind the IT Transformation of Covéa Insurance appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/12/the-secret-behind-the-it-transformation-of-covea-insurance/",
          "publishedOn": "2021-12-02T14:00:00.000Z",
          "wordCount": 1835,
          "title": "The Secret Behind the IT Transformation of Covéa Insurance"
        },
        {
          "id": "https://camunda.com/?p=37672",
          "author": "Niall Deehan",
          "description": "Learn how using Camunda’s process engine in your Java application will make development easier and save you time. \nThe post How Developing Java Apps is Easier with a Process Engine appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/11/how-developing-java-apps-is-easier-with-a-process-engine/",
          "publishedOn": "2021-11-26T14:00:00.000Z",
          "wordCount": 2220,
          "title": "How Developing Java Apps is Easier with a Process Engine"
        },
        {
          "id": "https://camunda.com/?p=37690",
          "author": "Bernd Ruecker",
          "description": "All the questions we didn't have time to answer at the recent 3 Superpowers for Next Level Microservices Orchestration webinar \nThe post 3 Superpowers for Next Level Microservices Orchestration Recap appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/11/3-superpowers-for-next-level-microservices-orchestration-recap/",
          "publishedOn": "2021-11-23T14:31:00.000Z",
          "wordCount": 1896,
          "title": "3 Superpowers for Next Level Microservices Orchestration Recap"
        },
        {
          "id": "https://camunda.com/?p=37324",
          "author": "David Simmons",
          "description": "Wondering how to make a SSO implementation work in Camunda? Have no fear. The answer you've been waiting for is here! \nThe post Q&A: The One with the SSO Implementation in Camunda appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/11/qa-the-one-with-the-sso-implementation-in-camunda/",
          "publishedOn": "2021-11-18T14:30:00.000Z",
          "wordCount": 2497,
          "title": "Q&A: The One with the SSO Implementation in Camunda"
        },
        {
          "id": "https://camunda.com/?p=36771",
          "author": "Christian Connors",
          "description": "Dig into how Intuit used workflow automation to manage 396 transactions per second during its most demanding months.\nThe post How Intuit Managed 19M Processes During Peak Tax, Accounting Seasons appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/11/how-intuit-managed-19m-processes-during-peak-tax-accounting-seasons/",
          "publishedOn": "2021-11-16T14:00:00.000Z",
          "wordCount": 1831,
          "title": "How Intuit Managed 19M Processes During Peak Tax, Accounting Seasons"
        },
        {
          "id": "https://camunda.com/?p=36489",
          "author": "Luca Buchholz",
          "description": "Our next cohort of Camunda Champions are about to begin. Take a look at our new recruits and learn how to join the program.\nThe post More Amazing Camunda Champions Loading… appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/11/more-amazing-camunda-champions-loading/",
          "publishedOn": "2021-11-11T07:05:00.000Z",
          "wordCount": 1551,
          "title": "More Amazing Camunda Champions Loading…"
        },
        {
          "id": "https://camunda.com/?p=36369",
          "author": "Camunda Cloud Team",
          "description": "Get started with Camunda Cloud 1.3.0-alpha1 now! The alpha includes bug fixes and the preparations for the next 1.3.0 release. \nThe post Camunda Cloud 1.3.0-alpha1 Released appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/11/camunda-cloud-1-3-0-alpha1-released/",
          "publishedOn": "2021-11-09T15:45:23.000Z",
          "wordCount": 1618,
          "title": "Camunda Cloud 1.3.0-alpha1 Released"
        },
        {
          "id": "https://camunda.com/?p=36192",
          "author": "Camunda Optimize Team",
          "description": "We’re excited to announce the release of Camunda Optimize 3.7.0-alpha1. Get started by downloading the release or signing up for a free trial.\nThe post Camunda Optimize 3.7.0-alpha1 Released appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/11/camunda-optimize-3-7-0-alpha1-released/",
          "publishedOn": "2021-11-09T07:15:00.000Z",
          "wordCount": 1540,
          "title": "Camunda Optimize 3.7.0-alpha1 Released"
        },
        {
          "id": "https://camunda.com/?p=35939",
          "author": "Camunda Platform Team",
          "description": "We're pleased to announce the next alpha release of Camunda Platform Runtime 7.17.0. Download Camunda for free or run it with Dock.\nThe post Camunda Automation Platform 7.17.0-alpha1 Released appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/11/camunda-automation-platform-7170-alpha1-released/",
          "publishedOn": "2021-11-09T07:05:00.000Z",
          "wordCount": 1491,
          "title": "Camunda Automation Platform 7.17.0-alpha1 Released"
        }
      ]
    },
    {
      "title": "となりのヤングジャンプ（ワンパンマン）",
      "feedUrl": "https://tonarinoyj.jp/rss/series/13932016480028984490",
      "siteUrl": "https://tonarinoyj.jp/episode/13932016480028985383",
      "articles": [
        {
          "id": "tonarino_yj:episode:3269754496631846058",
          "author": "原作/ＯＮＥ/漫画/村田雄介",
          "description": "ワンパンマン",
          "link": "https://tonarinoyj.jp/episode/3269754496631846058",
          "publishedOn": "2021-12-03T03:00:00.000Z",
          "wordCount": 102,
          "title": "[第199話] ワンパンマン",
          "enclosure": {
            "url": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/3269754496631846058-c7dd3c2f16360158ecc6996416436b13",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "tonarino_yj:episode:3269754496620290741",
          "author": "原作/ＯＮＥ/漫画/村田雄介",
          "description": "ワンパンマン",
          "link": "https://tonarinoyj.jp/episode/3269754496620290741",
          "publishedOn": "2021-11-26T15:00:00.000Z",
          "wordCount": 102,
          "title": "[第198話] ワンパンマン",
          "enclosure": {
            "url": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/3269754496620290741-5887ebef7d8cdda60fa72f308f75ba6b",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "tonarino_yj:episode:3269754496597544962",
          "author": "原作/ＯＮＥ/漫画/村田雄介",
          "description": "ワンパンマン",
          "link": "https://tonarinoyj.jp/episode/3269754496597544962",
          "publishedOn": "2021-11-12T15:00:00.000Z",
          "wordCount": 102,
          "title": "[第197話] ワンパンマン",
          "enclosure": {
            "url": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/3269754496597544962-6bd22dfba9c4f417221b474ccbad2401",
            "length": "0",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.com/blog/all.atom",
      "siteUrl": "https://github.blog",
      "articles": [
        {
          "id": "https://github.blog/2021-12-03-release-radar-nov-2021/",
          "author": null,
          "description": "The end of the year is getting closer, and our communities are busy working away on their projects. While you&#8217;ve all been busy maintaining open source projects and shipping releases, we&#8217;ve created a new open",
          "link": "https://github.blog/2021-12-03-release-radar-nov-2021/",
          "publishedOn": "2021-12-03T22:00:35.000Z",
          "wordCount": 1236,
          "title": "Release Radar · November 2021 Edition"
        },
        {
          "id": "https://github.blog/2021-12-01-github-availability-report-november-2021/",
          "author": null,
          "description": "In November, we experienced one incident resulting in significant impact and degraded state of availability for multiple services.",
          "link": "https://github.blog/2021-12-01-github-availability-report-november-2021/",
          "publishedOn": "2021-12-01T20:14:04.000Z",
          "wordCount": 658,
          "title": "GitHub Availability Report: November 2021"
        },
        {
          "id": "https://github.blog/2021-12-01-using-chatops-to-help-actions-on-call-engineers/",
          "author": null,
          "description": "You can multiply the impact of your domain experts by building their common workflows into ChatOps.",
          "link": "https://github.blog/2021-12-01-using-chatops-to-help-actions-on-call-engineers/",
          "publishedOn": "2021-12-01T18:01:09.000Z",
          "wordCount": 1627,
          "title": "Using ChatOps to help Actions on-call engineers"
        },
        {
          "id": "https://github.blog/2021-11-30-github-externships-enabling-indias-next-generation-of-developers/",
          "author": null,
          "description": "Are you a student in India? Applications are open for the GitHub Externships Winter Cohort!",
          "link": "https://github.blog/2021-11-30-github-externships-enabling-indias-next-generation-of-developers/",
          "publishedOn": "2021-12-01T03:30:25.000Z",
          "wordCount": 749,
          "title": "GitHub Externships: enabling India’s next generation of developers"
        },
        {
          "id": "https://github.blog/2021-11-30-5-devops-tips-to-speed-up-your-developer-workflow/",
          "author": null,
          "description": "From learning YAML to scripting with Bash, here are a few simple tips for developers who want to speed up their workflows.",
          "link": "https://github.blog/2021-11-30-5-devops-tips-to-speed-up-your-developer-workflow/",
          "publishedOn": "2021-11-30T17:09:28.000Z",
          "wordCount": 2366,
          "title": "5 DevOps tips to speed up your developer workflow"
        },
        {
          "id": "https://github.blog/2021-11-29-github-actions-reusable-workflows-is-generally-available/",
          "author": null,
          "description": "DRY your Actions configuration with reusable workflows (and more!)",
          "link": "https://github.blog/2021-11-29-github-actions-reusable-workflows-is-generally-available/",
          "publishedOn": "2021-11-29T17:38:13.000Z",
          "wordCount": 776,
          "title": "GitHub Actions: reusable workflows is generally available"
        },
        {
          "id": "https://github.blog/2021-11-23-secure-deployments-openid-connect-github-actions-generally-available/",
          "author": null,
          "description": "GitHub Actions now supports OpenID Connect for secure deployment to different cloud providers via short-lived, auto-rotated tokens.",
          "link": "https://github.blog/2021-11-23-secure-deployments-openid-connect-github-actions-generally-available/",
          "publishedOn": "2021-11-23T20:16:17.000Z",
          "wordCount": 679,
          "title": "Secure deployments with OpenID Connect &#038; GitHub Actions now generally available"
        },
        {
          "id": "https://github.blog/2021-11-23-how-to-squash-bugs-by-enrolling-in-oss-fuzz/",
          "author": null,
          "description": "OSS-Fuzz is Google’s awesome fuzzing service for open source projects. GitHub Security Lab's @kevinbackhouse describes enrolling a project.",
          "link": "https://github.blog/2021-11-23-how-to-squash-bugs-by-enrolling-in-oss-fuzz/",
          "publishedOn": "2021-11-23T17:37:46.000Z",
          "wordCount": 1652,
          "title": "Blue-teaming for Exiv2: how to squash bugs by enrolling in OSS-Fuzz"
        },
        {
          "id": "https://github.blog/2021-11-23-copyright-office-expands-security-research-rights/",
          "author": null,
          "description": "Recently, the Copyright Office responded to the calls to clarify the scope of protected security research.",
          "link": "https://github.blog/2021-11-23-copyright-office-expands-security-research-rights/",
          "publishedOn": "2021-11-23T16:47:28.000Z",
          "wordCount": 1229,
          "title": "The Copyright Office expands your security research rights"
        },
        {
          "id": "https://github.blog/2021-11-22-accelerate-security-adoption-in-your-organization/",
          "author": null,
          "description": "The GitHub Services Engineers have released the Advanced Security Enforcer GitHub Action to enable organizations to utilize code scanning in a consistent and automated way.",
          "link": "https://github.blog/2021-11-22-accelerate-security-adoption-in-your-organization/",
          "publishedOn": "2021-11-22T17:27:15.000Z",
          "wordCount": 676,
          "title": "Accelerate security adoption in your organization"
        }
      ]
    },
    {
      "title": "Martin Kleppmann's blog",
      "feedUrl": "https://feeds.feedburner.com/martinkl",
      "siteUrl": "http://martin.kleppmann.com/",
      "articles": []
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "http://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/8705834e6fd8",
          "author": "Netflix Technology Blog",
          "description": "Martin Tingley with Wenjing Zheng, Simon Ejdemyr, Stephanie Lane, Michael Lindon, and Colin McFarland",
          "link": "https://netflixtechblog.com/building-confidence-in-a-decision-8705834e6fd8?source=rss----2615bd06b42e---4",
          "publishedOn": "2021-11-15T16:20:05.000Z",
          "wordCount": 2453,
          "title": "Building confidence in a decision"
        },
        {
          "id": "https://medium.com/p/b7fc88e42320",
          "author": "Netflix Technology Blog",
          "description": "by Liwei Guo, Ashwin Kumar Gopi Valliammal, Raymond Tam, Chris Pham, Agata Opalach, Weibo Ni",
          "link": "https://netflixtechblog.com/bringing-av1-streaming-to-netflix-members-tvs-b7fc88e42320?source=rss----2615bd06b42e---4",
          "publishedOn": "2021-11-09T19:45:50.000Z",
          "wordCount": 2323,
          "title": "Bringing AV1 Streaming to Netflix Members’ TVs"
        }
      ]
    },
    {
      "title": "Google AI Blog",
      "feedUrl": "http://feeds.feedburner.com/blogspot/gJZg",
      "siteUrl": "http://ai.googleblog.com/",
      "articles": [
        {
          "id": "http://ai.googleblog.com/2021/12/evaluating-syntactic-abilities-of.html",
          "author": null,
          "description": "Posted by Jason Wei, AI Resident and Dan Garrette, Research Scientist, Google Research  \nIn recent years, pre-trained language models, such as BERT and GPT-3, have seen widespread use in natural language processing (NLP). By training on large volumes of text, language models acquire broad knowledge about the world, achieving strong performance on various NLP benchmarks. These models, however, are often opaque in that it may not be clear why they perform so well, which limits further hypothesis-driven improvement of the models. Hence, a new line of scientific inquiry has arisen: what linguistic knowledge is contained in these models? \n While there are many types of linguistic knowledge that one may want to investigate, a topic that provides a strong basis for analysis is the subject–verb ag…",
          "link": "http://ai.googleblog.com/2021/12/evaluating-syntactic-abilities-of.html",
          "publishedOn": "2021-12-02T18:23:00.000Z",
          "wordCount": 2106,
          "title": "Evaluating Syntactic Abilities of Language Models"
        },
        {
          "id": "http://ai.googleblog.com/2021/12/rlds-ecosystem-to-generate-share-and.html",
          "author": null,
          "description": "Posted by Sabela Ramos, Software Engineer and Léonard Hussenot, Student Researcher, Google Research, Brain Team \nMost reinforcement learning (RL) and sequential decision making algorithms require an agent to generate training data through large amounts of interactions with their environment to achieve optimal performance. This is highly inefficient, especially when generating those interactions is difficult, such as collecting data with a real robot or by interacting with a human expert. This issue can be mitigated by reusing external sources of knowledge, for example, the RL Unplugged Atari dataset, which includes data of a synthetic agent playing Atari games.  \n However, there are very few of these datasets and a variety of tasks and ways of generating data in sequential decision making …",
          "link": "http://ai.googleblog.com/2021/12/rlds-ecosystem-to-generate-share-and.html",
          "publishedOn": "2021-12-01T19:08:00.000Z",
          "wordCount": 2133,
          "title": "RLDS: An Ecosystem to Generate, Share, and Use Datasets in Reinforcement Learning"
        },
        {
          "id": "http://ai.googleblog.com/2021/11/mural-multimodal-multi-task-retrieval.html",
          "author": null,
          "description": "Posted by Aashi Jain, AI Resident and Yinfei Yang, Staff Research Scientist, Google Research    \nFor many concepts, there is no direct one-to-one translation from one language to another, and even when there is, such translations often carry different associations and connotations that are easily lost for a non-native speaker. In such cases, however, the meaning may be more obvious when grounded in visual examples. Take, for instance, the word \"wedding\". In English, one often associates a bride in a white dress and a groom in a tuxedo, but when translated into Hindi (शादी), a more appropriate association may be a bride wearing vibrant colors and a groom wearing a sherwani. What each person associates with the word may vary considerably, but if they are shown an image of the intended concep…",
          "link": "http://ai.googleblog.com/2021/11/mural-multimodal-multi-task-retrieval.html",
          "publishedOn": "2021-11-30T21:03:00.001Z",
          "wordCount": 2463,
          "title": "MURAL: Multimodal, Multi-task Retrieval Across Languages"
        },
        {
          "id": "http://ai.googleblog.com/2021/11/predicting-text-selections-with.html",
          "author": null,
          "description": "Posted by Florian Hartmann, Software Engineer, Google Research \nSmart Text Selection, launched in 2017 as part of Android O, is one of Android’s most frequently used features, helping users select, copy, and use text easily and quickly by predicting the desired word or set of words around a user’s tap, and automatically expanding the selection appropriately. Through this feature, selections are automatically expanded, and for selections with defined classification types, e.g., addresses and phone numbers, users are offered an app with which to open the selection, saving users even more time. \n\n  Today we describe how we have improved the performance of Smart Text Selection by using federated learning to train the neural network model on user interactions responsibly while preserving user p…",
          "link": "http://ai.googleblog.com/2021/11/predicting-text-selections-with.html",
          "publishedOn": "2021-11-22T18:21:00.002Z",
          "wordCount": 2254,
          "title": "Predicting Text Selections with Federated Learning"
        },
        {
          "id": "http://ai.googleblog.com/2021/11/decisiveness-in-imitation-learning-for.html",
          "author": null,
          "description": "Posted by Pete Florence, Research Scientist and Corey Lynch, Research Engineer, Robotics at Google   \nDespite considerable progress in robot learning over the past several years, some policies for robotic agents can still struggle to decisively choose actions when trying to imitate precise or complex behaviors. Consider a task in which a robot tries to slide a block across a table to precisely position it into a slot. There are many possible ways to solve this task, each requiring precise movements and corrections. The robot must commit to just one of these options, but must also be capable of changing plans each time the block ends up sliding farther than expected. Although one might expect such a task to be easy, that is often not the case for modern learning-based robots, which often le…",
          "link": "http://ai.googleblog.com/2021/11/decisiveness-in-imitation-learning-for.html",
          "publishedOn": "2021-11-19T21:19:00.000Z",
          "wordCount": 2454,
          "title": "Decisiveness in Imitation Learning for Robots"
        },
        {
          "id": "http://ai.googleblog.com/2021/11/permutation-invariant-neural-networks.html",
          "author": null,
          "description": "Posted by David Ha, Staff Research Scientist and Yujin Tang, Research Software Engineer, Google Research, Tokyo      “The brain is able to use information coming from the skin as if it were coming from the eyes. We don’t see with the eyes or hear with the ears, these are just the receptors, seeing and hearing in fact goes on in the brain.”\n— Paul Bach-y-Rita1\n-->  \n\n  \n“The brain is able to use information coming from the skin as if it were coming from the eyes. We don’t see with the eyes or hear with the ears, these are just the receptors, seeing and hearing in fact goes on in the brain.”\n  \n— Paul Bach-y-Rita1-->, quoted in Livewired\n  \n People have the amazing ability to use one sensory modality (e.g., touch) to supply environmental information normally gathered by another sense (e.g., …",
          "link": "http://ai.googleblog.com/2021/11/permutation-invariant-neural-networks.html",
          "publishedOn": "2021-11-18T20:07:00.002Z",
          "wordCount": 2651,
          "title": "Permutation-Invariant Neural Networks for Reinforcement Learning"
        },
        {
          "id": "http://ai.googleblog.com/2021/11/predicting-text-readability-from.html",
          "author": null,
          "description": "Posted by Sian Gooding, Intern, Google Research  \nIlliteracy affects at least 773 million people globally, both young and old. For these individuals, reading information from unfamiliar sources or on unfamiliar topics can be extremely difficult. Unfortunately, these inequalities have been further magnified by the global pandemic as a result of unequal access to education in reading and writing. In fact, UNESCO reports that over 100 million children are falling behind the minimum proficiency level in reading due to COVID-related school closures.  \n With increasing world-wide access to technology, reading on a device, such as a tablet or phone, has largely taken the place of traditional formats. This provides a unique opportunity to observe reading interactions, e.g., how a reader scrolls th…",
          "link": "http://ai.googleblog.com/2021/11/predicting-text-readability-from.html",
          "publishedOn": "2021-11-17T22:31:00.001Z",
          "wordCount": 2192,
          "title": "Predicting Text Readability from Scrolling Interactions"
        },
        {
          "id": "http://ai.googleblog.com/2021/11/rliable-towards-reliable-evaluation.html",
          "author": null,
          "description": "Posted by Rishabh Agarwal, Research Scientist and Pablo Samuel Castro, Staff Software Engineer, Google Research, Brain Team   \n Reinforcement learning (RL) is an area of machine learning that focuses on learning from experiences to solve decision making tasks. While the field of RL has made great progress, resulting in impressive empirical results on complex tasks, such as playing video games, flying stratospheric balloons and designing hardware chips, it is becoming increasingly apparent that the current standards for empirical evaluation might give a false sense of fast scientific progress while slowing it down. \n  To that end, in “Deep RL at the Edge of the Statistical Precipice”, accepted as an oral presentation at NeurIPS 2021, we discuss how statistical uncertainty of results needs t…",
          "link": "http://ai.googleblog.com/2021/11/rliable-towards-reliable-evaluation.html",
          "publishedOn": "2021-11-17T18:32:00.001Z",
          "wordCount": 2627,
          "title": "RLiable: Towards Reliable Evaluation & Reporting in Reinforcement Learning"
        },
        {
          "id": "http://ai.googleblog.com/2021/11/metnet-2-deep-learning-for-12-hour.html",
          "author": null,
          "description": "Posted by Nal Kalchbrenner and Lasse Espeholt, Google Research  \nDeep learning has successfully been applied to a wide range of important challenges, such as cancer prevention and increasing accessibility. The application of deep learning models to weather forecasts can be relevant to people on a day-to-day basis, from helping people plan their day to managing food production, transportation systems, or the energy grid. Weather forecasts typically rely on traditional physics-based techniques powered by the world’s largest supercomputers. Such methods are constrained by high computational requirements and are sensitive to approximations of the physical laws on which they are based.  \n Deep learning offers a new approach to computing forecasts. Rather than incorporating explicit physical law…",
          "link": "http://ai.googleblog.com/2021/11/metnet-2-deep-learning-for-12-hour.html",
          "publishedOn": "2021-11-15T21:56:00.001Z",
          "wordCount": 2292,
          "title": "MetNet-2: Deep Learning for 12-Hour Precipitation Forecasting"
        },
        {
          "id": "http://ai.googleblog.com/2021/11/an-open-source-vibrotactile-haptics.html",
          "author": null,
          "description": "Posted by Artem Dementyev, Hardware Engineer, Google Research \nMost wearable smart devices and mobile phones have the means to communicate with the user through tactile feedback, enabling applications from simple notifications to sensory substitution for accessibility. Typically, they accomplish this using vibrotactile actuators, which are small electric vibration motors. However, designing a haptic system that is well-targeted and effective for a given task requires experimentation with the number of actuators and their locations in the device, yet most practical applications require standalone on-body devices and integration into small form factors. This combination of factors can be difficult to address outside of a laboratory as integrating these systems can be quite time-consuming and…",
          "link": "http://ai.googleblog.com/2021/11/an-open-source-vibrotactile-haptics.html",
          "publishedOn": "2021-11-12T19:07:00.004Z",
          "wordCount": 2366,
          "title": "An Open Source Vibrotactile Haptics Platform for On-Body Applications"
        },
        {
          "id": "http://ai.googleblog.com/2021/11/making-better-future-predictions-by.html",
          "author": null,
          "description": "Posted by Dave Epstein, Student Researcher and Chen Sun, Staff Research Scientist, Google Research   \nMachine learning (ML) agents are increasingly deployed in the real world to make decisions and assist people in their daily lives. Making reasonable predictions about the future at varying timescales is one of the most important capabilities for such agents because it enables them to predict changes in the world around them, including other agents’ behaviors, and plan how to act next. Importantly, successful future prediction requires both capturing meaningful transitions in the environment (e.g., dough transforming into bread) and adapting to how transitions unfold over time in order to make decisions.  \n  \nPrevious work in future prediction from visual observations has largely been const…",
          "link": "http://ai.googleblog.com/2021/11/making-better-future-predictions-by.html",
          "publishedOn": "2021-11-11T20:26:00.001Z",
          "wordCount": 2529,
          "title": "Making Better Future Predictions by Watching Unlabeled Videos"
        },
        {
          "id": "http://ai.googleblog.com/2021/11/model-ensembles-are-faster-than-you.html",
          "author": null,
          "description": "Posted by Xiaofang Wang, Intern and Yair Alon (prev. Movshovitz-Attias), Software Engineer, Google Research    \nWhen building a deep model for a new machine learning application, researchers often begin with existing network architectures, such as ResNets or EfficientNets. If the initial model’s accuracy isn’t high enough, a larger model may be a tempting alternative, but may not actually be the best solution for the task at hand. Instead, better performance potentially could be achieved by designing a new model that is optimized for the task. However, such efforts can be challenging and usually require considerable resources.  \nIn “Wisdom of Committees: An Overlooked Approach to Faster and More Accurate Models”,  we discuss model ensembles and a subset called model cascades, both of which…",
          "link": "http://ai.googleblog.com/2021/11/model-ensembles-are-faster-than-you.html",
          "publishedOn": "2021-11-10T18:03:00.002Z",
          "wordCount": 2571,
          "title": "Model Ensembles Are Faster Than You Think"
        },
        {
          "id": "http://ai.googleblog.com/2021/11/enhanced-sleep-sensing-in-nest-hub.html",
          "author": null,
          "description": "Posted by Michael Dixon, Software Engineer and Reena Singhal Lee, Product Manager, Google Health \nEarlier this year, we launched Contactless Sleep Sensing in Nest Hub, an opt-in feature that can help users better understand their sleep patterns and nighttime wellness. While some of the most critical sleep insights can be derived from a person’s overall schedule and duration of sleep, that alone does not tell the complete story. The human brain has special neurocircuitry to coordinate sleep cycles — transitions between deep, light, and rapid eye movement (REM) stages of sleep — vital not only for physical and emotional wellbeing, but also for optimal physical and cognitive performance. Combining such sleep staging information with disturbance events can help you better understand what’s hap…",
          "link": "http://ai.googleblog.com/2021/11/enhanced-sleep-sensing-in-nest-hub.html",
          "publishedOn": "2021-11-09T14:40:00.001Z",
          "wordCount": 2285,
          "title": "Enhanced Sleep Sensing in Nest Hub"
        },
        {
          "id": "http://ai.googleblog.com/2021/11/google-at-emnlp-2021.html",
          "author": null,
          "description": "Posted by Catherine Armato, Google Research  \nThis week, the annual conference on Empirical Methods in Natural Language Processing (EMNLP 2021) will be held both virtually and in Punta Cana, Dominican Republic. As a Diamond Level sponsor of EMNLP 2021, Google will contribute research on a diverse set of topics, including language interactions, causal inference, and question answering, additionally serving in various levels of organization in the conference.  \nBelow is a full list of Google’s involvement and publications being presented at EMNLP 2021. We congratulate these authors, and all other researchers who are presenting their work at the conference (Google affiliations presented in bold). \n Organizing Committee\nEthics Committee includes: Nyalleng Moorosi   \nPublications\nMATE: Multi-vi…",
          "link": "http://ai.googleblog.com/2021/11/google-at-emnlp-2021.html",
          "publishedOn": "2021-11-08T23:47:00.002Z",
          "wordCount": 2066,
          "title": "Google at EMNLP 2021"
        },
        {
          "id": "http://ai.googleblog.com/2021/11/improved-on-device-ml-on-pixel-6-with.html",
          "author": null,
          "description": "Posted by Suyog Gupta and Marie White, Software Engineers, Google Research   \nThis fall Pixel 6 phones launched with Google Tensor, Google’s first mobile system-on-chip (SoC), bringing together various processing components (such as central/graphic/tensor processing units, image processors, etc.) onto a single chip, custom-built to deliver state-of-the-art innovations in machine learning (ML) to Pixel users. In fact, every aspect of Google Tensor was designed and optimized to run Google’s ML models, in alignment with our AI Principles. That starts with the custom-made TPU integrated in Google Tensor that allows us to fulfill our vision of what should be possible on a Pixel phone.  \nToday, we share the improvements in on-device machine learning made possible by designing the ML models for G…",
          "link": "http://ai.googleblog.com/2021/11/improved-on-device-ml-on-pixel-6-with.html",
          "publishedOn": "2021-11-08T20:02:00.002Z",
          "wordCount": 3033,
          "title": "Improved On-Device ML on Pixel 6, with Neural Architecture Search"
        }
      ]
    }
  ],
  "cliVersion": "1.11.3"
}