{
  "sources": [
    {
      "title": "Spring",
      "feedUrl": "https://spring.io/blog.atom",
      "siteUrl": "https://spring.io/blog",
      "articles": [
        {
          "id": "https://spring.io/blog/2022/10/17/spring-data-2022-0-0-rc1-2021-2-5-and-2021-1-8-available",
          "author": null,
          "description": "Dear Spring community,\n\r\nOn behalf of the Spring Data team and everyone who contributed, it is my pleasure to announce that Spring Data 2022.0.0 has entered its release candidate phase by releasing RC1 today. It is available from the milestone repository. This release ships with several tickets fixed. Along with the release candidate, we shipped 2021.2.5 and 2021.1.8 service releases, to be picked up by corresponding Spring Boot releases.\n\r\nThe release candidate ships with a revised module structure, specifically Spring Data for Apache Geode is no longer part of the release train. Expect a blog post that outlines details soon.\n\r\nPlease give Spring Data 2022.0.0-RC1 a try (for example, as part of the upcoming Spring Boot 3.0.0-RC1 release), which will be available start.spring.io soon, and …",
          "link": "https://spring.io/blog/2022/10/17/spring-data-2022-0-0-rc1-2021-2-5-and-2021-1-8-available",
          "publishedOn": "2022-10-17T08:23:00.000Z",
          "wordCount": 1177,
          "title": "Spring Data 2022.0.0-RC1, 2021.2.5, and 2021.1.8 available",
          "imageUrl": "https://avatars.githubusercontent.com/u/1035015?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/16/spring-at-javaone-2022",
          "author": null,
          "description": "Hi, Spring fans! It’s Sunday the 16th of October as I write this and I’m winging my way to sunny Las Vegas, Nevada, where I’ll be attending (and presenting at) the first JavaOne show in years! It didn’t exist as the JavaOne we know and love for years, even before the pandemic interrupted life as we know it worldwide. So this isn’t just the first JavaOne since 2019, it’s [the first JavaOne since 2017](https://www.infoq.com/news/2018/04/oracle-kills-java-one/_! I can’t wait to be there, to see the amazing community, to soak up the sun and fun with my teammates and friends in the ecosystem. And we want to see you, too.\n\r\nThere are a few of us doing talks from the Spring team and we’d love to see you!\n\r\nFirst of all: we have a booth, so join us there.\n\r\nThere are going to be a bunch of great t…",
          "link": "https://spring.io/blog/2022/10/16/spring-at-javaone-2022",
          "publishedOn": "2022-10-16T07:00:00.000Z",
          "wordCount": 939,
          "title": "Spring at JavaOne 2022",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/15/learn-more-about-spring-framework-6-and-spring-boot-3-in-these-two-great-talks-from-devoxx-2022",
          "author": null,
          "description": "Hi, Spring fans! I was just at Devoxx in Belgium, where hundreds of experts from across the Java ecosystem converged for the first time since 2019 to deliver their biggest and best. \n\r\nI could do a proper trip report, but I really just came here to point you to two talks from two of my amazing teammates, Stéphane Nicoll (@snicoll) and Brian Clozel (@bclozel), who have been very hard at work on both Spring Framework 6 and Spring Boot 3, both of which will land by the end of November, 2022. These are brand new generations of the framework, implying huge new paradigms and new opportunities for developers. \n\r\nThis first is a broader, whirlwind tour of the new features in Spring Framework 6 (which bubble up into Spring Boot 3).\n\r\n\r\nThis second one introduces the new ahead-of-time (AOT) support in Spring Framework 6 and Spring Boot 3, which makes it trivial to build GraalVM native images.\n\r\n\n\r\nNB: please ignore the metadata for the YouTube videos. Both talks feature both speakers, and there is no mention whatsoever of React and JavaScript and the like. I think that was a metadata issue with the publication of the videos on YouTube, which will hopefully be resolved. \n\r\nEnjoy! \n\r\nIf you missed this event, that’s OK - there’s still time to join the Spring team and larger Java ecosystem for SpringOne, being held 6-8 December, 2022, in sunny San Francisco, CA, 94105! Join us! (Psst.: If you register now, there’s a $200 discount from the pass price with this code S1VM22_Advocate_200.)",
          "link": "https://spring.io/blog/2022/10/15/learn-more-about-spring-framework-6-and-spring-boot-3-in-these-two-great-talks-from-devoxx-2022",
          "publishedOn": "2022-10-15T07:00:00.000Z",
          "wordCount": 793,
          "title": "Learn more about Spring Framework 6 and Spring Boot 3 in these two great talks from Devoxx 2022",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/13/spring-batch-5-0-0-m8-is-out",
          "author": null,
          "description": "On behalf of the team and all contributors, I am pleased to announce that Spring Batch 5.0.0-M8 is now available from our milestone repository.\n\r\nIn this milestone, we introduced two main changes:\n\r\n\r\n  \nNew default execution context serialization format\n\r\n  \nSystemCommandTasklet enhancements\n\r\n\r\nThis blog post walks through these two major changes in details. For the complete list of changes,\nplease check the release notes.\nNew default execution context serialization format\n\r\nIn this milestone release, the DefaultExecutionContextSerializer was updated to serialize/deserialize the context to/from Base64.\n\r\nMoreover, the default ExecutionContextSerializer configured by @EnableBatchProcessing or DefaultBatchConfiguration was changed from JacksonExecutionContextStringSerializer to DefaultExecutionContextSerializer. The dependency to Jackson was made optional. In order to use the JacksonExecutionContextStringSerializer, jackson-core should be added to the classpath.\nSystemCommandTasklet enhancements\n\r\nThe SystemCommandTasklet has been revisited in this release and was changed as follows:\n\r\n\r\n  \n\r\n  \nA new strategy interface named CommandRunner was introduced in order to decouple the command execution from the tasklet execution. The default implementation is the JvmCommandRunner which uses the java.lang.Runtime#exec API to run system commands. This interface can be implemented to use any other API to run system commands.\n\r\n  \n\r\n  \nThe method that runs the command now accepts an array of Strings representing the command and its arguments. There is no need to tokenize the command or do any pre-processing anymore. This change makes the API more intuitive, and less prone to errors.\n\r\n\nFeedback\n\r\nI would like to thank all contributors who had a role in this release! As we continue\nour work on Spring Batch 5, we look forward to your feedback on Github, Twitter and StackOverflow.\n\r\n\r\nSpring Batch Home|Source on Github|Reference documentation",
          "link": "https://spring.io/blog/2022/10/13/spring-batch-5-0-0-m8-is-out",
          "publishedOn": "2022-10-13T08:00:00.000Z",
          "wordCount": 772,
          "title": "Spring Batch 5.0.0-M8 is out!",
          "imageUrl": "https://avatars.githubusercontent.com/u/1210553?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/12/a-bootiful-podcast-google-mad-scientist-josh-suereth-on-observability-with-opentelemetry-building-better-build-tools-and-so-much-more",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) looks at the latest and greatest in Spring Boot 3 AOT, then talks to Google’s Josh Suereth (@jsuereth) about observability with OpenTelemetry, building better build tools, and so much more. \n\r\n\r\nWant to learn more about Spring Boot and the wider ecosystem? SpringOne 2022 is almost here! If you want a chance to learn from the source, I hope you’ll join us 6-8 December 2022, right here in my hometown of San Francisco, my favorite west coast city in the USA. (Psst.: If you register now, there’s a $200 discount from the pass price with this code S1VM22_Advocate_200.)",
          "link": "https://spring.io/blog/2022/10/12/a-bootiful-podcast-google-mad-scientist-josh-suereth-on-observability-with-opentelemetry-building-better-build-tools-and-so-much-more",
          "publishedOn": "2022-10-13T06:00:00.000Z",
          "wordCount": 647,
          "title": "A Bootiful Podcast: Google mad scientist Josh Suereth on Observability with OpenTelemetry, building better build tools, and so much more",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/12/observability-with-spring-boot-3",
          "author": null,
          "description": "The Spring Observability Team has been working on adding observability support for Spring Applications for quite some time, and we are pleased to inform you that this feature will be generally available with Spring Framework 6 and Spring Boot 3!\n\r\n\r\n\r\nWhat is observability? In our understanding, it is \"how well you can understand the internals of your system by examining its outputs\". We believe that the interconnection between metrics, logging, and distributed tracing gives you the ability to reason about the state of your system in order to debug exceptions and latency in your applications. You can watch more about what we think observability is in this episode of Enlightning with Jonatan Ivanov.\n\r\n\r\n\r\nThe upcoming Spring Boot 3.0.0-RC1 release will contain numerous autoconfigurations fo…",
          "link": "https://spring.io/blog/2022/10/12/observability-with-spring-boot-3",
          "publishedOn": "2022-10-12T21:00:00.000Z",
          "wordCount": 4191,
          "title": "Observability with Spring Boot 3",
          "imageUrl": "https://avatars.githubusercontent.com/u/3297437?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/12/spring-framework-6-0-goes-rc1",
          "author": null,
          "description": "Dear Spring community,\n\r\nIt is my pleasure to announce that a feature-complete Spring Framework 6.0 release candidate is available now! We are expecting a further release candidate in time for the first Spring Boot 3.0 release candidate next week, and then our final releases for general availability in November.\n\r\nAs a major revision of the core framework, 6.0 RC1 comes with a Java 17+ baseline, a move to Jakarta EE 9+ (in the jakarta namespace superseding the former javax based EE APIs), and a broader infrastructure revision. This provides access to the latest web containers such as Tomcat 10 / Jetty 11 and the latest persistence providers such as Hibernate ORM 6.1 - all of which are exclusively available with the jakarta-namespaced variants of the Servlet API and JPA. It also sets the st…",
          "link": "https://spring.io/blog/2022/10/12/spring-framework-6-0-goes-rc1",
          "publishedOn": "2022-10-12T11:45:11.000Z",
          "wordCount": 836,
          "title": "Spring Framework 6.0 goes RC1",
          "imageUrl": "https://avatars.githubusercontent.com/u/1263688?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/11/the-state-of-spring-survey-2022-is-here",
          "author": null,
          "description": "The State of Spring survey is here! Please give us your feedback by going to spring.io/survey. Spread the word by sharing these posts on Twitter, LinkedIn, and any other social platform you use! \n\r\n\r\nSpring fans, our annual survey of the Spring community is back! Last year, we dived into the biggest projects and the most popular app patterns built with Spring, and a whole lot more! You told us your views about Spring Native, Data, and what matters to you when you start using a new Spring project.\n\r\nThe survey is back for 2022, and we’re really excited to learn again from you. What matters to you when you build with Spring? What types of apps are you building with Spring? What can we change, and what should remain the same?\n\r\nCompleting the survey should take about 15 minutes. If you want to be among the first to get the report, feel free to leave your email at the end of the survey.\n\r\nOk, if you’re ready, head over to spring.io/survey now!\n\r\nOne last thing - we’d really appreciate it if you share the survey with others in the Spring community. You can share the link spring.io/survey, or our Twitter and LinkedIn posts. Thank you!\n\r\nThe Spring Team",
          "link": "https://spring.io/blog/2022/10/11/the-state-of-spring-survey-2022-is-here",
          "publishedOn": "2022-10-11T17:00:00.000Z",
          "wordCount": 727,
          "title": "The State of Spring Survey 2022 Is Here!",
          "imageUrl": "https://avatars.githubusercontent.com/u/630743?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/11/embracing-virtual-threads",
          "author": null,
          "description": "Project Loom has made it into the JDK through JEP 425. It’s available since Java 19 in September 2022 as a preview feature.\r\nIts goal is to dramatically reduce the effort of writing, maintaining, and observing high-throughput concurrent applications.\n\r\n\r\n\r\nWhere Virtual Threads make sense\n\r\n\r\n\r\nThis makes lightweight Virtual Threads an exciting approach for application developers and the Spring Framework. Past years indicated a trend towards applications that communicate over the network with each other. Many applications make use of data stores, message brokers, and remote services. I/O-intensive applications are the primary ones that benefit from Virtual Threads if they were built to use blocking I/O facilities such as InputStream and synchronous HTTP, database, and message broker client…",
          "link": "https://spring.io/blog/2022/10/11/embracing-virtual-threads",
          "publishedOn": "2022-10-11T07:32:00.000Z",
          "wordCount": 1759,
          "title": "Embracing Virtual Threads",
          "imageUrl": "https://avatars.githubusercontent.com/u/1035015?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/11/this-week-in-spring-october-11th-2022",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring! I write this installment as I pack and prepare for my trip to Antwerp, Belgium, for the always-amazing Devoxx show in Antwerp, Belgium. I’ve so missed this show over the pandemic and am so looking forward to returning. I hope to catch any and all of you there, too! I’ll be copresenting with my pal James Ward about some of the new and novel in Spring Boot 3 and Kotlin. It’s going to be awesome - join us and we’ll have some fun together! \n\r\nNow, we’ve got a ton to cover so let’s dive right into it!\n\r\n\r\n  \nSpring Tips: Spring Boot & Apache Kafka\n\r\n  \nSpring Batch 5.0.0-M7 available now!\n\r\n  \nSpring Cloud 2022.0.0-M5 is now available\n\r\n  \nSpring Shell 2.1.2 and 3.0.0-M1 are now available\n\r\n  \nThe State of Spring Survey\n\r\n  \nI put the updated code for my latest incarnation of Cloud Native Java - online in Github cloud-native-java-2022/e2e5\n\r\n  \nA Bootiful Podcast: Spring and Java community legend Marten Deinum\n\r\n  \nDifference Between Flux and Mono in Project Reactor\n\r\n  \nHey - Baeldung.com (yes, that Baeldung.com!) is using Spring, and they’re looking for a Java Team Lead with Spring Experience (Remote) (Part Time)\n\r\n  \nPatterns for Iterating Over Large Result Sets With Spring Data JPA\n\r\n  \nJobRunr’s already been upgraded to Spring Boot 3 for the JRE - and perhaps Spring Boot 3 AOT support is on the way?\n\r\n  \nJMeter: Latency vs. Load Time\n\r\n\r\nWant to learn more about Spring Boot and the wider ecosystem? SpringOne 2022 is almost here! If you want a chance to learn from the source, I hope you’ll join us 6-8 December 2022, right here in my hometown of San Francisco, my favorite west coast city in the USA. (Psst.: If you register now, there’s a $200 discount from the pass price with this code S1VM22_Advocate_200.)",
          "link": "https://spring.io/blog/2022/10/11/this-week-in-spring-october-11th-2022",
          "publishedOn": "2022-10-11T07:00:00.000Z",
          "wordCount": 822,
          "title": "This Week in Spring - October 11th, 2022",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/10/spring-tips-spring-boot-apache-kafka",
          "author": null,
          "description": "Hi, Spring fans! In this installment of Spring Tips, I look at the venerable Apache Kafka broker and its integrations at various level of abstraction in the Spring Boot ecosystem.\n\r\n\r\nWant to learn more about event driven architectures, AOT and GraalVM, Apache Kafka, and Spring Boot? SpringOne 2022 is almost here! If you want a chance to learn from the source, then I hope you’ll join us 6-8 December 2022, right here in my hometown of San Francisco, my favorite west coast city in the USA. (Psst.: If you register now, there’s a $200 discount from the pass price with this code S1VM22_Advocate_200.)",
          "link": "https://spring.io/blog/2022/10/10/spring-tips-spring-boot-apache-kafka",
          "publishedOn": "2022-10-10T07:00:00.000Z",
          "wordCount": 618,
          "title": "Spring Tips: Spring Boot & Apache Kafka",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/06/spring-cloud-2022-0-0-m5-is-now-available",
          "author": null,
          "description": "On behalf of the community, I am pleased to announce that the Milestone 5 (M5) of the Spring Cloud 2022.0.0 Release Train is available today. The release can be found in Spring Milestone repository. You can check out the 2022.0.0 release notes for more information.\nNotable Changes in the 2022.00-M5 Release Train\nSpring Cloud Netflix\n\r\n\r\n  \nUpdated to Eureka 2.0.0-rc.3. Eureka 2.0.0 is a new branch of Eureka unrelated to the old 2.x-archive experiment from 7 years ago. The new 2.x branch is for compatibility with JakartaEE. This allows Spring Cloud Netflix to be compatible with Spring Framework 6.0 and Spring Boot 3.0. This is the first milestone that Spring Cloud Netflix has participated in the 2022.0 release train.\n\r\n\nSpring Cloud Consul\n\r\n\r\n  \nAdded runtime hints to enable native image s…",
          "link": "https://spring.io/blog/2022/10/06/spring-cloud-2022-0-0-m5-is-now-available",
          "publishedOn": "2022-10-06T20:57:00.000Z",
          "wordCount": 920,
          "title": "Spring Cloud 2022.0.0-M5 is now available",
          "imageUrl": "https://avatars.githubusercontent.com/u/594085?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/06/a-bootiful-podcast-spring-and-java-community-legend-marten-deinum",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks to longtime Spring community member and legend Marten Deinum (@mdeinum) about scuba diving, software, Spring, community, and more. \n\r\nAlso: I fixed the odd silence in the middle of the last few episodes! thanks for suffering through it with me. I have no idea what went wrong but I know now how to fix it\n\r\n\r\nWant to meet more amazing people in our ecosystem, like Marten? SpringOne 2022 is almost here! I feel like it’s that anxious, exciting time before, sort of important holiday where you get given gifts! And with it, Spring Boot 3 and Spring Framework 6. We’re going to be announcing everything right here on the Spring blog, of course, but if you want a chance to learn from the source, then I hope you’ll join us 6-8 December 2022, right here in my hometown of San Francisco, my favorite west coast city in the USA, and my hometown. (Psst.: If you register now, there’s a $200 discount from the pass price with this code S1VM22_Advocate_200.)",
          "link": "https://spring.io/blog/2022/10/06/a-bootiful-podcast-spring-and-java-community-legend-marten-deinum",
          "publishedOn": "2022-10-06T07:00:00.000Z",
          "wordCount": 699,
          "title": "A Bootiful Podcast: Spring and Java community legend Marten Deinum",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/05/spring-shell-2-1-2-and-3-0-0-m1-are-now-available",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Shell 2.1.2 and 3.0.0-M1 has been released and is now available from https://repo.spring.io/release, Maven Central and https://repo.spring.io/milestone respectively.\n\r\n3.0.0-M1 is first milestone which builds on Spring Boot 3.x and requires JDK 17.\n\r\nPlease see the release notes 2.1.2 and release notes 3.0.0-M1 for more details.\n\r\nThanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nProject Page | GitHub | Issues | Documentation",
          "link": "https://spring.io/blog/2022/10/05/spring-shell-2-1-2-and-3-0-0-m1-are-now-available",
          "publishedOn": "2022-10-05T10:08:06.000Z",
          "wordCount": 602,
          "title": "Spring Shell 2.1.2 and 3.0.0-M1 are now available",
          "imageUrl": "https://avatars.githubusercontent.com/u/50398?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/05/spring-batch-5-0-0-m7-available-now",
          "author": null,
          "description": "On behalf of the team and all contributors, I am pleased to announce that Spring Batch 5.0.0-M7 is now available from our milestone repository.\n\r\nThe main theme of this milestone is the improvement of job parameters handling in Spring Batch. Two main changes were introduced in this release:\n\r\n\r\n  \nAdd support to use any type as a job parameter\n\r\n  \nImprove job parameters conversion\n\r\n\r\nThis blog post walks through these two major changes in details. For the complete list of changes, please check the release notes.\nAdd support to use any type as a job parameter\n\r\nUp to version 4, Spring Batch supported only 4 types that can be used as job parameters, which are long, double, String and Date. While this was convenient to simplify job parameters handling on the framework’s side, it turns out t…",
          "link": "https://spring.io/blog/2022/10/05/spring-batch-5-0-0-m7-available-now",
          "publishedOn": "2022-10-05T08:00:00.000Z",
          "wordCount": 1096,
          "title": "Spring Batch 5.0.0-M7 available now!",
          "imageUrl": "https://avatars.githubusercontent.com/u/1210553?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/04/this-week-in-spring-october-4th-2022",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring! It’s October 4th, 2022, and I’m in Austin, TX, for the new version of show formerly known as the Kafka Summit, here to talk to folks about the amazing opportunities for Spring Boot and Apache Kafka. On the 12th, I’ll be in Antwerp, Belgium, for the amazing Devoxx show. On October 17-20th, I’ll be in Las Vegas, for the new version of JavaOne. And, well, there’s more but I can’t say exactly. Stay tuned!\n\r\nAnd as for now, well, I’m excited to be here! We’ve got a ton of cool stuff to cover this week, so let’s dive right into it!\n\r\n\r\n  \nA Bootiful Podcast: thought leader Chris Richardson (and no, I’m not using that title ironically!)\n\r\n  \nGetting a URL Attribute Value in Thymeleaf\n\r\n  \nRabbitMQ 3.11 Feature Preview: Super …",
          "link": "https://spring.io/blog/2022/10/04/this-week-in-spring-october-4th-2022",
          "publishedOn": "2022-10-04T08:00:00.000Z",
          "wordCount": 967,
          "title": "This Week in Spring - October 4th, 2022",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/09/29/a-bootiful-podcast-thought-leader-chris-richardson-and-no-i-m-not-using-that-title-ironically",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks to his friend Chris Richardson (@crichardson), who helped articulate and advance cloud computing, reactive programming, microservices, domain-driven design, event sourcing, and so much more years before the zeitgeist. Also, we used to work together! \n\r\n\r\nWant to meet more amazing people in our ecosystem, like Chris? SpringOne 2022 is almost here! I feel like it’s that anxious, exciting time before, sort of important holiday where you get given gifts! And with it, Spring Boot 3 and Spring Framework 6. We’re going to be announcing everything right here on the Spring blog, of course, but if you want a chance to learn from the source, then I hope you’ll join us 6-8 December 2022, right here in my hometown of San Francisco, my favorite west coast city in the USA, and my hometown. (Psst.: If you register now, there’s a $200 discount from the pass price with this code S1VM22_Advocate_200.)",
          "link": "https://spring.io/blog/2022/09/29/a-bootiful-podcast-thought-leader-chris-richardson-and-no-i-m-not-using-that-title-ironically",
          "publishedOn": "2022-09-29T07:00:00.000Z",
          "wordCount": 689,
          "title": "A Bootiful Podcast:   thought leader Chris Richardson (and no, I'm not using that title ironically!)",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/09/27/delete-passwords-passwordless-connections-for-spring-boot-apps-to-azure-services",
          "author": null,
          "description": "Using username/password credentials to access one application from another presents a huge security risk for many\r\r\n    reasons. Today, we are announcing the preview of passwordless connections for Java applications to Azure database\r\r\n    and eventing services, letting you finally shift away from using passwords. \n\r\nSecurity Challenges with Passwords\n\r\nPasswords should be used with caution, and developers must never place passwords in an unsecure location. Many Java\r\r\n    applications connect to backend data, cache, messaging, and eventing services using usernames and passwords, or other sensitive credentials such as access tokens or connection strings.\r\r\n    If exposed, the passwords could be used to gain unauthorized access to sensitive information such as a sales catalog\r\r\n    that you…",
          "link": "https://spring.io/blog/2022/09/27/delete-passwords-passwordless-connections-for-spring-boot-apps-to-azure-services",
          "publishedOn": "2022-09-27T09:22:00.000Z",
          "wordCount": 1533,
          "title": "Delete Passwords: Passwordless Connections for Spring Boot  Apps to Azure Services",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/09/27/this-week-in-spring-september-27th-2022",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring!\n\r\nIt’s the last week of September, already! The year’s more done than not. The days are receding into darkness earlier. And the Pumpkin Spice Lattes are upon us. The darker and colder days are kind of a bummer, but I’m stil excited and overjoyed this time of year. You know why?\n\r\nSpringOne 2022 is almost here! I feel like it’s that anxious, exciting time before sort of important holiday where you get given gifts! And with it, Spring Boot 3 and Spring Framework 6. We’re going to be announcing everything right here on the Spring blog, of course, but if you want a chance to learn from the source, then I hope you’ll join us 6-8 December, 2022, right here in my hometown of San Francisco, my favorite west coast city in the U…",
          "link": "https://spring.io/blog/2022/09/27/this-week-in-spring-september-27th-2022",
          "publishedOn": "2022-09-27T07:00:00.000Z",
          "wordCount": 868,
          "title": "This Week in Spring - September 27th, 2022",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/09/26/native-support-in-spring-boot-3-0-0-m5",
          "author": null,
          "description": "The Spring Team has been working on native image support for Spring Applications for quite some time. After 3+ years of incubation in the Spring Native experimental project with Spring Boot 2, native support is moving to General Availability with Spring Framework 6 and Spring Boot 3!\n\r\nNative images provide almost instant startup time and reduced memory consumption for Java applications. The recent Spring Boot 3.0.0-M5 release marks the first time we’re asking for broader community feedback on our native story. If you need to catch-up on the basics, please refer to the Ahead Of Time basics blog post from late March. You can also learn how to prepare your applications for Spring Boot 3.0.\n\r\nA lot has happened since March! We’ve improved compatibility with a larger number of use cases and li…",
          "link": "https://spring.io/blog/2022/09/26/native-support-in-spring-boot-3-0-0-m5",
          "publishedOn": "2022-09-26T11:33:00.000Z",
          "wordCount": 1518,
          "title": "Native Support in Spring Boot 3.0.0-M5",
          "imageUrl": "https://avatars.githubusercontent.com/u/490484?v=4?s=200"
        }
      ]
    },
    {
      "title": "HashiCorp Blog",
      "feedUrl": "https://www.hashicorp.com/blog/feed.xml",
      "siteUrl": "https://hashicorp.com/blog",
      "articles": [
        {
          "id": "https://www.hashicorp.com/blog/how-two-hashicorp-employees-marked-latinx-hispanic-heritage-month",
          "author": null,
          "description": "Karla De La Garza and Abraham Martinez, from HashiCorp’s Unidos Employee Resource Group, share their experiences in Mexico during Latinx & Hispanic Heritage Month.",
          "link": "https://www.hashicorp.com/blog/how-two-hashicorp-employees-marked-latinx-hispanic-heritage-month",
          "publishedOn": "2022-10-13T19:00:00.000Z",
          "wordCount": 3521,
          "title": "How Two HashiCorp Employees Marked Latinx & Hispanic Heritage Month",
          "imageUrl": "https://www.datocms-assets.com/2885/1665678755-unidos-hispanic-heritage-eeg.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/vault-1-12",
          "author": null,
          "description": "The new HashiCorp Vault 1.12 focuses on improving core workflows and making key features production-ready.",
          "link": "https://www.hashicorp.com/blog/vault-1-12",
          "publishedOn": "2022-10-13T16:30:00.000Z",
          "wordCount": 4604,
          "title": "HashiCorp Vault 1.12 Adds New Secrets Engines, ADP Updates, and More",
          "imageUrl": "https://www.datocms-assets.com/2885/1620082983-blog-library-product-vault-dark-graphics.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/cdk-for-terraform-0-13-significantly-improves-performance",
          "author": null,
          "description": "Cloud Development Kit for Terraform (CDKTF) 0.13 vastly reduces synth time across all supported languages.",
          "link": "https://www.hashicorp.com/blog/cdk-for-terraform-0-13-significantly-improves-performance",
          "publishedOn": "2022-10-10T16:00:00.000Z",
          "wordCount": 3340,
          "title": "CDK for Terraform 0.13 Significantly Improves Performance",
          "imageUrl": "https://www.datocms-assets.com/2885/1620081857-blog-library-product-terraform-dark-gradient.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/nomad-1-4-adds-nomad-variables-and-updates-service-discovery",
          "author": null,
          "description": "The GA release of HashiCorp Nomad 1.4 enhances native service discovery support with health checks and introduces Nomad Variables, which lets users store configuration values.",
          "link": "https://www.hashicorp.com/blog/nomad-1-4-adds-nomad-variables-and-updates-service-discovery",
          "publishedOn": "2022-10-06T16:00:00.000Z",
          "wordCount": 5183,
          "title": "Nomad 1.4 Adds Nomad Variables and Updates Service Discovery",
          "imageUrl": "https://www.datocms-assets.com/2885/1620083839-blog-library-product-nomad-dark-graphics.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-hcp-waypoint-public-beta",
          "author": null,
          "description": "HashiCorp Waypoint — now available on the HashiCorp Cloud Platform in public beta — lets users standardize application delivery across platforms.",
          "link": "https://www.hashicorp.com/blog/announcing-hcp-waypoint-public-beta",
          "publishedOn": "2022-10-06T16:00:00.000Z",
          "wordCount": 2296,
          "title": "Announcing HCP Waypoint Public Beta",
          "imageUrl": "https://www.datocms-assets.com/2885/1655842512-blog-library-product-hcp-waypoint.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/terraform-gains-visibility-self-service-and-compliance-upgrades",
          "author": null,
          "description": "Continuous validation, no-code provisioning, native OPA support for Terraform Cloud, and other new features are key upgrades to HashiCorp Terraform introduced at HashiConf Global 2022.",
          "link": "https://www.hashicorp.com/blog/terraform-gains-visibility-self-service-and-compliance-upgrades",
          "publishedOn": "2022-10-06T16:00:00.000Z",
          "wordCount": 3193,
          "title": "Terraform Gains Visibility, Self-Service, and Compliance Upgrades",
          "imageUrl": "https://www.datocms-assets.com/2885/1620081857-blog-library-product-terraform-dark-gradient.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/hcp-boundary-now-ga-bolsters-hashicorp-s-zero-trust-security-solution",
          "author": null,
          "description": "General availability of HCP Boundary lets developers access critical systems with fine-grained authorizations — without managing credentials or exposing your network.",
          "link": "https://www.hashicorp.com/blog/hcp-boundary-now-ga-bolsters-hashicorp-s-zero-trust-security-solution",
          "publishedOn": "2022-10-05T16:00:00.000Z",
          "wordCount": 2713,
          "title": "HCP Boundary — Now GA — Bolsters HashiCorp's Zero Trust Security Solution",
          "imageUrl": "https://www.datocms-assets.com/2885/1655842506-blog-library-product-hcp-boundary.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/hcp-vault-on-microsoft-azure-now-in-public-beta",
          "author": null,
          "description": "In addition to its availability on AWS, HCP Vault can now be deployed on Microsoft Azure infrastructure.",
          "link": "https://www.hashicorp.com/blog/hcp-vault-on-microsoft-azure-now-in-public-beta",
          "publishedOn": "2022-10-05T16:00:00.000Z",
          "wordCount": 1313,
          "title": "HCP Vault on Microsoft Azure Now in Public Beta",
          "imageUrl": "https://www.datocms-assets.com/2885/1664831430-blog-thumbnail-hcp_diagram_onblack_vault_azure.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-developer-your-new-experience-for-docs-and-tutorials",
          "author": null,
          "description": "HashiCorp Developer is your one-stop shop for interactive labs, sample code, videos, tutorials, and in-depth documentation.",
          "link": "https://www.hashicorp.com/blog/hashicorp-developer-your-new-experience-for-docs-and-tutorials",
          "publishedOn": "2022-10-05T16:00:00.000Z",
          "wordCount": 1927,
          "title": "HashiCorp Developer: Your New Experience for Docs and Tutorials",
          "imageUrl": "https://www.datocms-assets.com/2885/1664569797-dev-dot-home.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/consul-1-14-beta-announcing-simplified-service-mesh-deployments",
          "author": null,
          "description": "HashiCorp Consul 1.14 enhances traffic management and failover, and adds a new deployment method: Consul dataplane. AWS Lambda updates and beta Windows VM support were also added.",
          "link": "https://www.hashicorp.com/blog/consul-1-14-beta-announcing-simplified-service-mesh-deployments",
          "publishedOn": "2022-10-05T16:00:00.000Z",
          "wordCount": 5578,
          "title": "Consul 1.14 Beta: Announcing Simplified Service Mesh Deployments",
          "imageUrl": "https://www.datocms-assets.com/2885/1620083627-blog-library-product-consul-dark-graphics.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/introducing-a-new-hcp-based-management-plane-for-consul",
          "author": null,
          "description": "The HashiCorp Cloud Platform (HCP) adds new visibility and management controls for self-managed and HCP-managed Consul deployments.",
          "link": "https://www.hashicorp.com/blog/introducing-a-new-hcp-based-management-plane-for-consul",
          "publishedOn": "2022-10-05T16:00:00.000Z",
          "wordCount": 2603,
          "title": "Introducing a New HCP-Based Management Plane for Consul",
          "imageUrl": "https://www.datocms-assets.com/2885/1655842467-blog-library-product-hcp-consul.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-the-2022-hashicorp-technology-partner-award-winners",
          "author": null,
          "description": "The 2022 HashiCorp Technology Partner Awards have been announced. Find out who the winners are in our four categories this year.",
          "link": "https://www.hashicorp.com/blog/announcing-the-2022-hashicorp-technology-partner-award-winners",
          "publishedOn": "2022-10-04T22:30:00.000Z",
          "wordCount": 1675,
          "title": "Announcing the 2022 HashiCorp Technology Partner Award Winners",
          "imageUrl": "https://www.datocms-assets.com/2885/1600142862-blog-library-product-hashicorp.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/dungeons-dragons-for-team-building",
          "author": null,
          "description": "The HashiCorp Community team used a custom Dungeons & Dragons campaign as a team building exercise. Check out the highlights and then try it yourself.",
          "link": "https://www.hashicorp.com/blog/dungeons-dragons-for-team-building",
          "publishedOn": "2022-09-29T16:00:00.000Z",
          "wordCount": 1930,
          "title": "Dungeons & Dragons for Team Building",
          "imageUrl": "https://www.datocms-assets.com/2885/1664466398-dnd.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/terraform-enterprise-adds-run-metrics-versioned-docs-and-more",
          "author": null,
          "description": "Terraform Enterprise enhances observability and cuts operational burden with improved run metrics, identity-based storage authentication, and versioned documentation.",
          "link": "https://www.hashicorp.com/blog/terraform-enterprise-adds-run-metrics-versioned-docs-and-more",
          "publishedOn": "2022-09-27T16:00:00.000Z",
          "wordCount": 1711,
          "title": "Terraform Enterprise Adds Run Metrics, Versioned Docs, and More",
          "imageUrl": "https://www.datocms-assets.com/2885/1620083068-blog-library-product-terraform-black.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/terraform-1-3-improves-extensibility-and-maintainability-of-terraform-modules",
          "author": null,
          "description": "Now generally available, HashiCorp Terraform 1.3 introduces optional object type attributes with defaults, and enhancements to moved blocks, improving extensibility and maintainability of Terraform modules.",
          "link": "https://www.hashicorp.com/blog/terraform-1-3-improves-extensibility-and-maintainability-of-terraform-modules",
          "publishedOn": "2022-09-21T16:00:00.000Z",
          "wordCount": 2370,
          "title": "Terraform 1.3 Improves Extensibility and Maintainability of Terraform Modules",
          "imageUrl": "https://www.datocms-assets.com/2885/1620083055-blog-library-product-terraform-dark-graphics.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/vagrant-2-3-introduces-go-runtime",
          "author": null,
          "description": "HashiCorp Vagrant 2.3 introduces a new Vagrant executable written in Golang, tying the Vagrant architecture more closely into the broader HashiCorp ecosystem.",
          "link": "https://www.hashicorp.com/blog/vagrant-2-3-introduces-go-runtime",
          "publishedOn": "2022-09-19T18:00:00.000Z",
          "wordCount": 1611,
          "title": "Vagrant 2.3 Introduces Go Runtime",
          "imageUrl": "https://www.datocms-assets.com/2885/1620083141-blog-library-product-vagrant-logo-dark-graphics.jpg"
        }
      ]
    },
    {
      "title": "Elastic Blog - Elasticsearch, Kibana, and ELK Stack",
      "feedUrl": "https://www.elastic.co/blog/feed",
      "siteUrl": "https://www.elastic.co",
      "articles": [
        {
          "id": "https://www.elastic.co/blog/elastic-continues-to-gain-momentum-in-siem-market",
          "author": "Mike Nichols,Mike Paquette",
          "description": "Gartner SIEM MQ - Elastic has successfully delivered a leading Security Information and Event Management (SIEM) offering with only two years in the market.",
          "link": "https://www.elastic.co/blog/elastic-continues-to-gain-momentum-in-siem-market",
          "publishedOn": "2022-10-14T17:00:00.000Z",
          "wordCount": 7410,
          "title": "Elastic continues to gain momentum in SIEM market",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltd316fcd9a9047cca/62ea7319022e5e700e65d3f0/blog-open-and-transparent-security-720x420-A.png"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-continues-to-gain-momentum-in-siem-market",
          "author": "Mike Nichols,Mike Paquette",
          "description": ",\nElastic has successfully delivered a leading Security Information and Event Management (SIEM) offering with only two years in the market. According to IDC Worldwide Security Information and Event Management Market Shares, 2021: The Cardinal SIEMs report, Elastic is one of the fastest growing SIEMs (more than 80% year-over-year growth) — and had the fifth largest market share in 2021 of the 20+ SIEM vendors in the report. \n2021 worldwide SIEM revenue market share\nhttps://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltbbcc5746c1499bd1/634979188473831f96bbd039/image1.png,image1.png,\nAdditionally, Gartner® has recognized Elastic as a Visionary in the 2022 Magic Quadrant™ for SIEM. We believe this recognition is a testament to Elastic’s ability to deliver value to customers quickly an…",
          "link": "https://www.elastic.co/blog/elastic-continues-to-gain-momentum-in-siem-market",
          "publishedOn": "2022-10-14T17:00:00.000Z",
          "wordCount": 7410,
          "title": "Elastic continues to gain momentum in SIEM market",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltd316fcd9a9047cca/62ea7319022e5e700e65d3f0/blog-open-and-transparent-security-720x420-A.png"
        },
        {
          "id": "https://www.elastic.co/blog/the-art-of-the-possible-arming-us-veterans-with-knowledge",
          "author": "Cami Lewis",
          "description": "Elastic can help us understand the data that impacts our daily lives and guides our decisions. Learn how one Elastic employee transformed data into something that provides invaluable insight and answers common questions in the veteran community.",
          "link": "https://www.elastic.co/blog/the-art-of-the-possible-arming-us-veterans-with-knowledge",
          "publishedOn": "2022-10-13T00:00:00.000Z",
          "wordCount": 8662,
          "title": "The art of the possible: Arming U.S. veterans with knowledge",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt27b982477dd915e2/6297bbb5ae6f0e4156d191e7/meet-user-expectations-smiley-result-1680x980.png"
        },
        {
          "id": "https://www.elastic.co/blog/the-art-of-the-possible-arming-us-veterans-with-knowledge",
          "author": "Cami Lewis",
          "description": ",\nElastic can be used to help us understand the data that impacts our daily lives and guides our decisions, and the possibilities for individual use cases are endless. Our community is full of success stories about innovative ways Elastic empowers our users to make meaning out of data — and Isra Sunhachawi, senior solutions architect at Elastic recently did just that. Using the Elastic stack, Isra developed interactive maps and dashboards to depict the journey of a veteran from pre-enlistment to retirement. His tool distills otherwise meaningless data into useful information to help service members make informed decisions about housing, healthcare, and more.\n,In 2022, Isra submitted his tool to the Academy Health DataJam Challenge and he won, successfully demonstrating the enormous potenti…",
          "link": "https://www.elastic.co/blog/the-art-of-the-possible-arming-us-veterans-with-knowledge",
          "publishedOn": "2022-10-13T00:00:00.000Z",
          "wordCount": 8662,
          "title": "The art of the possible: Arming U.S. veterans with knowledge",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt27b982477dd915e2/6297bbb5ae6f0e4156d191e7/meet-user-expectations-smiley-result-1680x980.png"
        },
        {
          "id": "https://www.elastic.co/blog/by-the-numbers-public-sector-organizations-quantify-the-benefits-of-elastic-solutions",
          "author": "Leanne Link",
          "description": "To help public sector organizations better understand how their peers are using Elastic and what results they’re seeing, we partnered with Socratic Technologies to manage and analyze a survey of our public sector and education customers.",
          "link": "https://www.elastic.co/blog/by-the-numbers-public-sector-organizations-quantify-the-benefits-of-elastic-solutions",
          "publishedOn": "2022-10-12T00:00:00.000Z",
          "wordCount": 8332,
          "title": "By the numbers: Public sector organizations quantify the benefits of Elastic solutions",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltf5b360e2c890f278/6345ca74a75f39138053b8e5/01-shuttle-launch.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/the-evolution-of-discover-in-kibana",
          "author": "Matthias Polman-Wilhelm",
          "description": "Discover has been around for quite some time in Kibana. But recently, we've added a new document table, field statistics, and the ability to create threshold alert rules.",
          "link": "https://www.elastic.co/blog/the-evolution-of-discover-in-kibana",
          "publishedOn": "2022-10-12T00:00:00.000Z",
          "wordCount": 8512,
          "title": "The evolution of Discover in Kibana",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltb32fd2bb6a2cdb2e/62584638102a0b4e934e16fe/fao-1200x628-stack-drag-and-drop-white.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/the-automotive-landscape-is-transforming-how-can-industry-leaders-stay-ahead-of-the-curve",
          "author": "Suranjeeta Choudhury",
          "description": "The digital transformation process in the automotive industry has already begun. With the current macroeconomic  headwinds, find out how automakers, OEMs, and suppliers can be successful in overcoming those speed bumps.",
          "link": "https://www.elastic.co/blog/the-automotive-landscape-is-transforming-how-can-industry-leaders-stay-ahead-of-the-curve",
          "publishedOn": "2022-10-12T00:00:00.000Z",
          "wordCount": 8181,
          "title": "The automotive landscape is transforming — how can industry leaders stay ahead of the curve?",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt07422fa410fa6515/6346fc69e62c4d1068b76844/libraries-edev-ops-1680x980.png"
        },
        {
          "id": "https://www.elastic.co/blog/by-the-numbers-public-sector-organizations-quantify-the-benefits-of-elastic-solutions",
          "author": "Leanne Link",
          "description": ",\nWhen analyzing solution providers, it’s easy to get stuck in lists of product features and benefits, and harder to quantify what the actual results will be in your own environment. In some industries, like public sector, decision makers need to justify investments that will be put toward specialized use cases that apply only to their field, such as defense or public safety.\n\nTo help public sector organizations better understand how their peers are using Elastic and what results they’re seeing, we partnered with Socratic Technologies to manage and analyze a survey of our public sector and education customers. We wanted to know how — and how much — Elastic is helping them meet their missions, so that other organizations can understand how to best meet theirs. Respondents answered questions…",
          "link": "https://www.elastic.co/blog/by-the-numbers-public-sector-organizations-quantify-the-benefits-of-elastic-solutions",
          "publishedOn": "2022-10-12T00:00:00.000Z",
          "wordCount": 8332,
          "title": "By the numbers: Public sector organizations quantify the benefits of Elastic solutions",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltf5b360e2c890f278/6345ca74a75f39138053b8e5/01-shuttle-launch.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/the-evolution-of-discover-in-kibana",
          "author": "Matthias Polman-Wilhelm",
          "description": ",\nDiscover has been around for quite some time. Still, it is one of the most used parts of Kibana, allowing you to search and view the atoms of Elasticsearch: the indexed documents. In 2015, it was released as part of Kibana 4. Let’s have a look at the early days of data discovery:\nhttps://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt35ed3799b53db14f/6345c21b366c7610e0fbccc4/blog-elastic-evolution-1.png,blog-elastic-evolution-1.png,\nIn 5.6, the last significant change enabling users to view surrounding documents of a selected document was added (it was a separate plugin at that time). During 6.x and 7.x, we focused on removing technical debt, like moving from Angular 1 to React and migrating to Kibana’s new platform.\n\nNow in 8.x, we’ve been adding big changes one after another. W…",
          "link": "https://www.elastic.co/blog/the-evolution-of-discover-in-kibana",
          "publishedOn": "2022-10-12T00:00:00.000Z",
          "wordCount": 8512,
          "title": "The evolution of Discover in Kibana",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltb32fd2bb6a2cdb2e/62584638102a0b4e934e16fe/fao-1200x628-stack-drag-and-drop-white.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/the-automotive-landscape-is-transforming-how-can-industry-leaders-stay-ahead-of-the-curve",
          "author": "Suranjeeta Choudhury",
          "description": ",\nThe automotive industry is on the cusp of a phase shift — thanks to changes in buyer behavior, mobility preferences, and technology advances in connectivity and AI. In fact, according to a Deloitte study,1 by 2035 revenues from “as-a-service” business models that leverage the economies of scale will grow by over 400%.\n\nThe digital transformation process has already begun. Leading car manufacturers have joined forces in various initiatives, such as the Mobility Open Blockchain Initiative (MOBI)2 and the MaaS Alliance,3 to simplify and protect financial operations, build transparency and agility in the supply chain, and design future-proof solutions that protect and accelerate the ability to achieve shared ownership and usage models at scale.\n\nWith the current macroeconomic conditions acti…",
          "link": "https://www.elastic.co/blog/the-automotive-landscape-is-transforming-how-can-industry-leaders-stay-ahead-of-the-curve",
          "publishedOn": "2022-10-12T00:00:00.000Z",
          "wordCount": 8181,
          "title": "The automotive landscape is transforming — how can industry leaders stay ahead of the curve?",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt07422fa410fa6515/6346fc69e62c4d1068b76844/libraries-edev-ops-1680x980.png"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-and-google-cloud-announce-expanded-and-deeper-partnership",
          "author": "Alvin Richards,Brian Bergholm",
          "description": "We’re pleased to share that Elastic and Google Cloud are expanding and deepening our partnership to help organizations search, observe, and protect their data and workloads on Google Cloud.",
          "link": "https://www.elastic.co/blog/elastic-and-google-cloud-announce-expanded-and-deeper-partnership",
          "publishedOn": "2022-10-11T00:00:00.000Z",
          "wordCount": 8277,
          "title": "Elastic and Google Cloud announce expanded and deeper partnership",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt5eeb33aa9737b10d/634424bd2a8d0a11633dbadf/illustration-google-cloud-elastic-1680x980_(1).png"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-and-google-cloud-announce-expanded-and-deeper-partnership",
          "author": "Alvin Richards,Brian Bergholm",
          "description": ",\nWe’re pleased to share that Elastic and Google Cloud are expanding and deepening our partnership to help organizations more easily search, observe, and protect their data and workloads. \n\nToday, we announce three new integrations we will be working on together: \n\nAn integrated search experience with BigQuery and BigLake, allowing users to employ Elasticsearch to drive insights from data that reside in data lakes on Google Cloud.\nNative integrations into a broader set of Google Cloud services for Elastic Observability and Elastic Security.\nAn integrated visualization experience for Looker to enable users to easily view Elastic analytical insights.\n\nOur joint investments will make it easier for customers to monitor and secure Google Cloud workloads; build advanced search capabilities bring…",
          "link": "https://www.elastic.co/blog/elastic-and-google-cloud-announce-expanded-and-deeper-partnership",
          "publishedOn": "2022-10-11T00:00:00.000Z",
          "wordCount": 8277,
          "title": "Elastic and Google Cloud announce expanded and deeper partnership",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt5eeb33aa9737b10d/634424bd2a8d0a11633dbadf/illustration-google-cloud-elastic-1680x980_(1).png"
        },
        {
          "id": "https://www.elastic.co/blog/how-to-add-a-store-locator-to-your-ecommerce-storefront-with-elastic",
          "author": "Lionel Palacin",
          "description": "See how to add a physical store locator, complete with maps, on your ecommerce storefront with Elastic Enterprise Search. This step-by-step post includes code samples and a code sandbox for you to try it out.",
          "link": "https://www.elastic.co/blog/how-to-add-a-store-locator-to-your-ecommerce-storefront-with-elastic",
          "publishedOn": "2022-10-10T15:00:00.000Z",
          "wordCount": 10042,
          "title": "How to add a store locator to your ecommerce storefront with Elastic",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltfa3672eea901e2f5/63443097366c7610e0fbc380/illustration-industries-retail-social-1680x980.png"
        },
        {
          "id": "https://www.elastic.co/blog/how-to-add-a-store-locator-to-your-ecommerce-storefront-with-elastic",
          "author": "Lionel Palacin",
          "description": ",\nOne thing that adds value to a business’s ecommerce presence is the ability for customers to easily find physical stores with an interactive map. Store locators can be built quite rapidly — all you need to place them on a map is geographic location in latitude and longitude.\n\n\nIn this post, I’ll outline the pieces needed to put together a proof-of-concept store locator that could later be added to an ecommerce website.\n\n\n[Related article: Building personalized ecommerce search experiences with Elastic]\nIndexing data and making it searchable\nIn this example, we’re going to make use of two datasets:\n\nA list of stores with their location\nA list of cities in the U.S. with their location \n\nBoth datasets are provided in our sample repository as JSON files.\n\n\nHere is an example of a store in JS…",
          "link": "https://www.elastic.co/blog/how-to-add-a-store-locator-to-your-ecommerce-storefront-with-elastic",
          "publishedOn": "2022-10-10T15:00:00.000Z",
          "wordCount": 10042,
          "title": "How to add a store locator to your ecommerce storefront with Elastic",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltfa3672eea901e2f5/63443097366c7610e0fbc380/illustration-industries-retail-social-1680x980.png"
        },
        {
          "id": "https://www.elastic.co/blog/culture-world-mental-health-day-2021-supporting-elasticians-and-their-families-to-be-well",
          "author": "Leah Sutton",
          "description": "World Mental Health Day is October 10th and is a time to raise awareness around prioritizing our mental health and continuing the conversation in the workplace.",
          "link": "https://www.elastic.co/blog/culture-world-mental-health-day-2021-supporting-elasticians-and-their-families-to-be-well",
          "publishedOn": "2022-10-10T06:30:00.000Z",
          "wordCount": 7647,
          "title": "World Mental Health Day 2022: Supporting Elasticians and their families to Be.Well",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt19897be70fe7c781/615f3733e29d690734fef4e0/big-World_Mental_Health_Day_blog.png"
        },
        {
          "id": "https://www.elastic.co/blog/culture-world-mental-health-day-2021-supporting-elasticians-and-their-families-to-be-well",
          "author": "Leah Sutton",
          "description": ",\nWorld Mental Health Day is on October 10, and Elastic remains committed to supporting Elasticians and their mental well-being through a range of support programs.\nAs a mom, wife, daughter, colleague and leader here at Elastic, I understand how we all play myriad roles outside of the one listed on our resume or LinkedIn profile. As I’ve struggled and have seen my friends, family, and colleagues struggle to show up for themselves and for each other, I’ve thought a great deal about how crucial it is to make yourself a priority. We can’t even begin to do our best work until we can bring our best self to all of the roles that make us who we are. \nThis week is a reminder for all of us to acknowledge the importance of prioritizing our mental health and continuing the conversation in the workpla…",
          "link": "https://www.elastic.co/blog/culture-world-mental-health-day-2021-supporting-elasticians-and-their-families-to-be-well",
          "publishedOn": "2022-10-10T06:30:00.000Z",
          "wordCount": 7647,
          "title": "World Mental Health Day 2022: Supporting Elasticians and their families to Be.Well",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt19897be70fe7c781/615f3733e29d690734fef4e0/big-World_Mental_Health_Day_blog.png"
        },
        {
          "id": "https://www.elastic.co/blog/managing-data-automation-through-hot-warm-cold-and-frozen-tiers-no-coding-needed",
          "author": "Joshua Quek",
          "description": "This post serves as a guide on how to use Kibana's “Stack Management” feature-set to automate the movement of your data through hot, warm, cold and frozen tiers, without the need to do any coding or execute command-line actions.",
          "link": "https://www.elastic.co/blog/managing-data-automation-through-hot-warm-cold-and-frozen-tiers-no-coding-needed",
          "publishedOn": "2022-10-10T00:00:00.000Z",
          "wordCount": 10377,
          "title": "Managing data automation through hot, warm, cold, and frozen tiers — No coding needed!",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt308a61dfa6231c99/6297bb2d9687cd428c1fa2b3/library-branding-elastic-stack-midnight-1680x980-no-logo.png"
        },
        {
          "id": "https://www.elastic.co/blog/maximizing-the-experience-of-elastic-cloud-on-kubernetes-with-azure-kubernetes-service",
          "author": "Hemant Malik",
          "description": "Elastic on Azure allows you to harness your data to better understand customers, refine operations, and develop trusted long-term relationships.",
          "link": "https://www.elastic.co/blog/maximizing-the-experience-of-elastic-cloud-on-kubernetes-with-azure-kubernetes-service",
          "publishedOn": "2022-10-10T00:00:00.000Z",
          "wordCount": 7062,
          "title": "Maximizing the experience of Elastic Cloud on Kubernetes with Azure Kubernetes Service",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltb01f1cea2ef0f12c/63449248666f14117a08b77f/illustration-microsoft-azure-elastic-1680x980.png"
        },
        {
          "id": "https://www.elastic.co/blog/managing-data-automation-through-hot-warm-cold-and-frozen-tiers-no-coding-needed",
          "author": "Joshua Quek",
          "description": ",\nIf you are looking to do exactly what the title of this article suggests, look no further. This post intends to be a guide on how one can use the Kibana Dashboard’s “Stack Management” feature-set to automate the movement of your data through hot, warm, cold, and frozen tiers, without the need to do any coding or execute command-line actions.\nBefore we begin: Core concepts\nLet’s take a step back to understand some core concepts of how data sits and moves within your Elasticsearch cluster before we go into how you can automate its movement. This is so we will be familiar with certain terms and patterns later on when we go into the hands-on step-by-step process in practice.\n\nIf your organization stores data, you will definitely need to consider a technical concept called “High Availability”…",
          "link": "https://www.elastic.co/blog/managing-data-automation-through-hot-warm-cold-and-frozen-tiers-no-coding-needed",
          "publishedOn": "2022-10-10T00:00:00.000Z",
          "wordCount": 10377,
          "title": "Managing data automation through hot, warm, cold, and frozen tiers — No coding needed!",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt308a61dfa6231c99/6297bb2d9687cd428c1fa2b3/library-branding-elastic-stack-midnight-1680x980-no-logo.png"
        },
        {
          "id": "https://www.elastic.co/blog/maximizing-the-experience-of-elastic-cloud-on-kubernetes-with-azure-kubernetes-service",
          "author": "Hemant Malik",
          "description": ",\nThe world’s most iconic retailers leverage Elastic to streamline product development, perform smoother application monitoring, and close essential security gaps. With a tailored set of tools, you can create unique customer journeys that drive revenue and maximize your omnichannel strategy. Elastic on Azure allows you to harness your data to better understand customers, refine operations, and develop trusted long-term relationships.\nElastic and Azure Kubernetes Apps Marketplace \nOur partnership with Microsoft is focused on helping you get more out of both your data and your infrastructure. By combining the power of search and a future-ready cloud, it’s easier than ever to innovate and adapt to turn possibilities into results. With Elastic and Microsoft Azure, you can search faster, keep m…",
          "link": "https://www.elastic.co/blog/maximizing-the-experience-of-elastic-cloud-on-kubernetes-with-azure-kubernetes-service",
          "publishedOn": "2022-10-10T00:00:00.000Z",
          "wordCount": 7062,
          "title": "Maximizing the experience of Elastic Cloud on Kubernetes with Azure Kubernetes Service",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltb01f1cea2ef0f12c/63449248666f14117a08b77f/illustration-microsoft-azure-elastic-1680x980.png"
        }
      ]
    },
    {
      "title": "Ansible Blog",
      "feedUrl": "https://www.ansible.com/blog/rss.xml",
      "siteUrl": "https://www.ansible.com/blog",
      "articles": [
        {
          "id": "https://www.ansible.com/blog/ansible-and-packer-why-they-are-better-together",
          "author": "scavanau@redhat.com (Sean Cavanaugh)",
          "description": "Red Hat Ansible Automation Platform can help you orchestrate, operationalize and govern your hybrid cloud deployments.  In my last public cloud blog, I talked about Two Simple Ways Automation Can Save You Money on Your AWS Bill and similarly to Ashton’s blog Bringing Order to the Cloud: Day 2 Operations in AWS with Ansible, we both wanted to look outside the common public cloud use-case of provisioning and deprovisioning resources and instead look at automating common operational tasks.  For this blog post I want to cover how the Technical Marketing team for Ansible orchestrates a pipeline for demos and workshops with Ansible and how we integrate that with custom AMIs (Amazon Machine Images) created with Packer.  Packer is an open source tool that allows IT operators to standardize and automate the process of building system images.",
          "link": "https://www.ansible.com/blog/ansible-and-packer-why-they-are-better-together",
          "publishedOn": "2022-10-03T13:00:00.000Z",
          "wordCount": 3645,
          "title": "Using Ansible and Packer, From Provisioning to Orchestration",
          "imageUrl": "https://lh6.googleusercontent.com/z95BNeupD4B20SB-bsp_c3yUweZUTdjlUCR8RWalV4lRr1o0nmZSpFa2rdYqCnytvowXIRNcx-vv_JD-Vyp9HF5n7TW7Lyfi_mbbBKzHq5zHuIcDyeF38v-ddQLWkn0luR-ZhxKztPrMdiqNOIgN8rmeWtUZBNJ1lBtVkxsU_NBUZCRWqtlKIKoAsg"
        },
        {
          "id": "https://www.ansible.com/blog/dynamic-inventory-plugin-collection-for-network-device-management",
          "author": "Eric McLeroy",
          "description": "Tackling the complexities of enterprise inventories\n \r\nOne common challenge our customers face is the need to track hosts from multiple sources: LDAP, cloud providers, and enterprise CMDB systems. Using a dynamic inventory allows users to integrate with these systems and update the Ansible inventory as it varies over time, with hosts spinning up and shutting down in response to business demands.",
          "link": "https://www.ansible.com/blog/dynamic-inventory-plugin-collection-for-network-device-management",
          "publishedOn": "2022-09-28T13:00:00.000Z",
          "wordCount": 3336,
          "title": "Dynamic inventory plugin collection for network device management",
          "imageUrl": "https://www.ansible.com/hubfs/network%20device%20management%20blog.png"
        },
        {
          "id": "https://www.ansible.com/blog/migrate-to-azure-monitor-agent-on-azure-arc-using-red-hat-ansible-automation-platform",
          "author": "Scott Harwell",
          "description": "Azure Arc is becoming the default Microsoft Azure service for connecting non-Azure infrastructure into Azure monitoring and administration.  Azure has also issued a deprecation notice for the Azure Log Analytics Agents; Microsoft Monitoring Agent and Log Analytics (OMS).  Azure Monitor Agent replaces these agents, introducing a simplified, flexible method of configuring collection configuration called Data Collection Rules. To leverage Azure Monitor Agent with their non-Azure servers, customers will need to onboard their machines to Azure Arc-enabled servers.",
          "link": "https://www.ansible.com/blog/migrate-to-azure-monitor-agent-on-azure-arc-using-red-hat-ansible-automation-platform",
          "publishedOn": "2022-09-26T13:00:00.000Z",
          "wordCount": 4424,
          "title": "Migrate to Azure Monitor Agent on Azure Arc using Red Hat Ansible Automation Platform",
          "imageUrl": "https://www.ansible.com/hubfs/azure%20arc%20blog.png"
        },
        {
          "id": "https://www.ansible.com/blog/why-event-driven-matters",
          "author": "nmartins@redhat.com (Nuno Martins)",
          "description": "Life comes down to moments. These events are often how we define our achievements, successes, and failures throughout life. Just like our daily lives, IT organizations and teams can also have these defining moments, where you will often hear phrases like the \"great database crash of '98.\" Many of these memorable IT  moments occur from limiting ourselves to a reactive approach when it comes to managing our IT assets. This is where event-driven automation can help us move from reactive to proactive IT management – well before we have the next great issue or moment in our IT teams.",
          "link": "https://www.ansible.com/blog/why-event-driven-matters",
          "publishedOn": "2022-09-21T13:00:00.000Z",
          "wordCount": 3202,
          "title": "Why Event-Driven Automation Matters",
          "imageUrl": "https://www.ansible.com/hubfs/Event%20driven%20automation%20blog.png"
        },
        {
          "id": "https://www.ansible.com/blog/how-network-engineers-can-get-more-sleep-using-red-hat-ansible-automation-platform-your-guide-to-ansiblefest-2022",
          "author": "Cindy Russell",
          "description": "Since connectivity is critical to all types of business applications including cloud apps, managing and maintaining the network often falls into the overnight hours. This is great for the business, but it puts a large wrinkle in your work-life balance. Luckily, AnsibleFest is here to help you get more sleep!",
          "link": "https://www.ansible.com/blog/how-network-engineers-can-get-more-sleep-using-red-hat-ansible-automation-platform-your-guide-to-ansiblefest-2022",
          "publishedOn": "2022-09-19T13:00:00.000Z",
          "wordCount": 3091,
          "title": "How network engineers can get more sleep using Red Hat Ansible Automation Platform: Your guide to AnsibleFest 2022",
          "imageUrl": "https://www.ansible.com/hubfs/Screen%20Shot%202022-09-07%20at%2011.09.29%20AM.png"
        }
      ]
    },
    {
      "title": "Azure DevOps Blog",
      "feedUrl": "https://devblogs.microsoft.com/devops/feed/",
      "siteUrl": "https://devblogs.microsoft.com/devops/",
      "articles": [
        {
          "id": "https://devblogs.microsoft.com/devops/?p=65846",
          "author": "Aaron Hallberg",
          "description": "Exciting things are in store for Azure DevOps in the coming year! We’re planning deep investments in security as well as broad investment across the product. Read on for more information, and then be sure to check out our updated roadmap at https://aka.ms/AzureDevOpsRoadmap.\nThe post Integrate security into your developer workflow with GitHub Advanced Security for Azure DevOps appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/integrate-security-into-your-developer-workflow-with-github-advanced-security-for-azure-devops/",
          "publishedOn": "2022-10-12T12:59:49.000Z",
          "wordCount": 7148,
          "title": "Integrate security into your developer workflow with GitHub Advanced Security for Azure DevOps",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/10/AzDO-heart-Security.png"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=65675",
          "author": "Angel Wong",
          "description": "We have resolved a known issue regarding publishing extensions to the Visual Studio Marketplace. If you’ve run into the error message: “Your ability to create global personal access tokens (PATs) is restricted by your organization.”, this is likely because your administrator has enabled a policy to restrict the creation of global personal access tokens (PATs).\nThe post Publishing extensions to Marketplace issue resolved appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/publishing-extensions-to-marketplace-issue-resolved/",
          "publishedOn": "2022-10-10T16:08:03.000Z",
          "wordCount": 3850,
          "title": "Publishing extensions to Marketplace issue resolved",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/10/start_4.png"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=65804",
          "author": "Dan Hellem",
          "description": "Sprint 211 was a busy one. We were able to complete a lot of bugs and yet introduce some new exciting features. We also enabled a “Try the New Boards Hub” banner and popup to the legacy boards experience on select organizations.\nThe post New Boards Hub, Sprint 211 Update appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/new-boards-hub-sprint-211-update/",
          "publishedOn": "2022-10-07T14:28:43.000Z",
          "wordCount": 5158,
          "title": "New Boards Hub, Sprint 211 Update",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/10/sketch-3.png"
        }
      ]
    },
    {
      "title": "Discover Dev",
      "feedUrl": "https://www.discoverdev.io/rss.xml",
      "siteUrl": "http://discoverdev.io",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "http://feeds.feedburner.com/AmazonWebServicesBlog",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "f3d6027b89e3960df03f4dc7b386bf38d63c911d",
          "author": "Steve Roberts",
          "description": "This post is part of our Week in Review series. Check back each week for a quick roundup of interesting news and announcements from AWS! Monday means it’s time for another Week in Review post, so, without further ado, let’s dive right in! Last Week’s Launches Here’s some launch announcements from last week you may […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-october-17-2020/",
          "publishedOn": "2022-10-17T17:34:56.000Z",
          "wordCount": 1230,
          "title": "AWS Week in Review – October 17, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/10/17/AWS-WIR-10.17.22.png"
        },
        {
          "id": "71e7c11b2e368b46b3451452c13a32231a1453a3",
          "author": "Antje Barth",
          "description": "Deep learning (DL) models have been increasing in size and complexity over the last few years, pushing the time to train from days to weeks. Training large language models the size of GPT-3 can take months, leading to an exponential growth in training cost. To reduce model training times and enable machine learning (ML) practitioners […]",
          "link": "https://aws.amazon.com/blogs/aws/amazon-ec2-trn1-instances-for-high-performance-model-training-are-now-available/",
          "publishedOn": "2022-10-10T21:31:33.000Z",
          "wordCount": 2017,
          "title": "Amazon EC2 Trn1 Instances for High-Performance Model Training are Now Available",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/08/19/Site-Merch_EC2-Trainium_Blog.png"
        },
        {
          "id": "7c008f7e8cef2812709e94fb9b2a1a09fcd48422",
          "author": "Marcia Villalba",
          "description": "This post is part of our Week in Review series. Check back each week for a quick roundup of interesting news and announcements from AWS! I had an amazing start to the week last week as I was speaking at the AWS Community Day NL. This event had 500 attendees and over 70 speakers, and […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-october-10-2022/",
          "publishedOn": "2022-10-10T20:53:03.000Z",
          "wordCount": 1317,
          "title": "AWS Week in Review – October 10, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/10/10/AWS-WIR-10.10.22.png"
        },
        {
          "id": "4ed417884c91622d902ab22f2b9f806063ec1a09",
          "author": "Jeff Barr",
          "description": "In late 2019 I told you about the AWS Local Zone in Los Angeles, California. In that post I described Local Zones as a new type of AWS infrastructure deployment that brings select AWS services very close to a particular geographic area. A year after that launch, I announced our plans to add 3 more […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-local-zones-expansion-taipei-and-delhi/",
          "publishedOn": "2022-10-05T21:30:38.000Z",
          "wordCount": 1331,
          "title": "AWS Local Zones Expansion: Taipei and Delhi",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/10/04/Site-Merch_AWS-Local-Zones_Blog.png"
        },
        {
          "id": "b52baf93c46bb68d0030598dd7ae15d1a9913d72",
          "author": "Veliswa Boya",
          "description": "In June 2022 AWS announced a preview of Amazon Connect Cases, a feature of Amazon Connect that simplifies these customer interactions and reduces the average handle times of issues. Today I am excited to announce the general availability of Amazon Connect Cases. Cases, a feature of Amazon Connect, makes it easy for your contact center […]",
          "link": "https://aws.amazon.com/blogs/aws/announcing-general-availability-of-amazon-connect-cases/",
          "publishedOn": "2022-10-03T20:41:27.000Z",
          "wordCount": 1258,
          "title": "Announcing General Availability of Amazon Connect Cases",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/10/03/Site-Merch_Amazon-Connect-Keystone-Gardner_Blog.png"
        },
        {
          "id": "ae5d0488bf0646507a69e9e761f48098a248df55",
          "author": "Danilo Poccia",
          "description": "This post is part of our Week in Review series. Check back each week for a quick roundup of interesting news and announcements from AWS! A new week and a new month just started. Curious which were the most significant AWS news from the previous seven days? I got you covered with this post. Last […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-october-3-2022/",
          "publishedOn": "2022-10-03T18:32:35.000Z",
          "wordCount": 1281,
          "title": "AWS Week in Review – October 3, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/10/03/AWS-WIR-10.3.22.png"
        },
        {
          "id": "732ba82c2e85ba6a2394bf8a29ee95a5e73a4c90",
          "author": "Antje Barth",
          "description": "Artificial intelligence (AI) is all around us. AI sends certain emails to our spam folders. It powers autocorrect, which helps us fix typos when we text. And now we can use it to solve business problems. In business, data-driven insights have become increasingly valuable. These insights are often discovered with the help of machine learning […]",
          "link": "https://aws.amazon.com/blogs/aws/new-hands-on-course-for-business-analysts-practical-decision-making-using-no-code-ml-on-aws/",
          "publishedOn": "2022-10-03T16:26:34.000Z",
          "wordCount": 1830,
          "title": "New Hands-On Course for Business Analysts – Practical Decision Making using No-Code ML on AWS",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/27/Amazon-SageMaker-Canvas_Blog.png"
        },
        {
          "id": "5ab6ca4c7fbca6e707e93106cb015a859442a687",
          "author": "Sébastien Stormacq",
          "description": "I am pleased to announce today the availability of Amazon File Cache, a new high-speed cache service on AWS designed for processing file data stored in disparate locations—including on premises. File Cache accelerates and simplifies your most demanding cloud bursting and hybrid workflows by giving your applications access to files using a fast and familiar […]",
          "link": "https://aws.amazon.com/blogs/aws/amazon-file-cache-a-high-performance-cache-on-aws-for-your-on-premises-file-systems/",
          "publishedOn": "2022-09-30T14:56:40.000Z",
          "wordCount": 2235,
          "title": "Amazon File Cache – A High Performance Cache On AWS For Your On-Premises File Systems",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/29/Site-Merch_Amazon-File-Cache_Blog.png"
        },
        {
          "id": "f345653beefe2e326410b05edcca8bc0fdf98a41",
          "author": "Sébastien Stormacq",
          "description": "At AWS, we love to give our customers choices: the choice of infrastructure to deploy your workloads, to store your most important data, or the operating systems for your virtual desktops. Many of you choose Amazon Workspaces to provision and distribute virtual desktops securely and at scale to your workforce. Our customers choose Workspaces when […]",
          "link": "https://aws.amazon.com/blogs/aws/amazon-workspaces-introduces-ubuntu-desktops/",
          "publishedOn": "2022-09-29T16:48:05.000Z",
          "wordCount": 1596,
          "title": "Amazon WorkSpaces Introduces Ubuntu Desktops",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/29/Site-Merch_Ubuntu-Desktop-for-Workspaces_Blog-1.png"
        },
        {
          "id": "852c2e070c6cea86911d87c790881d8de55886cb",
          "author": "Channy Yun",
          "description": "Today we announce the general availability of AWS IoT FleetWise, a fully managed AWS service that makes it easier to collect, transform, and transfer vehicle data to the cloud. Last AWS re:Invent 2021, we previewed AWS IoT FleetWise, heard customer feedback, and improved features for various use cases of near-real-time vehicle data processing. With AWS […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-iot-fleetwise-now-generally-available-easily-collect-vehicle-data-and-send-to-the-cloud/",
          "publishedOn": "2022-09-27T16:54:48.000Z",
          "wordCount": 2460,
          "title": "AWS IoT FleetWise Now Generally Available – Easily Collect Vehicle Data and Send to the Cloud",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/22/Site-Merch_AWS-IoT-FleetWise_Blog.png"
        },
        {
          "id": "7ba7c22c89a95d2ced12a3220867b6146d0a2db5",
          "author": "Sébastien Stormacq",
          "description": "It looks like my travel schedule is coupled with this Week In Review series of blog posts. This week, I am traveling to Fort-de-France in the French Caribbean islands to meet our customers and partners. I enjoy the travel time when I am offline. It gives me the opportunity to reflect on the past or […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-september-26-2022/",
          "publishedOn": "2022-09-26T23:21:36.000Z",
          "wordCount": 1699,
          "title": "AWS Week In Review — September 26, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/24/AWS-WIR-9.26.22.png"
        },
        {
          "id": "44f16a5754d845987d5a9cddff8e927e1897ca2b",
          "author": "Sébastien Stormacq",
          "description": "I am pleased to announce the availability of local clusters for Amazon Elastic Kubernetes Service (Amazon EKS) on AWS Outposts. It means that starting today, you can deploy your Amazon EKS cluster entirely on Outposts: both the Kubernetes control plane and the nodes. Amazon EKS is a managed Kubernetes service that makes it easy for […]",
          "link": "https://aws.amazon.com/blogs/aws/deploy-your-amazon-eks-clusters-locally-on-aws-outposts/",
          "publishedOn": "2022-09-20T16:05:47.000Z",
          "wordCount": 2133,
          "title": "Deploy your Amazon EKS Clusters Locally on AWS Outposts",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/13/Site-Merch_Amazon-Elastic-Kubernetes-Service_EKS-on-Outposts_Blog.png"
        },
        {
          "id": "c87835feafb2eecd408bc548fd91e06e13509083",
          "author": "Jeff Barr",
          "description": "Things are heating up in Seattle, with preparation for AWS re:Invent 2022 well underway. Later this month the entire News Blog team will participate in our now-legendary “speed storming” event. Over the course of three or four days, each of the AWS service teams with a launch in the works for re:Invent will give us […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-september-19-2022/",
          "publishedOn": "2022-09-19T19:13:12.000Z",
          "wordCount": 1795,
          "title": "AWS Week in Review – September 19, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/19/AWS-WIR-9.19.22.png"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/atom.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2686/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/space_adventure.png\" title=\"&quot;Sir, it looked really cool.&quot; &quot;Oh no--prestige TV. Okay, which of you has a terrible secret that's being slowly revealed to the audience through flashbacks? Just spit it out so we can escape this arc!&quot;\" alt=\"&quot;Sir, it looked really cool.&quot; &quot;Oh no--prestige TV. Okay, which of you has a terrible secret that's being slowly revealed to the audience through flashbacks? Just spit it out so we can escape this arc!&quot;\" />",
          "link": "https://xkcd.com/2686/",
          "publishedOn": "2022-10-17T00:00:00.000Z",
          "wordCount": 232,
          "title": "Space Adventure",
          "imageUrl": "https://imgs.xkcd.com/comics/space_adventure_2x.png"
        },
        {
          "id": "https://xkcd.com/2685/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/2045.png\" title=\"&quot;Sorry, doctor, I'm going to have to come in on a different day--I have another appointment that would be really hard to move, in terms of the kinetic energy requirements.&quot;\" alt=\"&quot;Sorry, doctor, I'm going to have to come in on a different day--I have another appointment that would be really hard to move, in terms of the kinetic energy requirements.&quot;\" />",
          "link": "https://xkcd.com/2685/",
          "publishedOn": "2022-10-14T00:00:00.000Z",
          "wordCount": 230,
          "title": "2045",
          "imageUrl": "https://imgs.xkcd.com/comics/2045_2x.png"
        },
        {
          "id": "https://xkcd.com/2684/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/road_space_comparison.png\" title=\"I wonder how hard it would be to ride an electric scooter in a hamster ball.\" alt=\"I wonder how hard it would be to ride an electric scooter in a hamster ball.\" />",
          "link": "https://xkcd.com/2684/",
          "publishedOn": "2022-10-12T00:00:00.000Z",
          "wordCount": 234,
          "title": "Road Space Comparison",
          "imageUrl": "https://imgs.xkcd.com/comics/road_space_comparison_2x.png"
        },
        {
          "id": "https://xkcd.com/2683/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/fan_theories.png\" title=\"The universe fandom is great. Such sweet and enthusiastic people.\" alt=\"The universe fandom is great. Such sweet and enthusiastic people.\" />",
          "link": "https://xkcd.com/2683/",
          "publishedOn": "2022-10-10T00:00:00.000Z",
          "wordCount": 232,
          "title": "Fan Theories",
          "imageUrl": "https://imgs.xkcd.com/comics/fan_theories_2x.png"
        }
      ]
    },
    {
      "title": "Camunda",
      "feedUrl": "https://camunda.com/feed/",
      "siteUrl": "https://camunda.com/",
      "articles": [
        {
          "id": "https://camunda.com/?p=65420",
          "author": "Bernd Ruecker",
          "description": "Learn from Bernd Ruecker, Camunda Co-founder/Chief Technologist, and Daniel Meyer, Camunda CTO, as they tackle questions on connectors, modeling & more.\nThe post CamundaCon 2022: Q&A with Bernd and Daniel appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/10/camundacon-2022-qa-bernd-daniel/",
          "publishedOn": "2022-10-14T20:00:27.000Z",
          "wordCount": 3675,
          "title": "CamundaCon 2022: Q&A with Bernd and Daniel",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/10/CamundaCon-QA-Bernd-Daniel.png"
        },
        {
          "id": "https://camunda.com/?p=64638",
          "author": "Christophe Dame",
          "description": "Directory services are an effective way to manage an organization’s users, groups, printers, devices, and more. Most organizations accomplish this using Active Directory, Apache Directory, Oracle Internet Directory, or other similar tools. Recently I worked with a customer who wanted to see how he could secure the Camunda 8 Platform and process applications with such a directory. Their requirements consisted of: Allowing Directory users to access Camunda applications (Tasklist, Operate, Optimize) Accessing secured Tasklist & Operate APIs from our custom project Securing the custom project In this article, I’ll briefly explain the 3 easy steps taken to fulfill their requirements which include: Federate users from the Directory service into Keycloak Declare an application in Identity to access Camunda APIs Configure...\nThe post Securing Camunda 8 self-managed cluster and applications behind a directory appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/10/securing-camunda-8-self-managed-cluster-and-applications-behind-a-directory/",
          "publishedOn": "2022-10-12T13:01:00.000Z",
          "wordCount": 3110,
          "title": "Securing Camunda 8 self-managed cluster and applications behind a directory",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/10/Active_Directory_Camunda_Platform_8.png"
        },
        {
          "id": "https://camunda.com/?p=64965",
          "author": "Camunda Platform Team",
          "description": "We’re extremely excited to announce the release of Camunda Platform 8.1.  In this post, we will go into the highlights of this release including Web Modeler, Connectors, Zeebe, Operate, Optimize, and more. Here’s the highlights of what’s included in this release: Easier Installation and maintenance for Camunda Platform Self-managed Hot backups for Self-Managed Token-Based authentication Modeler updates Process Templates FEEL Expression Editor Inline Annotations Changes to Camunda forms Connectors updates Workflow engine updates Operate updates Optimize updates Let’s get started! Easier installation and maintenance for Camunda Platform Self-Managed Improved Guides and Support for OpenShift and Amazon EKS (AWS) With this release, we are introducing official support for deploying and running Camunda Platform 8 Self-Managed on OpenShift and Amazon EKS (AWS)....\nThe post Camunda Platform 8.1 Released – What’s New appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/10/camunda-platform-8-1-released-whats-new/",
          "publishedOn": "2022-10-11T14:00:00.000Z",
          "wordCount": 6290,
          "title": "Camunda Platform 8.1 Released – What’s New",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/10/screenshot-camunda.com-2022.10.11-09_14_38.png"
        },
        {
          "id": "https://camunda.com/?p=65073",
          "author": "Camunda Platform Team",
          "description": "We’re extremely excited to announce the release of Camunda Platform 7.18 Here are some of the highlights: Cockpit: Improved instance selection to avoid unintended batch operations Cockpit: Easier navigation of high batch operation volumes MDC logging features Camunda Forms in Tasklist: Populate select options via process data Exception error codes Filter and order tasks by last updated WebSphere Liberty New and retired supported environments You can download Camunda Platform or run it with Docker. For a complete list of the changes, please check out the release notes. For patched security vulnerabilities, see our security notices. If you want to dig deeper, check out the source code on GitHub. Cockpit: Improved instance selection to avoid unintended batch operations Previously, when performing...\nThe post Camunda Platform 7.18 Released – What’s New appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/10/camunda-platform-7-18-released-whats-new/",
          "publishedOn": "2022-10-11T13:15:00.000Z",
          "wordCount": 3586,
          "title": "Camunda Platform 7.18 Released – What’s New",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/10/Camunda_7.18.png"
        },
        {
          "id": "https://camunda.com/?p=64182",
          "author": "Shane Ernest",
          "description": "We’re thrilled to announce Camunda Platform 8.1, the latest release of our process orchestration solution. This new version introduces features that accelerate connectivity to the many different systems and technologies that are required for true digital transformation, including: Create custom Connectors with our Integration Framework to accelerate connectivity New out-of-the-box Connectors for popular services Enhancements to Camunda Modeler that improve productivity Hot backups and official support for Amazon EKS and Red Hat OpenShift Plus, several upgrades requested by Camunda Platform 7 customers Organizations across all industries rely on complex technology stacks to adapt and enhance their operations in response to market dynamics, new disruptive companies, and increasing consumer expectations. Your technology stack likely includes everything from cutting-edge technologies to legacy...\nThe post Accelerate Connectivity with Camunda Platform 8.1 appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/10/accelerate-connectivity-with-camunda-platform-8-1/",
          "publishedOn": "2022-10-11T12:00:00.000Z",
          "wordCount": 3388,
          "title": "Accelerate Connectivity with Camunda Platform 8.1",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/10/Camunda-8.1-Release_2022_blog-featured-image_1200x630-1.png"
        },
        {
          "id": "https://camunda.com/?p=64132",
          "author": "Niall Deehan",
          "description": "What is FEEL As a part of the Decision Model and Notation (DMN) specification, the OMG also defined the Friendly Enough Expression Language (FEEL).  Since DMN is intended to be used by designers and business analysts who would like to build decision tables, FEEL needed to be designed as an uncomplicated and human-readable expression language that would help readers understand the logic being described or executed by the DMN table.  Expression languages are typically used by developers to evaluate data to produce a result based on query parameters or conditions. This means it’s syntactically closer to code than human-readable sentences. Since one of the goals of FEEL is to be “process analyst friendly,” it prioritizes readability more than other expression...\nThe post Using FEEL with Camunda 8 appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/09/using-feel-with-camunda-8/",
          "publishedOn": "2022-09-30T16:53:40.000Z",
          "wordCount": 4157,
          "title": "Using FEEL with Camunda 8",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/09/Camunda_using-FEEL-C8_blog-ftd-image_1200x630.png"
        },
        {
          "id": "https://camunda.com/?p=63983",
          "author": "Bernd Ruecker",
          "description": "Scaling process automation across an enterprise naturally includes a wide array of challenges. To counter these challenges, more and more organizations are evolving their organizational structures accordingly, often creating Centers of Excellence (CoE) and/or communities of practice (CoP). Please note that during this post we will use the term CoE, but keep in mind your organization might call this very differently. That said, in Camunda Platform 8, we included new functionalities that will help companies to scale process automation successfully.  This blog post discusses different aspects of scaling process automation, the role of CoEs, and how new Camunda 8 features support those initiatives.  What does scaling mean? Organizations that want to create a competitive edge through digital transformation (and frankly: which...\nThe post How Camunda 8 supports process automation at enterprise scale appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/09/how-camunda-8-supports-process-automation-at-enterprise-scale/",
          "publishedOn": "2022-09-29T19:30:00.000Z",
          "wordCount": 3899,
          "title": "How Camunda 8 supports process automation at enterprise scale",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/09/Camund_Blog_Process-Automation-at-Enterprise-Scale_1200x630-1.png"
        },
        {
          "id": "https://camunda.com/?p=63832",
          "author": "Josh Wulf",
          "description": "Microservices are an architectural style that structures an application as a collection of services that are: Highly maintainable and testable Loosely coupled Independently deployable Organized around business capabilities Owned by a small team Conway’s Law states that “any organization that designs a system (defined broadly) will produce a design whose structure is a copy of the organization’s communication structure”. If your organization has multiple teams working on different parts of a larger system, then microservices can serve as a separation of concerns that map an independent, encapsulated service to a specific team. These teams have clear boundaries of responsibility and can deploy on their own schedule. These factors lend themselves to a polyglot approach. What this means is that because...\nThe post 7 Best Programming Languages for Microservices appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/09/seven-best-programming-languages-for-microservices/",
          "publishedOn": "2022-09-29T13:30:00.000Z",
          "wordCount": 5127,
          "title": "7 Best Programming Languages for Microservices",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/09/Camunda_Blog_7-Best-Programming-Languages-Microservices_1200x630-1.png"
        },
        {
          "id": "https://camunda.com/?p=63238",
          "author": "Christopher Zell",
          "description": "During Summer Hackdays 2022, I worked on a project called “Zeebe chaos” (zbchaos), a fault injection command-line interface (CLI) tool. This allows us engineers to more easily run chaos experiments against Zeebe, build up confidence in the system’s capabilities, and discover potential weaknesses. Requirements To understand this blog post, it is useful to have a certain understanding of Kubernetes and Zeebe itself. Summer Hackdays: Hackdays are a regular event at Camunda, where people from different departments (engineering, consulting, DevRel, etc.) work together on new ideas, pet projects, and more. Check out previous Summer Hackdays here: Summer Hackdays 2020 Summer Hackdays 2019 Zeebe chaos CLI Working on the Zeebe project is not only about engineering a distributed system or a process...\nThe post Zbchaos — A new fault injection tool for Zeebe appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/09/zbchaos-a-new-fault-injection-tool-for-zeebe/",
          "publishedOn": "2022-09-27T18:00:00.000Z",
          "wordCount": 3876,
          "title": "Zbchaos — A new fault injection tool for Zeebe",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/09/Camunda_blog-ftd-image_2022_zbchaos_1200x630-1.png"
        },
        {
          "id": "https://camunda.com/?p=63178",
          "author": "Jakob Freund",
          "description": "The API economy is taking off, propelled by an explosion of activity across API tools and platforms. According to a 2021 report from Postman, developers reported spending nearly half of their time working on APIs, and 94% of companies planned to increase their investments in APIs in 2022. API-first development is also gaining traction, with an impressive 67% of companies embracing this methodology. Companies like Twilio and Stripe emerged as early winners in this new economy, with the promise of many more to come.  APIs offer organizations an opportunity to tap into best-of-breed software components without having to spend precious time or development resources creating them from scratch. With that said, an often-overlooked aspect of the API economy is how...\nThe post Could Process Orchestration be the “Glue” for the API Economy? appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/09/process-orchestration-api-economy/",
          "publishedOn": "2022-09-23T14:00:00.000Z",
          "wordCount": 2762,
          "title": "Could Process Orchestration be the “Glue” for the API Economy?",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/09/Glue.png"
        }
      ]
    },
    {
      "title": "となりのヤングジャンプ（ワンパンマン）",
      "feedUrl": "https://tonarinoyj.jp/rss/series/13932016480028984490",
      "siteUrl": "https://tonarinoyj.jp/episode/13932016480028985383",
      "articles": [
        {
          "id": "tonarino_yj:episode:316112896867289136",
          "author": "原作/ＯＮＥ/漫画/村田雄介",
          "description": "ワンパンマン",
          "link": "https://tonarinoyj.jp/episode/316112896867289136",
          "publishedOn": "2022-09-21T15:00:00.000Z",
          "wordCount": 211,
          "title": "[第216話] ワンパンマン",
          "enclosure": {
            "url": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/316112896867289136-ec72dd1edd1d2bc1dd7149719034eb96",
            "length": "0",
            "type": "image/jpeg"
          },
          "imageUrl": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/316112896867289136-ec72dd1edd1d2bc1dd7149719034eb96"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.com/blog/all.atom",
      "siteUrl": "https://github.blog/",
      "articles": [
        {
          "id": "https://github.blog/2022-10-17-github-at-the-77th-united-nations-general-assembly/",
          "author": null,
          "description": "Read about how the GitHub Social Impact, Tech for Social Good and Policy teams participated in the 77th session of the United Nations General Assembly, including events we hosted with the World Health Organization and the UN Development Programme.",
          "link": "https://github.blog/2022-10-17-github-at-the-77th-united-nations-general-assembly/",
          "publishedOn": "2022-10-17T17:00:54.000Z",
          "wordCount": 1853,
          "title": "GitHub at the 77th United Nations General Assembly",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/10/196257167-b7382917-06cb-4a0f-ab72-24597b1d1d50.png"
        },
        {
          "id": "https://github.blog/2022-10-17-5-tips-for-embedding-security-into-your-workflows/",
          "author": null,
          "description": "Having a robust security plan is key to innovation. These tips will empower you to gain the upper hand on cyberattacks, so you can ship quickly and innovate with ease.",
          "link": "https://github.blog/2022-10-17-5-tips-for-embedding-security-into-your-workflows/",
          "publishedOn": "2022-10-17T15:00:47.000Z",
          "wordCount": 1564,
          "title": "5 tips for embedding security into your workflows",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/08/Security-Product@2x.png"
        },
        {
          "id": "https://github.blog/2022-10-14-osis-deep-dive-is-an-essential-discussion-on-the-future-of-ai-and-open-source/",
          "author": null,
          "description": "GitHub is sponsoring Open Source Initiative’s Deep Dive: AI because we think it’s important for the community to unpack how open source software, process, and principles can help best deliver on the promise of AI.",
          "link": "https://github.blog/2022-10-14-osis-deep-dive-is-an-essential-discussion-on-the-future-of-ai-and-open-source/",
          "publishedOn": "2022-10-14T16:00:41.000Z",
          "wordCount": 2175,
          "title": "OSI’s Deep Dive is an essential discussion on the future of AI and open source",
          "imageUrl": "https://github.blog/wp-content/uploads/2021/11/GitHub-Policy-blog-banner.png?fit=1200%2C630"
        },
        {
          "id": "https://github.blog/2022-10-13-introducing-github-advanced-security-siem-integrations-for-security-professionals/",
          "author": null,
          "description": "Learn about using GitHub Advanced Security (GHAS) alerts with Security Information and Events Management (SIEM) tools. Check out the integrations, and read more about getting started.",
          "link": "https://github.blog/2022-10-13-introducing-github-advanced-security-siem-integrations-for-security-professionals/",
          "publishedOn": "2022-10-13T19:25:03.000Z",
          "wordCount": 1732,
          "title": "Introducing GitHub Advanced Security SIEM integrations for security professionals",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/08/Security-Product@2x.png"
        },
        {
          "id": "https://github.blog/2022-10-13-the-story-of-scalar/",
          "author": null,
          "description": "New to Git v2.38, Scalar is a built-in repository manager for large repos. Here, we’ll tell the story of how Scalar went from a rough VFS for Git successor to a fully-integrated Git tool, with all of the engineering lessons learned in the process.",
          "link": "https://github.blog/2022-10-13-the-story-of-scalar/",
          "publishedOn": "2022-10-13T15:00:12.000Z",
          "wordCount": 4944,
          "title": "The Story of Scalar",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/10/scalar1.png?fit=1600%2C850"
        },
        {
          "id": "https://github.blog/2022-10-11-the-github-universe-2022-agenda-is-live/",
          "author": null,
          "description": "Explore 80+ content sessions delivered by over 120 different speakers, across two days and four content tracks, all designed to level up your skills.",
          "link": "https://github.blog/2022-10-11-the-github-universe-2022-agenda-is-live/",
          "publishedOn": "2022-10-11T19:39:36.000Z",
          "wordCount": 1772,
          "title": "The GitHub Universe 2022 agenda is live",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/10/universeheader1.png"
        },
        {
          "id": "https://github.blog/2022-10-11-view-github-code-scanning-findings-directly-in-vs-code-and-github-codespaces/",
          "author": null,
          "description": "Developers can now view GitHub code scanning findings directly in VS Code and GitHub Codespaces. The new Microsoft SARIF Viewer extension gives developers direct access to their code scanning results, making remediating vulnerabilities easier than ever.",
          "link": "https://github.blog/2022-10-11-view-github-code-scanning-findings-directly-in-vs-code-and-github-codespaces/",
          "publishedOn": "2022-10-11T19:10:12.000Z",
          "wordCount": 1401,
          "title": "View GitHub code scanning findings directly in VS Code and GitHub Codespaces",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/08/Security-Product@2x.png"
        },
        {
          "id": "https://github.blog/2022-10-11-on-the-go-with-github-projects-on-github-mobile-public-beta/",
          "author": null,
          "description": "Stay connected and up to date on your work with GitHub Projects on GitHub Mobile, now in public beta.",
          "link": "https://github.blog/2022-10-11-on-the-go-with-github-projects-on-github-mobile-public-beta/",
          "publishedOn": "2022-10-11T16:00:52.000Z",
          "wordCount": 1243,
          "title": "On the go with GitHub Projects on GitHub Mobile (public beta)",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/10/195123728-b9bc2e5b-4440-44ab-95c5-479aec8ec922.png"
        },
        {
          "id": "https://github.blog/2022-10-06-developers-are-now-included-in-the-wipo-global-innovation-index/",
          "author": null,
          "description": "We’re excited that the World Intellectual Property Organization (WIPO) has launched the 2022 edition of its Global Innovation Index (GII) with an indicator of developer creative outputs based on GitHub commits.",
          "link": "https://github.blog/2022-10-06-developers-are-now-included-in-the-wipo-global-innovation-index/",
          "publishedOn": "2022-10-06T21:00:36.000Z",
          "wordCount": 1012,
          "title": "Developers are now included in the WIPO Global Innovation Index",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/10/global_innovation_index_2022_1200.jpeg?fit=1200%2C630"
        },
        {
          "id": "https://github.blog/2022-10-06-githubs-supply-chain-security-features-now-support-dart/",
          "author": null,
          "description": "Cross-platform apps built with the popular Flutter toolkit can now benefit from Dependabot alerts.",
          "link": "https://github.blog/2022-10-06-githubs-supply-chain-security-features-now-support-dart/",
          "publishedOn": "2022-10-06T18:00:44.000Z",
          "wordCount": 1281,
          "title": "GitHub’s supply chain security features now support Dart",
          "imageUrl": "https://github.blog/wp-content/uploads/2021/12/github-security_orange-banner.png"
        }
      ]
    },
    {
      "title": "Martin Kleppmann's blog",
      "feedUrl": "https://feeds.feedburner.com/martinkl",
      "siteUrl": "http://martin.kleppmann.com/",
      "articles": [
        {
          "id": "http://martin.kleppmann.com/2022/10/12/verifying-distributed-systems-isabelle.html",
          "author": "Martin Kleppmann",
          "description": "This post also appears on Larry Paulson’s blog. We use distributed systems every day in the form of internet services. These systems are very useful, but also challenging to implement because networks are unpredictable. Whenever you send a message over the network, it is likely to arrive quite quickly, but...",
          "link": "http://martin.kleppmann.com/2022/10/12/verifying-distributed-systems-isabelle.html",
          "publishedOn": "2022-10-12T00:00:00.000Z",
          "wordCount": 2435,
          "title": "Verifying distributed systems with Isabelle/HOL",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Kubernetes – Production-Grade Container Orchestration",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": [
        {
          "id": "https://kubernetes.io/blog/2022/10/05/current-state-2019-third-party-audit/",
          "author": null,
          "description": "Authors (in alphabetical order): Cailyn Edwards (Shopify), Pushkar Joglekar (VMware), Rey Lejano (SUSE) and Rory McCune (DataDog)\nWe expect the brand new Third Party Security Audit of Kubernetes will be\npublished later this month (Oct 2022).\nIn preparation for that, let's look at the state of findings that were made\npublic as part of the last third party security audit of\n2019\nthat was based on Kubernetes v1.13.4.\nMotivation\nCraig Ingram has graciously attempted over the years to keep track of the\nstatus of the findings reported in the last audit in this issue:\nkubernetes/kubernetes#81146.\nThis blog post will attempt to dive deeper into this, address any gaps\nin tracking and become a point in time summary of the state of the\nfindings reported from 2019.\nThis article should also help reader…",
          "link": "https://kubernetes.io/blog/2022/10/05/current-state-2019-third-party-audit/",
          "publishedOn": "2022-10-05T00:00:00.000Z",
          "wordCount": 3934,
          "title": "Blog: Current State: 2019 Third Party Security Audit of Kubernetes",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/10/04/introducing-kueue/",
          "author": null,
          "description": "Authors: Abdullah Gharaibeh (Google), Aldo Culquicondor (Google)\nWhether on-premises or in the cloud, clusters face real constraints for resource usage, quota, and cost management reasons. Regardless of the autoscalling capabilities, clusters have finite capacity. As a result, users want an easy way to fairly and\nefficiently share resources.\nIn this article, we introduce Kueue,\nan open source job queueing controller designed to manage batch jobs as a single unit.\nKueue leaves pod-level orchestration to existing stable components of Kubernetes.\nKueue natively supports the Kubernetes Job\nAPI and offers hooks for integrating other custom-built APIs for batch jobs.\nWhy Kueue?\nJob queueing is a key feature to run batch workloads at scale in both on-premises and cloud environments. The main goal…",
          "link": "https://kubernetes.io/blog/2022/10/04/introducing-kueue/",
          "publishedOn": "2022-10-04T00:00:00.000Z",
          "wordCount": 4487,
          "title": "Blog: Introducing Kueue",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/10/03/userns-alpha/",
          "author": null,
          "description": "Authors: Rodrigo Campos (Microsoft), Giuseppe Scrivano (Red Hat)\nKubernetes v1.25 introduces the support for user namespaces.\nThis is a major improvement for running secure workloads in\nKubernetes. Each pod will have access only to a limited subset of the\navailable UIDs and GIDs on the system, thus adding a new security\nlayer to protect from other pods running on the same system.\nHow does it work?\nA process running on Linux can use up to 4294967296 different UIDs and\nGIDs.\nUser namespaces is a Linux feature that allows mapping a set of users\nin the container to different users in the host, thus restricting what\nIDs a process can effectively use.\nFurthermore, the capabilities granted in a new user namespace do not\napply in the host initial namespaces.\nWhy is it important?\nThere are mainly t…",
          "link": "https://kubernetes.io/blog/2022/10/03/userns-alpha/",
          "publishedOn": "2022-10-03T00:00:00.000Z",
          "wordCount": 3356,
          "title": "Blog: Kubernetes 1.25: alpha support for running Pods with user namespaces",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/09/29/enforce-immutability-using-cel/",
          "author": null,
          "description": "Author: Alexander Zielenski (Google)\nImmutable fields can be found in a few places in the built-in Kubernetes types.\nFor example, you can't change the .metadata.name of an object. Specific objects\nhave fields where changes to existing objects are constrained; for example, the\n.spec.selector of a Deployment.\nAside from simple immutability, there are other common design patterns such as\nlists which are append-only, or a map with mutable values and immutable keys.\nUntil recently the best way to restrict field mutability for CustomResourceDefinitions\nhas been to create a validating\nadmission webhook:\nthis means a lot of complexity for the common case of making a field immutable.\nBeta since Kubernetes 1.25, CEL Validation Rules allow CRD authors to express\nvalidation constraints on their fields…",
          "link": "https://kubernetes.io/blog/2022/09/29/enforce-immutability-using-cel/",
          "publishedOn": "2022-09-29T00:00:00.000Z",
          "wordCount": 5307,
          "title": "Blog: Enforce CRD Immutability with CEL Transition Rules",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/09/26/storage-in-tree-to-csi-migration-status-update-1.25/",
          "author": null,
          "description": "Author: Jiawei Wang (Google)\nThe Kubernetes in-tree storage plugin to Container Storage Interface (CSI) migration infrastructure has already been beta since v1.17. CSI migration was introduced as alpha in Kubernetes v1.14.\nSince then, SIG Storage and other Kubernetes special interest groups are working to ensure feature stability and compatibility in preparation for CSI Migration feature to go GA.\nSIG Storage is excited to announce that the core CSI Migration feature is generally available in Kubernetes v1.25 release!\nSIG Storage wrote a blog post in v1.23 for CSI Migration status update which discussed the CSI migration status for each storage driver. It has been a while and this article is intended to give a latest status update on each storage driver for their CSI Migration status in Ku…",
          "link": "https://kubernetes.io/blog/2022/09/26/storage-in-tree-to-csi-migration-status-update-1.25/",
          "publishedOn": "2022-09-26T00:00:00.000Z",
          "wordCount": 4077,
          "title": "Blog: Kubernetes 1.25: Kubernetes In-Tree to CSI Volume Migration Status Update",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/09/23/crd-validation-rules-beta/",
          "author": null,
          "description": "Authors: Joe Betz (Google), Cici Huang (Google), Kermit Alexander (Google)\nIn Kubernetes 1.25, Validation rules for CustomResourceDefinitions (CRDs) have graduated to Beta!\nValidation rules make it possible to declare how custom resources are validated using the Common Expression Language (CEL). For example:\napiVersion: apiextensions.k8s.io/v1\nkind: CustomResourceDefinition\n ...\n openAPIV3Schema:\n type: object\n properties:\n spec:\n type: object\n x-kubernetes-validations:\n - rule: \"self.minReplicas <= self.replicas && self.replicas <= self.maxReplicas\"\n message: \"replicas should be in the range minReplicas..maxReplicas.\"\n properties:\n replicas:\n type: integer\n ...\n\n\nValidation rules support a wide range of use cases. To get a sense of some of the capabilities, let's look at a few examples:\nV…",
          "link": "https://kubernetes.io/blog/2022/09/23/crd-validation-rules-beta/",
          "publishedOn": "2022-09-23T00:00:00.000Z",
          "wordCount": 4323,
          "title": "Blog: Kubernetes 1.25: CustomResourceDefinition Validation Rules Graduate to Beta",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/09/21/kubernetes-1-25-use-secrets-while-expanding-csi-volumes-on-node-alpha/",
          "author": null,
          "description": "Author: Humble Chirammal (Red Hat), Louis Koo (deeproute.ai)\nKubernetes v1.25, released earlier this month, introduced a new feature\nthat lets your cluster expand storage volumes, even when access to those\nvolumes requires a secret (for example: a credential for accessing a SAN fabric)\nto perform node expand operation. This new behavior is in alpha and you\nmust enable a feature gate (CSINodeExpandSecret) to make use of it.\nYou must also be using CSI\nstorage; this change isn't relevant to storage drivers that are built in to Kubernetes.\nTo turn on this new, alpha feature, you enable the CSINodeExpandSecret feature\ngate for the kube-apiserver and kubelet, which turns on a mechanism to send secretRef\nconfiguration as part of NodeExpansion by the CSI drivers thus make use of\nthe same to perfor…",
          "link": "https://kubernetes.io/blog/2022/09/21/kubernetes-1-25-use-secrets-while-expanding-csi-volumes-on-node-alpha/",
          "publishedOn": "2022-09-21T00:00:00.000Z",
          "wordCount": 3976,
          "title": "Blog: Kubernetes 1.25: Use Secrets for Node-Driven Expansion of CSI Volumes",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/09/19/local-storage-capacity-isolation-ga/",
          "author": null,
          "description": "Author: Jing Xu (Google)\nLocal ephemeral storage capacity isolation was introduced as a alpha feature in Kubernetes 1.7 and it went beta in 1.9. With Kubernetes 1.25 we are excited to announce general availability(GA) of this feature.\nPods use ephemeral local storage for scratch space, caching, and logs. The lifetime of local ephemeral storage does not extend beyond the life of the individual pod. It is exposed to pods using the container’s writable layer, logs directory, and EmptyDir volumes. Before this feature was introduced, there were issues related to the lack of local storage accounting and isolation, such as Pods not knowing how much local storage is available and being unable to request guaranteed local storage. Local storage is a best-effort resource and pods can be evicted due t…",
          "link": "https://kubernetes.io/blog/2022/09/19/local-storage-capacity-isolation-ga/",
          "publishedOn": "2022-09-19T00:00:00.000Z",
          "wordCount": 3881,
          "title": "Blog: Kubernetes 1.25: Local Storage Capacity Isolation Reaches GA",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "http://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/6253603880a6",
          "author": "Netflix Technology Blog",
          "description": "A conversation between Travis Brooks, Netflix Product Manager for Experimentation Platform, and George Khachatryan, OfferFit CEO",
          "link": "https://netflixtechblog.com/how-product-teams-can-build-empathy-through-experimentation-6253603880a6?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-10-12T20:56:33.000Z",
          "wordCount": 4561,
          "title": "How Product Teams Can Build Empathy Through Experimentation",
          "imageUrl": "https://miro.medium.com/max/1200/1*tdD6kCUukBXG91LAAYr-zw.png"
        },
        {
          "id": "https://medium.com/p/1abf249ba95f",
          "author": "Netflix Technology Blog",
          "description": "by Kostas Christidis",
          "link": "https://netflixtechblog.com/timestone-netflixs-high-throughput-low-latency-priority-queueing-system-with-built-in-support-1abf249ba95f?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-09-28T15:40:35.000Z",
          "wordCount": 5418,
          "title": "Timestone: Netflix’s High-Throughput, Low-Latency Priority Queueing System with Built-in Support…",
          "imageUrl": "https://miro.medium.com/focal/1200/632/46/46/1*JvNLSZmWCDB1WjDDUamU_g.png"
        }
      ]
    },
    {
      "title": "Google AI Blog",
      "feedUrl": "http://feeds.feedburner.com/blogspot/gJZg",
      "siteUrl": "http://ai.googleblog.com/",
      "articles": [
        {
          "id": "http://ai.googleblog.com/2022/10/ul2-20b-open-source-unified-language.html",
          "author": null,
          "description": "Posted by Yi Tay and Mostafa Dehghani, Research Scientists, Google Research, Brain Team\nBuilding models that understand and generate natural language well is one the grand goals of machine learning (ML) research and has a direct impact on building smart systems for everyday applications. Improving the quality of language models is a key target for researchers to make progress toward such a goal.   \nMost common paradigms to build and train language models use either autoregressive decoder-only architectures (e.g., PaLM or GPT-3), where the model is trained to predict the next word for a given prefix phrase, or span corruption-based encoder-decoder architectures (e.g., T5, ST-MoE), where the training objective is to recover the subset of words masked out of the input. On the one hand, T5-lik…",
          "link": "http://ai.googleblog.com/2022/10/ul2-20b-open-source-unified-language.html",
          "publishedOn": "2022-10-14T18:47:00.003Z",
          "wordCount": 8058,
          "title": "UL2 20B: An Open Source Unified Language Learner",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/10/crossmodal-3600-multilingual-reference.html",
          "author": null,
          "description": "Posted by Ashish Thapliyal, Software Engineer, and Jordi Pont-Tuset, Research Scientist, Google Research\nImage captioning is the machine learning task of automatically generating a fluent natural language description for a given image. This task is important for improving accessibility for visually impaired users and is a core task in multimodal research encompassing both vision and language modeling.  \n However, datasets for image captioning are primarily available in English. Beyond that, there are only a few datasets covering a limited number of languages that represent just a small fraction of the world’s population. Further, these datasets feature images that severely under-represent the richness and diversity of cultures from across the globe. These aspects have hindered research on …",
          "link": "http://ai.googleblog.com/2022/10/crossmodal-3600-multilingual-reference.html",
          "publishedOn": "2022-10-13T16:53:00.003Z",
          "wordCount": 8839,
          "title": "Crossmodal-3600 — Multilingual Reference Captions for Geographically Diverse Images",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/10/audiolm-language-modeling-approach-to.html",
          "author": null,
          "description": "Posted by Zalán Borsos, Research Software Engineer, and Neil Zeghidour, Research Scientist, Google Research \nGenerating realistic audio requires modeling information represented at different scales. For example, just as music builds complex musical phrases from individual notes, speech combines temporally local structures, such as phonemes or syllables, into words and sentences. Creating well-structured and coherent audio sequences at all these scales is a challenge that has been addressed by coupling audio with transcriptions that can guide the generative process, be it text transcripts for speech synthesis or MIDI representations for piano. However, this approach breaks when trying to model untranscribed aspects of audio, such as speaker characteristics necessary to help people with spee…",
          "link": "http://ai.googleblog.com/2022/10/audiolm-language-modeling-approach-to.html",
          "publishedOn": "2022-10-06T20:05:00.000Z",
          "wordCount": 6844,
          "title": "AudioLM: a Language Modeling Approach to Audio Generation",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/10/large-motion-frame-interpolation.html",
          "author": null,
          "description": "Posted by Fitsum Reda and Janne Kontkanen, Google Research \nFrame interpolation is the process of synthesizing in-between images from a given set of images. The technique is often used for temporal up-sampling to increase the refresh rate of videos or to create slow motion effects. Nowadays, with digital cameras and smartphones, we often take several photos within a few seconds to capture the best picture. Interpolating between these “near-duplicate” photos can lead to engaging videos that reveal scene motion, often delivering an even more pleasing sense of the moment than the original photos.  \n  \nFrame interpolation between consecutive video frames, which often have small motion, has been studied extensively. Unlike videos, however, the temporal spacing between near-duplicate photos can …",
          "link": "http://ai.googleblog.com/2022/10/large-motion-frame-interpolation.html",
          "publishedOn": "2022-10-04T18:43:00.003Z",
          "wordCount": 7573,
          "title": "Large Motion Frame Interpolation",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/09/quantization-for-fast-and.html",
          "author": null,
          "description": "Posted by Srivatsan Krishnan, Student Researcher, and Aleksandra Faust, Senior Staff Research Scientist, Google Research, Brain Team   \nDeep reinforcement learning (RL) continues to make great strides in solving real-world sequential decision-making problems such as balloon navigation, nuclear physics, robotics, and games. Despite its promise, one of its limiting factors is long training times. While the current approach to speed up RL training on complex and difficult tasks leverages distributed training scaling up to hundreds or even thousands of computing nodes, it still requires the use of significant hardware resources which makes RL training expensive, while increasing its environmental impact. However, recent work [1, 2] indicates that performance optimizations on existing hardware …",
          "link": "http://ai.googleblog.com/2022/09/quantization-for-fast-and.html",
          "publishedOn": "2022-09-27T17:32:00.000Z",
          "wordCount": 6946,
          "title": "Quantization for Fast and Environmentally Sustainable Reinforcement Learning",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/09/tensorstore-for-high-performance.html",
          "author": null,
          "description": "Posted by Jeremy Maitin-Shepard and Laramie Leavitt, Software Engineers, Connectomics at Google\nMany exciting contemporary applications of computer science and machine learning (ML) manipulate multidimensional datasets that span a single large coordinate system, for example, weather modeling from atmospheric measurements over a spatial grid or medical imaging predictions from multi-channel image intensity values in a 2d or 3d scan. In these settings, even a single dataset may require terabytes or petabytes of data storage. Such datasets are also challenging to work with as users may read and write data at irregular intervals and varying scales, and are often interested in performing analyses using numerous machines working in parallel.  \nToday we are introducing TensorStore, an open-source…",
          "link": "http://ai.googleblog.com/2022/09/tensorstore-for-high-performance.html",
          "publishedOn": "2022-09-22T21:33:00.006Z",
          "wordCount": 7855,
          "title": "TensorStore for High-Performance, Scalable Array Storage",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/09/view-synthesis-with-transformers.html",
          "author": null,
          "description": "Posted by Carlos Esteves and Ameesh Makadia, Research Scientists, Google Research \nA long-standing problem in the intersection of computer vision and computer graphics, view synthesis is the task of creating new views of a scene from multiple pictures of that scene. This has received increased attention [1, 2, 3] since the introduction of neural radiance fields (NeRF). The problem is challenging because to accurately synthesize new views of a scene, a model needs to capture many types of information — its detailed 3D structure, materials, and illumination —  from a small set of reference images.  \nIn this post, we present recently published deep learning models for view synthesis. In “Light Field Neural Rendering” (LFNR), presented at CVPR 2022, we address the challenge of accurately repro…",
          "link": "http://ai.googleblog.com/2022/09/view-synthesis-with-transformers.html",
          "publishedOn": "2022-09-21T19:27:00.000Z",
          "wordCount": 7635,
          "title": "View Synthesis with Transformers",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/09/findit-generalized-object-localization.html",
          "author": null,
          "description": "Posted by Weicheng Kuo and Anelia Angelova, Research Scientists, Google Research, Brain Team  \nNatural language enables flexible descriptive queries about images. The interaction between text queries and images grounds linguistic meaning in the visual world, facilitating a better understanding of object relationships, human intentions towards objects, and interactions with the environment. The research community has studied object-level visual grounding through a range of tasks, including referring expression comprehension, text-based localization, and more broadly object detection, each of which require different skills in a model. For example, object detection seeks to find all objects from a predefined set of classes, which requires accurate localization and classification, while referr…",
          "link": "http://ai.googleblog.com/2022/09/findit-generalized-object-localization.html",
          "publishedOn": "2022-09-20T17:00:00.008Z",
          "wordCount": 7272,
          "title": "FindIt: Generalized Object Localization with Natural Language Queries",
          "imageUrl": "http://2.bp.blogspot.com/-qRz-hnwUdY4/WulXSQ6Rv4I/AAAAAAAATvQ/shk7KsphA0c3E3nUMsDVASqYaH0PhLPNwCK4BGAYYCw/s1600/GoogleAI_logo_horizontal_color_rgb.png"
        }
      ]
    },
    {
      "title": "Seth Godin's Blog on marketing, tribes and respect",
      "feedUrl": "https://feeds.feedblitz.com/sethsblog",
      "siteUrl": "https://seths.blog",
      "articles": [
        {
          "id": "https://seths.blog/?p=44008",
          "author": "Seth Godin",
          "description": "Cars aren’t like companies. Most cars on the road will be sold, again and again, until they end up as parts. Companies usually start and end with their founders. Sometimes, a small, stable company is sold to an individual operator, usually for a multiple of the expected annual profit. It’s an investment in future cash […]",
          "link": "https://feeds.feedblitz.com/~/715864308/0/sethsblog~Selling-a-company/",
          "publishedOn": "2022-10-17T08:22:00.000Z",
          "wordCount": 1412,
          "title": "Selling a company",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806136-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=39746",
          "author": "Seth Godin",
          "description": "Someone said that to me the other day and it was heartbreaking. The number of tasks in our culture that require someone who was born with off-the-charts talent is small indeed. Just about everything else we need people to do is the result of effort, practice and care. It’s true that variations of that work […]",
          "link": "https://feeds.feedblitz.com/~/715773264/0/sethsblog~Im-not-that-smart/",
          "publishedOn": "2022-10-16T08:30:00.000Z",
          "wordCount": 1116,
          "title": "“I’m not that smart”",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061317.jpg"
        },
        {
          "id": "https://seths.blog/?p=42252",
          "author": "Seth Godin",
          "description": "When abundance showed up, first in manufactured goods, then in information, it all seemed like a simple win. More of what we want, thanks. But of course, more of too many things is too much. We are leaving the age of information and entering the age of choice. Not just choosing what we’ll consume, but […]",
          "link": "https://feeds.feedblitz.com/~/715677944/0/sethsblog~We-forgot-to-choose/",
          "publishedOn": "2022-10-15T08:34:00.000Z",
          "wordCount": 1077,
          "title": "We forgot to choose",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061313.jpg"
        },
        {
          "id": "https://seths.blog/?p=43976",
          "author": "Seth Godin",
          "description": "That’s what it said on the side of the tractor-trailer on the highway. Since 1924, they’re almost 100 years old. But it’s unlikely that it’s everyone’s favorite. Being everyone’s favorite is such an attractive goal, and almost impossible to achieve. Ask someone about their favorite pie and they’ll talk about the one they ate as […]",
          "link": "https://feeds.feedblitz.com/~/715566360/0/sethsblog~Americas-favorite-pie/",
          "publishedOn": "2022-10-14T08:06:00.000Z",
          "wordCount": 1195,
          "title": "“America’s favorite pie”",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806136-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=43984",
          "author": "Seth Godin",
          "description": "Without a doubt, the world has become more connected, noisier and more complex. But along the way, we’re still applying our instincts from a century ago, from a planet of villages and different expectations. Rhetorical questions worth considering as we think about what’s normal. Where does here end and there begin? Is there a line […]",
          "link": "https://feeds.feedblitz.com/~/715452174/0/sethsblog~The-small-world-questions/",
          "publishedOn": "2022-10-13T08:22:00.000Z",
          "wordCount": 1141,
          "title": "The small world questions",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806134-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=43932",
          "author": "Seth Godin",
          "description": "Big companies act like big companies. We don’t take them seriously when they say they care, because there is no “they.” When they send a holiday card or an email, we don’t really think it was from a person we could connect with. Individuals act like individuals. When they write us a note or show […]",
          "link": "https://feeds.feedblitz.com/~/715344454/0/sethsblog~The-uncanny-valley-of-scale/",
          "publishedOn": "2022-10-12T08:04:00.000Z",
          "wordCount": 1180,
          "title": "The uncanny valley of scale",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806132-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=42982",
          "author": "Seth Godin",
          "description": "I’m not sure we have a common word for this. “Yes” can mean, “yes, I’m prepared to do the minimum” or it could mean, “yes, this commitment is something I wholeheartedly embrace and will devote myself to exceeding expectations at every turn.” Life’s way better if we find partnerships that are the second kind. “All […]",
          "link": "https://feeds.feedblitz.com/~/715240176/0/sethsblog~Without-reservations/",
          "publishedOn": "2022-10-11T08:45:00.000Z",
          "wordCount": 1049,
          "title": "Without reservations",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061313.jpg"
        },
        {
          "id": "https://seths.blog/?p=42949",
          "author": "Seth Godin",
          "description": "Satisfaction is often driven by the story we tell ourselves. How does this rank compared to what I expected? Compared to what I used to have? Compared to the person sitting next to me? The richest person in the world used to sleep on the floor and eat moldy food, but still felt great because […]",
          "link": "https://feeds.feedblitz.com/~/715130524/0/sethsblog~Compared-to-what/",
          "publishedOn": "2022-10-10T09:17:00.000Z",
          "wordCount": 1066,
          "title": "Compared to what",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061314.jpg"
        },
        {
          "id": "https://seths.blog/?p=42023",
          "author": "Seth Godin",
          "description": "The optic nerve dominates. It’s piped directly into our brains and uses a lot of processing power to help us discern the world through vision. As a result, it’s louder than our other senses and often outshouts the rest of our brain. That’s why it’s easy to be fooled by a magician. This focus on […]",
          "link": "https://feeds.feedblitz.com/~/715020458/0/sethsblog~The-invisibility-paradox/",
          "publishedOn": "2022-10-09T08:21:00.000Z",
          "wordCount": 1167,
          "title": "The invisibility paradox",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806139-1.jpg"
        },
        {
          "id": "https://seths.blog-production.mystagingwebsite.com/?p=31895",
          "author": "Seth Godin",
          "description": "The closer we look at what other people believe and do, the more clear it is that our view of the world doesn’t precisely match theirs. It never has, but now it’s magnified. The things we thought were a given, aren’t. No one believes what I believe, not exactly. How is it possible, we wonder, […]",
          "link": "https://feeds.feedblitz.com/~/714869252/0/sethsblog~Points-of-view/",
          "publishedOn": "2022-10-08T08:45:00.000Z",
          "wordCount": 1146,
          "title": "Points of view",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806139-1.jpg"
        }
      ]
    },
    {
      "title": "The JetBrains Blog",
      "feedUrl": "https://blog.jetbrains.com/feed/",
      "siteUrl": "https://blog.jetbrains.com",
      "articles": [
        {
          "id": "https://blog.jetbrains.com/?post_type=dotnet&p=285616",
          "author": "Khalid Abuhakmeh",
          "description": "Join us Wednesday, November 16, 2022, 2:00 – 3:00 PM UTC (check other timezones) for our free live webinar, Wolverine: Your Next Messaging, with Senior Director of Software Architecture at MedeAnalytics, Jeremy D. Miller. Register now and get a reminder, or join on YouTube Wolverine is a new framework for local command handling and asynchronous […]",
          "link": "https://blog.jetbrains.com/dotnet/2022/10/17/webinar-wolverine-your-next-messaging-library/",
          "publishedOn": "2022-10-17T12:17:33.000Z",
          "wordCount": 2236,
          "title": "Webinar – Wolverine: Your Next Messaging Library",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/DSGN-14780-Webinar-Wolverine-Your-Next-Messaging-Library_JB_Blog_Social_share_image_1280-720.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=appcode&p=287314",
          "author": "Anastasia Kazakova",
          "description": "Hi everyone, A new AppCode 2022.3 EAP build (223.6646.113) is available for download. Builds are available from our website and via the Toolbox App. You can also update from the 2022.3 EAP1 build via patch. DOWNLOAD APPCODE EAP New solution for synchronizing settings Synchronizing settings is essential when you use AppCode or other IntelliJ-based IDEs […]",
          "link": "https://blog.jetbrains.com/appcode/2022/10/appcode-2022-3-eap-new-settings-sync-solution/",
          "publishedOn": "2022-10-15T00:40:50.000Z",
          "wordCount": 2026,
          "title": "AppCode 2022.3 EAP: New Settings Sync Solution",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/09/Blog_Social_share_image_1280x720_AppCode-2x.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=go&p=287057",
          "author": "Sergey Kozlovskiy",
          "description": "The third build of our current Early Access Program is out!  You can get the EAP build via the Toolbox App, download it from our website, use a snap package (for Ubuntu), or from inside GoLand, select Check IDE updates for Early Access Program in Preferences / Settings | Appearance & Behavior | System Settings […]",
          "link": "https://blog.jetbrains.com/go/2022/10/14/quick-fix-for-invalid-recursive-type-new-settings-synchronization-solution-and-improvements-for-databases-in-goland-eap-2022-3-3/",
          "publishedOn": "2022-10-14T14:45:39.000Z",
          "wordCount": 2551,
          "title": "Quick-fix for Invalid Recursive Type, New Settings Synchronization Solution, and Improvements for Databases in GoLand EAP 2022.3 #3",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/09/Blog_Social_share_image_1280x720_GoLand-2x.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=clion&p=287260",
          "author": "Anastasia Kazakova",
          "description": "A new CLion 2022.3 EAP build is available! Download build 223.6646.99 from our website via the Toolbox App or as a snap package (if you are using Ubuntu). If you are on macOS, there is a separate build for Apple Silicon (M1 chip). Update via patch if you are using EAP1 or EAP2 builds. DOWNLOAD […]",
          "link": "https://blog.jetbrains.com/clion/2022/10/clion-2022-3-eap-new-settings-sync-solution-linker-scripts-azure-rtos/",
          "publishedOn": "2022-10-14T14:37:49.000Z",
          "wordCount": 2281,
          "title": "CLion 2022.3 EAP: New Settings Sync Solution, Linker Scripts, Azure RTOS",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/09/Social_share_image_1280x720_CLion-2x.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=idea&p=284899",
          "author": "Maria Kosukhina",
          "description": "IntelliJ IDEA 2022.3 EAP 3 is now available! In this new EAP build, we introduce a reworked Settings Sync solution to help seamlessly synchronize your personal IDE settings, a range of new inspections and other improvements for Java, and experimental Maven import functionality that utilizes the new IntelliJ IDEA Workspace Model API. You can get […]",
          "link": "https://blog.jetbrains.com/idea/2022/10/intellij-idea-2022-3-eap-3/",
          "publishedOn": "2022-10-14T12:54:41.000Z",
          "wordCount": 3070,
          "title": "IntelliJ IDEA 2022.3 EAP 3: New Settings Sync Solution, Improvements for Java, and More",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2019/02/intellij-idea_social.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=pycharm&p=286832",
          "author": "Jodie Burchell",
          "description": "This year saw the premier of the first ever PyCon Portugal! With DjangoCon Europe being hosted in Porto this year, the organizers took the opportunity to piggyback off of this conference and set up a PyCon in this beautiful country. I was lucky enough to be selected as one of the speakers, and it was […]",
          "link": "https://blog.jetbrains.com/pycharm/2022/10/pycon-portugal-2022-trip-report/",
          "publishedOn": "2022-10-14T09:20:29.000Z",
          "wordCount": 2498,
          "title": "PyCon Portugal 2022 trip report",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/DSGN-14812_Conference_trip_report_Blog_Social_share_image_1280x720_02.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=datagrip&p=286633",
          "author": "Maksim Sobolevskiy",
          "description": "Hello, DataGrip fans! As usual, we want to share our new functionality with you before the official release happens. Here’s what you will find in DataGrip 2022.3. Of course, you can already try all of this out by downloading our EAP build. Let’s go! Database explorer Quick filter A long-awaited feature is finally here! Now, […]",
          "link": "https://blog.jetbrains.com/datagrip/2022/10/13/datagrip-2022-3-eap-is-open/",
          "publishedOn": "2022-10-13T12:04:54.000Z",
          "wordCount": 2528,
          "title": "DataGrip 2022.3 EAP Is Open",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/Blog_Featured_image_1280x600_DataGrip-2x-1.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=datalore&p=286377",
          "author": "Alena Guzharina",
          "description": "While tabular data works best for calculating descriptive statistics, you will need plotting to compare values and find complex insights. One of the easiest and most flexible ways to visualize and explore your data is by using Python charts. In this article, we will show you how to plot using Python libraries and Datalore. Plotting […]",
          "link": "https://blog.jetbrains.com/datalore/2022/10/12/top-4-ways-to-plot-data-in-python-using-datalore/",
          "publishedOn": "2022-10-12T15:38:34.000Z",
          "wordCount": 2507,
          "title": "Top 4 Ways to Plot Data in Python Using Datalore",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/dl-yellow-blog-social-share-image-1280x720-1-2.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=fleet&p=285871",
          "author": "Hadi Hariri",
          "description": "Since the initial announcement of Fleet, we have had an overwhelming amount of interest from all of you, with over 137,000 people signing up for the private preview. Our reason for starting with a closed preview was to be able to process the feedback in a gradual way. We want to thank each and every […]",
          "link": "https://blog.jetbrains.com/fleet/2022/10/introducing-the-fleet-public-preview/",
          "publishedOn": "2022-10-12T11:45:00.000Z",
          "wordCount": 2674,
          "title": "Introducing the Fleet Public Preview",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/DSGN-14708_Fleet_public_release_Blog_Social_share_image_1280x720_06.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=kotlin&p=285629",
          "author": "Sebastian Aigner",
          "description": "Starting today, Compose Multiplatform 1.2 is available for you to use! This latest version of the declarative UI framework for Kotlin brings compatibility with the latest Kotlin version and introduces several powerful features for the desktop target. Specifically, here are the highlights: The newly added ProGuard support allows you to minify and obfuscate your application […]",
          "link": "https://blog.jetbrains.com/kotlin/2022/10/compose-multiplatform-1-2-is-out/",
          "publishedOn": "2022-10-12T08:42:50.000Z",
          "wordCount": 3525,
          "title": "Compose Multiplatform 1.2 Is Out: New Mouse and Keyboard APIs, ProGuard Support, Online Updates, and More",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/DSGN-14801_Compose_MPP_1_2_Blog_Social_share_image_1280x720.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=pycharm&p=285867",
          "author": "Valeria Letusheva",
          "description": "We are releasing PyCharm 2022.2.3, which contains important fixes for workflows, including remote interpreters, and fixes for working with MicroPython plugin and the recent Matplotlib 3.6.0 package. You can update to this version from inside the IDE, by using the Toolbox App, or by using snaps for Ubuntu. You can also download it from our […]",
          "link": "https://blog.jetbrains.com/pycharm/2022/10/pycharm-2022-2-3/",
          "publishedOn": "2022-10-11T16:21:54.000Z",
          "wordCount": 1855,
          "title": "PyCharm 2022.2.3 Is Out!",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/Release_Blog_Social_share_image_1280x720_PyCharm_3-2x.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=appcode&p=285840",
          "author": "Anastasia Kazakova",
          "description": "The AppCode 2022.2.3 bug-fix update is now available! Build 222.4345.23 is available from our website, from the Toolbox App, or via an update patch from the IDE itself. DOWNLOAD APPCODE Here are the main highlights: Improved compatibility with Xcode 14.1 beta. The Create branch input field in the Open task window now has the correct […]",
          "link": "https://blog.jetbrains.com/appcode/2022/10/appcode-bug-fix-update-2022-2-3/",
          "publishedOn": "2022-10-11T16:08:23.000Z",
          "wordCount": 1881,
          "title": "AppCode Bug-Fix Update 2022.2.3",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/ac-bug-fix-blog-social-share-image-1280x720-1.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}