{
  "sources": [
    {
      "title": "Spring",
      "feedUrl": "https://spring.io/blog.atom",
      "siteUrl": "https://spring.io/blog",
      "articles": [
        {
          "id": "https://spring.io/blog/2022/10/27/bootiful-podcast-spring-mad-scientist-andy-clement-on-springone-2022-aot-azure-spring-apps-and-more",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks to Spring mad scientist Andy Clement (@andy_clement) about the new native support in Spring Boot 3, SpringOne 2022, and Azure Spring Apps, among other things",
          "link": "https://spring.io/blog/2022/10/27/bootiful-podcast-spring-mad-scientist-andy-clement-on-springone-2022-aot-azure-spring-apps-and-more",
          "publishedOn": "2022-10-27T07:00:00.000Z",
          "wordCount": 562,
          "title": "Bootiful Podcast: Spring Mad Scientist Andy Clement on SpringOne 2022, AOT, Azure Spring Apps, and more",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/26/spring-tips-the-road-to-spring-boot-3-spring-framework-6",
          "author": null,
          "description": "Hi, Spring fans! In this installment, we begin a journey to Spring Boot 3, due end of November 2022. In this installment, we’ll look - at a very high level - at some of the amazing features in Spring Framework 6, which underpins Spring Boot 3.\n\r\n\r\nWant to learn more about Spring Framework 6 and Spring Boot 3? Join us at SpringOne 2022! use the code S1VM22_Advocate_200 for $200 off the price of admission!",
          "link": "https://spring.io/blog/2022/10/26/spring-tips-the-road-to-spring-boot-3-spring-framework-6",
          "publishedOn": "2022-10-26T07:00:00.000Z",
          "wordCount": 591,
          "title": "Spring Tips: the road to Spring Boot 3: Spring Framework 6",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/26/spring-tools-4-16-1-released",
          "author": null,
          "description": "Dear Spring Community,\n\r\nI am happy to announce the 4.16.1 release of the Spring Tools 4 for Eclipse, Visual Studio Code, and Theia.\nmajor changes to the Spring Tools 4 for Eclipse distribution\n\r\n\r\n  \nearly access builds available for Spring Tools 4 on Eclipse 2022-12 milestones\n\r\n\nimportant note for upgrading from a release prior to 4.16.0 on Eclipse\n\r\n\r\n  \nIf you are upgrading an existing Spring Tools 4 for Eclipse distribution 4.15.3 or older to 4.16.1, please take a look at the necessary manual steps described for the upgrade to 4.16.0.\n\r\n\nfixes and improvements\n\r\n\r\n  \n(Spring Boot) fixed: Spring XML Config support does not show symbols with scope “File” (#860)\n\r\n  \n(Spring Boot) fixed: [open-rewrite] exception when executing quick fix for project (#853)\n\r\n  \n(Spring Boot) fixed: [refactoring] quick fix to convert autowired field to constructor param shows up even if the constructor param already exists (#815)\n\r\n  \n(VSCode) fixed: Vscode Spring Boot Tools 1.39.0 prevents Java project from Running/Debugging (#847)\n\r\n  \n(Eclipse) fixed: Web Tools Platform (WTP) validation is activated by default (#859)\n\r\n  \n(Eclipse) fixed: ask user to save dirty editors before deploying on docker (#803)\n\r\n\r\nTo download the distribution for Eclipse and find links to the marketplace entries for Visual Studio Code and Theia, please go visit:\n\r\n\r\n  \nSpring Tools 4: https://spring.io/tools/\n\r\n\r\nDetailed changes can be found here: https://github.com/spring-projects/sts4/wiki/Changelog#2022-10-26-4161-release-incl-language-servers-version-1400\n\r\nSpring Tools 4.17.0 is scheduled to be released in early December 2022.\n\r\nEnjoy!",
          "link": "https://spring.io/blog/2022/10/26/spring-tools-4-16-1-released",
          "publishedOn": "2022-10-26T07:00:00.000Z",
          "wordCount": 728,
          "title": "Spring Tools 4.16.1 released",
          "imageUrl": "https://avatars.githubusercontent.com/u/107705?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/25/spring-integration-6-0-0-rc1-available",
          "author": null,
          "description": "Dear Spring community,\n\r\n\r\n\r\nI was so eager to find and fix bugs in the latest Spring Integration release, that missed to announce a 6.0 RC1 last week.\r\nBut I believe it is still worth to mention it even after Spring Boot 3.0.0-RC1 announcement since there is a number of notable changes and improvements.\n\r\n\r\n\r\nSo, please, welcome Spring Integration 6.0 first Release Candidate.\r\nIt can be obtained from Spring Milestone repository:\n\r\n\r\n\r\n\r\ndependencyManagement {\r\n    imports {\r\n        mavenBom 'org.springframework.integration:spring-integration-bom:6.0.0-RC1'\r\n    }\r\n}\n\r\n\r\n\r\n\r\nHere you can find important changes after the previously announced Spring Integration 6.0.0-M5:\n\r\n\r\n\r\n\r\n\r\nspring-integration-amqp has added support for RabbitMQ Streams;\n\r\n\r\n\r\nspring-integration-sftp has been migrated from an old unsupported jsch library to more modern Apache MINA;\n\r\n\r\n\r\nspring-integration-gemfire was removed according to dropped support for Apache Geode in Spring Data;\n\r\n\r\n\r\nspring-integration-scripting has added a GraalVM Polyglot support for JavaScript invocations;\n\r\n\r\n\r\nThe Apache Groovy DSL for Spring Integration extension project has been migrated to the spring-integration-groovy module code base;\n\r\n\r\n\r\nThe Spring Integration for Apache Cassandra extension project has been migrated as a spring-integration-cassandra module;\n\r\n\r\n\r\nThe Kotlin Coroutines support has been added to the @ServiceActivator POJO functions, also messaging gateway methods can now be as suspended functions;\n\r\n\r\n\r\nThe AOP ChannelSecurityInterceptor in the spring-integration-security module has been deprecated in favor of AuthorizationChannelInterceptor.\n\r\n\r\n\r\n\r\n\r\nAlso, see a Migration Guide for breaking changes in the framework and its modules.\n\r\n\r\n\r\nIt would be great if you give it a chance and come back to us with reports, so it may make it into GA next month.\n\r\n\r\n\r\nSee you in person this December at SpringOne!\n\r\n\r\n\r\nCheers, \n\r\nArtem\n\r\n\r\n\r\nProject Page | GitHub Issues | Contributing | Help | Chat",
          "link": "https://spring.io/blog/2022/10/25/spring-integration-6-0-0-rc1-available",
          "publishedOn": "2022-10-25T13:55:35.000Z",
          "wordCount": 769,
          "title": "Spring Integration 6.0.0-RC1 Available",
          "imageUrl": "https://avatars.githubusercontent.com/u/1071590?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/24/this-week-in-spring-october-25th-2022",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring! When last we spoke, I was in Las Vegas, NV, for the JavaOne show. It was amazing! I’m in sunny Singapore, then off to Malaysia and Thailand. It’s the first time I’ve been to any of these places since 2019! How good it is to be back! I’ve so missed it.\n\r\nThe Spring team is busy preparing for both Spring Boot 3 (and the Spring Framework 6 release that underpins it) and SpringOne 2022. Have you booked your ticket for SpringOne 2022 yet? It’s going to be held in sunny San Francisco, and - of course - it’ll be the absolute best place to learn about Spring Framework 6, Spring Boot 3, GraalVM, the new Ahead-of-time compilation engine in Spring Boot 3, and more. Also, it’s a rare chance to hang out with the Spring team proper.…",
          "link": "https://spring.io/blog/2022/10/24/this-week-in-spring-october-25th-2022",
          "publishedOn": "2022-10-24T07:00:00.000Z",
          "wordCount": 863,
          "title": "This Week in Spring - October 25th, 2022",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/21/introducing-spring-modulith",
          "author": null,
          "description": "When designing software systems, architects and developers have plenty of architectural options to choose from. Microservice-based systems have become ubiquitous in the last couple of years. However, the idea of monolithic, modular systems has also regained popularity recently.\r\nIndependent of the architectural style ultimately selected, the individual applications comprising the overall system need their structure to be evolvable and able to follow changes in business requirements.\n\r\n\r\n\r\nTraditionally, application frameworks have provided structural guidance by providing abstractions aligned with technical concepts, such as Spring Framework’s stereotype annotations (@Controller, @Service, @Repository, and so on).\r\nHowever, shifting the focus to align code structure with the domain has pro…",
          "link": "https://spring.io/blog/2022/10/21/introducing-spring-modulith",
          "publishedOn": "2022-10-21T12:00:00.000Z",
          "wordCount": 1926,
          "title": "Introducing Spring Modulith",
          "imageUrl": "https://avatars.githubusercontent.com/u/128577?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/20/spring-boot-3-0-0-rc1-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 3.0.0-RC1 has been released and is now available from https://repo.spring.io/milestone.\n\r\nThis release includes 135 enhancements, documentation improvements, dependency upgrades, and bug fixes. \n\r\nThis is our first release candidate for Spring Boot 3.0, which we expect to release November 24, 2022. We are not expecting any more features to be added at this point, and we will only be making API changes if we find issues.\n\r\nThis release is the culmination of 11 months of work and is the first release to fully realize the themes that we set out to deliver in Spring Boot 3.0. Most notably, this release builds on the multi-year R&D effort that started with the experimental Spring Native project to pro…",
          "link": "https://spring.io/blog/2022/10/20/spring-boot-3-0-0-rc1-available-now",
          "publishedOn": "2022-10-21T04:00:00.000Z",
          "wordCount": 825,
          "title": "Spring Boot 3.0.0-RC1 available now",
          "imageUrl": "https://avatars.githubusercontent.com/u/519772?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/20/a-bootiful-podcast-microsoft-s-asir-selvasingh-on-azure-spring-apps-java-at-microsoft-application-security-and-more",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxma) talks to his friend, Microsoft’s Asir Selvasingh (@asirselvasingh), about Azure Spring Apps, Java at Microsoft, Spring, application security, and more. Want to learn more? Join us at SpringOne (6-8 December 2022)!\n\r\n\r\nWant to meet amazing people like Asir? Join us at SpringOne 2022! Register now and get $200 off with this discount code S1VM22_Advocate_200.",
          "link": "https://spring.io/blog/2022/10/20/a-bootiful-podcast-microsoft-s-asir-selvasingh-on-azure-spring-apps-java-at-microsoft-application-security-and-more",
          "publishedOn": "2022-10-20T15:00:00.000Z",
          "wordCount": 592,
          "title": "A Bootiful Podcast: Microsoft's Asir Selvasingh on Azure Spring Apps, Java at Microsoft, application security, and more",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/20/spring-boot-2-7-5-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.7.5 has been released and is now available from Maven Central.\n\r\nThis release includes 31 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2022/10/20/spring-boot-2-7-5-available-now",
          "publishedOn": "2022-10-20T14:27:46.000Z",
          "wordCount": 610,
          "title": "Spring Boot 2.7.5 available now",
          "imageUrl": "https://avatars.githubusercontent.com/u/490484?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/20/spring-framework-6-0-0-rc2-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I am pleased to announce that Spring Framework 6.0.0-RC2 is available now.\n\r\nSpring Framework 6.0.0-RC2 includes 28 fixes and improvements. Stay tuned for the announcement of Spring Boot 3.0.0-RC1 later today!\n\r\nProject Page | GitHub | Issues | Documentation",
          "link": "https://spring.io/blog/2022/10/20/spring-framework-6-0-0-rc2-available-now",
          "publishedOn": "2022-10-20T13:17:51.000Z",
          "wordCount": 554,
          "title": "Spring Framework 6.0.0-RC2 available now",
          "imageUrl": "https://avatars.githubusercontent.com/u/490484?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/20/cve-2022-31684-reactor-netty-http-server-may-log-request-headers",
          "author": null,
          "description": "The Reactor Netty 1.0.24 release on October 11 included fix for CVE-2022-31684 affecting Reactor Netty HTTP Server.\nUsers are encouraged to update as soon as possible.\n\r\nReactor Netty is used internally in many frameworks including Spring WebFlux and its WebClient.\nIf you have a Spring Boot application, you can upgrade to Reactor BOM 2020.0.24.",
          "link": "https://spring.io/blog/2022/10/20/cve-2022-31684-reactor-netty-http-server-may-log-request-headers",
          "publishedOn": "2022-10-20T12:45:00.000Z",
          "wordCount": 565,
          "title": "CVE-2022-31684: Reactor Netty HTTP Server may log request headers",
          "imageUrl": "https://avatars.githubusercontent.com/u/696661?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/20/spring-boot-2-6-13-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.6.13 has been released and is now available from Maven Central.\n\r\nThis release includes 27 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2022/10/20/spring-boot-2-6-13-available-now",
          "publishedOn": "2022-10-20T10:45:48.000Z",
          "wordCount": 610,
          "title": "Spring Boot 2.6.13 available now",
          "imageUrl": "https://avatars.githubusercontent.com/u/490484?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/20/spring-batch-5-0-rc1-is-out",
          "author": null,
          "description": "It is finally here! The first release candidate of Spring Batch 5 is now available from our milestone repository. In this release, we worked on the following items:\n\r\n\r\n  \nExecution context Meta-data improvement\n\r\n  \nGemFire support removal\n\r\n\r\nThis blog post walks through these two changes in details. For the complete list of changes, please check the release notes.\nExecution context Meta-data improvement\n\r\nIn addition to what Spring Batch already persists in the execution context with regard to runtime information (like the step type, the restart flag, etc), this release adds an important detail in the execution context which is the Spring Batch version that was used to serialize the context.\n\r\nWhile this seems a detail, it has a huge added value when debugging upgrade issues with regard to execution context serialization and deserialization.\nGemFire support removal\n\r\nBased on the decision to discontinue the support of Spring Data for Apache Geode, the support for Apache Geode in Spring Batch was removed.\n\r\nThe code was moved to the spring-batch-extensions repository as a community-driven effort.\nWhat’s next?\n\r\nWe are planning to roll out a second release candidate early November and release 5.0.0 GA by the end of November, in time for Spring Boot 3.0.0. We would appreciate your help to try this release candidate out and share your feedback with us on Github, Twitter and StackOverflow. You can find a migration guide here.\n\r\nI would like to thank all contributors who had a role in this first release candidate!\n\r\n\r\nSpring Batch Home|Source on Github|Reference documentation",
          "link": "https://spring.io/blog/2022/10/20/spring-batch-5-0-rc1-is-out",
          "publishedOn": "2022-10-20T08:00:00.000Z",
          "wordCount": 755,
          "title": "Spring Batch 5.0 RC1 is out!",
          "imageUrl": "https://avatars.githubusercontent.com/u/1210553?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/18/this-week-in-spring-october-18th-2022",
          "author": null,
          "description": "Hi, Spring fans! How’re you doin’? I’m doin’ alright! Last week I was in Antwerp, Belgium, for the amazing Devoxx BE show. I did a presentation with my friend and hero James Ward on Spring and Kotlin (that was voted third most-liked talk at a show with more than 250 speakers!) That was a personal career highlight for me - it’s not often you get to win and have fun in life. And, as if that wasn’t awesome enough, this week I am in Las Vegas, NV, for JavaOne! Fingers crossed, this week will go smoothly, too! Both Devoxx and JavaOne are the first such shows since at least before the pandemic. It’s been a very long time in coming and I’m elated, overjoyed, to be able to be here.\n\r\nAnd, of course, I’m super excited about SpringOne 2022! Also, the first in-person show of its kind since before the pandemic! It’s going to be amazing. Have you registered? If not, you might consider using this registration code - S1VM22_Advocate_200.\n\r\nAnd this week’s busy roundup reflects the usual flurry of activity on the Spring team as we ready releases for our end-of-November timelines for Spring Framework 6 and Spring Boot 3, which means we’ve got a ton of stuff to get into this week, so let’s!\n\r\n\r\n  \nSpring Framework 6.0 goes RC1\n\r\n  \nObservability with Spring Boot 3\n\r\n  \nA Bootiful Podcast: Google mad scientist Josh Suereth on Observability with OpenTelemetry, building better build tools, and so much more \n\r\n  \nSpring Batch 5.0.0-M8 is out!\n\r\n  \nLearn more about Spring Framework 6 and Spring Boot 3 in these two great talks from Devoxx 2022\n\r\n  \nSpring at JavaOne 2022\n\r\n  \nSpring Data 2022.0.0-RC1, 2021.2.5, and 2021.1.8 available\n\r\n  \nSpring Security 6.0.0-RC1 and 5.8.0-RC1 are released\n\r\n  \nSpring Security 5.7.4 and 5.6.8 available now\n\r\n  \nSpring for GraphQL 1.1.0-RC1 released\n\r\n  \nSpring Web Services 4.0.0-RC1 is out!",
          "link": "https://spring.io/blog/2022/10/18/this-week-in-spring-october-18th-2022",
          "publishedOn": "2022-10-18T19:00:00.000Z",
          "wordCount": 816,
          "title": "This Week in Spring - October 18th, 2022",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/18/spring-web-services-4-0-0-rc1-is-out",
          "author": null,
          "description": "Greetings Spring community,\n\r\n\r\n\r\nThe Spring Web Services team has released 4.0.0-RC1. This is the last planned release candidate that supports Spring Boot 3.0. The final GA release is coming next month in anticipation of Spring Boot 3.0 going GA.\n\r\n\r\n\r\n4.0.x is the generation of Spring Web Services that works with Jakarta EE 9, the version where the enterprise specs (JAX-WS, etc.) migrate from javax. to jakarta.. See Juergen Holler’s blog post for more details about that.\n\r\n\r\n\r\nBeing based upon Spring Framework 6.0, this is also the generation of Spring Web Services that is rebased on top of Java 17 (LTS). So check it out!\n\r\n\r\n\r\nFor more details, read the following release notes for each version:\n\r\n\r\n\r\nRelease Notes - Spring Web Services - Version 4.0.0-RC1\n\r\n\r\n\r\n#1284 - Upgrade to Spring…",
          "link": "https://spring.io/blog/2022/10/18/spring-web-services-4-0-0-rc1-is-out",
          "publishedOn": "2022-10-18T19:00:00.000Z",
          "wordCount": 899,
          "title": "Spring Web Services 4.0.0-RC1 is out!",
          "imageUrl": "https://avatars.githubusercontent.com/u/311040?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/18/spring-for-graphql-1-1-0-rc1-released",
          "author": null,
          "description": "I’m pleased to announce that the first release candidate of Spring for GraphQL 1.1.0 is now available from our Milestone repository. This version will be shipped with Spring Boot 3.0.0-RC1 due for release later this week.\n\r\nThis release candidate is the last stop for shipping new features; from that point, we’ll be focusing on bug fixes and documentation improvements. Our goal is to stabilize the current branch for our GA release scheduled next month.\n\r\nWith RC1, we’re shipping our new Observability support in Spring for GraphQL. Based on the new Micrometer Observation work, this infrastructure replaces the former GraphQL Metrics support in Spring Boot 2.7. GraphQL is a good use case for Observability in general, as the GraphQL engine can distribute the data fetching operations over caches, databases, REST APIs and more. It’s important not only to keep track of performance metrics for your GraphQL API, but also to be able to explore traces and investigate production issues.\n\r\nWe didn’t have time to tackle features like Pagination/Relay or AOT/Native support, but we’re listening to the community. We’re working on our roadmap for the next feature version, so now is the time to vote on existing issues to show your interest!\n\r\nThe annual Spring survey is here, it’s a great way to let us know what you think!\nHow can you help?\n\r\nIf you have general questions, please ask on stackoverflow.com using the spring-graphql tag.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow",
          "link": "https://spring.io/blog/2022/10/18/spring-for-graphql-1-1-0-rc1-released",
          "publishedOn": "2022-10-18T16:40:00.000Z",
          "wordCount": 749,
          "title": "Spring for GraphQL 1.1.0-RC1 released",
          "imageUrl": "https://avatars.githubusercontent.com/u/103264?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/18/spring-security-5-7-4-and-5-6-8-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I am pleased to announce that Spring Security 5.7.4 and 5.6.8 are available now. In both cases the releases are largely composed of dependency upgrades and minor fixes.\n\r\n\r\n\r\nTo learn more, please visit the 5.7.4 and\r\n 5.6.8 release summaries.\n\r\n\r\n\r\nProject Site | Reference | Help",
          "link": "https://spring.io/blog/2022/10/18/spring-security-5-7-4-and-5-6-8-available-now",
          "publishedOn": "2022-10-18T12:54:00.000Z",
          "wordCount": 564,
          "title": "Spring Security 5.7.4 and 5.6.8 available now",
          "imageUrl": "https://avatars.githubusercontent.com/u/5248162?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/18/spring-security-6-0-0-rc1-and-5-8-0-rc1-are-released",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I am pleased to announce that Spring Security 6.0.0-RC1 and 5.8.0-RC1 are available now.\n\r\n\r\n\r\nSee the 6.0.0-RC1 and 5.8.0-RC1 release notes for more details.\n\r\n\r\n\r\nProject Site | Reference | Help",
          "link": "https://spring.io/blog/2022/10/18/spring-security-6-0-0-rc1-and-5-8-0-rc1-are-released",
          "publishedOn": "2022-10-18T12:54:00.000Z",
          "wordCount": 549,
          "title": "Spring Security 6.0.0-RC1 and 5.8.0-RC1 are released",
          "imageUrl": "https://avatars.githubusercontent.com/u/5248162?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/17/spring-data-2022-0-0-rc1-2021-2-5-and-2021-1-8-available",
          "author": null,
          "description": "Dear Spring community,\n\r\nOn behalf of the Spring Data team and everyone who contributed, it is my pleasure to announce that Spring Data 2022.0.0 has entered its release candidate phase by releasing RC1 today. It is available from the milestone repository. This release ships with several tickets fixed. Along with the release candidate, we shipped 2021.2.5 and 2021.1.8 service releases, to be picked up by corresponding Spring Boot releases.\n\r\nThe release candidate ships with a revised module structure, specifically Spring Data for Apache Geode is no longer part of the release train. Expect a blog post that outlines details soon.\n\r\nPlease give Spring Data 2022.0.0-RC1 a try (for example, as part of the upcoming Spring Boot 3.0.0-RC1 release), which will be available start.spring.io soon, and …",
          "link": "https://spring.io/blog/2022/10/17/spring-data-2022-0-0-rc1-2021-2-5-and-2021-1-8-available",
          "publishedOn": "2022-10-17T08:23:00.000Z",
          "wordCount": 1171,
          "title": "Spring Data 2022.0.0-RC1, 2021.2.5, and 2021.1.8 available",
          "imageUrl": "https://avatars.githubusercontent.com/u/1035015?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/16/spring-at-javaone-2022",
          "author": null,
          "description": "Hi, Spring fans! It’s Sunday the 16th of October as I write this and I’m winging my way to sunny Las Vegas, Nevada, where I’ll be attending (and presenting at) the first JavaOne show in years! It didn’t exist as the JavaOne we know and love for years, even before the pandemic interrupted life as we know it worldwide. So this isn’t just the first JavaOne since 2019, it’s [the first JavaOne since 2017](https://www.infoq.com/news/2018/04/oracle-kills-java-one/_! I can’t wait to be there, to see the amazing community, to soak up the sun and fun with my teammates and friends in the ecosystem. And we want to see you, too.\n\r\nThere are a few of us doing talks from the Spring team and we’d love to see you!\n\r\nFirst of all: we have a booth, so join us there.\n\r\nThere are going to be a bunch of great t…",
          "link": "https://spring.io/blog/2022/10/16/spring-at-javaone-2022",
          "publishedOn": "2022-10-16T07:00:00.000Z",
          "wordCount": 933,
          "title": "Spring at JavaOne 2022",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        }
      ]
    },
    {
      "title": "HashiCorp Blog",
      "feedUrl": "https://www.hashicorp.com/blog/feed.xml",
      "siteUrl": "https://hashicorp.com/blog",
      "articles": [
        {
          "id": "https://www.hashicorp.com/blog/the-state-of-vault-and-kubernetes-and-future-plans",
          "author": null,
          "description": "Get an overview of the most common ways to use HashiCorp Vault and Kubernetes together, and get a preview of a new method we're considering.",
          "link": "https://www.hashicorp.com/blog/the-state-of-vault-and-kubernetes-and-future-plans",
          "publishedOn": "2022-10-26T16:30:00.000Z",
          "wordCount": 2764,
          "title": "The State of Vault and Kubernetes, and Future Plans",
          "imageUrl": "https://www.datocms-assets.com/2885/1608227983-blog-library-product-kubernetes-vault.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/certificate-management-with-vault",
          "author": null,
          "description": "In this blog post, we’ll look at practical public key certificate management in HashiCorp Vault using dynamic secrets rotation.",
          "link": "https://www.hashicorp.com/blog/certificate-management-with-vault",
          "publishedOn": "2022-10-24T16:00:00.000Z",
          "wordCount": 4993,
          "title": "X.509 Certificate Management with Vault",
          "imageUrl": "https://www.datocms-assets.com/2885/1600072325-4bc95438-e433-4f87-908c-e8effb707462.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashiconf-global-2022-from-zero-trust-to-no-code",
          "author": null,
          "description": "Check out the highlights from HashiConf Global 2022 and watch the 40+ keynote and session recordings now live on YouTube.",
          "link": "https://www.hashicorp.com/blog/hashiconf-global-2022-from-zero-trust-to-no-code",
          "publishedOn": "2022-10-21T16:30:00.000Z",
          "wordCount": 1805,
          "title": "HashiConf Global 2022: From Zero Trust to No Code",
          "imageUrl": "https://www.datocms-assets.com/2885/1666368098-2022_hashiconf_thursday_081_2507.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/pre-plan-apply-run-tasks-now-available-in-terraform-cloud",
          "author": null,
          "description": "Enhance your Terraform Cloud workflow by adding run tasks before the plan and/or apply stages.",
          "link": "https://www.hashicorp.com/blog/pre-plan-apply-run-tasks-now-available-in-terraform-cloud",
          "publishedOn": "2022-10-20T16:00:00.000Z",
          "wordCount": 1868,
          "title": "Pre-Plan/Pre-Apply Run Tasks Now Available in Terraform Cloud",
          "imageUrl": "https://www.datocms-assets.com/2885/1620073844-blog-library-product-terraform-cloud-tfc-black-gradient.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-wins-datadog-s-integration-developer-partner-of-the-year-award",
          "author": null,
          "description": "HashiCorp has won the 2022 Datadog Partner Network (DPN) Integration Developer Partner of the Year Award.",
          "link": "https://www.hashicorp.com/blog/hashicorp-wins-datadog-s-integration-developer-partner-of-the-year-award",
          "publishedOn": "2022-10-19T19:00:00.000Z",
          "wordCount": 1612,
          "title": "HashiCorp Wins Datadog’s Integration Developer Partner of the Year Award",
          "imageUrl": "https://www.datocms-assets.com/2885/1639970392-hashicorp-datadog.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/new-competency-program-validates-systems-integrators-hashicorp-expertise",
          "author": null,
          "description": "The new Technical Competency Program for Systems Integrators allows partners to display earned competency badges on both their own website and HashiCorp.com.",
          "link": "https://www.hashicorp.com/blog/new-competency-program-validates-systems-integrators-hashicorp-expertise",
          "publishedOn": "2022-10-19T16:00:00.000Z",
          "wordCount": 1760,
          "title": "New Competency Program Validates Systems Integrators’ HashiCorp Expertise",
          "imageUrl": "https://www.datocms-assets.com/2885/1666107145-partner-network-thumbnail.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/cockroach-labs-forgerock-paloalto-networks-highlight-new-vault-integrations",
          "author": null,
          "description": "The HashiCorp Vault ecosystem saw multiple integrations from partners Cockroach Labs, ForgeRock, and PaloAlto Networks as part of the 19 integrations completed this past quarter.",
          "link": "https://www.hashicorp.com/blog/cockroach-labs-forgerock-paloalto-networks-highlight-new-vault-integrations",
          "publishedOn": "2022-10-18T16:00:00.000Z",
          "wordCount": 2739,
          "title": "Cockroach Labs, ForgeRock & Palo Alto Networks Highlight New Vault Integrations",
          "imageUrl": "https://www.datocms-assets.com/2885/1666036246-oct19thvaultintbloggraphic.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/how-two-hashicorp-employees-marked-latinx-hispanic-heritage-month",
          "author": null,
          "description": "Karla De La Garza and Abraham Martinez, from HashiCorp’s Unidos Employee Resource Group, share their experiences in Mexico during Latinx & Hispanic Heritage Month.",
          "link": "https://www.hashicorp.com/blog/how-two-hashicorp-employees-marked-latinx-hispanic-heritage-month",
          "publishedOn": "2022-10-13T19:00:00.000Z",
          "wordCount": 3521,
          "title": "How Two HashiCorp Employees Marked Latinx & Hispanic Heritage Month",
          "imageUrl": "https://www.datocms-assets.com/2885/1665678755-unidos-hispanic-heritage-eeg.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/vault-1-12",
          "author": null,
          "description": "The new HashiCorp Vault 1.12 focuses on improving core workflows and making key features production-ready.",
          "link": "https://www.hashicorp.com/blog/vault-1-12",
          "publishedOn": "2022-10-13T16:30:00.000Z",
          "wordCount": 4580,
          "title": "HashiCorp Vault 1.12 Adds New Secrets Engines, ADP Updates, and More",
          "imageUrl": "https://www.datocms-assets.com/2885/1620082983-blog-library-product-vault-dark-graphics.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/cdk-for-terraform-0-13-significantly-improves-performance",
          "author": null,
          "description": "Cloud Development Kit for Terraform (CDKTF) 0.13 vastly reduces synth time across all supported languages.",
          "link": "https://www.hashicorp.com/blog/cdk-for-terraform-0-13-significantly-improves-performance",
          "publishedOn": "2022-10-10T16:00:00.000Z",
          "wordCount": 3310,
          "title": "CDK for Terraform 0.13 Significantly Improves Performance",
          "imageUrl": "https://www.datocms-assets.com/2885/1620081857-blog-library-product-terraform-dark-gradient.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/nomad-1-4-adds-nomad-variables-and-updates-service-discovery",
          "author": null,
          "description": "The GA release of HashiCorp Nomad 1.4 enhances native service discovery support with health checks and introduces Nomad Variables, which lets users store configuration values.",
          "link": "https://www.hashicorp.com/blog/nomad-1-4-adds-nomad-variables-and-updates-service-discovery",
          "publishedOn": "2022-10-06T16:00:00.000Z",
          "wordCount": 5177,
          "title": "Nomad 1.4 Adds Nomad Variables and Updates Service Discovery",
          "imageUrl": "https://www.datocms-assets.com/2885/1620083839-blog-library-product-nomad-dark-graphics.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-hcp-waypoint-public-beta",
          "author": null,
          "description": "HashiCorp Waypoint — now available on the HashiCorp Cloud Platform in public beta — lets users standardize application delivery across platforms.",
          "link": "https://www.hashicorp.com/blog/announcing-hcp-waypoint-public-beta",
          "publishedOn": "2022-10-06T16:00:00.000Z",
          "wordCount": 2306,
          "title": "Announcing HCP Waypoint Public Beta",
          "imageUrl": "https://www.datocms-assets.com/2885/1655842512-blog-library-product-hcp-waypoint.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/terraform-gains-visibility-self-service-and-compliance-upgrades",
          "author": null,
          "description": "Continuous validation, no-code provisioning, native OPA support for Terraform Cloud, and other new features are key upgrades to HashiCorp Terraform introduced at HashiConf Global 2022.",
          "link": "https://www.hashicorp.com/blog/terraform-gains-visibility-self-service-and-compliance-upgrades",
          "publishedOn": "2022-10-06T16:00:00.000Z",
          "wordCount": 3183,
          "title": "Terraform Gains Visibility, Self-Service, and Compliance Upgrades",
          "imageUrl": "https://www.datocms-assets.com/2885/1620081857-blog-library-product-terraform-dark-gradient.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/hcp-boundary-now-ga-bolsters-hashicorp-s-zero-trust-security-solution",
          "author": null,
          "description": "General availability of HCP Boundary lets developers access critical systems with fine-grained authorizations — without managing credentials or exposing your network.",
          "link": "https://www.hashicorp.com/blog/hcp-boundary-now-ga-bolsters-hashicorp-s-zero-trust-security-solution",
          "publishedOn": "2022-10-05T16:00:00.000Z",
          "wordCount": 2709,
          "title": "HCP Boundary — Now GA — Bolsters HashiCorp's Zero Trust Security Solution",
          "imageUrl": "https://www.datocms-assets.com/2885/1655842506-blog-library-product-hcp-boundary.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/hcp-vault-on-microsoft-azure-now-in-public-beta",
          "author": null,
          "description": "In addition to its availability on AWS, HCP Vault can now be deployed on Microsoft Azure infrastructure.",
          "link": "https://www.hashicorp.com/blog/hcp-vault-on-microsoft-azure-now-in-public-beta",
          "publishedOn": "2022-10-05T16:00:00.000Z",
          "wordCount": 1289,
          "title": "HCP Vault on Microsoft Azure Now in Public Beta",
          "imageUrl": "https://www.datocms-assets.com/2885/1664831430-blog-thumbnail-hcp_diagram_onblack_vault_azure.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-developer-your-new-experience-for-docs-and-tutorials",
          "author": null,
          "description": "HashiCorp Developer is your one-stop shop for interactive labs, sample code, videos, tutorials, and in-depth documentation.",
          "link": "https://www.hashicorp.com/blog/hashicorp-developer-your-new-experience-for-docs-and-tutorials",
          "publishedOn": "2022-10-05T16:00:00.000Z",
          "wordCount": 1933,
          "title": "HashiCorp Developer: Your New Experience for Docs and Tutorials",
          "imageUrl": "https://www.datocms-assets.com/2885/1664569797-dev-dot-home.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/consul-1-14-beta-announcing-simplified-service-mesh-deployments",
          "author": null,
          "description": "HashiCorp Consul 1.14 enhances traffic management and failover, and adds a new deployment method: Consul dataplane. AWS Lambda updates and beta Windows VM support were also added.",
          "link": "https://www.hashicorp.com/blog/consul-1-14-beta-announcing-simplified-service-mesh-deployments",
          "publishedOn": "2022-10-05T16:00:00.000Z",
          "wordCount": 5576,
          "title": "Consul 1.14 Beta: Announcing Simplified Service Mesh Deployments",
          "imageUrl": "https://www.datocms-assets.com/2885/1620083627-blog-library-product-consul-dark-graphics.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/introducing-a-new-hcp-based-management-plane-for-consul",
          "author": null,
          "description": "The HashiCorp Cloud Platform (HCP) adds new visibility and management controls for self-managed and HCP-managed Consul deployments.",
          "link": "https://www.hashicorp.com/blog/introducing-a-new-hcp-based-management-plane-for-consul",
          "publishedOn": "2022-10-05T16:00:00.000Z",
          "wordCount": 2601,
          "title": "Introducing a New HCP-Based Management Plane for Consul",
          "imageUrl": "https://www.datocms-assets.com/2885/1655842467-blog-library-product-hcp-consul.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-the-2022-hashicorp-technology-partner-award-winners",
          "author": null,
          "description": "The 2022 HashiCorp Technology Partner Awards have been announced. Find out who the winners are in our four categories this year.",
          "link": "https://www.hashicorp.com/blog/announcing-the-2022-hashicorp-technology-partner-award-winners",
          "publishedOn": "2022-10-04T22:30:00.000Z",
          "wordCount": 1629,
          "title": "Announcing the 2022 HashiCorp Technology Partner Award Winners",
          "imageUrl": "https://www.datocms-assets.com/2885/1600142862-blog-library-product-hashicorp.png"
        }
      ]
    },
    {
      "title": "Elastic Blog - Elasticsearch, Kibana, and ELK Stack",
      "feedUrl": "https://www.elastic.co/blog/feed",
      "siteUrl": "https://www.elastic.co",
      "articles": [
        {
          "id": "https://www.elastic.co/blog/easy-javascript-error-investigation",
          "author": "Carly Richmond",
          "description": "Identifying errors in minified JavaScript code is hard! Check out how source maps uploaded to Elastic Observability make error hunting in RUM traces easier.",
          "link": "https://www.elastic.co/blog/easy-javascript-error-investigation",
          "publishedOn": "2022-10-28T13:00:00.000Z",
          "wordCount": 8754,
          "title": "Easy JavaScript error investigation with source maps",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt62a64ffe6b9f2012/629e68d43d4e745ed3ae5888/blog-observability-no-logo.png"
        },
        {
          "id": "https://www.elastic.co/blog/easy-javascript-error-investigation",
          "author": "Carly Richmond",
          "description": ",\nHopefully by now you’re taken your first sip of Elastic RUM, or real user monitoring, and see the power of searching through traces and the User Experience metrics to gain insights into how users actually use and experience your application. One issue you may have experienced is the challenge of finding the source of errors for minified JavaScript files. \n\nMinification is the process of modifying code and markup using techniques such as whitespace and comment removal and variable renaming to reduce the overall filesize. This is intended to improve the user experience by speeding up the page loading time in the browser. Sadly, this can make diagnosing the cause of issues in production applications rather tricky. As you can see from the below stack trace, files are often minified to a sing…",
          "link": "https://www.elastic.co/blog/easy-javascript-error-investigation",
          "publishedOn": "2022-10-28T13:00:00.000Z",
          "wordCount": 8754,
          "title": "Easy JavaScript error investigation with source maps",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt62a64ffe6b9f2012/629e68d43d4e745ed3ae5888/blog-observability-no-logo.png"
        },
        {
          "id": "https://www.elastic.co/blog/how-to-personalize-search-experiences-using-elastic",
          "author": "Jessica Taylor",
          "description": "Personalized ecommerce search experiences build loyalty, influence decisions, and increase spend. This post demystifies the steps to get started, so you can prioritize search results according to user profiles and offer relevant recommendations.",
          "link": "https://www.elastic.co/blog/how-to-personalize-search-experiences-using-elastic",
          "publishedOn": "2022-10-28T00:00:00.000Z",
          "wordCount": 8110,
          "title": "How to personalize search experiences using Elastic",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltcc7f9873ba87d03d/635ad995714c6a728bd02f2b/search-personalization-elastibuy.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/how-to-personalize-search-experiences-using-elastic",
          "author": "Jessica Taylor",
          "description": ",\nCreating personalized search experiences can be challenging. In this post, we’ll demystify the steps to get started, so you can prioritize search results according to user profiles, offer relevant recommendations, and accelerate workflows. But before we get to that, let’s address why personalized search matters.\n[Download the whitepaper: Ecommerce search personalization on Elastic]\nThe influence of personalized search\nWhether you’re aware of it or not, search powers the personalized digital experiences you encounter everyday. Here are just a few examples:\n\nSearch-as-you-type uses your search history to suggest queries.\nKnowledge base articles get served up according to your subscription preferences.\nHealthcare providers are suggested depending on your medical history and location.\nOnline…",
          "link": "https://www.elastic.co/blog/how-to-personalize-search-experiences-using-elastic",
          "publishedOn": "2022-10-28T00:00:00.000Z",
          "wordCount": 8110,
          "title": "How to personalize search experiences using Elastic",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltcc7f9873ba87d03d/635ad995714c6a728bd02f2b/search-personalization-elastibuy.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/how-to-create-a-document-schema-for-product-variants-and-skus-for-your-ecommerce-search-experience",
          "author": "Jason Stoltzfus",
          "description": "With Elastic Enterprise Search, explore how to set up, display, and manage product variants and SKUs when modeling data for your ecommerce search experiences.",
          "link": "https://www.elastic.co/blog/how-to-create-a-document-schema-for-product-variants-and-skus-for-your-ecommerce-search-experience",
          "publishedOn": "2022-10-27T00:00:00.000Z",
          "wordCount": 11444,
          "title": "How to create a document schema for product variants and SKUs for your ecommerce search experience",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt26eec11ef53768ba/6358548a91426d70a0a61abb/ecommerce-sku-variant-thumbnail.png"
        },
        {
          "id": "https://www.elastic.co/blog/turning-data-into-actionable-insights-using-search-technology",
          "author": "Jennifer Klinger",
          "description": "Discover how IT leaders are using search technology to turn unstructured data into insights that improve the customer experience, increase operational resilience, and mitigate security threats.",
          "link": "https://www.elastic.co/blog/turning-data-into-actionable-insights-using-search-technology",
          "publishedOn": "2022-10-27T00:00:00.000Z",
          "wordCount": 7243,
          "title": "How IT leaders are turning data into actionable insights using search technology [Infographic]",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt19bdb1f1afc59605/6358409e94a86c5862636940/observability-digital-transformation-1.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/how-moving-to-the-cloud-leads-to-a-better-customer-experience",
          "author": "Dan Tynan",
          "description": "Want to increase loyalty and retention? Move your customer data to the cloud.",
          "link": "https://www.elastic.co/blog/how-moving-to-the-cloud-leads-to-a-better-customer-experience",
          "publishedOn": "2022-10-27T00:00:00.000Z",
          "wordCount": 8267,
          "title": "How moving to the cloud leads to a better customer experience",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltb72a287b784f8ffe/635ac10792026b7701875538/integrated-IT-infrastructure.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/how-to-create-a-document-schema-for-product-variants-and-skus-for-your-ecommerce-search-experience",
          "author": "Jason Stoltzfus",
          "description": ",\nIn this article, we'll explore the concepts of variants and SKUs in ecommerce, and how to best handle these when modeling data for your ecommerce search experiences. We're optimizing our models using Elastic Enterprise Search.\nUnderstanding variants and SKUs\nIn ecommerce, products are not just \"products.\" There can be a hierarchy to products, which generally follows this pattern:\nProduct → Variant → SKU\nLet's explore these terms and how they factor into ecommerce stores and search experiences.\nVariants\nThe term variant in ecommerce refers to a single product that has a number of variations with different attributes. \nFor example, a store may sell a Breezy Classic Button Down Shirt, in three different colors: green, red, and blue. Each color variation of the shirt is considered a variant …",
          "link": "https://www.elastic.co/blog/how-to-create-a-document-schema-for-product-variants-and-skus-for-your-ecommerce-search-experience",
          "publishedOn": "2022-10-27T00:00:00.000Z",
          "wordCount": 11444,
          "title": "How to create a document schema for product variants and SKUs for your ecommerce search experience",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt26eec11ef53768ba/6358548a91426d70a0a61abb/ecommerce-sku-variant-thumbnail.png"
        },
        {
          "id": "https://www.elastic.co/blog/turning-data-into-actionable-insights-using-search-technology",
          "author": "Jennifer Klinger",
          "description": ",\nMore data is being created than ever before. With an expected 181 zettabytes of data created in 2025 (compared to 64.2 zettabytes in 2020), there’s a lot more of it to make use of. Over the next five years, 80% of that data will be unstructured, according to IDC. This data isn’t just applicable to big data projects with hypothetical opportunities, either. It’s the lifeblood for real, concrete, business-critical use cases that are applicable to businesses of all sizes and across all industries.\n\nAs an IT leader, you’re tasked with accelerating digital transformation, supercharging scalability, and improving customer experiences (among a plethora of other business priorities). To achieve all of these objectives, you need technologies that can supercharge your decision-making and turn data …",
          "link": "https://www.elastic.co/blog/turning-data-into-actionable-insights-using-search-technology",
          "publishedOn": "2022-10-27T00:00:00.000Z",
          "wordCount": 7243,
          "title": "How IT leaders are turning data into actionable insights using search technology [Infographic]",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt19bdb1f1afc59605/6358409e94a86c5862636940/observability-digital-transformation-1.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/how-moving-to-the-cloud-leads-to-a-better-customer-experience",
          "author": "Dan Tynan",
          "description": ",\nIt was finally time to bite the bullet. \n\nAfter years of relying on an aging on-prem version of Elasticsearch, the U.S.-based expense management firm needed to modernize its IT infrastructure. And as it migrated from v 2.3.4 to v 7.9, it seemed like the right time to graduate to the cloud.\n\n\n\nIt wouldn’t be simple. The firm — a global leader in accounts payable automation — employed a complex installation using 10 custom searches. And the Lucene syntax that drives Elasticsearch had changed a lot in five years.\n\n\n\nWith the help of Softjourn, a Bay Area-based software development company, they began a year-long migration to AWS.\n\n\nThe key questions: What would happen to the customer experience? Would searches be as fast and accurate? Could the firm maintain the same high level of responsiv…",
          "link": "https://www.elastic.co/blog/how-moving-to-the-cloud-leads-to-a-better-customer-experience",
          "publishedOn": "2022-10-27T00:00:00.000Z",
          "wordCount": 8267,
          "title": "How moving to the cloud leads to a better customer experience",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltb72a287b784f8ffe/635ac10792026b7701875538/integrated-IT-infrastructure.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/leading-financial-institutions-hedge-risk-by-focusing-on-these-5-critical-siem-requirements",
          "author": "Brandon Mavleos",
          "description": "Digital transformation is expanding the attack surface in financial services. Learn about several essential features that financial security leaders should look out for in their next SIEM investment.",
          "link": "https://www.elastic.co/blog/leading-financial-institutions-hedge-risk-by-focusing-on-these-5-critical-siem-requirements",
          "publishedOn": "2022-10-26T00:00:00.000Z",
          "wordCount": 8553,
          "title": "Leading financial institutions hedge risk by focusing on these 5 critical SIEM requirements",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt01f60c6522c57385/6351b1bc4e565f1cdce29dcf/04-stock-charts.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/leading-financial-institutions-hedge-risk-by-focusing-on-these-5-critical-siem-requirements",
          "author": "Brandon Mavleos",
          "description": ",\nDigital transformation is expanding the attack surface in financial services. Throughout the pandemic, the accelerated adoption of digital banking, payments, and insurance channels has enabled providers to offer greater levels of service, new financial products, and enhanced journeys to their customers.\n\n\n\nHowever, with growing amounts of data and increasingly complex IT ecosystems, bad actors are finding more creative ways of wreaking havoc. In fact, U.S. Federal Reserve Chairman Jerome Powell warned last year that cyberattacks are the number-one threat to the global financial system.\n\n\n\nCyberattacks in financial services can be exceptionally devastating. Even small problems can lead to substantial money lost, customers exposed, and heavy regulatory fines. Some of the recent drivers beh…",
          "link": "https://www.elastic.co/blog/leading-financial-institutions-hedge-risk-by-focusing-on-these-5-critical-siem-requirements",
          "publishedOn": "2022-10-26T00:00:00.000Z",
          "wordCount": 8553,
          "title": "Leading financial institutions hedge risk by focusing on these 5 critical SIEM requirements",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt01f60c6522c57385/6351b1bc4e565f1cdce29dcf/04-stock-charts.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/top-3-siem-challenges-in-multi-cloud-environments",
          "author": "Ken Buckler",
          "description": "To be effective, a SIEM needs to provide compatibility with your current environment — including your cloud infrastructure and applications — as well as support future expansion.",
          "link": "https://www.elastic.co/blog/top-3-siem-challenges-in-multi-cloud-environments",
          "publishedOn": "2022-10-25T07:00:00.000Z",
          "wordCount": 7930,
          "title": "Top 3 SIEM challenges in multi-cloud environments",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt066782b93361a351/6297e54324e98e0f7a82ff1e/illustration-hero-security-cloud-security.png"
        },
        {
          "id": "https://www.elastic.co/blog/top-3-siem-challenges-in-multi-cloud-environments",
          "author": "Ken Buckler",
          "description": ",\n\nWhat is a SIEM, and why do you need one for cloud?\nSecurity information and event management (SIEM) is designed to combine the best of security information management (SIM) and security event management (SEM) to provide a unified platform for intrusion detection and response. While SIEMs traditionally don’t include prevention capabilities, users are increasingly expecting fulfillment of this use case from a SIEM as part of tool consolidation. We need to move away from reactive security toward proactive security, working to prevent intrusions before they happen (or get worse). A quality SIEM must equip practitioners to spot cyber-threats quickly, and investigate and remediate threats before they can cause damage.\nThe shift to the cloud exacerbates the visibility challenges of perimeter-b…",
          "link": "https://www.elastic.co/blog/top-3-siem-challenges-in-multi-cloud-environments",
          "publishedOn": "2022-10-25T07:00:00.000Z",
          "wordCount": 7930,
          "title": "Top 3 SIEM challenges in multi-cloud environments",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt066782b93361a351/6297e54324e98e0f7a82ff1e/illustration-hero-security-cloud-security.png"
        },
        {
          "id": "https://www.elastic.co/blog/culture-the-elastic-guide-to-finding-a-company-you-can-grow-with",
          "author": "Elastic Culture",
          "description": "Where do you want to be in 5 years? Here's how to find a company that will help you take the next steps in your career.",
          "link": "https://www.elastic.co/blog/culture-the-elastic-guide-to-finding-a-company-you-can-grow-with",
          "publishedOn": "2022-10-25T00:00:00.000Z",
          "wordCount": 7295,
          "title": "The Elastic Guide to: Finding a company you can grow with",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltea1eab838043c602/63569ce0e63a425d5dc58c7d/10.0-culture-blog-finding-a-company-you-can-grow-with-blog-1680x980.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/what-do-telecom-security-teams-need-from-a-siem",
          "author": "Suranjeeta Choudhury",
          "description": "In the past couple of years, two things stood out for the telecom industry: 5G and cloud adoption. Put together, there is a need for a completely revamped approach to security. And the journey begins with a “modern” SIEM.",
          "link": "https://www.elastic.co/blog/what-do-telecom-security-teams-need-from-a-siem",
          "publishedOn": "2022-10-25T00:00:00.000Z",
          "wordCount": 7562,
          "title": "What do telecom security teams need from a SIEM?",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt648c7212bb76343e/6351ad161d78fa218f252508/06-subway.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/customer-trust-relies-on-building-it-systems-that-scale",
          "author": "Rusty Weston",
          "description": "Solving for scale is the key to ensuring your IT organization delivers on its promise to secure and protect data",
          "link": "https://www.elastic.co/blog/customer-trust-relies-on-building-it-systems-that-scale",
          "publishedOn": "2022-10-25T00:00:00.000Z",
          "wordCount": 7743,
          "title": "Customer trust relies on building IT systems that scale",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltc47a20080a005ac8/6356ec7a0a58db35cbdbc2c7/observability-digital-transformation-3.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/culture-the-elastic-guide-to-finding-a-company-you-can-grow-with",
          "author": "Elastic Culture",
          "description": ",\nJordyn Short, Services Architect at Elastic, spent seven years in the U.S. Army. She learned many valuable lessons, among them, the path to success isn’t always easy. After leaving the military, she took these learnings to create a fulfilling career. \nAs a civilian, the path to success isn’t as defined as it might be in military training, so Jordyn had to learn how to create and pursue the career she wanted. She went from the Army to government contracting work, which she says was a good transition into finding out who she was and what she wanted.\nJordyn spent two years as a Senior Technical Consultant at Elastic before being recently promoted to Services Architect, a common career trajectory. To get promoted, she had to complete her Elastic Engineering certification, show technical comp…",
          "link": "https://www.elastic.co/blog/culture-the-elastic-guide-to-finding-a-company-you-can-grow-with",
          "publishedOn": "2022-10-25T00:00:00.000Z",
          "wordCount": 7295,
          "title": "The Elastic Guide to: Finding a company you can grow with",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltea1eab838043c602/63569ce0e63a425d5dc58c7d/10.0-culture-blog-finding-a-company-you-can-grow-with-blog-1680x980.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/what-do-telecom-security-teams-need-from-a-siem",
          "author": "Suranjeeta Choudhury",
          "description": ",\nJust within the last 30 days, the two largest telecom operators in Australia1 were hit by a data breach impacting millions of customers and compromising sensitive personal information like home addresses, drivers’ licenses, and passport numbers. The situation is not very different in the Americas, where another leading telecom provider2 cited a 13% jump in ransomware attacks in the past year. And in Europe, the latest cybersecurity report from European Union Agency for Cybersecurity (ENISA)3 that lists the major telecom security incidents from 2021 stated that 5,000+ user hours were lost — compared to just over 800 hours in 2020.\n\n\n\nSo what has changed in the past couple of years? For the telecom industry in particular, two things stand out: 5G and cloud adoption. These technologies prov…",
          "link": "https://www.elastic.co/blog/what-do-telecom-security-teams-need-from-a-siem",
          "publishedOn": "2022-10-25T00:00:00.000Z",
          "wordCount": 7562,
          "title": "What do telecom security teams need from a SIEM?",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt648c7212bb76343e/6351ad161d78fa218f252508/06-subway.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/customer-trust-relies-on-building-it-systems-that-scale",
          "author": "Rusty Weston",
          "description": ",\nAdopting hybrid or public clouds remains IT’s go-to means of achieving scale. While this transformation has improved price performance and advanced tech-driven business capabilities, including faster and deeper data insights, it hasn’t always engendered higher customer trust. \n\nThat’s due in no small part to widely-publicized hacks that have exposed personally identifiable information (PII) and also in part to higher customer dependence upon mobile commerce, wonky inventory systems, and sometimes unreliable online ordering. By some measures, performing at scale is all about improving transactions per second.\n\nAccording to a 2022 PwC study, “87% of business executives think consumers have a high level of trust in their business. But only 30% of consumers say they do.” One of the biggest t…",
          "link": "https://www.elastic.co/blog/customer-trust-relies-on-building-it-systems-that-scale",
          "publishedOn": "2022-10-25T00:00:00.000Z",
          "wordCount": 7743,
          "title": "Customer trust relies on building IT systems that scale",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltc47a20080a005ac8/6356ec7a0a58db35cbdbc2c7/observability-digital-transformation-3.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/performing-real-user-monitoring-rum-with-elastic-apm",
          "author": "Adam Quan,Carly Richmond",
          "description": "Sorry if I lured you into the mood of having a sip of a wonderful cocktail made with rum and you realized that the RUM I’m talking about is not the rum you are craving. But, be assured that Elastic RUM is equally wonderful! Let’s take a sip! I do want to warn you that it will take a bit of time to go through the amount of detail I will cover in this blog.\nWhat is RUM?\nElastic real user monitoring, or RUM, captures user interactions with the web browser and provides a detailed view of the “real user experience” of your web applications from a performance perspective. Elastic’s RUM Agent is a JavaScript Agent, which means it supports any JavaScript-based application. RUM can provide valuable insight into your applications. Some of the common benefits of RUM include:\n\nRUM performance data can…",
          "link": "https://www.elastic.co/blog/performing-real-user-monitoring-rum-with-elastic-apm",
          "publishedOn": "2022-10-20T16:00:00.000Z",
          "wordCount": 11897,
          "title": "A Sip of Elastic RUM (Real User Monitoring)",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt1463e5e2ef1cadd0/5c98d5ed12edfac256db3cd9/elastic-apm-distributed-tracing-small.png"
        },
        {
          "id": "https://www.elastic.co/blog/performing-real-user-monitoring-rum-with-elastic-apm",
          "author": "Adam Quan,Carly Richmond",
          "description": "Elastic APM real user monitoring (RUM) captures user interactions with browsers. We will instrument an application with a React frontend and a Spring Boot backend using the RUM and Java agents. Together, they provide a holistic view of application performance from an end user perspective through distributed tracing.",
          "link": "https://www.elastic.co/blog/performing-real-user-monitoring-rum-with-elastic-apm",
          "publishedOn": "2022-10-20T16:00:00.000Z",
          "wordCount": 11897,
          "title": "A Sip of Elastic RUM (Real User Monitoring)",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt1463e5e2ef1cadd0/5c98d5ed12edfac256db3cd9/elastic-apm-distributed-tracing-small.png"
        }
      ]
    },
    {
      "title": "Ansible Blog",
      "feedUrl": "https://www.ansible.com/blog/rss.xml",
      "siteUrl": "https://www.ansible.com/blog",
      "articles": [
        {
          "id": "https://www.ansible.com/blog/edge-automation-a-paradigm-shift",
          "author": "Chad Ferman",
          "description": "Introduction\n \r\nRed Hat Ansible Automation Platform has seen wide-scale adoption in a variety of automation domains, however with edge use cases becoming more mainstream, the thought process around automation must shift from “complete a task immediately” to being able to run automation now and later, and respond to incoming automation requests from devices that are yet unmanaged.",
          "link": "https://www.ansible.com/blog/edge-automation-a-paradigm-shift",
          "publishedOn": "2022-10-26T13:00:00.000Z",
          "wordCount": 3807,
          "title": "Edge Automation: A Paradigm Shift",
          "imageUrl": "https://lh6.googleusercontent.com/zJMwDxo2jroIb8kVx2bsfYWNevZiCy2SVCsSilWIrhvPO4CORVhGxNp_ON7hMgE9NY4aau7vEqTIdznNCyOC-Iok0LWWnkVpcSrFPPh6Doin9EyINbC8aGX1k6kqggVCgDOhMAoF3FM6TqHhbIpkOhT783zFKE4p0Vac_m8fmslk7ZDUKwq37QZS1Q"
        },
        {
          "id": "https://www.ansible.com/blog/best-of-fest-2022",
          "author": "elathram@redhat.com (Elle Universal)",
          "description": "At AnsibleFest 2022, the power of automation was on full display. Through sessions, workshops, labs and more, we explored how to transform enterprise and industry through automation. There were a lot of exciting announcements made on both days, and in case you missed it, we are going to dive into what is new!",
          "link": "https://www.ansible.com/blog/best-of-fest-2022",
          "publishedOn": "2022-10-24T14:15:00.000Z",
          "wordCount": 3320,
          "title": "Best of Fest 2022",
          "imageUrl": "https://lh3.googleusercontent.com/dvLgLfKHj7h3CaM8aydri6pVdGkUcOkAswu5ClstfexqCwBtf6pVdndQeOcDSxo2NtjWHR191WguWHYVIXO6ZlkCzVYdUiuLCb-bQ_55bL4BdjuwVohcQq3qaWUvvLZ01yxPFixljsjzqPTzl_wayyk-DrF0DI6CaVsP2Z3cclDdsXndSLh-_RaO7Q"
        },
        {
          "id": "https://www.ansible.com/blog/introducing-event-driven-ansible",
          "author": "Joe Pisciotta",
          "description": "Today at AnsibleFest 2022, Red Hat announced an exciting new developer preview for Event-Driven Ansible. Most customers are on a journey toward full end-to-end automation and there are many paths you take along this journey.  Event-Driven Ansible is a new way to enhance and expand automation. It improves IT speed and agility, while enabling consistency and resilience.",
          "link": "https://www.ansible.com/blog/introducing-event-driven-ansible",
          "publishedOn": "2022-10-19T04:05:00.000Z",
          "wordCount": 3908,
          "title": "Introducing the Event-Driven Ansible developer preview",
          "imageUrl": "https://lh5.googleusercontent.com/4ib-UuFC47hOa3jGkoFiYan-VZBcovZHeapDpRcVoQCWXjEKt72Irvswn7q8wUOJmqsRCx3jidkF1wWk8RIEPArFL0I53SJ4JHqIJ-lMHo-8k3som7TZwm4c4yAJUBQap_gDIsP3lR-f21plkJsXiAj2uxRA_2EILD26iC7GA5znZTZlsId_tlm49g"
        },
        {
          "id": "https://www.ansible.com/blog/getting-started-with-event-driven-ansible",
          "author": "nmartins@redhat.com (Nuno Martins)",
          "description": "As one technology advances, it expands the possibilities for other technologies and offers the solutions of tomorrow for the challenges we face today. AnsibleFest 2022 brings us new advances in Ansible automation that are as bright as they are innovative. I am talking about the Event-Driven Ansible developer preview.",
          "link": "https://www.ansible.com/blog/getting-started-with-event-driven-ansible",
          "publishedOn": "2022-10-19T04:02:00.000Z",
          "wordCount": 3838,
          "title": "Getting Started with Event-Driven Ansible",
          "imageUrl": "https://lh5.googleusercontent.com/LVSgtbu7PWHg3zCHxtuiF8g8J8wW5yO2IBk9-hAsJioFnqb3zgaEPPJNHIudrZNyhcTl-TnARFSjKZXzcXw8jPS1F8pr2rS9dS-7kl2UIM0fif5eY7laJaGeguv_z4QvIGWkNuWNv3R5JpYpoin-0bvOWvXcn7Ae6Mi6XmxHfZyjSBBjPcz4gTDMwg"
        },
        {
          "id": "https://www.ansible.com/blog/event-driven-ansible-for-partners",
          "author": "Emily Bock",
          "description": "Event-driven automation is increasingly being adopted because of the strong benefits it delivers in managing huge amounts of complexity across multi-clouds, a multi-device remote workforce, and growing edge implementations. In a digital world, maintaining resilience and reliability is essential and event driven automation helps teams meet these needs while working around resource and skills gaps.",
          "link": "https://www.ansible.com/blog/event-driven-ansible-for-partners",
          "publishedOn": "2022-10-19T04:01:00.000Z",
          "wordCount": 3410,
          "title": "It takes a community: how partners play a key role in event driven automation",
          "imageUrl": "https://lh5.googleusercontent.com/Ar-jdRGP8239YbtfmnddQV6Q4g3QQjS1GNT-TQyKyb6Sz0_lE2VCgjqex0LMZw9E15a6Cs46S1QHrOCG4vy-7GVS2Z5JySq9-SQQ0DMXo-47O5duXeH4sLXo8IbEf2lDzxPb-UounU72bTPK75bxGeqDJ1bUw3vVuohUn0N87q0SyhZQQV3VFSllug"
        },
        {
          "id": "https://www.ansible.com/blog/ansible-and-packer-why-they-are-better-together",
          "author": "scavanau@redhat.com (Sean Cavanaugh)",
          "description": "Red Hat Ansible Automation Platform can help you orchestrate, operationalize and govern your hybrid cloud deployments.  In my last public cloud blog, I talked about Two Simple Ways Automation Can Save You Money on Your AWS Bill and similarly to Ashton’s blog Bringing Order to the Cloud: Day 2 Operations in AWS with Ansible, we both wanted to look outside the common public cloud use-case of provisioning and deprovisioning resources and instead look at automating common operational tasks.  For this blog post I want to cover how the Technical Marketing team for Ansible orchestrates a pipeline for demos and workshops with Ansible and how we integrate that with custom AMIs (Amazon Machine Images) created with Packer.  Packer is an open source tool that allows IT operators to standardize and automate the process of building system images.",
          "link": "https://www.ansible.com/blog/ansible-and-packer-why-they-are-better-together",
          "publishedOn": "2022-10-03T13:00:00.000Z",
          "wordCount": 3645,
          "title": "Using Ansible and Packer, From Provisioning to Orchestration",
          "imageUrl": "https://lh6.googleusercontent.com/z95BNeupD4B20SB-bsp_c3yUweZUTdjlUCR8RWalV4lRr1o0nmZSpFa2rdYqCnytvowXIRNcx-vv_JD-Vyp9HF5n7TW7Lyfi_mbbBKzHq5zHuIcDyeF38v-ddQLWkn0luR-ZhxKztPrMdiqNOIgN8rmeWtUZBNJ1lBtVkxsU_NBUZCRWqtlKIKoAsg"
        }
      ]
    },
    {
      "title": "Azure DevOps Blog",
      "feedUrl": "https://devblogs.microsoft.com/devops/feed/",
      "siteUrl": "https://devblogs.microsoft.com/devops/",
      "articles": [
        {
          "id": "https://devblogs.microsoft.com/devops/?p=65951",
          "author": "Dan Hellem",
          "description": "In sprint 211 we enabled the “Try the New Boards Hub” banner and popup. This has resulted in a lot of great user feedback, and in turn, a pile of bugs. Our main focus in sprint 212 was fixing these bugs.\nThe post New Boards Hub, Sprint 212 Update appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/new-boards-hub-sprint-212-update/",
          "publishedOn": "2022-10-27T19:05:32.000Z",
          "wordCount": 4549,
          "title": "New Boards Hub, Sprint 212 Update",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/08/sketch-1.png"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=65931",
          "author": "Gloridel Morales",
          "description": "We have released Azure DevOps Server 2022 RC2. This is our last planned prerelease before our final release of Azure DevOps Server 2022. You can upgrade from Azure DevOps Server 2022 RC1 or previous versions of TFS and Azure DevOps. You can find the full details in our release notes.\nThe post Azure DevOps Server 2022 RC2 now available appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azure-devops-server-2022-rc2-now-available/",
          "publishedOn": "2022-10-25T20:41:56.000Z",
          "wordCount": 3910,
          "title": "Azure DevOps Server 2022 RC2 now available",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/06/HERO-1.jpg"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=65894",
          "author": "Gloridel Morales",
          "description": "Last week we made significant updates to our product roadmap. We published the latest features for 2022, updated the list of features for 2023, and included an initiatives section that provides details about the product strategy and long-term investments.\nIn addition to including a new list of key features and initiatives,\nThe post Azure DevOps Roadmap update appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azure-devops-roadmap-update/",
          "publishedOn": "2022-10-20T17:13:02.000Z",
          "wordCount": 4660,
          "title": "Azure DevOps Roadmap update",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2019/02/roadmap.png"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=65881",
          "author": "Gloridel Morales",
          "description": "This month, we are releasing fixes that impact our self-hosted product, Azure DevOps Server.\nResolve issue with newly added AD identities not appearing in security dialog identity pickers.\nThe post October patches for Azure DevOps Server appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/october-patches-for-azure-devops-server-2/",
          "publishedOn": "2022-10-18T16:59:44.000Z",
          "wordCount": 4503,
          "title": "October patches for Azure DevOps Server",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/06/HERO-1.jpg"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=65846",
          "author": "Aaron Hallberg",
          "description": "Exciting things are in store for Azure DevOps in the coming year! We’re planning deep investments in security as well as broad investment across the product. Read on for more information, and then be sure to check out our updated roadmap at https://aka.ms/AzureDevOpsRoadmap.\nThe post Integrate security into your developer workflow with GitHub Advanced Security for Azure DevOps appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/integrate-security-into-your-developer-workflow-with-github-advanced-security-for-azure-devops/",
          "publishedOn": "2022-10-12T12:59:49.000Z",
          "wordCount": 7471,
          "title": "Integrate security into your developer workflow with GitHub Advanced Security for Azure DevOps",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/10/AzDO-heart-Security.png"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=65675",
          "author": "Angel Wong",
          "description": "We have resolved a known issue regarding publishing extensions to the Visual Studio Marketplace. If you’ve run into the error message: “Your ability to create global personal access tokens (PATs) is restricted by your organization.”, this is likely because your administrator has enabled a policy to restrict the creation of global personal access tokens (PATs).\nThe post Publishing extensions to Marketplace issue resolved appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/publishing-extensions-to-marketplace-issue-resolved/",
          "publishedOn": "2022-10-10T16:08:03.000Z",
          "wordCount": 3883,
          "title": "Publishing extensions to Marketplace issue resolved",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/10/start_4.png"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=65804",
          "author": "Dan Hellem",
          "description": "Sprint 211 was a busy one. We were able to complete a lot of bugs and yet introduce some new exciting features. We also enabled a “Try the New Boards Hub” banner and popup to the legacy boards experience on select organizations.\nThe post New Boards Hub, Sprint 211 Update appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/new-boards-hub-sprint-211-update/",
          "publishedOn": "2022-10-07T14:28:43.000Z",
          "wordCount": 4919,
          "title": "New Boards Hub, Sprint 211 Update",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/10/sketch-3.png"
        }
      ]
    },
    {
      "title": "Discover Dev",
      "feedUrl": "https://www.discoverdev.io/rss.xml",
      "siteUrl": "http://discoverdev.io",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "http://feeds.feedburner.com/AmazonWebServicesBlog",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "90f04a9d62650a4739f4d04add932ad4769dc741",
          "author": "Sébastien Stormacq",
          "description": "This year, and for the twelfth consecutive year, AWS has been named as a Leader in the 2022 Magic Quadrant for Cloud Infrastructure and Platform Services (CIPS). Per Gartner, AWS is the longest-running CIPS Magic Quadrant Leader. AWS was among the first cloud providers when we launched Amazon Elastic Compute Cloud (Amazon EC2) and Amazon […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-named-as-a-leader-in-the-2022-gartner-cloud-infrastructure-platform-services-cips-magic-quadrant-for-the-12th-consecutive-year/",
          "publishedOn": "2022-10-28T16:44:07.000Z",
          "wordCount": 1288,
          "title": "AWS Named as a Leader in the 2022 Gartner Cloud Infrastructure & Platform Services (CIPS) Magic Quadrant for the 12th Consecutive Year",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/827bfc458708f0b442009c9c9836f7e4b65557fb/2020/06/03/Blog-Post_thumbnail.png"
        },
        {
          "id": "418c9a7115badfdc4c7fb44c681e774eb70be3b8",
          "author": "Danilo Poccia",
          "description": "Amazon Neptune is a fully managed graph database service that makes it easy to build and run applications that work with highly connected datasets. With Neptune, you can use open and popular graph query languages to execute powerful queries that are easy to write and perform well on connected data. You can use Neptune for […]",
          "link": "https://aws.amazon.com/blogs/aws/introducing-amazon-neptune-serverless-a-fully-managed-graph-database-that-adjusts-capacity-for-your-workloads/",
          "publishedOn": "2022-10-26T22:05:11.000Z",
          "wordCount": 1863,
          "title": "Introducing Amazon Neptune Serverless – A Fully Managed Graph Database that Adjusts Capacity for Your Workloads",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/827bfc458708f0b442009c9c9836f7e4b65557fb/2020/06/03/Blog-Post_thumbnail.png"
        },
        {
          "id": "ca16621081273a61c85f2eec5a092eca6cc9cf7e",
          "author": "Steve Roberts",
          "description": "Today I’m pleased to announce AWS Batch for Amazon Elastic Kubernetes Service (Amazon EKS). AWS Batch for Amazon EKS is ideal for customers who no longer want to shoulder the burden of configuring, fine-tuning, and managing Kubernetes clusters and pods to use with their batch processing workflows. Furthermore, there is no charge for this service. […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-batch-for-amazon-elastic-kubernetes-service/",
          "publishedOn": "2022-10-25T13:31:57.000Z",
          "wordCount": 1680,
          "title": "AWS Batch for Amazon Elastic Kubernetes Service",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/827bfc458708f0b442009c9c9836f7e4b65557fb/2020/06/03/Blog-Post_thumbnail.png"
        },
        {
          "id": "b39e23f90151c8cfdcfc226399885b21d1d1045c",
          "author": "Channy Yun",
          "description": "Last week, we announced plans to launch the AWS Asia Pacific (Bangkok) Region, which will become our third AWS Region in Southeast Asia. This Region will have three Availability Zones and will give AWS customers in Thailand the ability to run workloads and store data that must remain in-country. In the Works – AWS Region […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-october-24-2022/",
          "publishedOn": "2022-10-24T19:37:21.000Z",
          "wordCount": 2290,
          "title": "AWS Week in Review – October 24, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/10/21/AWS-WIR-10.24.22.png"
        },
        {
          "id": "f3d6027b89e3960df03f4dc7b386bf38d63c911d",
          "author": "Steve Roberts",
          "description": "This post is part of our Week in Review series. Check back each week for a quick roundup of interesting news and announcements from AWS! Monday means it’s time for another Week in Review post, so, without further ado, let’s dive right in! Last Week’s Launches Here’s some launch announcements from last week you may […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-october-17-2020/",
          "publishedOn": "2022-10-17T17:34:56.000Z",
          "wordCount": 1234,
          "title": "AWS Week in Review – October 17, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/10/17/AWS-WIR-10.17.22.png"
        },
        {
          "id": "71e7c11b2e368b46b3451452c13a32231a1453a3",
          "author": "Antje Barth",
          "description": "Deep learning (DL) models have been increasing in size and complexity over the last few years, pushing the time to train from days to weeks. Training large language models the size of GPT-3 can take months, leading to an exponential growth in training cost. To reduce model training times and enable machine learning (ML) practitioners […]",
          "link": "https://aws.amazon.com/blogs/aws/amazon-ec2-trn1-instances-for-high-performance-model-training-are-now-available/",
          "publishedOn": "2022-10-10T21:31:33.000Z",
          "wordCount": 2021,
          "title": "Amazon EC2 Trn1 Instances for High-Performance Model Training are Now Available",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/08/19/Site-Merch_EC2-Trainium_Blog.png"
        },
        {
          "id": "7c008f7e8cef2812709e94fb9b2a1a09fcd48422",
          "author": "Marcia Villalba",
          "description": "This post is part of our Week in Review series. Check back each week for a quick roundup of interesting news and announcements from AWS! I had an amazing start to the week last week as I was speaking at the AWS Community Day NL. This event had 500 attendees and over 70 speakers, and […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-october-10-2022/",
          "publishedOn": "2022-10-10T20:53:03.000Z",
          "wordCount": 1321,
          "title": "AWS Week in Review – October 10, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/10/10/AWS-WIR-10.10.22.png"
        },
        {
          "id": "4ed417884c91622d902ab22f2b9f806063ec1a09",
          "author": "Jeff Barr",
          "description": "In late 2019 I told you about the AWS Local Zone in Los Angeles, California. In that post I described Local Zones as a new type of AWS infrastructure deployment that brings select AWS services very close to a particular geographic area. A year after that launch, I announced our plans to add 3 more […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-local-zones-expansion-taipei-and-delhi/",
          "publishedOn": "2022-10-05T21:30:38.000Z",
          "wordCount": 1335,
          "title": "AWS Local Zones Expansion: Taipei and Delhi",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/10/04/Site-Merch_AWS-Local-Zones_Blog.png"
        },
        {
          "id": "b52baf93c46bb68d0030598dd7ae15d1a9913d72",
          "author": "Veliswa Boya",
          "description": "In June 2022 AWS announced a preview of Amazon Connect Cases, a feature of Amazon Connect that simplifies these customer interactions and reduces the average handle times of issues. Today I am excited to announce the general availability of Amazon Connect Cases. Cases, a feature of Amazon Connect, makes it easy for your contact center […]",
          "link": "https://aws.amazon.com/blogs/aws/announcing-general-availability-of-amazon-connect-cases/",
          "publishedOn": "2022-10-03T20:41:27.000Z",
          "wordCount": 1265,
          "title": "Announcing General Availability of Amazon Connect Cases",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/10/03/Site-Merch_Amazon-Connect-Keystone-Gardner_Blog.png"
        },
        {
          "id": "ae5d0488bf0646507a69e9e761f48098a248df55",
          "author": "Danilo Poccia",
          "description": "This post is part of our Week in Review series. Check back each week for a quick roundup of interesting news and announcements from AWS! A new week and a new month just started. Curious which were the most significant AWS news from the previous seven days? I got you covered with this post. Last […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-october-3-2022/",
          "publishedOn": "2022-10-03T18:32:35.000Z",
          "wordCount": 1288,
          "title": "AWS Week in Review – October 3, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/10/03/AWS-WIR-10.3.22.png"
        },
        {
          "id": "732ba82c2e85ba6a2394bf8a29ee95a5e73a4c90",
          "author": "Antje Barth",
          "description": "Artificial intelligence (AI) is all around us. AI sends certain emails to our spam folders. It powers autocorrect, which helps us fix typos when we text. And now we can use it to solve business problems. In business, data-driven insights have become increasingly valuable. These insights are often discovered with the help of machine learning […]",
          "link": "https://aws.amazon.com/blogs/aws/new-hands-on-course-for-business-analysts-practical-decision-making-using-no-code-ml-on-aws/",
          "publishedOn": "2022-10-03T16:26:34.000Z",
          "wordCount": 1837,
          "title": "New Hands-On Course for Business Analysts – Practical Decision Making using No-Code ML on AWS",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/27/Amazon-SageMaker-Canvas_Blog.png"
        },
        {
          "id": "5ab6ca4c7fbca6e707e93106cb015a859442a687",
          "author": "Sébastien Stormacq",
          "description": "I am pleased to announce today the availability of Amazon File Cache, a new high-speed cache service on AWS designed for processing file data stored in disparate locations—including on premises. File Cache accelerates and simplifies your most demanding cloud bursting and hybrid workflows by giving your applications access to files using a fast and familiar […]",
          "link": "https://aws.amazon.com/blogs/aws/amazon-file-cache-a-high-performance-cache-on-aws-for-your-on-premises-file-systems/",
          "publishedOn": "2022-09-30T14:56:40.000Z",
          "wordCount": 2239,
          "title": "Amazon File Cache – A High Performance Cache On AWS For Your On-Premises File Systems",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/29/Site-Merch_Amazon-File-Cache_Blog.png"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/atom.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2691/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/encryption.png\" title=\"WARNING: PEOPLE NAMED EVE ARE PROHIBITED FROM INSTALLING THIS APP!\" alt=\"WARNING: PEOPLE NAMED EVE ARE PROHIBITED FROM INSTALLING THIS APP!\" />",
          "link": "https://xkcd.com/2691/",
          "publishedOn": "2022-10-28T00:00:00.000Z",
          "wordCount": 230,
          "title": "Encryption",
          "imageUrl": "https://imgs.xkcd.com/comics/encryption_2x.png"
        },
        {
          "id": "https://xkcd.com/2690/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/cool_s.png\" title=\"Although I hear they were caught cheating off of Rosalind, who sat at a desk in front of them.\" alt=\"Although I hear they were caught cheating off of Rosalind, who sat at a desk in front of them.\" />",
          "link": "https://xkcd.com/2690/",
          "publishedOn": "2022-10-26T00:00:00.000Z",
          "wordCount": 232,
          "title": "Cool S",
          "imageUrl": "https://imgs.xkcd.com/comics/cool_s_2x.png"
        },
        {
          "id": "https://xkcd.com/2689/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/fermats_first_theorem.png\" title=\"Mathematicians quickly determined that it spells ANT BNECN, an unusual theoretical dish which was not successfully cooked until Andrew Wiles made it for breakfast in the 1990s.\" alt=\"Mathematicians quickly determined that it spells ANT BNECN, an unusual theoretical dish which was not successfully cooked until Andrew Wiles made it for breakfast in the 1990s.\" />",
          "link": "https://xkcd.com/2689/",
          "publishedOn": "2022-10-24T00:00:00.000Z",
          "wordCount": 234,
          "title": "Fermat's First Theorem",
          "imageUrl": "https://imgs.xkcd.com/comics/fermats_first_theorem_2x.png"
        },
        {
          "id": "https://xkcd.com/2688/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/bubble_universes.png\" title=\"The theory finally unifies cosmic inflation and regular inflation.\" alt=\"The theory finally unifies cosmic inflation and regular inflation.\" />",
          "link": "https://xkcd.com/2688/",
          "publishedOn": "2022-10-21T00:00:00.000Z",
          "wordCount": 232,
          "title": "Bubble Universes",
          "imageUrl": "https://imgs.xkcd.com/comics/bubble_universes_2x.png"
        }
      ]
    },
    {
      "title": "Camunda",
      "feedUrl": "https://camunda.com/feed/",
      "siteUrl": "https://camunda.com/",
      "articles": [
        {
          "id": "https://camunda.com/?p=66325",
          "author": "Danny Shain",
          "description": "We’re grateful to our customers and community for selecting Camunda Platform for three 2022 PeerSpot Peer Awards.\nThe post Camunda Wins Three PeerSpot 2022 Peer Awards appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/10/camunda-wins-three-peerspot-2022-peer-awards/",
          "publishedOn": "2022-10-28T19:04:17.000Z",
          "wordCount": 2599,
          "title": "Camunda Wins Three PeerSpot 2022 Peer Awards",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/10/Camunda_2022_PeerSpot-awards-blog-ftd-image_1200x630.png"
        },
        {
          "id": "https://camunda.com/?p=66235",
          "author": "Bernd Ruecker",
          "description": "Learn how inbound Connectors work in Camunda Platform 8.1, and how you can get started with them today.\nThe post A technical sneak peek into inbound Connectors alongside Camunda 8.1 appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/10/technical-sneak-peek-inbound-connectors-camunda-8-1/",
          "publishedOn": "2022-10-26T14:34:22.000Z",
          "wordCount": 3264,
          "title": "A technical sneak peek into inbound Connectors alongside Camunda 8.1",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/10/Camunda_inbound-connectors-technical-sneak-peek_ftd-image_1200x627.png"
        },
        {
          "id": "https://camunda.com/?p=63590",
          "author": "Tobias Metzke-Bernstein",
          "description": "Monitoring is an essential facet of running applications in a production system. Through this process, organizations collect and analyze data, and determine if a program is performing as expected within set boundaries. When combined with alerting, monitoring allows for detecting unexpected system behavior to mitigate exceptional situations as fast as possible. Furthermore, tracking the performance of a system enables organizations to improve those aspects that have the biggest impact with higher priority. One essential aspect of monitoring is the list of key metrics you want to observe. There are different categories of statistics that can be of interest here. To observe the defined metrics, there are plenty of application monitoring tools on the market today. They differ in many aspects...\nThe post Monitoring Camunda Platform 7 with Prometheus appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/10/monitoring-camunda-platform-7-with-prometheus/",
          "publishedOn": "2022-10-18T13:52:00.000Z",
          "wordCount": 4385,
          "title": "Monitoring Camunda Platform 7 with Prometheus",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/10/image-7-1024x505-2.png"
        },
        {
          "id": "https://camunda.com/?p=65420",
          "author": "Bernd Ruecker",
          "description": "Learn from Bernd Ruecker, Camunda Co-founder/Chief Technologist, and Daniel Meyer, Camunda CTO, as they tackle questions on connectors, modeling & more.\nThe post CamundaCon 2022: Q&A with Bernd and Daniel appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/10/camundacon-2022-qa-bernd-daniel/",
          "publishedOn": "2022-10-14T20:00:27.000Z",
          "wordCount": 3669,
          "title": "CamundaCon 2022: Q&A with Bernd and Daniel",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/10/CamundaCon-QA-Bernd-Daniel.png"
        },
        {
          "id": "https://camunda.com/?p=64638",
          "author": "Christophe Dame",
          "description": "Directory services are an effective way to manage an organization’s users, groups, printers, devices, and more. Most organizations accomplish this using Active Directory, Apache Directory, Oracle Internet Directory, or other similar tools. Recently I worked with a customer who wanted to see how he could secure the Camunda 8 Platform and process applications with such a directory. Their requirements consisted of: Allowing Directory users to access Camunda applications (Tasklist, Operate, Optimize) Accessing secured Tasklist & Operate APIs from our custom project Securing the custom project In this article, I’ll briefly explain the 3 easy steps taken to fulfill their requirements which include: Federate users from the Directory service into Keycloak Declare an application in Identity to access Camunda APIs Configure...\nThe post Securing Camunda 8 self-managed cluster and applications behind a directory appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/10/securing-camunda-8-self-managed-cluster-and-applications-behind-a-directory/",
          "publishedOn": "2022-10-12T13:01:00.000Z",
          "wordCount": 3213,
          "title": "Securing Camunda 8 self-managed cluster and applications behind a directory",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/10/Active_Directory_Camunda_Platform_8.png"
        },
        {
          "id": "https://camunda.com/?p=64965",
          "author": "Camunda Platform Team",
          "description": "We’re extremely excited to announce the release of Camunda Platform 8.1.  In this post, we will go into the highlights of this release including Web Modeler, Connectors, Zeebe, Operate, Optimize, and more. Here’s the highlights of what’s included in this release: Easier Installation and maintenance for Camunda Platform Self-managed Hot backups for Self-Managed Token-Based authentication Modeler updates Process Templates FEEL Expression Editor Inline Annotations Changes to Camunda forms Connectors updates Workflow engine updates Operate updates Optimize updates Let’s get started! Easier installation and maintenance for Camunda Platform Self-Managed Improved Guides and Support for OpenShift and Amazon EKS (AWS) With this release, we are introducing official support for deploying and running Camunda Platform 8 Self-Managed on OpenShift and Amazon EKS (AWS)....\nThe post Camunda Platform 8.1 Released – What’s New appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/10/camunda-platform-8-1-released-whats-new/",
          "publishedOn": "2022-10-11T14:00:00.000Z",
          "wordCount": 6078,
          "title": "Camunda Platform 8.1 Released – What’s New",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/10/screenshot-camunda.com-2022.10.11-09_14_38.png"
        },
        {
          "id": "https://camunda.com/?p=65073",
          "author": "Camunda Platform Team",
          "description": "We’re extremely excited to announce the release of Camunda Platform 7.18 Here are some of the highlights: Cockpit: Improved instance selection to avoid unintended batch operations Cockpit: Easier navigation of high batch operation volumes MDC logging features Camunda Forms in Tasklist: Populate select options via process data Exception error codes Filter and order tasks by last updated WebSphere Liberty New and retired supported environments You can download Camunda Platform or run it with Docker. For a complete list of the changes, please check out the release notes. For patched security vulnerabilities, see our security notices. If you want to dig deeper, check out the source code on GitHub. Cockpit: Improved instance selection to avoid unintended batch operations Previously, when performing...\nThe post Camunda Platform 7.18 Released – What’s New appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/10/camunda-platform-7-18-released-whats-new/",
          "publishedOn": "2022-10-11T13:15:00.000Z",
          "wordCount": 3371,
          "title": "Camunda Platform 7.18 Released – What’s New",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/10/Camunda_7.18.png"
        },
        {
          "id": "https://camunda.com/?p=64182",
          "author": "Shane Ernest",
          "description": "We’re thrilled to announce Camunda Platform 8.1, the latest release of our process orchestration solution. This new version introduces features that accelerate connectivity to the many different systems and technologies that are required for true digital transformation, including: Create custom Connectors with our Integration Framework to accelerate connectivity New out-of-the-box Connectors for popular services Enhancements to Camunda Modeler that improve productivity Hot backups and official support for Amazon EKS and Red Hat OpenShift Plus, several upgrades requested by Camunda Platform 7 customers Organizations across all industries rely on complex technology stacks to adapt and enhance their operations in response to market dynamics, new disruptive companies, and increasing consumer expectations. Your technology stack likely includes everything from cutting-edge technologies to legacy...\nThe post Accelerate Connectivity with Camunda Platform 8.1 appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/10/accelerate-connectivity-with-camunda-platform-8-1/",
          "publishedOn": "2022-10-11T12:00:00.000Z",
          "wordCount": 3169,
          "title": "Accelerate Connectivity with Camunda Platform 8.1",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/10/Camunda-8.1-Release_2022_blog-featured-image_1200x630-1.png"
        },
        {
          "id": "https://camunda.com/?p=64132",
          "author": "Niall Deehan",
          "description": "What is FEEL As a part of the Decision Model and Notation (DMN) specification, the OMG also defined the Friendly Enough Expression Language (FEEL).  Since DMN is intended to be used by designers and business analysts who would like to build decision tables, FEEL needed to be designed as an uncomplicated and human-readable expression language that would help readers understand the logic being described or executed by the DMN table.  Expression languages are typically used by developers to evaluate data to produce a result based on query parameters or conditions. This means it’s syntactically closer to code than human-readable sentences. Since one of the goals of FEEL is to be “process analyst friendly,” it prioritizes readability more than other expression...\nThe post Using FEEL with Camunda 8 appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/09/using-feel-with-camunda-8/",
          "publishedOn": "2022-09-30T16:53:40.000Z",
          "wordCount": 3937,
          "title": "Using FEEL with Camunda 8",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/09/Camunda_using-FEEL-C8_blog-ftd-image_1200x630.png"
        }
      ]
    },
    {
      "title": "となりのヤングジャンプ（ワンパンマン）",
      "feedUrl": "https://tonarinoyj.jp/rss/series/13932016480028984490",
      "siteUrl": "https://tonarinoyj.jp/episode/13932016480028985383",
      "articles": [
        {
          "id": "tonarino_yj:episode:316112896950049151",
          "author": "原作/ＯＮＥ/漫画/村田雄介",
          "description": "ワンパンマン",
          "link": "https://tonarinoyj.jp/episode/316112896950049151",
          "publishedOn": "2022-10-19T15:00:00.000Z",
          "wordCount": 211,
          "title": "[第217話] ワンパンマン",
          "enclosure": {
            "url": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/316112896950049151-eaa2e7d053ba1801b931c55e99fdfda6",
            "length": "0",
            "type": "image/jpeg"
          },
          "imageUrl": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/316112896950049151-eaa2e7d053ba1801b931c55e99fdfda6"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.com/blog/all.atom",
      "siteUrl": "https://github.blog/",
      "articles": [
        {
          "id": "https://github.blog/2022-10-29-thirteen-tiny-terrific-and-terrifying-games-to-hack-slay-and-play-this-halloween/",
          "author": null,
          "description": "Some seriously spooktacular open source games for the web, Windows, macOS, and Linux with all sorts of fun hacks for infinite lives, invulnerability, and playing with time.",
          "link": "https://github.blog/2022-10-29-thirteen-tiny-terrific-and-terrifying-games-to-hack-slay-and-play-this-halloween/",
          "publishedOn": "2022-10-29T07:01:32.000Z",
          "wordCount": 2420,
          "title": "13 tiny, terrific, and terrifying games to hack, slay, and play this Halloween 🧛🏻‍♀️",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/10/halloween-1.png"
        },
        {
          "id": "https://github.blog/2022-10-28-cybersecurity-spotlight-on-bug-bounty-researcher-ahacker1/",
          "author": null,
          "description": "As we wrap up Cybersecurity Awareness Month, the GitHub bug bounty team is excited to spotlight one of the security researchers who participates in the GitHub Security Bug Bounty Program.",
          "link": "https://github.blog/2022-10-28-cybersecurity-spotlight-on-bug-bounty-researcher-ahacker1/",
          "publishedOn": "2022-10-28T18:34:58.000Z",
          "wordCount": 1412,
          "title": "Cybersecurity spotlight on bug bounty researcher @ahacker1",
          "imageUrl": "https://github.blog/wp-content/uploads/2021/06/GitHub-Bug-Bounty_for-social.png"
        },
        {
          "id": "https://github.blog/2022-10-28-release-radar-sept-2022/",
          "author": null,
          "description": "Hackatoberfest, hackathons, and open source contributions. It&#8217;s been a hectic month with so many community pull requests to all kinds of projects. So many in fact that we had to spend hours going through all the submissions for this blog post. We almost didn&#8217;t get it out before the end of October. Nevertheless, we are [&#8230;]",
          "link": "https://github.blog/2022-10-28-release-radar-sept-2022/",
          "publishedOn": "2022-10-28T18:00:17.000Z",
          "wordCount": 1878,
          "title": "Release Radar · September 2022 Edition",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/10/September-2022.jpg"
        },
        {
          "id": "https://github.blog/2022-10-27-choose-your-own-github-universe-2022-adventure/",
          "author": null,
          "description": "You can now build your agenda on GitHubUniverse.com! Whether you’re just getting started or you’re a seasoned industry professional, there’s a session for you.",
          "link": "https://github.blog/2022-10-27-choose-your-own-github-universe-2022-adventure/",
          "publishedOn": "2022-10-27T18:54:54.000Z",
          "wordCount": 2589,
          "title": "Choose your own GitHub Universe 2022 adventure",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/10/universeheader2.png"
        },
        {
          "id": "https://github.blog/2022-10-27-what-we-learned-from-the-security-labs-community-office-hours/",
          "author": null,
          "description": "The GitHub Security Lab provided office hours for open source projects looking to improve their security posture and reduce the risk of breach. Here’s what we learned and how you can also participate.",
          "link": "https://github.blog/2022-10-27-what-we-learned-from-the-security-labs-community-office-hours/",
          "publishedOn": "2022-10-27T15:00:42.000Z",
          "wordCount": 1868,
          "title": "What we learned from the Security Lab’s Community Office Hours",
          "imageUrl": "https://github.blog/wp-content/uploads/2021/11/GitHub-Security-Lab.jpeg"
        },
        {
          "id": "https://github.blog/2022-10-27-diversity-inclusion-and-belonging-at-github-in-2022/",
          "author": null,
          "description": "As GitHub continues to grow, our vision of being the home for all developers continues to materialize, expanding our progress, perspectives, and responsibility to the world.",
          "link": "https://github.blog/2022-10-27-diversity-inclusion-and-belonging-at-github-in-2022/",
          "publishedOn": "2022-10-27T13:13:22.000Z",
          "wordCount": 1427,
          "title": "Diversity, inclusion, and belonging at GitHub in 2022",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/10/GitHub-diversity-inclusion-belonging-2022.png"
        },
        {
          "id": "https://github.blog/2022-10-26-3-strategies-for-consolidating-your-toolkit-and-boosting-productivity/",
          "author": null,
          "description": "Explore how GitHub Enterprise can help you transform your software engineering organization and practices.",
          "link": "https://github.blog/2022-10-26-3-strategies-for-consolidating-your-toolkit-and-boosting-productivity/",
          "publishedOn": "2022-10-26T16:00:04.000Z",
          "wordCount": 2696,
          "title": "3 strategies for consolidating your toolkit and boosting productivity",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/10/1200x640ader.png"
        },
        {
          "id": "https://github.blog/2022-10-26-why-and-how-github-encrypts-sensitive-database-columns-using-activerecordencryption/",
          "author": null,
          "description": "You may know that GitHub encrypts your source code at rest, but you may not have known that we encrypt sensitive database columns as well. Read about our column encryption strategy and our decision to adopt the Rails column encryption standard.",
          "link": "https://github.blog/2022-10-26-why-and-how-github-encrypts-sensitive-database-columns-using-activerecordencryption/",
          "publishedOn": "2022-10-26T14:00:25.000Z",
          "wordCount": 1816,
          "title": "Why and how GitHub encrypts sensitive database columns using ActiveRecord::Encryption",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/04/Engineering-Security@2x.png?fit=2400%2C1260"
        },
        {
          "id": "https://github.blog/2022-10-25-why-were-excited-about-the-sigstore-general-availability/",
          "author": null,
          "description": "The Sigstore GA means you can protect your software supply chain today with GitHub Actions, and will power new npm security capabilities in the near future.",
          "link": "https://github.blog/2022-10-25-why-were-excited-about-the-sigstore-general-availability/",
          "publishedOn": "2022-10-25T13:02:35.000Z",
          "wordCount": 1541,
          "title": "Why we&#8217;re excited about the Sigstore general availability",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/02/Security-Product-Open-Source@2x.png"
        },
        {
          "id": "https://github.blog/2022-10-21-build-a-game-this-november-with-game-off-2022/",
          "author": null,
          "description": "Save the date! Game Off returns on November 1 for its 10th year! 🎉",
          "link": "https://github.blog/2022-10-21-build-a-game-this-november-with-game-off-2022/",
          "publishedOn": "2022-10-21T17:30:25.000Z",
          "wordCount": 891,
          "title": "Build a game this November with Game Off 2022",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/10/game-off-large.png"
        }
      ]
    },
    {
      "title": "Martin Kleppmann's blog",
      "feedUrl": "https://feeds.feedburner.com/martinkl",
      "siteUrl": "http://martin.kleppmann.com/",
      "articles": [
        {
          "id": "http://martin.kleppmann.com/2022/10/12/verifying-distributed-systems-isabelle.html",
          "author": "Martin Kleppmann",
          "description": "This post also appears on Larry Paulson’s blog. We use distributed systems every day in the form of internet services. These systems are very useful, but also challenging to implement because networks are unpredictable. Whenever you send a message over the network, it is likely to arrive quite quickly, but...",
          "link": "http://martin.kleppmann.com/2022/10/12/verifying-distributed-systems-isabelle.html",
          "publishedOn": "2022-10-12T00:00:00.000Z",
          "wordCount": 2436,
          "title": "Verifying distributed systems with Isabelle/HOL",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Kubernetes – Production-Grade Container Orchestration",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": [
        {
          "id": "https://kubernetes.io/blog/2022/10/20/advanced-server-side-apply/",
          "author": null,
          "description": "Author: Daniel Smith (Google)\nServer-side apply (SSA) has now\nbeen GA for a few releases, and I\nhave found myself in a number of conversations, recommending that people / teams\nin various situations use it. So I’d like to write down some of those reasons.\nObvious (and not-so-obvious) benefits of SSA\nA list of improvements / niceties you get from switching from various things to\nServer-side apply!\nVersus client-side-apply (that is, plain kubectl apply):\n\nThe system gives you conflicts when you accidentally fight with another\nactor over the value of a field!\nWhen combined with --dry-run, there’s no chance of accidentally running a\nclient-side dry run instead of a server side dry run.\nVersus hand-rolling patches:\n\nThe SSA patch format is extremely natural to write, with no weird syntax.\nIt’s …",
          "link": "https://kubernetes.io/blog/2022/10/20/advanced-server-side-apply/",
          "publishedOn": "2022-10-20T00:00:00.000Z",
          "wordCount": 4778,
          "title": "Blog: Server Side Apply Is Great And You Should Be Using It",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/10/05/current-state-2019-third-party-audit/",
          "author": null,
          "description": "Authors (in alphabetical order): Cailyn Edwards (Shopify), Pushkar Joglekar (VMware), Rey Lejano (SUSE) and Rory McCune (DataDog)\nWe expect the brand new Third Party Security Audit of Kubernetes will be\npublished later this month (Oct 2022).\nIn preparation for that, let's look at the state of findings that were made\npublic as part of the last third party security audit of\n2019\nthat was based on Kubernetes v1.13.4.\nMotivation\nCraig Ingram has graciously attempted over the years to keep track of the\nstatus of the findings reported in the last audit in this issue:\nkubernetes/kubernetes#81146.\nThis blog post will attempt to dive deeper into this, address any gaps\nin tracking and become a point in time summary of the state of the\nfindings reported from 2019.\nThis article should also help reader…",
          "link": "https://kubernetes.io/blog/2022/10/05/current-state-2019-third-party-audit/",
          "publishedOn": "2022-10-05T00:00:00.000Z",
          "wordCount": 3918,
          "title": "Blog: Current State: 2019 Third Party Security Audit of Kubernetes",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/10/04/introducing-kueue/",
          "author": null,
          "description": "Authors: Abdullah Gharaibeh (Google), Aldo Culquicondor (Google)\nWhether on-premises or in the cloud, clusters face real constraints for resource usage, quota, and cost management reasons. Regardless of the autoscalling capabilities, clusters have finite capacity. As a result, users want an easy way to fairly and\nefficiently share resources.\nIn this article, we introduce Kueue,\nan open source job queueing controller designed to manage batch jobs as a single unit.\nKueue leaves pod-level orchestration to existing stable components of Kubernetes.\nKueue natively supports the Kubernetes Job\nAPI and offers hooks for integrating other custom-built APIs for batch jobs.\nWhy Kueue?\nJob queueing is a key feature to run batch workloads at scale in both on-premises and cloud environments. The main goal…",
          "link": "https://kubernetes.io/blog/2022/10/04/introducing-kueue/",
          "publishedOn": "2022-10-04T00:00:00.000Z",
          "wordCount": 4471,
          "title": "Blog: Introducing Kueue",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/10/03/userns-alpha/",
          "author": null,
          "description": "Authors: Rodrigo Campos (Microsoft), Giuseppe Scrivano (Red Hat)\nKubernetes v1.25 introduces the support for user namespaces.\nThis is a major improvement for running secure workloads in\nKubernetes. Each pod will have access only to a limited subset of the\navailable UIDs and GIDs on the system, thus adding a new security\nlayer to protect from other pods running on the same system.\nHow does it work?\nA process running on Linux can use up to 4294967296 different UIDs and\nGIDs.\nUser namespaces is a Linux feature that allows mapping a set of users\nin the container to different users in the host, thus restricting what\nIDs a process can effectively use.\nFurthermore, the capabilities granted in a new user namespace do not\napply in the host initial namespaces.\nWhy is it important?\nThere are mainly t…",
          "link": "https://kubernetes.io/blog/2022/10/03/userns-alpha/",
          "publishedOn": "2022-10-03T00:00:00.000Z",
          "wordCount": 3340,
          "title": "Blog: Kubernetes 1.25: alpha support for running Pods with user namespaces",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "http://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/aaa2b41b800c",
          "author": "Netflix Technology Blog",
          "description": "",
          "link": "https://netflixtechblog.com/orchestrating-data-ml-workflows-at-scale-with-netflix-maestro-aaa2b41b800c?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-10-18T20:43:36.000Z",
          "wordCount": null,
          "title": "Orchestrating Data/ML Workflows at Scale With Netflix Maestro",
          "imageUrl": null
        },
        {
          "id": "https://medium.com/p/6253603880a6",
          "author": "Netflix Technology Blog",
          "description": "",
          "link": "https://netflixtechblog.com/how-product-teams-can-build-empathy-through-experimentation-6253603880a6?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-10-12T20:56:33.000Z",
          "wordCount": null,
          "title": "How Product Teams Can Build Empathy Through Experimentation",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Google AI Blog",
      "feedUrl": "http://feeds.feedburner.com/blogspot/gJZg",
      "siteUrl": "http://ai.googleblog.com/",
      "articles": [
        {
          "id": "http://ai.googleblog.com/2022/10/natural-language-assessment-new.html",
          "author": null,
          "description": "Posted by Kedem Snir, Software Engineer, and Gal Elidan, Senior Staff Research Scientist, Google Research \nWhether it's a professional honing their skills or a child learning to read, coaches and educators play a key role in assessing the learner's answer to a question in a given context and guiding them towards a goal. These interactions have unique characteristics that set them apart from other forms of dialogue, yet are not available when learners practice alone at home. In the field of natural language processing, this type of capability has not received much attention and is technologically challenging. We set out to explore how we can use machine learning to assess answers in a way that facilitates learning. \n\nIn this blog, we introduce an important natural language understanding (NL…",
          "link": "http://ai.googleblog.com/2022/10/natural-language-assessment-new.html",
          "publishedOn": "2022-10-26T17:18:00.001Z",
          "wordCount": 27771,
          "title": "Natural Language Assessment: A New Framework to Promote Education",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjNwF8YrXFz2iqbVrKP5LS0lJPNDVAsqozOzz-Ut8075ogDQhWd1bXaVBTfpWLmzjcyB2XxeXzEpXB1eO5RA0Q8iO8j1zC3Cpsn8PDj8YNLywLFD2THrJovvowrUTlrOvslYMwFsTyApSvWo3JOkd_KysHV8Chg7sk3PrAr4aMERjEBWttxjez89Wnszw/s72-c/image21.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/10/open-images-v7-now-featuring-point.html",
          "author": null,
          "description": "Posted by Rodrigo Benenson, Research Scientist, Google Research \nOpen Images is a computer vision dataset covering ~9 million images with labels spanning thousands of object categories. Researchers around the world use Open Images to train and evaluate computer vision models. Since the initial release of Open Images in 2016, which included image-level labels covering 6k categories, we have provided multiple updates to enrich annotations and expand the potential use cases of the dataset. Through several releases, we have added image-level labels for over 20k categories on all images and bounding box annotations, visual relations, instance segmentations, and localized narratives (synchronized voice, mouse trace, and text caption) on a subset of 1.9M images.  \n  \nToday, we are happy to announ…",
          "link": "http://ai.googleblog.com/2022/10/open-images-v7-now-featuring-point.html",
          "publishedOn": "2022-10-25T19:52:00.000Z",
          "wordCount": 27179,
          "title": "Open Images V7 — Now Featuring Point Labels",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiVHhZfSUBgnAKpUO9qhA0jtxKym_bRLFaZR-zpVaCab_t1-tFYVjslsZf9OcQpfOPppcKqWNKh78ojdYsF0lDilnTfN_GfOytHRPT6gA1ho7uRMmFOoTPeW1XM19eekxXxI3dwk2JAJHKrk7Jp2QNpmNTfS0hrNVTOPM5QU3FYxEXGWWN9G-odpMLMuw/s72-c/image3.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/10/google-at-eccv-2022.html",
          "author": null,
          "description": "Posted by Shaina Mehta, Program Manager, Google  \nGoogle is proud to be a Platinum Sponsor of the European Conference on Computer Vision (ECCV 2022), a premier forum for the dissemination of research in computer vision and machine learning (ML). This year, ECCV 2022 will be held as a hybrid event, in person in Tel Aviv, Israel with virtual attendance as an option. Google has a strong presence at this year’s conference with over 60 accepted publications and active involvement in a number of workshops and tutorials. We look forward to sharing some of our extensive research and expanding our partnership with the broader ML research community. \n  \nRegistered for ECCV 2022? We hope you’ll visit our on-site or virtual booths to learn more about the research we’re presenting at ECCV 2022, includi…",
          "link": "http://ai.googleblog.com/2022/10/google-at-eccv-2022.html",
          "publishedOn": "2022-10-23T03:30:00.004Z",
          "wordCount": 28326,
          "title": "Google at ECCV 2022",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhWmLScVcpCyi8puS5FYC4xNN88CWeK0-77JiMlowYPlxCPym5T4zX7iKIuzIjwtDnUubUJ0yM8Xa6Mt83N_-YoBgyrZH_dwSL6YgoxUEgGf1tNuR5fSWeRY61Ut0TOhlzUuTJlKs6fyBF3JTVzAlbEOUgtGb_5gdgFBIXWFCJ0utT8kuUh3rKIjw4L1g/s72-c/about_hero.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/10/pi-ars-accelerating-evolution-learned.html",
          "author": null,
          "description": "Posted by Wenhao Yu, Research Scientist, Robotics at Google, and Kuang-Huei Lee, Research Engineer, Google Research, Brain team \nEvolution strategy (ES) is a family of optimization techniques inspired by the ideas of natural selection: a population of candidate solutions are usually evolved over generations to better adapt to an optimization objective. ES has been applied to a variety of challenging decision making problems, such as legged locomotion, quadcopter control, and even power system control.  \n\nCompared to gradient-based reinforcement learning (RL) methods like proximal policy optimization (PPO) and soft actor-critic (SAC), ES has several advantages. First, ES directly explores in the space of controller parameters, while gradient-based methods often explore within a limited acti…",
          "link": "http://ai.googleblog.com/2022/10/pi-ars-accelerating-evolution-learned.html",
          "publishedOn": "2022-10-20T20:39:00.015Z",
          "wordCount": 27712,
          "title": "PI-ARS: Accelerating Evolution-Learned Visual-Locomotion with Predictive Information Representations",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh9-FBUlQSRlE2rFmeloCUXYYfBngkIWz6RIDURErqOxjFSd785fpbkjetz4lkfbUhxY8rDB88yOy26ml669f2WcP16SkXH8uZfy60jCgMq28Ggm__ombQNfdhvYe-1qsOF1imso96y26PjhT3pSukVmy__RHkVdKOJRbMTTS_k0hEJfWexdcbY4QJ2QA/s72-c/image3.gif"
        },
        {
          "id": "http://ai.googleblog.com/2022/10/musiq-assessing-image-aesthetic-and.html",
          "author": null,
          "description": "Posted by Junjie Ke, Senior Software Engineer, and Feng Yang, Senior Staff Software Engineer, Google Research\nUnderstanding the aesthetic and technical quality of images is important for providing a better user visual experience. Image quality assessment (IQA) uses models to build a bridge between an image and a user's subjective perception of its quality. In the deep learning era, many IQA approaches, such as NIMA, have achieved success by leveraging the power of convolutional neural networks (CNNs). However, CNN-based IQA models are often constrained by the fixed-size input requirement in batch training, i.e., the input images need to be resized or cropped to a fixed size shape. This preprocessing is problematic for IQA because images can have very different aspect ratios and resolutions…",
          "link": "http://ai.googleblog.com/2022/10/musiq-assessing-image-aesthetic-and.html",
          "publishedOn": "2022-10-20T16:58:00.010Z",
          "wordCount": 27681,
          "title": "MUSIQ: Assessing Image Aesthetic and Technical Quality with Multi-scale Transformers",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiCIbYQlkOE0n8G7IFh_Uo4KhEafpAKdpnx9swpUA06IV4kFaqN2bTjd22zaSmhVUDmzpFOAqTH73AQNtXvffeaW3UZwlI54w427v7dsDsI8_8UQEvY198hGgTCu9f0upoDn33AYsq0fqUbwu12rwb9_FVzrSTTHNewaiJyMIpEDzMURKzFdzpZOubazQ/s72-c/MUSIQ.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/10/do-modern-imagenet-classifiers.html",
          "author": null,
          "description": "Posted by Manoj Kumar, Research Engineer, and Ekin Dogus Cubuk, Research Scientist, Google Research \nThe task of determining the similarity between images is an open problem in computer vision and is crucial for evaluating the realism of machine-generated images. Though there are a number of straightforward methods of estimating image similarity (e.g., low-level metrics that measure pixel differences, such as FSIM and SSIM), in many cases, the measured similarity differences do not match the differences perceived by a person. However, more recent work has demonstrated that intermediate representations of neural network classifiers, such as AlexNet, VGG and SqueezeNet trained on ImageNet, exhibit perceptual similarity as an emergent property. That is, Euclidean distances between encoded rep…",
          "link": "http://ai.googleblog.com/2022/10/do-modern-imagenet-classifiers.html",
          "publishedOn": "2022-10-19T17:57:00.005Z",
          "wordCount": 27574,
          "title": "Do Modern ImageNet Classifiers Accurately Predict Perceptual Similarity?",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEguCNOD5qe7A72gZv0sl7QIgLv4HL06sCxEzVQLELH8Affzu_UzyEFJPj2nGU5PdEFO6h6XErHLFZqpFgcrJQZO0sif3zH70avGxMsop1IBQvfFKTBKfdJ-6OBYdIODCS9xopyjaIRRmcNR58EygavFwwxrGxqlOLidEkIvZxvHCIUdBsnczvy_EC7C/s72-c/image5.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/10/table-tennis-research-platform-for.html",
          "author": null,
          "description": "Posted by Avi Singh, Research Scientist, and Laura Graesser, Research Engineer, Robotics at Google\nRobot learning has been applied to a wide range of challenging real world tasks, including dexterous manipulation, legged locomotion, and grasping. It is less common to see robot learning applied to dynamic, high-acceleration tasks requiring tight-loop human-robot interactions, such as table tennis. There are two complementary properties of the table tennis task that make it interesting for robotic learning research. First, the task requires both speed and precision, which puts significant demands on a learning algorithm. At the same time, the problem is highly-structured (with a fixed, predictable environment) and naturally multi-agent (the robot can play with humans or another robot), makin…",
          "link": "http://ai.googleblog.com/2022/10/table-tennis-research-platform-for.html",
          "publishedOn": "2022-10-18T17:50:00.024Z",
          "wordCount": 27742,
          "title": "Table Tennis: A Research Platform for Agile Robotics",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh563V_fA2AfwFfnKgijiPz38oX40zeziDIAGd6chEHZiNJRLpo1N3IXjqYRhF9acNGgkwrrBvbDMKIeTxov5QJHtTx3FO36jdOVlvMpRWdjrASBWSrGLNWP8gIPoS_qEk4z5fdJiNhLKwYWiMQDsjiFwvE5iABgFNyoREW37VzHjJ102qWxpNP7aWBvg/s72-c/i-S2R.gif"
        },
        {
          "id": "http://ai.googleblog.com/2022/10/ul2-20b-open-source-unified-language.html",
          "author": null,
          "description": "Posted by Yi Tay and Mostafa Dehghani, Research Scientists, Google Research, Brain Team\nBuilding models that understand and generate natural language well is one the grand goals of machine learning (ML) research and has a direct impact on building smart systems for everyday applications. Improving the quality of language models is a key target for researchers to make progress toward such a goal.   \n\nMost common paradigms to build and train language models use either autoregressive decoder-only architectures (e.g., PaLM or GPT-3), where the model is trained to predict the next word for a given prefix phrase, or span corruption-based encoder-decoder architectures (e.g., T5, ST-MoE), where the training objective is to recover the subset of words masked out of the input. On the one hand, T5-li…",
          "link": "http://ai.googleblog.com/2022/10/ul2-20b-open-source-unified-language.html",
          "publishedOn": "2022-10-14T18:47:00.009Z",
          "wordCount": 27866,
          "title": "UL2 20B: An Open Source Unified Language Learner",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjoRWMTOf1JUl345eb5BqKEPTRRxPvzPdzvspKtqlwNHqo4BVq98MJYkvEVPZAPdYmLaFMLQKAolOdzKD3uzbYTdYM8S9Z-y5BXgy6kotdukG8w9VCkrZt3Vb0H-BEDp8XC5bGIsA_OEQPWWll1vNRZbSBwJWowTCTf9cnW-7fDOXT8MmyH5s8KzieCQg/s72-c/image3.gif"
        },
        {
          "id": "http://ai.googleblog.com/2022/10/crossmodal-3600-multilingual-reference.html",
          "author": null,
          "description": "Posted by Ashish Thapliyal, Software Engineer, and Jordi Pont-Tuset, Research Scientist, Google Research\nImage captioning is the machine learning task of automatically generating a fluent natural language description for a given image. This task is important for improving accessibility for visually impaired users and is a core task in multimodal research encompassing both vision and language modeling.  \n \nHowever, datasets for image captioning are primarily available in English. Beyond that, there are only a few datasets covering a limited number of languages that represent just a small fraction of the world’s population. Further, these datasets feature images that severely under-represent the richness and diversity of cultures from across the globe. These aspects have hindered research on…",
          "link": "http://ai.googleblog.com/2022/10/crossmodal-3600-multilingual-reference.html",
          "publishedOn": "2022-10-13T16:53:00.014Z",
          "wordCount": 27907,
          "title": "Crossmodal-3600 — Multilingual Reference Captions for Geographically Diverse Images",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhA3qznWJUsCY3Jh7Z5CPA5U3dJIBWD28I3OOEXklBBY4TseAh5iap2pmDdYi-s4PbBZZu7lgMut_pW9WpbEr9FLyRK0WBnzejaerkRjJfNAc4tKhOvbnxhTY70akSiIrEir7NUxXhgbFyA1DopoQdqY0feRtoiTRkuyh6Goiqs2m73Yz9bFeBvkhekSg/s72-c/xm3600_animation_long.gif"
        },
        {
          "id": "http://ai.googleblog.com/2022/10/audiolm-language-modeling-approach-to.html",
          "author": null,
          "description": "Posted by Zalán Borsos, Research Software Engineer, and Neil Zeghidour, Research Scientist, Google Research \nGenerating realistic audio requires modeling information represented at different scales. For example, just as music builds complex musical phrases from individual notes, speech combines temporally local structures, such as phonemes or syllables, into words and sentences. Creating well-structured and coherent audio sequences at all these scales is a challenge that has been addressed by coupling audio with transcriptions that can guide the generative process, be it text transcripts for speech synthesis or MIDI representations for piano. However, this approach breaks when trying to model untranscribed aspects of audio, such as speaker characteristics necessary to help people with spee…",
          "link": "http://ai.googleblog.com/2022/10/audiolm-language-modeling-approach-to.html",
          "publishedOn": "2022-10-06T20:05:00.002Z",
          "wordCount": 27494,
          "title": "AudioLM: a Language Modeling Approach to Audio Generation",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiX0MyO_IXk730mCbbJX7LXxBRIxJk2K41Y4leuEk4WQRjz0kgIp9CGHFwLePaKt3qEcCK8fvhAxjJ7J_sXH05q7xnsMbjZZFDDLPIlVyaKr3yYo77oT2KBqe9gw4MFuUZnUfxFprP67ExPzr2RNxduB0SruUGjJXghihHSoxvMtlG3YNtHHesZOJzY/s72-c/image2.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/10/large-motion-frame-interpolation.html",
          "author": null,
          "description": "Posted by Fitsum Reda and Janne Kontkanen, Google Research \nFrame interpolation is the process of synthesizing in-between images from a given set of images. The technique is often used for temporal up-sampling to increase the refresh rate of videos or to create slow motion effects. Nowadays, with digital cameras and smartphones, we often take several photos within a few seconds to capture the best picture. Interpolating between these “near-duplicate” photos can lead to engaging videos that reveal scene motion, often delivering an even more pleasing sense of the moment than the original photos.  \n  \nFrame interpolation between consecutive video frames, which often have small motion, has been studied extensively. Unlike videos, however, the temporal spacing between near-duplicate photos can …",
          "link": "http://ai.googleblog.com/2022/10/large-motion-frame-interpolation.html",
          "publishedOn": "2022-10-04T18:43:00.005Z",
          "wordCount": 27671,
          "title": "Large Motion Frame Interpolation",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgRIrNGJ_ULWX3iM63cdI0H6CJx9200rUy_yxYJbT15kNRlAkgiZ4o_8NfWyfZ2GnTusotAQXxMjVkhh0zvOW92meJkwRniD2Fh6DyvZukZDOo_ZujCcsos37LOeE9rpZlyh2VNFYVMa5WapuSpCxdTJ9UWVBLZvRdlup7ACXPlq_zhR6tyE8KoUpsg0g/s72-c/image3.gif"
        }
      ]
    },
    {
      "title": "Seth Godin's Blog on marketing, tribes and respect",
      "feedUrl": "https://feeds.feedblitz.com/sethsblog",
      "siteUrl": "https://seths.blog",
      "articles": [
        {
          "id": "https://seths.blog/?p=43100",
          "author": "Seth Godin",
          "description": "There are unforeseen speedbumps, missed connections and of course, a lot of luck. If you are in love with your authentic voice, you’re unlikely to change. One lesson from the 500 Songs podcast is that most classic rock songs were made by people who started pretty far from where they ended up, but persisted, adjusted […]",
          "link": "https://feeds.feedblitz.com/~/717675566/0/sethsblog~Sticking-just-the-right-amount/",
          "publishedOn": "2022-10-29T09:28:00.000Z",
          "wordCount": 1170,
          "title": "Sticking just the right amount",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806138-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=44078",
          "author": "Seth Godin",
          "description": "The industrial age prized these three attributes. We’ve all been indoctrinated into adopting them through our time in organized schooling, and it’s easy to imagine that the world still wants this. When work is geographically bounded and the assembly line is the dynamic of efficiency, this is precisely what’s sought. Your resume certifies that you […]",
          "link": "https://feeds.feedblitz.com/~/717535794/0/sethsblog~Handy-cheap-and-willing/",
          "publishedOn": "2022-10-28T08:15:00.000Z",
          "wordCount": 1301,
          "title": "Handy, cheap and willing",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806139-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=43091",
          "author": "Seth Godin",
          "description": "A 98% chance is dramatically different than a 100% certainty. Certainty isn’t on the spectrum of chance. It’s a different thing altogether. If the weather report says the chance of precipitation is zero, one should never walk outside into the rain. When you leave yourself a few points of wiggle room, you can build more […]",
          "link": "https://feeds.feedblitz.com/~/717361002/0/sethsblog~With-certainty/",
          "publishedOn": "2022-10-27T07:47:00.000Z",
          "wordCount": 1063,
          "title": "With certainty",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061317.jpg"
        },
        {
          "id": "https://seths.blog/?p=44070",
          "author": "Seth Godin",
          "description": "Some problems lend themselves to reexamination. A second, third or even fourth thought is productive, because our initial impulses might not reflect our best effort at understanding the nuances of the situation. But many problems simply create more thoughts, without productive output. As we confront something that is unlikely to have a simple or productive […]",
          "link": "https://feeds.feedblitz.com/~/717203466/0/sethsblog~Giving-it-a-second-thought/",
          "publishedOn": "2022-10-26T08:39:00.000Z",
          "wordCount": 1104,
          "title": "Giving it a second thought",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061318.jpg"
        },
        {
          "id": "https://seths.blog/?p=44072",
          "author": "Seth Godin",
          "description": "It’s the first mile. Big tech likes to talk about the last mile problem–how to get a wire, a system or a concept from where the nodes are easy to plant to where people actually are. As if the hard part is what they’ve already done, and now it’s just the last little bit… None […]",
          "link": "https://feeds.feedblitz.com/~/717133428/0/sethsblog~Its-not-the-last-mile/",
          "publishedOn": "2022-10-25T18:44:00.000Z",
          "wordCount": 1145,
          "title": "It’s not the last mile",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061316.jpg"
        },
        {
          "id": "https://seths.blog-production.mystagingwebsite.com/?p=31602",
          "author": "Seth Godin",
          "description": "When one person needs to fix a wall, adjust a cabinet or choose what to serve for dinner, they can optimize their choice. Make appropriate trade-offs. Take responsibility for the path chosen. But when a group of people are asked to do the same thing, it’s easy to err on the side of the pursuit […]",
          "link": "https://feeds.feedblitz.com/~/717084466/0/sethsblog~Perfect-might-be-the-enemy-of-good-in-group-dynamics-and-choice-making/",
          "publishedOn": "2022-10-25T08:48:00.000Z",
          "wordCount": 1154,
          "title": "Perfect might be the enemy of good in group dynamics and choice making",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061315.jpg"
        },
        {
          "id": "https://seths.blog/?p=43087",
          "author": "Seth Godin",
          "description": "Decisions and crises and moments of significant effort and risk can be stressful. But the challenge of a stressful day is rarely directly related to today, it’s about tomorrow or years from now. Which means that pushing your way through some critical choices now will probably pay off in far more good days later. How […]",
          "link": "https://feeds.feedblitz.com/~/716965058/0/sethsblog~How-many-good-days/",
          "publishedOn": "2022-10-24T07:45:00.000Z",
          "wordCount": 1096,
          "title": "How many good days?",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806138-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=44062",
          "author": "Seth Godin",
          "description": "Many offices and public settings are putting up clear plexiglas barriers to insulate staff from the spread of disease. While we can easily see through these partitions, it ends up creating a lot of yelling. What if there were a disc, about the size of a hockey puck and the thickness of a few coasters… […]",
          "link": "https://feeds.feedblitz.com/~/716846974/0/sethsblog~Product-idea-Talking-discs/",
          "publishedOn": "2022-10-23T08:30:00.000Z",
          "wordCount": 1187,
          "title": "Product idea: Talking discs",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806136-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=43029",
          "author": "Seth Godin",
          "description": "It’s hopeful to believe that the NFT, baseball card or even car that we next purchase is going to go up in value. It probably won’t. The secret is to only acquire things where the resale value doesn’t matter to your overall satisfaction. That’s one reason there’s a huge difference between investing in stocks and […]",
          "link": "https://feeds.feedblitz.com/~/716687966/0/sethsblog~Resale-value/",
          "publishedOn": "2022-10-22T07:44:00.000Z",
          "wordCount": 1041,
          "title": "Resale value",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806136-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=44056",
          "author": "Seth Godin",
          "description": "“The number of people who say that Moore’s Law can’t continue doubles every 24 months.” Even if you don’t understand this at first, it’s worth a second to understand it. Moore’s Law, now nearly sixty years old, describes a simple engineering fact that has changed the life of everyone on the planet. The number of […]",
          "link": "https://feeds.feedblitz.com/~/716500452/0/sethsblog~Dawanis-Law/",
          "publishedOn": "2022-10-21T08:25:00.000Z",
          "wordCount": 1173,
          "title": "Dawani’s Law",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806132-1.jpg"
        }
      ]
    },
    {
      "title": "The JetBrains Blog",
      "feedUrl": "https://blog.jetbrains.com/feed/",
      "siteUrl": "https://blog.jetbrains.com",
      "articles": [
        {
          "id": "https://blog.jetbrains.com/?post_type=go&p=292107",
          "author": "Sergey Kozlovskiy",
          "description": "The fifth build of the GoLand 2022.3 EAP is now available!  You can get the EAP build via the Toolbox App, download it from our website, use a snap package (for Ubuntu), or from inside GoLand, select Check IDE updates for Early Access Program in Preferences/Settings | Appearance & Behavior | System Settings | Updates. […]",
          "link": "https://blog.jetbrains.com/go/2022/10/28/goland-2022-3-eap-5-support-for-links-lists-and-new-headings-in-go-doc-comments/",
          "publishedOn": "2022-10-28T13:55:07.000Z",
          "wordCount": 2698,
          "title": "GoLand 2022.3 EAP #5: Support for Links, Lists, and New Headings in Go Doc Comments",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/09/Blog_Social_share_image_1280x720_GoLand-2x.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=pycharm&p=292115",
          "author": "Valeria Letusheva",
          "description": "In this new EAP build, we’ve introduced the ability to execute asynchronous code in the Debug Console and Evaluate dialog, improved the parsing and rendering of some sections for class docstrings, enhanced UX for working with the HTTP client and Docker, and added support for new CSS features. This blog post covers the most notable […]",
          "link": "https://blog.jetbrains.com/pycharm/2022/10/2022-3-eap-3/",
          "publishedOn": "2022-10-28T13:22:59.000Z",
          "wordCount": 2782,
          "title": "PyCharm 2022.3 EAP 3 Is Out!",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/09/Blog_Featured_image_1280x600_PyCharm-2x-1.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=teamcity&p=292021",
          "author": "Alexander Rassokhin",
          "description": "TeamCity 2022.10 comes with the Sakura UI enabled by default, introduces many cloud-related features including the AWS credentials management system and out-of-the-box terminal access to AWS EC2-based build agents, and adds important improvements to VCS integrations. Server administrators will love the new streamlined way to implement HTTPS for on-premises TeamCity installations. Also, a new authentication […]",
          "link": "https://blog.jetbrains.com/teamcity/2022/10/teamcity-2022-10-sakura-ui-improved-integration-with-amazon-aws-out-of-the-box-https-support-google-oauth-authentication-and-more/",
          "publishedOn": "2022-10-27T21:01:36.000Z",
          "wordCount": 2926,
          "title": "TeamCity 2022.10: Sakura UI, Improved Integration With Amazon AWS, Out-of-the-Box HTTPS Support, Google OAuth Authentication, and More.",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2019/02/teamcity_social.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=webstorm&p=291757",
          "author": "David Watson",
          "description": "WebStorm 2022.3 EAP build #5 is now available! To catch up on all the new features, check out our previous EAP blog posts. The Toolbox App is the easiest way to get the EAP builds and keep both your stable and EAP versions up-to-date. You can also manually download the EAP builds from our website. […]",
          "link": "https://blog.jetbrains.com/webstorm/2022/10/webstorm-2022-3-eap-5/",
          "publishedOn": "2022-10-27T14:44:16.000Z",
          "wordCount": 2222,
          "title": "WebStorm 2022.3 EAP #5: Package Vulnerability Checker, Vue Import Improvements, and Windows ARM64 Installer",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/09/WebStorm-2022-3EAP-social-media-share.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=education&p=291827",
          "author": "Anastasiia Pogorelova",
          "description": "We are excited to announce the release of EduTools 2022.10. The new version brings an extended selection of toolchains for Rust users. Additionally, teachers can now review tasks before creating a course archive and modify the names of hints. We also improved the overall quality of the plugin by fixing a variety of bugs. Read […]",
          "link": "https://blog.jetbrains.com/education/2022/10/27/edutools-plugin-2022-10-available/",
          "publishedOn": "2022-10-27T14:14:22.000Z",
          "wordCount": 1937,
          "title": "EduTools 2022.10 Is Available",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/Featured_Blog_Social_1280x720_EduTools-2x-2.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=datalore&p=291802",
          "author": "Alena Guzharina",
          "description": "On Wednesday, 26th October 2022, I gave a webinar about how to build beautiful data apps with Datalore, our collaborative data science and data analytics platform. Here’s the recording for you to watch if you missed the live stream. Description Have you ever struggled to create presentations for your stakeholders with your data science or […]",
          "link": "https://blog.jetbrains.com/datalore/2022/10/27/webinar-recording-how-to-build-beautiful-data-apps-with-datalore/",
          "publishedOn": "2022-10-27T10:30:21.000Z",
          "wordCount": 1824,
          "title": "Webinar Recording: “How to Build Beautiful Data Apps with Datalore”",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/DSGN-14748-Webinar-How-To-Build-Beautiful-Data-Apps-with-Datalore_JB_Blog_Social_share_image_1280-720.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=clion&p=291573",
          "author": "Anastasia Kazakova",
          "description": "A new CLion 2022.3 EAP build is available! Download build 223.7255.15 from our website, via the Toolbox App, or as a snap package (if you are using Ubuntu). Update via patch if you are using the previous EAP build. DOWNLOAD CLION EAP CMake Debugger CMake is a tricky scripting language that is sometimes hard to […]",
          "link": "https://blog.jetbrains.com/clion/2022/10/clion-2022-3-eap-cmake-debugger/",
          "publishedOn": "2022-10-26T17:41:56.000Z",
          "wordCount": 2500,
          "title": "CLion 2022.3 EAP: CMake Debugger",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/09/Social_share_image_1280x720_CLion-2x.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=appcode&p=291719",
          "author": "Anastasia Kazakova",
          "description": "The AppCode 2022.2.4 bug-fix update is now available! Build 222.4345.34 is available from our website, from the Toolbox App, or via an update patch from the IDE itself. This build improves AppCode’s compatibility with Xcode 14.1 RC by fixing an exception that was happening on project opening (OC-23248). DOWNLOAD APPCODE If you are interested in […]",
          "link": "https://blog.jetbrains.com/appcode/2022/10/appcode-bug-fix-update-2022-2-4/",
          "publishedOn": "2022-10-26T17:41:23.000Z",
          "wordCount": 1886,
          "title": "AppCode Bug-Fix Update 2022.2.4",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/ac-bug-fix-blog-social-share-image-1280x720-1-1.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=idea&p=290845",
          "author": "Maria Kosukhina",
          "description": "IntelliJ IDEA 2022.3 EAP 5 is out! With this last EAP build before IntelliJ IDEA 2022.3 Beta, we’re introducing some more of the new features and improvements you can expect in the upcoming major release. This build provides a better user experience with tips of the day and bookmarks, includes updates for Gradle, and more. […]",
          "link": "https://blog.jetbrains.com/idea/2022/10/intellij-idea-2022-3-eap-5/",
          "publishedOn": "2022-10-26T17:12:20.000Z",
          "wordCount": 2725,
          "title": "IntelliJ IDEA 2022.3 EAP 5: Updated Tips of the Day, Enhanced Bookmarks, Gradle Improvements, and More",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2019/02/intellij-idea_social.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=kotlin&p=291103",
          "author": "Maria Krishtal",
          "description": "It’s been three years since we got together for KotlinConf 2019 Global. Since then, we’ve missed it a lot. That’s why we’re more than happy to announce that KotlinConf will be back in 2023, and so will KotlinConf Global! KotlinConf Global During KotlinConf’23 Global, you’ll get a chance to watch the conference keynotes and other […]",
          "link": "https://blog.jetbrains.com/kotlin/2022/10/kotlinconf-2023-is-going-global-get-on-board-with-us/",
          "publishedOn": "2022-10-26T14:34:59.000Z",
          "wordCount": 1975,
          "title": "KotlinConf 2023 Is Going Global. Get on Board With Us!",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/KotlinConf-Global-Banners_Twitter-Blog-800h418-no-CTA-1.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=youtrack&p=291378",
          "author": "Elena Pishkova",
          "description": "Sign up for our YouTrack Project Management: Essentials for Getting Started webinar. You’ll get an overview of how to manage your tasks and projects easily, work with your team’s Agile boards, use powerful time tracking, create Gantt charts effectively, and see what’s going on with reports and dashboards. You’ll get to see real examples of […]",
          "link": "https://blog.jetbrains.com/youtrack/2022/10/join-our-youtrack-project-management-essentials-for-getting-started-online-webinar/",
          "publishedOn": "2022-10-26T12:56:44.000Z",
          "wordCount": 1854,
          "title": "Join Our YouTrack Project Management: Essentials for Getting Started Online Webinar",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/DSGN-14655_YouTrack_Project_Management_Essentials_for_Getting_Started_Blog_Social_share_image_1280x720.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=clion&p=291421",
          "author": "Timur Doumler",
          "description": "In this video, we show how to use CLion together with a PEmicro Multilink debug probe in order to develop, build and debug code on an ARM-based microcontroller. For this example, our target device will be a BluePill with a STM32F103 ARM Cortex M3 microcontroller, and we will be implementing “Blinky”, i.e. making an LED […]",
          "link": "https://blog.jetbrains.com/clion/2022/10/using-a-pemicro-multilink-debug-probe-with-clion/",
          "publishedOn": "2022-10-26T11:22:52.000Z",
          "wordCount": 1915,
          "title": "Using a PEmicro Multilink Debug Probe With CLion",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/cl-tips-tricks-blog-social-share-image-1280x720-1.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}