{
  "sources": [
    {
      "title": "Spring",
      "feedUrl": "https://spring.io/blog.atom",
      "siteUrl": "https://spring.io/blog",
      "articles": [
        {
          "id": "https://spring.io/blog/2021/08/26/bootiful-podcast-richard-north-and-sergei-egorov-on-testcontainers-their-new-company-atomicjar-and-more",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring! In this installment, Josh Long talks to Richard North (@whichrich) and Sergei Egorov (@bsideup) about Testcontainers, their new company AtomicJar, and software licensing, among other things.",
          "link": "https://spring.io/blog/2021/08/26/bootiful-podcast-richard-north-and-sergei-egorov-on-testcontainers-their-new-company-atomicjar-and-more",
          "publishedOn": "2021-08-26T11:00:00.000Z",
          "wordCount": 445,
          "title": "Bootiful Podcast - Richard North and Sergei Egorov on Testcontainers, their new company AtomicJar, and more"
        },
        {
          "id": "https://spring.io/blog/2021/08/24/this-week-in-spring-august-24th-2021",
          "author": null,
          "description": "Hi, Spring fans, and welcome to another riveting roundup of all the news that’s fit to reprint in the Java and Spring ecosystems, with apologies, as always, to The Times. We’re a week away from SpringOne 2021, our annual, free, and utterly online tentpole conference featuring hundreds of hours of amazing technical content from speakers all around the world and tens of thousands of attendees with whom to partake in the festivities. Do not miss this! I’ll be there! \n\r\nI get so excited in the leadup to SpringOne each year, and this year doubly so! First, there’s the usual monumental scope of the whole thing, which always gets me. I also just got my first (of hopefully many) negative COVID-19 tests a few days ago, after three weeks of convalescence. Huzzah! I’m still taking it easy, trying to …",
          "link": "https://spring.io/blog/2021/08/24/this-week-in-spring-august-24th-2021",
          "publishedOn": "2021-08-24T07:00:00.000Z",
          "wordCount": 838,
          "title": "This Week in Spring - August 24th, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/08/22/structuring-your-code-for-spring-framework-and-spring-boot",
          "author": null,
          "description": "or: How To Build a Mental Framework for Spring Framework\n\r\nEDIT: There’s a great comment below that mentions that the original title, Structuring Spring Boot Applications, is a bit misleading, in that the blog doesn’t intend to talk about how to organize types and packages, and instead thinks about how Spring interacts with the objects in your code. The next paragraph sought to clarify that point but apparently fell short. Anyway, I’ve changed it, which unfortunately will break earlier links to it. I’m sorry for both the poor title and the now two days of broken links. I hope it’s useful for everyone, even if I clearly could’ve done a better job with the title… \n\r\nIt’s hard to think about structuring applications. There’s a lot to think about at the higher level - is it a batch job, a web …",
          "link": "https://spring.io/blog/2021/08/22/structuring-your-code-for-spring-framework-and-spring-boot",
          "publishedOn": "2021-08-23T05:02:00.000Z",
          "wordCount": 1850,
          "title": "Structuring Your Code for Spring Framework and Spring Boot"
        },
        {
          "id": "https://spring.io/blog/2021/08/19/spring-boot-2-6-0-m2-is-now-available",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.6.0-M2 has been released and is now available from https://repo.spring.io/milestone.\n\r\nThis release includes more than a 100 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/08/19/spring-boot-2-6-0-m2-is-now-available",
          "publishedOn": "2021-08-19T18:00:39.000Z",
          "wordCount": 494,
          "title": "Spring Boot 2.6.0-M2 is now available"
        },
        {
          "id": "https://spring.io/blog/2021/08/19/spring-boot-2-5-4-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.5.4 has been released and is now available from Maven Central.\n\r\nThis release includes 35 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/08/19/spring-boot-2-5-4-available-now",
          "publishedOn": "2021-08-19T13:12:05.000Z",
          "wordCount": 490,
          "title": "Spring Boot 2.5.4 available now"
        },
        {
          "id": "https://spring.io/blog/2021/08/19/a-bootiful-podcast-microsoft-azure-engineering-manager-rome-li-on-his-work-supporting-microsoft-azure-in-intellij-visual-studio-maven-eclipse-and-visual-studio-code",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks to Microsoft’s Rome Li (@akalirong) on his work supporting Microsoft Azure from IntelliJ, Visual Studio, Maven, Eclipse, and Visual Studio Code.",
          "link": "https://spring.io/blog/2021/08/19/a-bootiful-podcast-microsoft-azure-engineering-manager-rome-li-on-his-work-supporting-microsoft-azure-in-intellij-visual-studio-maven-eclipse-and-visual-studio-code",
          "publishedOn": "2021-08-19T12:00:00.000Z",
          "wordCount": 456,
          "title": "A Bootiful Podcast: Microsoft Azure engineering manager Rome Li on his work supporting Microsoft Azure in IntelliJ, Visual Studio, Maven, Eclipse, and Visual Studio Code"
        },
        {
          "id": "https://spring.io/blog/2021/08/19/spring-boot-2-4-10-is-now-available",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.4.10 has been released and is now available from Maven Central.\n\r\nThis release includes 29 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/08/19/spring-boot-2-4-10-is-now-available",
          "publishedOn": "2021-08-19T11:06:27.000Z",
          "wordCount": 492,
          "title": "Spring Boot 2.4.10 is now available"
        },
        {
          "id": "https://spring.io/blog/2021/08/19/spring-authorization-server-goes-to-production",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, it is my great pleasure to announce the general availability of Spring Authorization Server 0.2.0.\n\r\n\r\n\r\nThis release is the first officially supported production-ready version backed by our new support policy.\n\r\n\r\n\r\nYou can download it from Maven Central by using the module coordinates:\n\r\n\r\n\r\n\r\ncompile 'org.springframework.security:spring-security-oauth2-authorization-server:0.2.0'\n\r\n\r\n\r\n\r\nSee the release notes for complete details.\n\r\n\r\n\r\nFor additional details on this project, see the latest and initial announcement and the project page.\n\r\n\r\n\r\nTo get started using Spring Authorization Server, see the sample to become familiar with setup and configuration.\n\r\n\r\n\r\nWe would love to gather your feedback as we strive to improve and build upon this release.\n\r\n\r\n\r\nProject Page | GitHub Issues |  ZenHub Board",
          "link": "https://spring.io/blog/2021/08/19/spring-authorization-server-goes-to-production",
          "publishedOn": "2021-08-19T08:00:00.000Z",
          "wordCount": 508,
          "title": "Spring Authorization Server goes to production !"
        },
        {
          "id": "https://spring.io/blog/2021/08/18/spring-tools-4-11-1-released",
          "author": null,
          "description": "ear Spring Community,\n\r\nI am happy to announce the 4.11.1 release of the Spring Tools 4 for Eclipse, Visual Studio Code, and Theia.\nFixes in this release\n\r\n\r\n  \n(VS Code, Spring Boot) fixed: [codespaces] spring boot extension starting up multiple times in Codespaces setting (#669)\n\r\n  \n(VS Code, Spring Boot) fixed: [codespaces] spring boot extension doesn’t find the right JDK when connecting to a codespace (#670)\n\r\n  \n(VS Code, Spring Boot) fixed: JAVA_Home should be right but still shows “Note Java 8 can still be used in your own projects” (#664)\n\r\n  \n(Eclipse) improvement: progress view shows many AsyncLiveExpression refresh messages and doesn’t respond anymore (#653)\n\r\n  \n(Eclipse) improvement: latest CI builds do not show port of running app anymore (#659)\n\r\n  \n(Concourse) improvement: Property ‘commit_message’ not recognized for semver resources (#655)\n\r\n  \n(Concourse) improvement: GitResource schema, add missing properties (#671)\n\r\n  \n(Concourse) improvement: Unknown property ‘fetch_tags’ for type ‘GitSource’(YamlSchemaProblem) (#668)\n\r\n\r\nTo download the distribution for Eclipse and find links to the marketplace entries for Visual Studio Code and Theia, please go visit:\n\r\n\r\n  \nSpring Tools 4: https://spring.io/tools/\n\r\n\r\nSpring Tools 4.12.0 is scheduled to be released in late September 2021.\n\r\nEnjoy!",
          "link": "https://spring.io/blog/2021/08/18/spring-tools-4-11-1-released",
          "publishedOn": "2021-08-18T11:44:09.000Z",
          "wordCount": 564,
          "title": "Spring Tools 4.11.1 released"
        },
        {
          "id": "https://spring.io/blog/2021/08/17/this-week-in-spring-august-17th-2021",
          "author": null,
          "description": "Hi, Spring fans! How’re you doing? I’m alright. I’ve been recuperating from a COVID-19 infection. Today was the first day in a while that I woke up and wasn’t short of breath. Most days, I’ve woken up, hacked a few wads of phlegm into the toilet, and then my breathing was fine. But today I woke up and wasn’t short of breath in the first place. (I still hacked a few wads of phlegm). Thank goodness for vaccines, or I expect my experience of this virus would’ve been much worse as a lifelong asthmatic. Things are looking up! \n\r\nAnd then, as if my fortunes couldn’t get any better, I got to compiling this week’s roundup and there’s a ton of great stuff in it so let’s dive right in!\n\r\n\r\n  \nGet started with Spring Boot and the CQRS framework Axon\n\r\n  \nIn last week’s installment of A Bootiful Podcast: Neo4J CEO and Spring Data cofounder Emil Eifrem on graphs, Neo4J, and more\n\r\n  \nAlexa Request Validation with Spring Cloud Gateway\n\r\n  \nFree Java & OpenJDK Info for Daily Java Usage\n\r\n  \nSpring Authorization Server officially moves to spring-projects\n\r\n  \nSpring Data 2021.0.4 and 2020.0.12 released\n\r\n  \nSpring Data 2021.1.0-M2 released\n\r\n  \nSpring WebClient with Feign\n\r\n  \nGet hands-on with Azure Spring Cloud in 90 minutes.\n\r\n  \nDid you see Cora Iberkleid’s power session on Spring Cloud Gateway? It was awesome!",
          "link": "https://spring.io/blog/2021/08/17/this-week-in-spring-august-17th-2021",
          "publishedOn": "2021-08-17T10:00:00.000Z",
          "wordCount": 611,
          "title": "This Week in Spring - August 17th, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/08/17/spring-authorization-server-officially-moves-to-spring-projects",
          "author": null,
          "description": "We are very excited to announce that Spring Authorization Server has officially moved out of experimental status and into the Spring project’s portfolio!\n\r\n\r\n\r\nThis move coincides with this week’s 0.2.0 release, which is the first officially supported production-ready version backed by our new support policy.\n\r\n\r\n\r\nSince announcing the Spring Authorization Server in April 2020, the implemented features provide support for a large portion of the OAuth 2.1 Authorization Framework and modest support for OpenID Connect 1.0. However, as we move onto the next phase of development, our focus changes to advancing the support for OpenID Connect 1.0.\n\r\n\r\n\r\nOn behalf of the team, I would like to thank everyone who has contributed and helped grow this project in this short time frame. We are confident in the base that we have built so far and are excited for the next phase of the project. We look forward to continuing this work together and ultimately making Spring Authorization Server the de facto framework for OAuth 2 Authorization Server support on the Java platform.\n\r\n\r\n\r\nLet’s get moving onto the next phase!",
          "link": "https://spring.io/blog/2021/08/17/spring-authorization-server-officially-moves-to-spring-projects",
          "publishedOn": "2021-08-17T10:00:00.000Z",
          "wordCount": 567,
          "title": "Spring Authorization Server officially moves to spring-projects"
        },
        {
          "id": "https://spring.io/blog/2021/08/12/spring-data-2021-1-0-m2-released",
          "author": null,
          "description": "On behalf of the team, I’m pleased to announce the availability of the Spring Data 2021.1.0-M2 milestone release.\n\r\nThe release is built on top of Spring Framework 5.3.9.\nFor your convenience, you can consume this release through Spring Boot 2.6.0-M2, which our team mates on the Boot team will release in about a week.\n\r\nTo round things off, here are the links to the artifacts, changelogs, and documentation:\n\r\n\r\n  \nSpring Data Commons 2.6 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data JDBC 2.3 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data JPA 2.6 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data for Apache Cassandra 3.3 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data KeyValue 2.6 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data Neo4j 6.2 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data MongoDB 3.3 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data for Apache Geode 2.6 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data R2DBC 1.4 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data LDAP 2.6 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data Envers 2.6 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data REST 3.6 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data Redis 2.6 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data Elasticsearch 4.3 M2 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data Couchbase 4.3 M2 - Artifacts - Javadoc - Documentation - Changelog",
          "link": "https://spring.io/blog/2021/08/12/spring-data-2021-1-0-m2-released",
          "publishedOn": "2021-08-12T18:50:35.000Z",
          "wordCount": 649,
          "title": "Spring Data 2021.1.0-M2 released"
        },
        {
          "id": "https://spring.io/blog/2021/08/12/spring-data-2021-0-4-and-2020-0-12-released",
          "author": null,
          "description": "On behalf of the team, I’m pleased to announce the availability of the Spring Data2021.0.4 and 2020.0.12 service releases.\n\r\nBoth releases are built on top of Spring Framework 5.3.9. For your convenience, you can consume these releases through Spring Boot 2.5.4 and 2.4.10, respectively. Our teammates on the Boot team will release those in about a week.\n\r\nThe service releases ship with mostly bug fixes and dependency upgrades.\n\r\nTo round things off, here are the links to the artifacts, changelogs, and documentation:\n2021.0.4\n\r\n\r\n  \nSpring Data Commons 2.5.4 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data JDBC 2.2.4 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data JPA 2.5.4 - Artifacts - Javadoc - Documentation - Changelog\n\r\n  \nSpring Data for Apache Cass…",
          "link": "https://spring.io/blog/2021/08/12/spring-data-2021-0-4-and-2020-0-12-released",
          "publishedOn": "2021-08-12T18:50:20.000Z",
          "wordCount": 852,
          "title": "Spring Data 2021.0.4 and 2020.0.12 released"
        },
        {
          "id": "https://spring.io/blog/2021/08/12/a-bootiful-podcast-neo4j-ceo-and-spring-data-cofounder-emil-eifrem-on-graphs-neo4j-and-more",
          "author": null,
          "description": "Hi, Spring fans! In this episode, Josh Long (@starbuxman) talks to Neo4j CEO and Spring Data cofounder Emil Eifrem (@emileifrem) .",
          "link": "https://spring.io/blog/2021/08/12/a-bootiful-podcast-neo4j-ceo-and-spring-data-cofounder-emil-eifrem-on-graphs-neo4j-and-more",
          "publishedOn": "2021-08-12T11:00:00.000Z",
          "wordCount": 428,
          "title": "A Bootiful Podcast: Neo4J CEO and Spring Data cofounder Emil Eifrem on graphs, Neo4J, and more"
        },
        {
          "id": "https://spring.io/blog/2021/08/10/this-week-in-spring-august-10th-2021",
          "author": null,
          "description": "Hi, Spring fans! How’re you doing? I hope you’re doing well. You know, I’ve been thinking a lot about how to retain that zen-like peace that comes with a vacation spent on the beach. I got back from Hawaii eight days ago and I found it to be so very beautiful. Nature really sold it for me; the fresh air is everything. If you don’t have ready access to nature - if you, like me, are in a giant city with the ongoing sound of car horns (“klaxons”), fire engines, traffic, and everything else that accompanies any big city - then may I invite you to breathe with me? \n\r\nJust sit still for 30 seconds. Focus on these words. Inhale. Take a big, deep breath, and then hold it in for a few seconds. Then exhale. When was the last time you did that? I don’t do that nearly enough. If I spend 30 or 60 secon…",
          "link": "https://spring.io/blog/2021/08/10/this-week-in-spring-august-10th-2021",
          "publishedOn": "2021-08-10T07:00:00.000Z",
          "wordCount": 751,
          "title": "This Week in Spring - August 10th, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/08/05/a-bootiful-podcast-microsoft-s-sean-li-on-azure-spring-boot-azure-spring-cloud-spring-integrations-and-more",
          "author": null,
          "description": "Hi, Spring fans! In this installment Josh Long talks to Microsoft’s Sean Li on Azure, Spring Boot, Azure Spring Cloud, Spring integrations and more.",
          "link": "https://spring.io/blog/2021/08/05/a-bootiful-podcast-microsoft-s-sean-li-on-azure-spring-boot-azure-spring-cloud-spring-integrations-and-more",
          "publishedOn": "2021-08-05T16:30:00.000Z",
          "wordCount": 433,
          "title": "A Bootiful Podcast: Microsoft's Sean Li on Azure, Spring Boot, Azure Spring Cloud, Spring integrations and more"
        },
        {
          "id": "https://spring.io/blog/2021/08/04/spring-tips-better-data-driven-applications-with-spring-boot-and-redis",
          "author": null,
          "description": "Hi, Spring fans! Redis is the swiss-army knife of databases and it integrates into Spring-based workloads with ease. In this installment, Josh Long (@starbuxman) and special guest star Brian Sam-Bodden (@bsbodden) look at just a few of the bootiful possibilities for Redis and Spring Boot.",
          "link": "https://spring.io/blog/2021/08/04/spring-tips-better-data-driven-applications-with-spring-boot-and-redis",
          "publishedOn": "2021-08-04T07:00:00.000Z",
          "wordCount": 440,
          "title": "Spring Tips: Better Data-Driven Applications with Spring Boot and Redis"
        },
        {
          "id": "https://spring.io/blog/2021/08/03/this-week-in-spring-august-3rd-2021",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring! Can you believe it’s already August, 2021! We’re nearly to 2022! And I am, for better or for worse, back from vacation! I am so happy to be back, but I do miss the sunkissed beaches of Hawai’i. Sigh. Anyway, let’s get into it! We’ve got a ton of things to get into, so without further ado…\n\r\n\r\n  \nA Bootiful Podcast: Microsoft’s Asir V. Selvasingh on Spring Boot, Spring Cloud, Microsoft Azure, and Azure Spring Cloud\n\r\n  \nBlog: Roorkee robots, releases and racing: the Kubernetes 1.21 release interview\n\r\n  \nJoin Pure Storage at VMworld 2021\n\r\n  \nCassandre is an open-source framework that makes it easy to create your crypto trading bot in Java. Our Spring boot starter takes care of exchange connections, accounts, orders, trades, and positions so you can focus \n\r\n  \nCheck out this Spring Security Authorization Server example\n\r\n  \nJoin Confluent Developer advocate Viktor Gamov for this look at Spring and Apache Kafka 101\n\r\n  \nHere’s another interesting look at using Spring Boot with Swagger\n\r\n  \nDid y’all see the latest installment of the SpringOne Tour. This was my favorite installment yet!\n\r\n  \nFlight Status: Oracle Cloud VMware Solution",
          "link": "https://spring.io/blog/2021/08/03/this-week-in-spring-august-3rd-2021",
          "publishedOn": "2021-08-03T07:00:00.000Z",
          "wordCount": 585,
          "title": "This Week in Spring - August 3rd, 2021"
        }
      ]
    },
    {
      "title": "HashiCorp Blog",
      "feedUrl": "https://www.hashicorp.com/blog/feed.xml",
      "siteUrl": "https://hashicorp.com/blog",
      "articles": [
        {
          "id": "https://www.hashicorp.com/blog/when-free-isn-t-good-enough-why-companies-buy-infrastructure-tools",
          "author": null,
          "description": "According to the HashiCorp State of Cloud Strategy Survey, infrastructure tool buyers seek support, compliance, and management features — plus a faster ROI.",
          "link": "https://www.hashicorp.com/blog/when-free-isn-t-good-enough-why-companies-buy-infrastructure-tools",
          "publishedOn": "2021-08-27T16:00:00.000Z",
          "wordCount": 1642,
          "title": "When Free Isn’t Good Enough — Why Companies Buy Infrastructure Tools"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-terraform-azuread-provider-2-0",
          "author": null,
          "description": "Terraform AzureAD provider Version 2.0 exclusively uses the Microsoft Graph API and has numerous schema and behavioral changes to align with the new API.",
          "link": "https://www.hashicorp.com/blog/announcing-terraform-azuread-provider-2-0",
          "publishedOn": "2021-08-26T16:00:00.000Z",
          "wordCount": 838,
          "title": "Announcing Terraform AzureAD Provider 2.0"
        },
        {
          "id": "https://www.hashicorp.com/blog/how-to-choose-a-data-protection-method",
          "author": null,
          "description": "Get a clear picture of modern data protection and encryption methods, their tradeoffs, and see HashiCorp Vault’s feature matrix to identify which method is the right fit for you.",
          "link": "https://www.hashicorp.com/blog/how-to-choose-a-data-protection-method",
          "publishedOn": "2021-08-25T16:00:00.000Z",
          "wordCount": 2257,
          "title": "How to Choose a Data Protection Method"
        },
        {
          "id": "https://www.hashicorp.com/blog/azure-managed-identities-with-the-hashicorp-stack-part-3",
          "author": null,
          "description": "HashiCorp Consul and Nomad use Azure managed identities  to authenticate against Azure in order to read tags and manage service principal information.",
          "link": "https://www.hashicorp.com/blog/azure-managed-identities-with-the-hashicorp-stack-part-3",
          "publishedOn": "2021-08-24T16:00:00.000Z",
          "wordCount": 986,
          "title": "Azure Managed Identities with the HashiCorp Stack: Part 3"
        },
        {
          "id": "https://www.hashicorp.com/blog/cloud-budgets-busted-almost-40-overspent-last-year",
          "author": null,
          "description": "If you want to know what’s really happening in the cloud, you have to follow the money. Here’s what we learned from the 2021 HashiCorp State of Cloud Strategy Survey.",
          "link": "https://www.hashicorp.com/blog/cloud-budgets-busted-almost-40-overspent-last-year",
          "publishedOn": "2021-08-23T20:15:00.000Z",
          "wordCount": 1513,
          "title": "Cloud Budgets Busted: Almost 40% Overspent Last Year"
        },
        {
          "id": "https://www.hashicorp.com/blog/new-terraform-planning-options-refresh-false-refresh-only-replace",
          "author": null,
          "description": "Make changes to your infrastructure in Terraform Cloud and Terraform Enterprise faster with the new -refresh=false, -refresh-only, and replace planning options.",
          "link": "https://www.hashicorp.com/blog/new-terraform-planning-options-refresh-false-refresh-only-replace",
          "publishedOn": "2021-08-20T16:00:00.000Z",
          "wordCount": 1269,
          "title": "New Terraform Planning Options: -refresh=false, -refresh-only, -replace"
        },
        {
          "id": "https://www.hashicorp.com/blog/new-workspace-tags-for-terraform-cloud",
          "author": null,
          "description": "HashiCorp Terraform Cloud gives you a quick and easy new way to search and filter workspaces based on tags.",
          "link": "https://www.hashicorp.com/blog/new-workspace-tags-for-terraform-cloud",
          "publishedOn": "2021-08-19T16:00:00.000Z",
          "wordCount": 849,
          "title": "New Workspace Tags for Terraform Cloud"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-state-of-cloud-strategy-survey-offensive-defensive-drivers-multi-cloud",
          "author": null,
          "description": "Based on the HashiCorp State of Cloud Strategy Survey, we take a deep dive into the business and technology factors driving — and blocking — multi-cloud adoption, including a look at the pandemic's complex effects.",
          "link": "https://www.hashicorp.com/blog/hashicorp-state-of-cloud-strategy-survey-offensive-defensive-drivers-multi-cloud",
          "publishedOn": "2021-08-18T16:00:00.000Z",
          "wordCount": 1582,
          "title": "Survey Finds Both Offensive, Defensive Drivers for Multi-Cloud"
        },
        {
          "id": "https://www.hashicorp.com/blog/new-vault-tutorials-vault-1-8-release-highlights",
          "author": null,
          "description": "Try out the new and enhanced features introduced in Vault 1.8 with step-by-step tutorials on HashiCorp Learn.",
          "link": "https://www.hashicorp.com/blog/new-vault-tutorials-vault-1-8-release-highlights",
          "publishedOn": "2021-08-16T16:00:00.000Z",
          "wordCount": 690,
          "title": "New Vault Tutorials: Vault 1.8 Release Highlights"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-hashicorp-waypoint-0-5",
          "author": null,
          "description": "The new Waypoint 0.5 focuses on visibility around your application deployments and introduces governance for teams to enable better traceability.",
          "link": "https://www.hashicorp.com/blog/announcing-hashicorp-waypoint-0-5",
          "publishedOn": "2021-08-12T19:00:00.000Z",
          "wordCount": 1309,
          "title": "Announcing HashiCorp Waypoint 0.5"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-state-of-cloud-strategy-survey-welcome-to-the-multi-cloud-era",
          "author": null,
          "description": "Our inaugural cloud strategy survey reveals that multi-cloud is now the new normal, driven by digital transformation, with skill shortages, security, and COVID having complex impacts.",
          "link": "https://www.hashicorp.com/blog/hashicorp-state-of-cloud-strategy-survey-welcome-to-the-multi-cloud-era",
          "publishedOn": "2021-08-11T16:00:00.000Z",
          "wordCount": 1150,
          "title": "HashiCorp State of Cloud Strategy Survey: Welcome to the Multi-Cloud Era"
        },
        {
          "id": "https://www.hashicorp.com/blog/a-kubernetes-user-s-guide-to-hashicorp-nomad-secret-management",
          "author": null,
          "description": "Learn how secrets management in Kubernetes compares to HashiCorp Nomad, and see why HashiCorp Vault is a powerful solution for both.",
          "link": "https://www.hashicorp.com/blog/a-kubernetes-user-s-guide-to-hashicorp-nomad-secret-management",
          "publishedOn": "2021-08-10T19:30:00.000Z",
          "wordCount": 2006,
          "title": "A Kubernetes User's Guide to HashiCorp Nomad Secret Management"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-hashicorp-boundary-0-5",
          "author": null,
          "description": "HashiCorp Boundary 0.5 and Boundary Desktop 1.2.1 include a new event logging system along with enhancements to the admin console and sessions cleanup.",
          "link": "https://www.hashicorp.com/blog/announcing-hashicorp-boundary-0-5",
          "publishedOn": "2021-08-10T16:00:00.000Z",
          "wordCount": 593,
          "title": "Announcing HashiCorp Boundary 0.5"
        },
        {
          "id": "https://www.hashicorp.com/blog/application-observability-with-hcp-consul-and-datadog",
          "author": null,
          "description": "Spend more time improving observability rather than maintaining infrastructure with HCP Consul and Datadog.",
          "link": "https://www.hashicorp.com/blog/application-observability-with-hcp-consul-and-datadog",
          "publishedOn": "2021-08-05T16:00:00.000Z",
          "wordCount": 1012,
          "title": "Application Observability with HCP Consul and Datadog"
        },
        {
          "id": "https://www.hashicorp.com/blog/vault-browser-plugin",
          "author": null,
          "description": "Learn how to fetch secrets from Vault with a custom Chrome extension in the latest HashiCorp Learn tutorial.",
          "link": "https://www.hashicorp.com/blog/vault-browser-plugin",
          "publishedOn": "2021-08-04T17:00:00.000Z",
          "wordCount": 958,
          "title": "Vault Secrets in a Browser Plugin"
        },
        {
          "id": "https://www.hashicorp.com/blog/azure-managed-identities-with-the-hashicorp-stack-part-2",
          "author": null,
          "description": "Secrets management with HashiCorp Vault can use Microsoft Azure managed identities to ease the operational burden of Vault cluster availability: Part 2 in a series.",
          "link": "https://www.hashicorp.com/blog/azure-managed-identities-with-the-hashicorp-stack-part-2",
          "publishedOn": "2021-08-04T15:00:00.000Z",
          "wordCount": 1051,
          "title": "Azure Managed Identities with the HashiCorp Stack: Part 2"
        },
        {
          "id": "https://www.hashicorp.com/blog/beta-support-for-crds-in-the-terraform-provider-for-kubernetes",
          "author": null,
          "description": "The kubernetes_manifest resource has now graduated into the official Kubernetes provider as a beta, bringing support for CRDs and custom resources.",
          "link": "https://www.hashicorp.com/blog/beta-support-for-crds-in-the-terraform-provider-for-kubernetes",
          "publishedOn": "2021-08-03T19:00:00.000Z",
          "wordCount": 1262,
          "title": "Beta Support for CRDs in the Terraform Provider for Kubernetes"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-hcp-consul-plus",
          "author": null,
          "description": "HCP Consul Plus allows users to federate Consul clusters across multiple regions for improved redundancy and resiliency of applications.",
          "link": "https://www.hashicorp.com/blog/announcing-hcp-consul-plus",
          "publishedOn": "2021-08-03T16:00:00.000Z",
          "wordCount": 1066,
          "title": "Announcing HCP Consul Plus"
        },
        {
          "id": "https://www.hashicorp.com/blog/hcp-vault-starter",
          "author": null,
          "description": "HCP Vault Starter — now generally available on AWS — offers a production-grade 3-node cluster at a reduced price point.",
          "link": "https://www.hashicorp.com/blog/hcp-vault-starter",
          "publishedOn": "2021-08-02T16:00:00.000Z",
          "wordCount": 962,
          "title": "Announcing HCP Vault Starter"
        }
      ]
    },
    {
      "title": "Elastic Blog - Elasticsearch, Kibana, and ELK Stack",
      "feedUrl": "https://www.elastic.co/blog/feed",
      "siteUrl": "https://www.elastic.co",
      "articles": [
        {
          "id": "https://www.elastic.co/blog/elastic-on-elastic-deep-dive-into-our-siem-architecture",
          "author": "Aaron Jewitt",
          "description": "Elastic on Elastic \nThe Elastic Infosec Detections and Analytics team is responsible for building, tuning, and maintaining the security detections used to protect all Elastic systems. Within Elastic we call ourselves Customer Zero and we strive to always use the newest versions of our products. \n\nIn this series of blog posts we will provide an overview of our architecture, what data we send to our clusters, how and why we use Cross Cluster Search (CCS) with the Security and Machine Learning (ML) applications, and how we tune, manage and notify analysts for those alerts.\n \nOverview of the Elastic Infosec environment\n\nMany cybersecurity products and security controls are built to support a traditional “Corporate Network” with workstations and servers on a local network, secured by a firewall…",
          "link": "https://www.elastic.co/blog/elastic-on-elastic-deep-dive-into-our-siem-architecture",
          "publishedOn": "2021-08-26T15:00:00.000Z",
          "wordCount": 1800,
          "title": "Elastic on Elastic: Deep dive into our SIEM architecture"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-and-cmd-join-forces-to-help-you-take-command-of-your-cloud-workloads",
          "author": "Ashutosh Kulkarni",
          "description": "We are excited to announce that Elastic is joining forces with Cmd to accelerate our efforts in Cloud security - specifically in cloud workload runtime security. By integrating the capabilities of Cmd's expertise and product into Elastic Security, we will enable customers to detect, prevent, and respond to attacks on their cloud workloads. Adding to our recent announcement to acquire build.security, this will give customers cloud security protections from build-time, to deployment-time, to runtime.\n\nCmd is a leader in infrastructure detection and response (IDR), providing deep and performant visibility into cloud workloads using extended Berkeley Packet Filter (eBPF) technology and performing expert detection and prevention on cloud-native data. eBPF has revolutionized how organizations ob…",
          "link": "https://www.elastic.co/blog/elastic-and-cmd-join-forces-to-help-you-take-command-of-your-cloud-workloads",
          "publishedOn": "2021-08-25T19:55:00.000Z",
          "wordCount": 1609,
          "title": "Elastic and Cmd join forces to help you take command of your cloud workloads"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-customers-success-is-my-passion",
          "author": "Asjad Athick,Nikki Jones",
          "description": "As an Elastic Technical Account Manager (TAM), I’m a trusted advisor who provides the necessary technical lens to help solve key business problems and drive customers towards strategic outcomes by helping teams make the most of their investments in Elastic technologies.\n\nIn this series, you will hear firsthand the insights into some of the many ways we help our customers achieve success. \n\n\n\nAsjad Athick, Elastic Technical Account Manager (TAM)\nFor customers looking to monitor and observe their complex IT environments, I help collect the data needed to quickly and efficiently discover and diagnose issues before they impact their organizations. I also help my customers’ security teams establish robust and resilient SIEM platforms that security analysts can rely on day in and day out. Ultima…",
          "link": "https://www.elastic.co/blog/elastic-customers-success-is-my-passion",
          "publishedOn": "2021-08-25T15:00:00.000Z",
          "wordCount": 860,
          "title": "Elastic customers’ success is my passion"
        },
        {
          "id": "https://www.elastic.co/blog/detection-and-response-for-the-actively-exploited-proxyshell-vulnerabilities",
          "author": "Elastic Security Intelligence & Analytics Team",
          "description": "On August 21, 2021, the Cybersecurity and Infrastructure Security Agency (CISA) released an urgent notice related to the exploitation of ProxyShell vulnerabilities (CVE-2021-31207, CVE-2021-34473, CVE-2021-34523).  By chaining these vulnerabilities together, threat actors are compromising unpatched Microsoft Exchange servers and gaining footholds into enterprise networks. Security vendors and researchers are also observing these attacks tied to post-exploitation behavior such as deploying ransomware to victim environments.  \n  \nElastic Security identified indicators of compromise (IoCs) indicating similar activity as reported by the industry. The details of this activity can be found in our Discuss forum, highlighting our perspective of what we have observed in our own telemetry. \n  \nPlease visit the Discuss forum for full details on our identified IoCs.",
          "link": "https://www.elastic.co/blog/detection-and-response-for-the-actively-exploited-proxyshell-vulnerabilities",
          "publishedOn": "2021-08-25T00:00:00.000Z",
          "wordCount": 361,
          "title": "Detection and response for the actively exploited ProxyShell vulnerabilities"
        },
        {
          "id": "https://www.elastic.co/blog/evolving-and-diversifying-elastics-engineering-team-with-the-elastigrad-program",
          "author": "David Kravets,Lauren Peters",
          "description": "At Elastic, we are continually evolving and growing and with this comes new opportunities. We are excited to announce our latest initiative, the Elastigrad Program, which is focused on recruiting early-career engineers.  \n Ash Kulkarni, Elastic’s Chief Product Officer, is dedicated to creating an even more diverse engineering team, and the Elastigrad Program is a natural extension of our investment in our people. “By recruiting and training early-career engineers, we will have fresh perspectives to help us continue to drive innovation and build solutions to help customers around the world search, observe and protect their organizations.”\nOur Elastigrads will be able to devote their time to key projects and initiatives while partnering closely with experienced engineers. These opportunities…",
          "link": "https://www.elastic.co/blog/evolving-and-diversifying-elastics-engineering-team-with-the-elastigrad-program",
          "publishedOn": "2021-08-24T20:00:00.000Z",
          "wordCount": 555,
          "title": "Evolving and diversifying Elastic’s engineering team with the Elastigrad Program"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-and-build-security-shifting-left-together-to-secure-the-cloud",
          "author": "Ashutosh Kulkarni",
          "description": "Since its inception, Elastic Security has had a clear mission: to protect the world's data and systems from attack.\n\nWe started with SIEM, built on top of the Elastic Stack, applying its fast and scalable search capabilities to detect security vulnerabilities across all threat vectors. Next, we joined forces with Endgame to integrate endpoint security into Elastic Security, and allow customers to prevent, detect, and respond to attacks from a single, unified platform. With the recent release of Elastic Security Limitless XDR and the general availability of Elastic Agent, we furthered our mission.\n\nToday, we are excited to announce the next step in the Elastic Security journey: to extend security enforcement from every endpoint to every cloud workload.\n\nMillions of users trust Elastic for o…",
          "link": "https://www.elastic.co/blog/elastic-and-build-security-shifting-left-together-to-secure-the-cloud",
          "publishedOn": "2021-08-23T10:55:00.000Z",
          "wordCount": 1508,
          "title": "Elastic and build.security: Shifting left together to secure the cloud"
        },
        {
          "id": "https://www.elastic.co/blog/kibana-10-common-questions-formulas-time-series-maps",
          "author": "Graham Hudgins,Adeline Tan",
          "description": "Kibana creates easy ways to do powerful things with all of your data — to ask and answer questions and follow the flow of analysis. Many times the answer to your question requires calculations based on queried data. Formulas allow you to author your own metrics by combining multiple aggregated fields using math operations.\n\nIn addition, moving through and replaying your data in time and space are powerful ways to gain historical context and understand additional insight about the present.\n\nIn the below sections you’ll find 10 examples of questions you can answer with dashboard data and map visualizations in Kibana via formulas, time shifts, and moving through data in time. Try following along with your own data or using Kibana’s sample datasets. Have a question? Head on over to our discuss…",
          "link": "https://www.elastic.co/blog/kibana-10-common-questions-formulas-time-series-maps",
          "publishedOn": "2021-08-18T18:00:00.000Z",
          "wordCount": 1850,
          "title": "10 common questions answered with formulas and time travel in Kibana"
        },
        {
          "id": "https://www.elastic.co/blog/introducing-new-google-cloud-instance-types-on-elastic-cloud",
          "author": "Yoav Derazon,Fermi Fang",
          "description": "We are excited to announce support for Google Compute Engine (GCE) N2 general purpose virtual machine (VM) types, and additional hardware configuration options powered by N2 custom machine types. \n\nN2 VMs leverage Intel 2nd Generation Xeon Scalable processors and provide a balance of compute, memory, and storage. N2 machine types also offer more than a 20% improvement in price-performance over the first-generation N1 machines.\n\n\n\nWhen you provision an Elastic deployment on Google Cloud you will automatically leverage N2 VM types. You can select the default configuration, or choose one of four custom configurations. This optionality allows you to select a combination of vCPU, RAM, and storage to deliver optimal performance for your specific use case. For example, you may select a configurat…",
          "link": "https://www.elastic.co/blog/introducing-new-google-cloud-instance-types-on-elastic-cloud",
          "publishedOn": "2021-08-18T15:00:00.000Z",
          "wordCount": 570,
          "title": "New Google Cloud instance types on Elastic Cloud"
        },
        {
          "id": "https://www.elastic.co/blog/full-cycle-observability-with-the-elastic-stack-and-lightrun",
          "author": "Daliya Spasova,Philipp Krenn",
          "description": "This blog post was written in collaboration with the team at Lightrun: Itai Tieger, Roy Chen, and Tom Granot. Itai is an R&D team leader specializing in cybersecurity, with over 10 years of experience in the industry. Roy is a software engineer with over 6 years of diverse experience in multiple disciplines. Tom is a solution engineer and a former site reliability engineer.\n\nAn application running in production is a difficult beast to tame.\n\nMost experienced developers–ones who spent enough late nights or Saturday mornings trying to break apart a nasty production bug–will try and create the clearest possible picture for their later selves while writing their code, so that they could understand what’s actually going on in the system during an incident. \n\nTo make life easier, developers can …",
          "link": "https://www.elastic.co/blog/full-cycle-observability-with-the-elastic-stack-and-lightrun",
          "publishedOn": "2021-08-17T19:00:00.000Z",
          "wordCount": 3293,
          "title": "Full-cycle observability with the Elastic Stack and Lightrun"
        },
        {
          "id": "https://www.elastic.co/blog/establish-robust-threat-intelligence-with-elastic-security",
          "author": "Haran Kumar",
          "description": "As a powerful search engine, Elasticsearch provides various ways to collect and enrich data with threat intel feeds, while the Elastic Security detection engine helps security analysts to detect alerts with threat indicator matching. In this blog post, we’ll provide an introduction to threat intelligence and demonstrate how Elastic Security can help organizations establish robust cyber threat intelligence (CTI) capabilities.\n\nCTI is contextual information obtained through research and analysis of emerging threats and the application of defensive countermeasures to enhance the protective posture of contested environments. It helps organizations to better understand past, current, and future threats. \n\nThreat feeds that can be obtained from various open source and commercial platforms become…",
          "link": "https://www.elastic.co/blog/establish-robust-threat-intelligence-with-elastic-security",
          "publishedOn": "2021-08-12T17:00:00.000Z",
          "wordCount": 1737,
          "title": "Establish robust threat intelligence with Elastic Security"
        },
        {
          "id": "https://www.elastic.co/blog/read-active-log-files-more-quickly-and-easily-with-the-new-filestream-input-in-filebeat",
          "author": "Noémi Ványi",
          "description": "With Elastic 7.14, the filestream input, the successor of log input, is now generally available in Filebeat. This new, superior input provides better support for reading active log files, with faster reaction time when there is backpressure in the system, quicker registry updates, better cooperation with external log rotation tools, and more. \n \nImproved registry performance\n \nPreviously, when a registry file (the file used for saving the progress of publishing events) contained many entries, state updates became slower, even if Filebeat was only collecting a few files. The main problem was that the complete registry was serialized after every ACK from the outputs. That required an expensive fsync call per registry write. Now offset updates are written to the file in an append-only manner.…",
          "link": "https://www.elastic.co/blog/read-active-log-files-more-quickly-and-easily-with-the-new-filestream-input-in-filebeat",
          "publishedOn": "2021-08-11T15:00:00.000Z",
          "wordCount": 852,
          "title": "Read active log files more quickly and easily with the new filestream input in Filebeat"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-stack-8-0-0-alpha1-released",
          "author": "Philipp Krenn",
          "description": "While the 7.x minors keep delivering feature after feature, we are thrilled to announce the first public alpha of 8.0.0.\n\nBefore we continue with this exciting news, we want to remind you that this is an alpha version. We recommend that you keep it an arm's length from production. There is no guarantee that 8.0.0-alpha1 will be compatible with other preview releases or with 8.0.0 general availability (GA).\n\nAlso, 8.0.0-alpha1 will not be available on Elastic Cloud. But, we expect to make a preview version available in the coming months.\n\nThe Elastic Pioneer Program\nWe are also excited to bring back the Elastic Pioneer Program for 8.0. The Pioneer Program debuted in version 5.0 to recognize community participation and feedback. It has been a source of invaluable feedback during the preview …",
          "link": "https://www.elastic.co/blog/elastic-stack-8-0-0-alpha1-released",
          "publishedOn": "2021-08-10T15:00:00.000Z",
          "wordCount": 709,
          "title": "Elastic Stack 8.0.0-alpha1 released"
        },
        {
          "id": "https://www.elastic.co/blog/culture-four-unexpected-benefits-of-working-in-a-distributed-engineering-org",
          "author": "Elastic Culture",
          "description": "Software engineers cite constant distractions, long commute times, and a lack of flexibility as the biggest challenges of working in an office setting, according to an internal employee survey conducted by the Elastic Culture team. But the survey also revealed that the biggest benefits of a distributed environment could be the new opportunities it opens for employees — for example, the freedom to catch some waves during the workday.\n\nAs Elastic offices slowly begin to reopen worldwide in accordance with local guidelines, we asked our Engineering and Product teams why they value being able to work for a company that’s distributed by intention — whether they work in an office, a shared workspace, or from home. \n\nYou can improve your physical and mental health\nOf the Elasticians we surveyed, …",
          "link": "https://www.elastic.co/blog/culture-four-unexpected-benefits-of-working-in-a-distributed-engineering-org",
          "publishedOn": "2021-08-05T15:00:00.000Z",
          "wordCount": 1271,
          "title": "Four unexpected benefits of working in a distributed engineering org"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-recognized-for-innovation-by-google-cloud-and-microsoft",
          "author": "Laurent Mechain",
          "description": "Elastic received honors from two key partners, Microsoft and Google — a recognition of our efforts to ensure that customers can easily find and use Elastic products in the environments that best suit their needs.\n\nElastic was named the 2021 Microsoft US Partner Award Winner in Business Excellence in the Commercial Marketplace. In addition, for the second year in a row, Elastic was selected by Google Cloud as the 2020 Technology Partner of the Year for Data Management.\n\nWe understand that more organizations are procuring software via marketplaces to ease compliance, cost, and operational complexity within their technology landscape. Through our cloud partnerships with Google Cloud, Microsoft Azure, and others, including Amazon Web Services, our customers can gain access to both free and pai…",
          "link": "https://www.elastic.co/blog/elastic-recognized-for-innovation-by-google-cloud-and-microsoft",
          "publishedOn": "2021-08-04T15:00:00.000Z",
          "wordCount": 684,
          "title": "Elastic recognized for innovation by Google Cloud and Microsoft"
        },
        {
          "id": "https://www.elastic.co/blog/whats-new-elastic-7-14-0",
          "author": "Steve Kearns,Angelos Kottas",
          "description": "We are pleased to announce the general availability (GA) of Elastic 7.14, including our Elastic Enterprise Search, Observability, and Security solutions, which are built into the Elastic Stack — Elasticsearch and Kibana. \n\nElastic 7.14 empowers organizations with the first free and open Limitless XDR, which delivers unified SIEM and endpoint security capabilities in one platform. \n\nThe latest release makes it even easier to manage and monitor data from a growing volume of diverse sources. With Elastic Agent, security practitioners benefit from integrated ransomware and malware prevention as well as remediation on all of their hosts. Users of Elastic Observability can get better visibility across their applications and infrastructure, as well as secure centralized agent management, with Ela…",
          "link": "https://www.elastic.co/blog/whats-new-elastic-7-14-0",
          "publishedOn": "2021-08-03T16:07:00.000Z",
          "wordCount": 1543,
          "title": "Elastic 7.14.0 introduces the industry’s first free and open Limitless XDR"
        },
        {
          "id": "https://www.elastic.co/blog/whats-new-elastic-security-7-14-0",
          "author": "Mark Settle",
          "description": "Elastic Security 7.14 introduces the industry’s first free and open Limitless XDR solution, unifying the capabilities of SIEM and endpoint security. It is made possible by the general availability of Elastic Agent, which helps equip it to prevent, detect, and respond to threats before adversaries can steal sensitive information or sabotage operations. Let’s dig into the best of what it brings.\nQuickly quarantine and inspect endpoints\nElastic Security 7.14 accelerates response by enabling analysts to invoke response actions with Elastic Agent. With the first native response action for Elastic Agent, host isolation, analysts can address malicious activity by quarantining a host from a network, containing the attack and preventing lateral movement to other hosts. Try it out with the Endpoint …",
          "link": "https://www.elastic.co/blog/whats-new-elastic-security-7-14-0",
          "publishedOn": "2021-08-03T16:06:00.000Z",
          "wordCount": 1096,
          "title": "What’s new in Elastic Security 7.14: Protect your company with Limitless XDR"
        },
        {
          "id": "https://www.elastic.co/blog/whats-new-elastic-observability-7-14-0",
          "author": "Amena Siddiqi",
          "description": "Elastic Observability 7.14 introduces the general availability of unified telemetry and centralized agent management with Elastic Agent and Fleet, enabling faster and simpler data onboarding, and reduced security risk, in addition to enhanced correlations for accelerated root cause analysis in Elastic APM. \n\nThese new features allow customers to:\n\nCollect all forms of data from anywhere with a single unified agent per host, with just one agent to install, configure, and scale\nDeploy endpoint security seamlessly across their infrastructure, bringing DevOps and security teams into greater convergence\nQuickly surface factors that have the most significant impact on service performance\nElastic Observability 7.14 is available now on Elastic Cloud — the only hosted Elasticsearch offering to incl…",
          "link": "https://www.elastic.co/blog/whats-new-elastic-observability-7-14-0",
          "publishedOn": "2021-08-03T16:05:00.000Z",
          "wordCount": 1113,
          "title": "Elastic Observability 7.14: Unified telemetry and accelerated application root cause analysis"
        },
        {
          "id": "https://www.elastic.co/blog/whats-new-elastic-enterprise-search-7-14-0",
          "author": "The Elastic Enterprise Search team",
          "description": "Elastic Enterprise Search 7.14 now lets you manage all your Elastic products from a single management interface, so you can navigate to App Search and Workplace Search from Kibana without losing your way.\n\nWe’re also delivering more flexibility and configurability with precision tuning in App Search and content source flexibility and synonym support in Workplace Search. With all these enhancements, you can set up your teams and customers to find what they’re looking for faster than ever:\n\nGenerate more search experience insights with Kibana’s powerful visualizations\nGain tighter customization over your search results with adjustable precision and recall\nConfigure how you want to ingest data with our out-of-the-box content sources\nCreate synonyms so teams can find information faster\nElastic…",
          "link": "https://www.elastic.co/blog/whats-new-elastic-enterprise-search-7-14-0",
          "publishedOn": "2021-08-03T16:04:00.000Z",
          "wordCount": 1122,
          "title": "What's new in Elastic Enterprise Search 7.14: Kibana integration and precision tuning"
        },
        {
          "id": "https://www.elastic.co/blog/whats-new-elastic-cloud-7-14-0",
          "author": "The Elastic Cloud Team",
          "description": "The latest updates to Elastic Cloud make it even easier for our customers to protect their data using Microsoft Azure Private Link, and offer new options for deployment location and hardware configuration in Google Cloud. \n \nNetwork security enhancements\n\nWe’re excited to announce that support for Microsoft Azure Private Link is now generally available. Private Link provides private connectivity from your Azure virtual network to your Elastic Cloud deployments. The traffic between your virtual network and your Elastic Cloud deployment on Azure travels only within the Azure network, utilizing Private Link endpoints and ensuring that your data stays off the Internet. Soon, you will also be able to leverage Google Cloud Private Service Connect to secure the network connection between your Goo…",
          "link": "https://www.elastic.co/blog/whats-new-elastic-cloud-7-14-0",
          "publishedOn": "2021-08-03T16:03:00.000Z",
          "wordCount": 659,
          "title": "What’s new in Elastic Cloud for 7.14: Connect securely to your public cloud environments with Azure Private Link"
        },
        {
          "id": "https://www.elastic.co/blog/whats-new-kibana-7-14-0",
          "author": "Adeline Tan",
          "description": "Kibana 7.14 introduces more capabilities for ad hoc analytics to enable users to cut through the noise and discover insights faster and more easily. \n\nThese new features include custom formulas and time-shifted metrics in Kibana Lens and a time slider in Elastic Maps–all without compromising speed. In addition:\n\nTime-shifted metrics and a time slider in Kibana Lens and Elastic Maps allow users to compare data from different time periods at a glance.\nCustom formulas in Kibana Lens and edit tools in Elastic Maps give users the creative freedom to author metrics and add to geo indices.\nElastic Agent, a unified agent for collecting data from multiple sources and protecting your data and hosts, is generally available. Users can choose from 100+ out-of-the-box integrations that are pre-loaded wi…",
          "link": "https://www.elastic.co/blog/whats-new-kibana-7-14-0",
          "publishedOn": "2021-08-03T16:02:00.000Z",
          "wordCount": 1348,
          "title": "What’s new in Kibana 7.14: Formulas and time shifts for richer ad hoc analysis"
        }
      ]
    },
    {
      "title": "Ansible Blog",
      "feedUrl": "https://www.ansible.com/blog/rss.xml",
      "siteUrl": "https://www.ansible.com/blog",
      "articles": [
        {
          "id": "https://www.ansible.com/blog/audit-your-vmware-vcenter-server-using-ansible",
          "author": "Gonéri Le Bouder",
          "description": "How you can use the modules available in Red Hat supported vmware.vmware_rest Ansible Content Collection to audit your vCenter Servers.",
          "link": "https://www.ansible.com/blog/audit-your-vmware-vcenter-server-using-ansible",
          "publishedOn": "2021-08-03T13:35:00.000Z",
          "wordCount": 1707,
          "title": "Audit your VMware vCenter Server using Ansible"
        }
      ]
    },
    {
      "title": "Azure DevOps Blog",
      "feedUrl": "https://devblogs.microsoft.com/devops/feed/",
      "siteUrl": "https://devblogs.microsoft.com/devops",
      "articles": [
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62215",
          "author": "Gloridel Morales",
          "description": "Today, we released Azure DevOps Server 2020.1.1 RTW. This is our final release of Azure DevOps Server 2020.1.1. You can directly install Azure DevOps Server 2020 Update 1.1 or upgrade from Azure DevOps Server 2020 or Team Foundation Server 2013 or newer.\nThe post Azure DevOps Server 2020.1.1 RTW now available appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azure-devops-server-2020-1-1-rtw-now-available/",
          "publishedOn": "2021-08-17T18:10:37.000Z",
          "wordCount": 1369,
          "title": "Azure DevOps Server 2020.1.1 RTW now available"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62081",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes Episode 51 – Deploy With ARM Templates with @shankuehn appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-episode-51-deploy-with-arm-templates-with-shankuehn/",
          "publishedOn": "2021-08-17T14:00:08.000Z",
          "wordCount": 1564,
          "title": "AzureFunBytes Episode 51 – Deploy With ARM Templates with @shankuehn"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62194",
          "author": "Jay Gordon",
          "description": "The top stories from the #AzureDevOps #community for 2021.08.13 are here!\nThe post Top Stories from the Microsoft DevOps Community – 2021.08.13 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-08-13/",
          "publishedOn": "2021-08-13T12:00:17.000Z",
          "wordCount": 1205,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.08.13"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62165",
          "author": "April Edwards",
          "description": "Developer Best Practices – YAML Exposure in your pipeline\nThe post Developer Best Practices – Structuring Your Repository for Static Web Apps appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/developer-best-practices-structuring-your-repository-for-static-web-apps/",
          "publishedOn": "2021-08-11T15:24:30.000Z",
          "wordCount": 1499,
          "title": "Developer Best Practices – Structuring Your Repository for Static Web Apps"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62180",
          "author": "Gloridel Morales",
          "description": "For the August patches, we are releasing fixes that impact our self-hosted product, Azure DevOps Server.\nFix build definition UI error.\nChanged browsing history to display files instead of the root repository.\nFix issue with email delivery jobs for some work item types.\nThe post August patches for Azure DevOps Server appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/august-patches-for-azure-devops-server/",
          "publishedOn": "2021-08-10T20:08:44.000Z",
          "wordCount": 1352,
          "title": "August patches for Azure DevOps Server"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62077",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes Episode 50 – Intro to @BicepLang with @adotfrank appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-episode-50-intro-to-biceplang-with-adotfrank/",
          "publishedOn": "2021-08-10T14:00:18.000Z",
          "wordCount": 1425,
          "title": "AzureFunBytes Episode 50 – Intro to @BicepLang with @adotfrank"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62155",
          "author": "Jay Gordon",
          "description": "It’s Friday, and every Friday we try to bring you the latest and greatest in content about DevOps. This week we dedicate this list of community posts to our lost friend, Abel Wang. Abel was always about elevating the community and helping others do their best.\nThe post Top Stories from the Microsoft DevOps Community – 2021.08.06 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-08-06/",
          "publishedOn": "2021-08-06T13:00:08.000Z",
          "wordCount": 1217,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.08.06"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61981",
          "author": "Jay Gordon",
          "description": "Last time, I showed you how to create a Cosmos DB account for your MongoDB data using an ARM template. This time, we’ll use the Azure Database Migration Service (DBMS) to migrate my data I have on a Virtual Machine into Cosmos DB.\nThe post AzureFunBytes Presents: Migrating Your Data – Migrate your MongoDB data to Cosmos DB appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-presents-migrating-your-data-migrate-your-mongodb-data-to-cosmos-db/",
          "publishedOn": "2021-08-05T15:00:23.000Z",
          "wordCount": 2604,
          "title": "AzureFunBytes Presents: Migrating Your Data – Migrate your MongoDB data to Cosmos DB"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=62072",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes Episode 49 – Intro to @Azure SQL with @StevenMurawski appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-episode-49-intro-to-azure-sql-with-stevenmurawski/",
          "publishedOn": "2021-08-03T14:00:39.000Z",
          "wordCount": 1417,
          "title": "AzureFunBytes Episode 49 – Intro to @Azure SQL with @StevenMurawski"
        }
      ]
    },
    {
      "title": "Discover Dev",
      "feedUrl": "https://www.discoverdev.io/rss.xml",
      "siteUrl": "http://discoverdev.io",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "http://feeds.feedburner.com/AmazonWebServicesBlog",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "ab1095ff6e13f6a555a78d4d5bb69e424da604a3",
          "author": "Ross Barich",
          "description": "AWS Heroes go above and beyond to share knowledge with the community and help others build better and faster on AWS. Last month we launched the AWS Heroes Content Library, a centralized place where Builders can find inspiration and learn from AWS Hero authored educational content including blogs, videos, slide presentations, podcasts, open source projects, […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/xhYbw-t0kDY/",
          "publishedOn": "2021-08-26T18:28:12.000Z",
          "wordCount": 1380,
          "title": "Announcing the latest AWS Heroes – August 2021"
        },
        {
          "id": "8a88d0376f1e7e50dc00438841148100887bbdaf",
          "author": "Channy Yun",
          "description": "Introduced at AWS re:Invent 2018, Amazon Textract is a machine learning service that automatically extracts text, handwriting and data from scanned documents that goes beyond simple optical character recognition (OCR) to identify, understand, and extract data from forms and tables. In the past few months, we introduced specialized support for processing invoices and receipts and […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/PeEIVdVuy9w/",
          "publishedOn": "2021-08-26T16:03:49.000Z",
          "wordCount": 1320,
          "title": "Amazon Textract Updates: Up to 32% Price Reduction in 8 AWS Regions and Up to 50% Reduction in Asynchronous Job Processing Times"
        },
        {
          "id": "67850536ae98d21f4ff66429ee314dfdad639c1c",
          "author": "Steve Roberts",
          "description": "Today, I’m happy to announce the availability of AWS Backup Audit Manager, a new feature of AWS Backup that helps you monitor and evaluate the compliance status of your backups to meet business and regulatory requirements, and enables you to generate reports that help demonstrate compliance to auditors and regulators. AWS Backup is a fully […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/Vn65TtQiSLo/",
          "publishedOn": "2021-08-24T13:50:02.000Z",
          "wordCount": 1836,
          "title": "Monitor, Evaluate, and Demonstrate Backup Compliance with AWS Backup Audit Manager"
        },
        {
          "id": "26d642d9945ef477f9a2c6443e79a0d085ddbfad",
          "author": "Jeff Barr",
          "description": "Fifteen years ago today I wrote the blog post that launched the Amazon EC2 Beta. As I recall, the launch was imminent for quite some time as we worked to finalize the feature set, the pricing model, and innumerable other details. The launch date was finally chosen and it happened to fall in the middle […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/rwO2ynXIqF8/",
          "publishedOn": "2021-08-23T15:09:54.000Z",
          "wordCount": 1739,
          "title": "Happy 15th Birthday Amazon EC2"
        },
        {
          "id": "c0f4c867c6984fe656087db346b578b038cd1735",
          "author": "Danilo Poccia",
          "description": "Interactive applications need to process requests and respond very quickly, and this requirement extends to all the components of their architecture. That is even more important when you adopt microservices and your architecture is composed of many small independent services that communicate with each other. For this reason, database performance is critical to the success […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/ubxMIL1QGYc/",
          "publishedOn": "2021-08-19T17:42:09.000Z",
          "wordCount": 2403,
          "title": "Introducing Amazon MemoryDB for Redis – A Redis-Compatible, Durable, In-Memory Database Service"
        },
        {
          "id": "f37eb47e4e2a70fab81aae10293c94725350cb8a",
          "author": "Danilo Poccia",
          "description": "Last year, we introduced the sixth generation of EC2 instances powered by AWS-designed Graviton2 processors. We’re now expanding our sixth-generation offerings to include x86-based instances, delivering price/performance benefits for workloads that rely on x86 instructions. Today, I am happy to announce the availability of the new general purpose Amazon EC2 M6i instances, which offer up to […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/LSIPPm7qjYU/",
          "publishedOn": "2021-08-16T21:27:10.000Z",
          "wordCount": 1068,
          "title": "New – Amazon EC2 M6i Instances Powered by the Latest-Generation Intel Xeon Scalable Processors"
        },
        {
          "id": "903ccd8fce8570d9ea1622cb7649dffac71ba65f",
          "author": "Martin Beeby",
          "description": "To be successful in today’s fast-moving world, businesses need to analyze data quickly and take meaningful action. Many of our customers embrace this concept to become data-driven organizations. Data-driven organizations treat data as an asset and use it to improve their insights and make better decisions. They unleash the power of data by using secure […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/6auMmTu8udw/",
          "publishedOn": "2021-08-13T16:38:16.000Z",
          "wordCount": 1681,
          "title": "Cross-Account Data Sharing for Amazon Redshift"
        },
        {
          "id": "2e1848a3c16dd182412ffc24ea189f3aa5a05a7c",
          "author": "Julien Simon",
          "description": "In 2017, we launched Amazon Transcribe, an automatic speech recognition (ASR) service that makes it easy to add speech-to-text capabilities to any application. Today, I’m very happy to announce the availability of Amazon Transcribe Call Analytics, a new feature that lets you easily extract valuable insights from customer conversations with a single API call. Each […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/u3VRBOAMpCM/",
          "publishedOn": "2021-08-04T18:06:17.000Z",
          "wordCount": 2066,
          "title": "Extract Insights From Customer Conversations with Amazon Transcribe Call Analytics",
          "enclosure": {
            "length": "826893",
            "type": "audio/mpeg",
            "url": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/07/20/demo-call.mp3"
          }
        },
        {
          "id": "446271ecb9bf93846c19f7d2d60e450dedd2456a",
          "author": "Danilo Poccia",
          "description": "In my job at AWS I have the privilege of working with many different teams, all focused to help our customers lower costs, become more agile, and innovate faster. It’s greatly rewarding to see these efforts recognized by our customers and by leading analysts. Last year Gartner introduced a new Magic Quadrant for Cloud Infrastructure […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/GuZ2U5msR-8/",
          "publishedOn": "2021-08-02T15:54:38.000Z",
          "wordCount": 870,
          "title": "AWS Named as a Leader for the 11th Consecutive Year in 2021 Gartner Magic Quadrant for Cloud Infrastructure & Platform Services (CIPS)"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/atom.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2508/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/circumappendiceal_somectomy.png\" title=\"Some personal news: After treating my first case a few years ago with antibiotics, I can report that I have now had appendicitis for the second and--unless something extremely unexpected happened with the surgery--final time.\" alt=\"Some personal news: After treating my first case a few years ago with antibiotics, I can report that I have now had appendicitis for the second and--unless something extremely unexpected happened with the surgery--final time.\" />",
          "link": "https://xkcd.com/2508/",
          "publishedOn": "2021-08-27T00:00:00.000Z",
          "wordCount": 185,
          "title": "Circumappendiceal Somectomy"
        },
        {
          "id": "https://xkcd.com/2507/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/usv_c.png\" title=\"Ultra-Serial Violet C light is unpolarized, so you don't have to flip the polarizing filter over when you get the orientation wrong the first time.\" alt=\"Ultra-Serial Violet C light is unpolarized, so you don't have to flip the polarizing filter over when you get the orientation wrong the first time.\" />",
          "link": "https://xkcd.com/2507/",
          "publishedOn": "2021-08-25T00:00:00.000Z",
          "wordCount": 183,
          "title": "USV-C"
        },
        {
          "id": "https://xkcd.com/2506/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/projecting.png\" title=\"This is something we all need to work on, but especially you all.\" alt=\"This is something we all need to work on, but especially you all.\" />",
          "link": "https://xkcd.com/2506/",
          "publishedOn": "2021-08-23T00:00:00.000Z",
          "wordCount": 183,
          "title": "Projecting"
        },
        {
          "id": "https://xkcd.com/2505/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/news_story_reaction.png\" title=\"Unless the next line is, &quot;After we broke up, she blamed the painting and spent years planning her revenge, so my sorrow is mixed with relief that the dogs at least denied her that triumph.&quot;\" alt=\"Unless the next line is, &quot;After we broke up, she blamed the painting and spent years planning her revenge, so my sorrow is mixed with relief that the dogs at least denied her that triumph.&quot;\" />",
          "link": "https://xkcd.com/2505/",
          "publishedOn": "2021-08-20T00:00:00.000Z",
          "wordCount": 187,
          "title": "News Story Reaction"
        }
      ]
    },
    {
      "title": "Software Engineering Daily",
      "feedUrl": "https://softwareengineeringdaily.com/feed/podcast/",
      "siteUrl": "https://softwareengineeringdaily.com/archives/",
      "articles": [
        {
          "id": "https://softwareengineeringdaily.com/?p=11488",
          "author": null,
          "description": "Shinji Kim is Founder and CEO of Select Star. In this episode we discuss data discovery and more. This interview was also recorded as a video podcast. Check out the video on the Software Daily YouTube channel. Sponsorship inquiries: sponsor@softwareengineeringdaily.com\nThe post Data Discovery with Shinji Kim appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/27/data-discovery-with-shinji-kim/?utm_source=rss&utm_medium=rss&utm_campaign=data-discovery-with-shinji-kim",
          "publishedOn": "2021-08-27T09:00:14.000Z",
          "wordCount": null,
          "title": "Data Discovery with Shinji Kim",
          "itunes": {
            "duration": "1:27:25"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED5199899172.mp3",
            "length": "83962294",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11487",
          "author": null,
          "description": "ETL stands for “extract, transform, load” and refers to the process of integrating data from many different sources into one location, usually a data warehouse. This process has become especially important for companies as they use many different services to collect and manage data.  The company Grouparoo provides an open source framework that helps you\nThe post Grouparoo Open Source Data Tools with Brian Leonard appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/26/grouparoo-open-source-data-tools-with-brian-leonard/?utm_source=rss&utm_medium=rss&utm_campaign=grouparoo-open-source-data-tools-with-brian-leonard",
          "publishedOn": "2021-08-26T09:00:13.000Z",
          "wordCount": null,
          "title": "Grouparoo Open Source Data Tools with Brian Leonard",
          "itunes": {
            "duration": "50:55"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED3753719230.mp3",
            "length": "48916054",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11486",
          "author": null,
          "description": "In the late 1970s a printer at MIT kept jamming, resulting in regular pileups of print jobs in the printer’s queue. To solve this problem, some computer scientists wrote a software program that alerted every user in the backed up queue “The printer is jammed, please fix it.” When a man named Richard Stallmen was\nThe post Publishing Open Source Code with William Morgan appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/25/publishing-open-source-code-with-william-morgan/?utm_source=rss&utm_medium=rss&utm_campaign=publishing-open-source-code-with-william-morgan",
          "publishedOn": "2021-08-25T09:00:03.000Z",
          "wordCount": null,
          "title": "Publishing Open Source Code with William Morgan",
          "itunes": {
            "duration": "1:00:33"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED2155281547.mp3",
            "length": "58163405",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11485",
          "author": null,
          "description": "Google uses automated programs called spiders, or crawlers, to index and rank web pages. Then, when a user searches for something, it uses a special algorithm to determine the order of results to display (howstuffworks). This process, of course, applies to web pages on the internet. There are 2 major projects, worked on by the\nThe post Cloud Blockchains: The Google of Blockchain with Nader Dabit appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/24/cloud-blockchains-the-google-of-blockchain-with-nader-dabit/?utm_source=rss&utm_medium=rss&utm_campaign=cloud-blockchains-the-google-of-blockchain-with-nader-dabit",
          "publishedOn": "2021-08-24T09:00:53.000Z",
          "wordCount": null,
          "title": "Cloud Blockchains: The Google of Blockchain with Nader Dabit",
          "itunes": {
            "duration": "1:16:27"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED9943731416.mp3",
            "length": "73432086",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11478",
          "author": null,
          "description": "Application security is usually done with a set of tools and services known as SIEM – Security Information and Event Management. SIEM tools usually try to provide visibility into an organization’s security systems, as well as event log management and security event notifications.  The company Panther takes traditional SIEM security a step further. Panther processes\nThe post Panther: Security as Code with Jack Naglieri appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/23/panther-security-as-code-with-jack-naglieri/?utm_source=rss&utm_medium=rss&utm_campaign=panther-security-as-code-with-jack-naglieri",
          "publishedOn": "2021-08-23T19:09:44.000Z",
          "wordCount": null,
          "title": "Panther: Security as Code with Jack Naglieri",
          "itunes": {
            "duration": "47:18"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED5018835007.mp3",
            "length": "45456881",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11475",
          "author": null,
          "description": "Audible is a non-functional product and I’m taking their market with a new kind of audio product.\nThe post Audible dot con appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/22/audible-dot-con/?utm_source=rss&utm_medium=rss&utm_campaign=audible-dot-con",
          "publishedOn": "2021-08-22T15:41:05.000Z",
          "wordCount": null,
          "title": "Audible dot con",
          "itunes": {
            "duration": "57:25"
          },
          "enclosure": {
            "url": "https://s3-us-west-2.amazonaws.com/sd-profile-pictures/adfree/Music_adfree.mp3",
            "length": "110237491",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11472",
          "author": null,
          "description": "“In October 1958, Physicist William Higinbotham created what is thought to be the first video game. It was a very simple tennis game, similar to the classic 1970s video game Pong, and it was quite a hit at a Brookhaven National Laboratory open house” (aps.org). 63 years have passed, and video games are prolific. The\nThe post Pragma: Video Games with Eden Chen appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/20/pragma-video-games-with-eden-chen/?utm_source=rss&utm_medium=rss&utm_campaign=pragma-video-games-with-eden-chen",
          "publishedOn": "2021-08-20T09:00:30.000Z",
          "wordCount": null,
          "title": "Pragma: Video Games with Eden Chen",
          "itunes": {
            "duration": "58:55"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED2257879477.mp3",
            "length": "56595493",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11450",
          "author": null,
          "description": "Time series data are simply measurements or events that are tracked, monitored, downsampled, and aggregated over time. This could be server metrics, application performance monitoring, network data, sensor data, events, clicks, trades in a market, and many other types of analytics data (influxdata.com). The platform InfluxData is designed for building and operating time series applications.\nThe post InfluxData: Time-Series Data with Russ Savage appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/19/influxdata-time-series-data-with-russ-savage/?utm_source=rss&utm_medium=rss&utm_campaign=influxdata-time-series-data-with-russ-savage",
          "publishedOn": "2021-08-19T17:09:30.000Z",
          "wordCount": null,
          "title": "InfluxData: Time-Series Data with Russ Savage",
          "itunes": {
            "duration": "43:55"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED1043165870.mp3",
            "length": "42195358",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11449",
          "author": null,
          "description": "Domain names are the address of your website that people type into the browser URL bar. Once purchased, a domain name is stored on your behalf by custodians like Google domains. Blockchain domains, on the other hand, are similar to regular domain names except they are stored and controlled in your cryptocurrency wallet. The company\nThe post Unstoppable Domains: Blockchain Domains with Matthew Gould appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/18/unstoppable-domains-blockchain-domains-with-matthew-gould/?utm_source=rss&utm_medium=rss&utm_campaign=unstoppable-domains-blockchain-domains-with-matthew-gould",
          "publishedOn": "2021-08-18T09:00:26.000Z",
          "wordCount": null,
          "title": "Unstoppable Domains: Blockchain Domains with Matthew Gould",
          "itunes": {
            "duration": "51:18"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED4380018449.mp3",
            "length": "49282594",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11448",
          "author": null,
          "description": "Pay-as-you-go pricing has become a strong selling point for modern SaaS companies as well as cloud-based companies. Public cloud providers, for example, typically only charge you for only what you use. But implementing this option is challenging because it requires advanced platform analytics. The company Octane is a drop-in metered billing system that gives you\nThe post getoctane.io: Pay-As-You-Go Pricing with Akash Khanolkar appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/17/octane-io-pay-as-you-go-pricing-with-akash-khanolkar/?utm_source=rss&utm_medium=rss&utm_campaign=octane-io-pay-as-you-go-pricing-with-akash-khanolkar",
          "publishedOn": "2021-08-17T09:00:24.000Z",
          "wordCount": null,
          "title": "getoctane.io: Pay-As-You-Go Pricing with Akash Khanolkar",
          "itunes": {
            "duration": "1:16:32"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED1928379818.mp3",
            "length": "73521406",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11447",
          "author": null,
          "description": "Whether sending messages, shopping in an app, or watching videos, modern consumers expect information and responsiveness to be near-instant in their apps and devices. From a developer’s perspective, this means clean code and a fast database.  Apache Druid is a database built to power real-time analytic workloads for event-driven data, like user-facing applications, streaming, and\nThe post Druid: Event-Driven Data with Eric Tschetter appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/16/druid-event-driven-data-with-eric-tschetter/?utm_source=rss&utm_medium=rss&utm_campaign=druid-event-driven-data-with-eric-tschetter",
          "publishedOn": "2021-08-16T09:00:22.000Z",
          "wordCount": null,
          "title": "Druid: Event-Driven Data with Eric Tschetter",
          "itunes": {
            "duration": "56:26"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED6908668584.mp3",
            "length": "54210337",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11445",
          "author": null,
          "description": "This episode was published on the GeekWire podcast. Subscribe to GeekWire for more great content. Facebook CEO Mark Zuckerberg told employees recently that the company’s long-term goal is to “bring the metaverse to life” — helping to create an interconnected world of physical, virtual and augmented reality spaces that will reshape the way we work, interact with\nThe post How Facebook Works: Comparing its Engineering Process to Google, Microsoft, and Amazon appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/14/how-facebook-works-comparing-its-engineering-process-to-google-microsoft-and-amazon/?utm_source=rss&utm_medium=rss&utm_campaign=how-facebook-works-comparing-its-engineering-process-to-google-microsoft-and-amazon",
          "publishedOn": "2021-08-14T09:00:20.000Z",
          "wordCount": null,
          "title": "How Facebook Works: Comparing its Engineering Process to Google, Microsoft, and Amazon",
          "itunes": {
            "duration": "32:06"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED1720536971.mp3",
            "length": "30860781",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11436",
          "author": null,
          "description": "Auren Hoffman is the CEO of SafeGraph. In this episode we discuss data as a service and more. This interview was also recorded as a video podcast. Check out the video on the Software Daily YouTube channel. Sponsorship inquiries: sponsor@softwareengineeringdaily.com\nThe post DaaS with Auren Hoffman appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/13/daas-with-auren-hoffman/?utm_source=rss&utm_medium=rss&utm_campaign=daas-with-auren-hoffman",
          "publishedOn": "2021-08-13T09:00:25.000Z",
          "wordCount": null,
          "title": "DaaS with Auren Hoffman",
          "itunes": {
            "duration": "1:47:58"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED4822052713.mp3",
            "length": "103687829",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11403",
          "author": null,
          "description": "Serverless computing is a cloud computing solution that lets developers deploy applications to containers without managing the servers themselves. Servers and resources are provisioned automatically, pay only for what you use, and experience little to no errors or downtime (ionos). Google Cloud Run is a managed compute platform that enables you to run containers that\nThe post Cloud Run: Serverless Applications with Steren Giannini appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/12/cloud-run-serverless-applications-with-steren-giannini/?utm_source=rss&utm_medium=rss&utm_campaign=cloud-run-serverless-applications-with-steren-giannini",
          "publishedOn": "2021-08-12T09:00:36.000Z",
          "wordCount": null,
          "title": "Cloud Run: Serverless Applications with Steren Giannini",
          "itunes": {
            "duration": "46:45"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED9778839125.mp3",
            "length": "44925173",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11405",
          "author": null,
          "description": "According to Fugue’s new State of Cloud Security 2020 report, cloud misconfiguration remains the top cause of data breaches in the cloud, and millions of database servers are currently exposed across cloud providers. Some of the leading reasons are a lack of adequate oversight and too many APIs and interfaces to govern. (securityaffairs.co).  Argos Security\nThe post Argos Security: Cloud Configuration Security with David O’Brien appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/11/argos-security-cloud-configuration-security-with-david-obrien/?utm_source=rss&utm_medium=rss&utm_campaign=argos-security-cloud-configuration-security-with-david-obrien",
          "publishedOn": "2021-08-11T09:00:44.000Z",
          "wordCount": null,
          "title": "Argos Security: Cloud Configuration Security with David O’Brien",
          "itunes": {
            "duration": "48:07"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED1458313249.mp3",
            "length": "46240198",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11425",
          "author": null,
          "description": "Stackblitz CEO Eric Simons and Jeff Meyerson discuss a serious vulnerability in React.   Also available on Dropbox, please download this. https://www.dropbox.com/s/9u0m52xj04vqggc/React%20Vulnerability%20with%20Eric%20Simons.mp3?dl=0\nThe post React Vulnerability with Eric Simons appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/10/react-vulnerability-with-eric-simons/?utm_source=rss&utm_medium=rss&utm_campaign=react-vulnerability-with-eric-simons",
          "publishedOn": "2021-08-10T22:50:10.000Z",
          "wordCount": null,
          "title": "React Vulnerability with Eric Simons",
          "itunes": {
            "duration": "53:27"
          },
          "enclosure": {
            "url": "http://softwareengineeringdaily.com/wp-content/uploads/2021/08/React-Vulnerability-with-Eric-Simons.mp3",
            "length": "25660313",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11404",
          "author": null,
          "description": "Latency is the time it takes to get from point A to point B. In programming, this might be the time from a user selecting their photos library to the pictures reaching their computer screen from the database.  Fly.io is a simple platform for running full-stack apps and databases close to your users. Some available\nThe post Fly.io: Geographic App Deployment with Kurt Mackey appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/10/fly-io-geographic-app-deployment-with-kurt-mackey/?utm_source=rss&utm_medium=rss&utm_campaign=fly-io-geographic-app-deployment-with-kurt-mackey",
          "publishedOn": "2021-08-10T20:14:16.000Z",
          "wordCount": null,
          "title": "Fly.io: Geographic App Deployment with Kurt Mackey",
          "itunes": {
            "duration": "1:02:48"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED8989461280.mp3",
            "length": "60331011",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11402",
          "author": null,
          "description": "Direct-to-Consumer companies sell their products without going through a traditional middleman like an outlet store or wholesaler. By posting content on platforms like TikTok, Facebook, and YouTube, companies can reach millions of users.TikTok, for example, has an estimated 1 billion monthly active users (wallaroomedia). The company Kindred Studios helps direct-to-consumer companies create consistent, beautiful content\nThe post DTC: Content Creation with Daniel Snow appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/09/dtc-content-creation-with-daniel-snow/?utm_source=rss&utm_medium=rss&utm_campaign=dtc-content-creation-with-daniel-snow",
          "publishedOn": "2021-08-09T19:58:33.000Z",
          "wordCount": null,
          "title": "DTC: Content Creation with Daniel Snow",
          "itunes": {
            "duration": "49:47"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED7399136436.mp3",
            "length": "47839399",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11347",
          "author": null,
          "description": "Ryan Noon is the CEO of Material Security.   This interview was also recorded as a video podcast. Check out the video on the Software Daily YouTube channel.   Sponsorship inquiries: sponsor@softwareengineeringdaily.com\nThe post Material Security with Ryan Noon appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/06/material-security-with-ryan-noon/?utm_source=rss&utm_medium=rss&utm_campaign=material-security-with-ryan-noon",
          "publishedOn": "2021-08-06T09:00:40.000Z",
          "wordCount": null,
          "title": "Material Security with Ryan Noon",
          "itunes": {
            "duration": "55:50"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED2553206461.mp3",
            "length": "53645076",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11340",
          "author": null,
          "description": "The term “boilerplate code” refers to code sections that are repeated across many projects with little to no variation. Every developer is familiar with boilerplate code, whether it be pom.xml files in Java or setting up React.js applications, tweaking boilerplate code for every project is inevitable. Actually, the company Wasp believes writing boilerplate code doesn’t\nThe post Wasp-Lang: Boilerplate Code with Matija Sosic appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/05/wasp-lang-boilerplate-code-with-matija-sosic/?utm_source=rss&utm_medium=rss&utm_campaign=wasp-lang-boilerplate-code-with-matija-sosic",
          "publishedOn": "2021-08-05T19:09:01.000Z",
          "wordCount": null,
          "title": "Wasp-Lang: Boilerplate Code with Matija Sosic",
          "itunes": {
            "duration": "57:37"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED2087579873.mp3",
            "length": "55347722",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11338",
          "author": null,
          "description": "Kubernetes is an open-source container orchestration system. It makes managing container clusters possible as well as deploying code changes to these containers. Microservice architecture is widely used today in large part because of Kubernetes. However, using it can require a large time commitment due to its learning curve. The company Okteto empowers developers to innovate\nThe post Okteto: Cloud-Native Applications on Kubernetes with Ramiro Berreleza appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/04/okteto-with-ramiro-berreleza/?utm_source=rss&utm_medium=rss&utm_campaign=okteto-with-ramiro-berreleza",
          "publishedOn": "2021-08-04T09:00:21.000Z",
          "wordCount": null,
          "title": "Okteto: Cloud-Native Applications on Kubernetes with Ramiro Berreleza",
          "itunes": {
            "duration": "1:01:28"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED1276535672.mp3",
            "length": "59042576",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11339",
          "author": null,
          "description": "Blockchain protocols like Bitcoin and Ethereum have changed the cyber world dramatically in the last decade. They’ve created communities of like-minded developers, generated new financial markets, and popularized “decentralization” in computer networks. However, they require large resources to operate which makes scaling difficult and transactions expensive. Hedera is a decentralized public network that takes the\nThe post Hedera Hashgraph: Proof-of-Stake Public Networks with Leemon Baird appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/03/hedera-hashgraph-with-leemon-baird/?utm_source=rss&utm_medium=rss&utm_campaign=hedera-hashgraph-with-leemon-baird",
          "publishedOn": "2021-08-03T09:00:22.000Z",
          "wordCount": null,
          "title": "Hedera Hashgraph: Proof-of-Stake Public Networks with Leemon Baird",
          "itunes": {
            "duration": "53:03"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED5692476562.mp3",
            "length": "50977833",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11237",
          "author": null,
          "description": "Enterprise data warehouses store all company data in a single place to be accessed, queried, and analyzed. They’re essential for business operations because they support managing data from multiple sources, providing context, and have built-in analytics tools. While keeping a single source of truth is important, easily moving data from the warehouse to other applications\nThe post Reverse ETL: Operationalizing Data Warehouses with Tejas Manohar appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/08/02/reverse-etl-operationalizing-data-warehouses-with-tejas-manojar/?utm_source=rss&utm_medium=rss&utm_campaign=reverse-etl-operationalizing-data-warehouses-with-tejas-manojar",
          "publishedOn": "2021-08-02T09:00:37.000Z",
          "wordCount": null,
          "title": "Reverse ETL: Operationalizing Data Warehouses with Tejas Manohar",
          "itunes": {
            "duration": "1:02:16"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED6127076779.mp3",
            "length": "59815652",
            "type": "audio/mpeg"
          }
        }
      ]
    },
    {
      "title": "Camunda",
      "feedUrl": "https://camunda.com/feed/",
      "siteUrl": "https://camunda.com",
      "articles": [
        {
          "id": "https://camunda.com/?p=27670",
          "author": "Jakob Freund",
          "description": "Instead of dramatic, rip-and-replace events, Camunda CEO Jakob Freund describes how gradual digital transformation can be a more practical and strategic path to automation.\nThe post The Art of Gradual Digital Transformation appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/08/the-art-of-gradual-digital-transformation/",
          "publishedOn": "2021-08-26T16:57:46.000Z",
          "wordCount": 1255,
          "title": "The Art of Gradual Digital Transformation"
        },
        {
          "id": "https://camunda.com/?p=27174",
          "author": "Nele Uhlemann",
          "description": "Camunda Platform and Camunda Cloud are “same same, but different.” Find out the similarities and differences of these workflow engines.\nThe post Same Same, But Different (Workflow Engines) appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/08/same-same-but-different-workflow-engines/",
          "publishedOn": "2021-08-23T14:00:01.000Z",
          "wordCount": 2549,
          "title": "Same Same, But Different (Workflow Engines)"
        },
        {
          "id": "https://camunda.com/?p=27320",
          "author": "Camunda Team",
          "description": "All automation tools are not created equal. It’s important that you choose the right tool for the job.\nThe post How to Choose a Process Automation Tool appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/08/how-to-choose-a-process-automation-tool/",
          "publishedOn": "2021-08-20T19:29:42.000Z",
          "wordCount": 1721,
          "title": "How to Choose a Process Automation Tool"
        },
        {
          "id": "https://camunda.com/?p=26096",
          "author": "Camunda Team",
          "description": "The latest episode of the Camunda Nation podcast is live. Join us on a journey through the BPMN Diagram to find your ideal Camunda Platform architecture. \nThe post Podcast: What Camunda Platform Architecture Are You? appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/08/podcast-what-camunda-platform-architecture-are-you/",
          "publishedOn": "2021-08-16T14:08:25.000Z",
          "wordCount": 1307,
          "title": "Podcast: What Camunda Platform Architecture Are You?"
        },
        {
          "id": "https://camunda.com/?p=26961",
          "author": "Camunda Team",
          "description": "With Kubernetes being pretty ubiquitous today, we decided it was time to help you deploy Camunda Platform on Kubernetes in a snap, so we created the Community Helm Chart.\nThe post Releasing Camunda Platform Community Helm Chart appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/08/releasing-camunda-platform-community-helm-chart/",
          "publishedOn": "2021-08-13T13:19:27.000Z",
          "wordCount": 2097,
          "title": "Releasing Camunda Platform Community Helm Chart"
        },
        {
          "id": "https://camunda.com/?p=26973",
          "author": "Gottfried Sehringer",
          "description": "We’re excited to share two new keynote speakers who we just added to our CamundaCon 2021 agenda, each of whom will be leading important discussions related to process automation. \nThe post CamundaCon 2021 Keynotes Revealed: Angie Jones & Hannah Fry appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/08/camundacon-2021-keynotes-revealedangie-jones-hannah-fry/",
          "publishedOn": "2021-08-12T14:00:00.000Z",
          "wordCount": 1477,
          "title": "CamundaCon 2021 Keynotes Revealed: Angie Jones & Hannah Fry"
        },
        {
          "id": "https://camunda.com/?p=26270",
          "author": "Camunda BPM Team",
          "description": "We are happy to announce the fourth alpha release of Camunda Platform Runtime 7.16. This release features improvements such as Initial Quarkus 2.0 support, Liquibase support and 8 bug fixes.\nThe post Camunda Platform Runtime 7.16.0-alpha4 Release appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/08/camunda-platform-runtime-7160-alpha4-released/",
          "publishedOn": "2021-08-10T08:59:18.000Z",
          "wordCount": 1722,
          "title": "Camunda Platform Runtime 7.16.0-alpha4 Release"
        },
        {
          "id": "https://camunda.com/?p=26530",
          "author": "Camunda Team",
          "description": "We’re excited to announce the release of Camunda Optimize 3.6.0-alpha1. Discover the highlights of the new capabilities introduced in Optimize 3.6.0-alpha1.\nThe post Camunda Optimize 3.6.0-alpha1 Release appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/08/camunda-optimize-3-6-0-alpha1-release/",
          "publishedOn": "2021-08-10T08:00:12.000Z",
          "wordCount": 1607,
          "title": "Camunda Optimize 3.6.0-alpha1 Release"
        },
        {
          "id": "https://camunda.com/?p=26526",
          "author": "Camunda Cloud Team",
          "description": "We’re excited to announce the release of Camunda Cloud 1.2.0-alpha1, the first alpha release for our next stable minor release in October. \nThe post Camunda Cloud 1.2.0-alpha1 Release appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/08/camunda-cloud-1-2-0-alpha1-release/",
          "publishedOn": "2021-08-10T07:00:03.000Z",
          "wordCount": 1502,
          "title": "Camunda Cloud 1.2.0-alpha1 Release"
        },
        {
          "id": "https://camunda.com/?p=25892",
          "author": "Christopher Rogers",
          "description": "When Forrester Consulting spoke to six longtime Camunda Platform users, they learned how they’re delivering process automation projects faster, driving organizational efficiency and better customer service with massive, multi-million dollar impact to the business. Download the Total Economic Impact study commissioned by Camunda. \nThe post A Compelling ROI Case for Camunda appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/08/a-compelling-roi-case-for-camunda/",
          "publishedOn": "2021-08-04T08:00:06.000Z",
          "wordCount": 1365,
          "title": "A Compelling ROI Case for Camunda"
        }
      ]
    },
    {
      "title": "となりのヤングジャンプ（ワンパンマン）",
      "feedUrl": "https://tonarinoyj.jp/rss/series/13932016480028984490",
      "siteUrl": "https://tonarinoyj.jp/episode/13932016480028985383",
      "articles": [
        {
          "id": "tonarino_yj:episode:3269754496462105179",
          "author": "原作/ＯＮＥ/漫画/村田雄介",
          "description": "ワンパンマン",
          "link": "https://tonarinoyj.jp/episode/3269754496462105179",
          "publishedOn": "2021-08-23T15:00:00.000Z",
          "wordCount": 98,
          "title": "[第152話] ワンパンマン",
          "enclosure": {
            "url": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/3269754496462105179-ce968165f07f3621548bc20c299f8d66",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "tonarino_yj:episode:3269754496438639193",
          "author": "原作/ＯＮＥ/漫画/村田雄介",
          "description": "ワンパンマン",
          "link": "https://tonarinoyj.jp/episode/3269754496438639193",
          "publishedOn": "2021-08-08T15:00:00.000Z",
          "wordCount": 98,
          "title": "[第151話] ワンパンマン",
          "enclosure": {
            "url": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/3269754496438639193-d93a0ed09bef60833401223670dad586",
            "length": "0",
            "type": "image/jpeg"
          }
        }
      ]
    }
  ],
  "cliVersion": "1.11.0"
}