{
  "sources": [
    {
      "title": "Spring",
      "feedUrl": "https://spring.io/blog.atom",
      "siteUrl": "https://spring.io/blog",
      "articles": [
        {
          "id": "https://spring.io/blog/2021/06/14/spring-native-0-10-0-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Native 0.10.0 has been released. It is based on Spring Boot 2.5 and GraalVM 21.1.\n\r\n\r\n\r\nThis release is packed with features, highlights include:\n\r\n\r\n\r\n\r\n\r\nIntroduction of native testing.\n\r\n\r\n\r\nA new official Gradle plugin from the GraalVM team.\n\r\n\r\n\r\nIntroduction of ahead-of-time proxies usable on classes.\n\r\n\r\n\r\n\r\n\r\nIt also includes 43 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\n\r\n\r\n\r\nJosh Long has crafted a great video to present those new features, so check this out:\n\r\n\r\n\r\n\r\nNative testing and Gradle plugin\n\r\n\r\n\r\nWe have been collaborating with the GraalVM team on bringing native image to the next lev…",
          "link": "https://spring.io/blog/2021/06/14/spring-native-0-10-0-available-now",
          "publishedOn": "2021-06-14T15:11:00.000Z",
          "wordCount": 936,
          "title": "Spring Native 0.10.0 available now"
        },
        {
          "id": "https://spring.io/blog/2021/06/10/a-bootiful-podcast-redgate-technical-lead-for-the-flyway-team-mikiel-agutu-on-database-migrations-and-continuous-delivery",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks to Mikiel Agutu, technical lead for the Flyway team at Redgate software about database migrations and continuous delivery.",
          "link": "https://spring.io/blog/2021/06/10/a-bootiful-podcast-redgate-technical-lead-for-the-flyway-team-mikiel-agutu-on-database-migrations-and-continuous-delivery",
          "publishedOn": "2021-06-10T22:00:00.000Z",
          "wordCount": 439,
          "title": "A Bootiful Podcast: Redgate technical lead for the Flyway team Mikiel Agutu on database migrations and continuous delivery"
        },
        {
          "id": "https://spring.io/blog/2021/06/10/spring-boot-2-5-1-is-now-available",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.5.1 has been released and is now available from Maven Central.\n\r\nThis release includes about 70 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/06/10/spring-boot-2-5-1-is-now-available",
          "publishedOn": "2021-06-10T19:00:00.000Z",
          "wordCount": 493,
          "title": "Spring Boot 2.5.1 is now available"
        },
        {
          "id": "https://spring.io/blog/2021/06/10/spring-boot-2-4-7-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.4.7 has been released and is now available from Maven Central.\n\r\nThis release includes 36 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/06/10/spring-boot-2-4-7-available-now",
          "publishedOn": "2021-06-10T12:51:46.000Z",
          "wordCount": 490,
          "title": "Spring Boot 2.4.7 available now"
        },
        {
          "id": "https://spring.io/blog/2021/06/10/spring-boot-2-3-12-release-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.3.12.RELEASE has been released and is now available from Maven Central.\n\r\nThis release includes 26 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/06/10/spring-boot-2-3-12-release-available-now",
          "publishedOn": "2021-06-10T12:27:40.000Z",
          "wordCount": 490,
          "title": "Spring Boot 2.3.12.RELEASE available now"
        },
        {
          "id": "https://spring.io/blog/2021/06/09/spring-framework-5-3-8-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I am pleased to announce that Spring Framework 5.3.8 is available now.\n\r\nSpring Framework 5.3.8 includes 35 fixes and improvements. \n\r\nStay tuned for follow-up Spring Boot releases later this week.\n\r\nProject Page | GitHub | Issues | Documentation",
          "link": "https://spring.io/blog/2021/06/09/spring-framework-5-3-8-available-now",
          "publishedOn": "2021-06-09T09:57:00.000Z",
          "wordCount": 433,
          "title": "Spring Framework 5.3.8 available now"
        },
        {
          "id": "https://spring.io/blog/2021/06/08/this-week-in-spring-june-8th-2021",
          "author": null,
          "description": "Hi, Spring fans! What’s shaking? It’s one of those weeks where, even though the thing I wanted to happen - a vacation with the family - didn’t happen, what did happen - accidentally lots of free time with no meetings - has turned out wonderfully. It was all I could do to pry myself from the IDE to pull together this week’s roundup, but I am glad I did! There’s a ton of great stuff there. Let’s dive into it.\n\r\n\r\n  \nI love this post by the good Dr. David Syer: “Wiremock” for RSocket\n\r\n  \nIn this week’s installment of A Bootiful Podcast, JHipster creator and Microsoft Java Developer Advocacy manager Julien Dubois\n\r\n  \nKotlin 1.5.0 Release Community Event\n\r\n  \nThis is super interesting: OpenJDK on RISC-V - an update from Alibaba\n\r\n  \nTo all the readers of my little book so far: Thank you! Schiko on Twitter: “Reactive Spring” by @starbuxman is without a doubt the best programming book i’ve ever read. Thanks Josh! https://t.co/nAzdK4kNyn #springboot #Java\" / Twitter\n\r\n  \nSpring Integration AWS 2.5.1 and Spring Cloud Stream Kinesis Binder 2.2.0 Available\n\r\n  \nThe presentation that Brian Sam Bodden and I did for RedisConf - “An application framework worthy of Redis” - is now available on YouTube! Check it out!\n\r\n  \nWhat’s new with content at VMworld 2021?\n\r\n  \nagschnitzer/multitenant: Multi-Tenant Spring Boot Application using Hibernate and H2\n\r\n  \nGot 30 minutes? Learn how to propel Java applications into the future with @AzureCosmosDB, a fast NoSQL database with open APIs for any scale! Start learning",
          "link": "https://spring.io/blog/2021/06/08/this-week-in-spring-june-8th-2021",
          "publishedOn": "2021-06-09T06:46:00.000Z",
          "wordCount": 637,
          "title": "This Week in Spring - June 8th, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/06/04/spring-integration-aws-2-5-1-and-spring-cloud-stream-kinesis-binder-2-2-0-available",
          "author": null,
          "description": "Dear Spring Community,\n\r\n\r\n\r\nToday it’s my pleasure to announce releases of Spring Integration for Amazon Web Services extension versions 2.5.1 and Spring Cloud Stream Binder for AWS Kinesis 2.2.0.\n\r\n\r\n\r\nThese releases can be downloaded from Maven Central:\n\r\n\r\n\r\n\r\ncompile 'org.springframework.integration:spring-integration-aws:2.5.1'\n\r\n\r\n\r\n\r\nIf you don’t use Kinesis Binder.\r\nOr via Binder dependency:\n\r\n\r\n\r\n\r\ncompile 'org.springframework.cloud:spring-cloud-stream-binder-kinesis:2.2.0'\n\r\n\r\n\r\n\r\nSpring Integration for AWS extension of 2.5.1 has some minor bug fixes after the previous 2.5.0 announcement.\n\r\n\r\n\r\nThe Spring Cloud Stream Binder for AWS Kinesis 2.2.0 is the first release in the project generation which is based on a new independent Spring Cloud for AWS artifact. It also was upgraded to the latest Spring Cloud 2020.0.3 and has some other bug fixes and improvements.\n\r\n\r\n\r\nAny feedback is welcome via all the available communication channels!\n\r\n\r\n\r\nSpring Integration for AWS resources:\n\r\n\r\n\r\nProject Page | Contributing | Help | Chat\n\r\n\r\n\r\nSpring Cloud Stream Binder for AWS Kinesis resources:\n\r\n\r\n\r\nProject Page | Contributing | Help | Chat",
          "link": "https://spring.io/blog/2021/06/04/spring-integration-aws-2-5-1-and-spring-cloud-stream-kinesis-binder-2-2-0-available",
          "publishedOn": "2021-06-04T17:51:28.000Z",
          "wordCount": 553,
          "title": "Spring Integration AWS 2.5.1 and Spring Cloud Stream Kinesis Binder 2.2.0 Available"
        },
        {
          "id": "https://spring.io/blog/2021/06/03/a-bootiful-podcast-jhipster-creator-and-microsoft-java-developer-advocacy-manager-julien-dubois",
          "author": null,
          "description": "Hi, Spring fans! In this installment Josh Long (@starbuxman) talks to JHipster creator and Microsoft Java Developer Advocacy manager Julien Dubois (@juliendubois)",
          "link": "https://spring.io/blog/2021/06/03/a-bootiful-podcast-jhipster-creator-and-microsoft-java-developer-advocacy-manager-julien-dubois",
          "publishedOn": "2021-06-03T08:00:00.000Z",
          "wordCount": 423,
          "title": "A Bootiful Podcast: JHipster creator and Microsoft Java Developer Advocacy manager Julien Dubois"
        },
        {
          "id": "https://spring.io/blog/2021/06/02/wiremock-for-rsocket",
          "author": null,
          "description": "If you have an application that connects to an RSocket server at runtime, how do you test it? We need a way for a test to start a server and tell us where it is listening, and then we need to be able to register request and response examples (a.k.a. \"contracts\"). That’s what this project provides - it’s like Wiremock but for RSocket.\n\r\n\r\n\r\nGetting Started\n\r\n\r\n\r\nThe easiest way to use the project is as a JUnit (Jupiter) extension, e.g:\n\r\n\r\n\r\n\r\n@SpringBootTest\r\n@ExtendWith(RSocketServerExtension.class)\r\nclass SocketsApplicationTests {\r\n\t...\r\n}\n\r\n\r\n\r\n\r\nWith this extension installed the Spring Boot tests will run with an RSocket server listening on a port given by test.rsocket.server.port, so the test can connect directly to it, or (more likely) the code that it is testing will connect to it. …",
          "link": "https://spring.io/blog/2021/06/02/wiremock-for-rsocket",
          "publishedOn": "2021-06-02T19:52:00.000Z",
          "wordCount": 1021,
          "title": "\"Wiremock\" for RSocket"
        },
        {
          "id": "https://spring.io/blog/2021/06/01/this-week-in-spring-june-1st-2021",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring! How’re you doing? I’m doing well! I hope you’re doing well, too. Can you believe we’ve just entered the month of June 2021? WHERE HAS THIS YEAR GONE ALREADY! It’s insane. But, the march of Spring continues, and with each passing week a ton of new stuff to talk about arrives. Let’s get into it!\n\r\n\r\n  \nIn last week’s episode of A Bootiful Podcast, I talked to Micrometer-lead Tommy Ludwig\n\r\n  \nAnnouncing the general availability of the Azure Spring Cloud Terraform provider\n\r\n  \nCool to see an Azure Spring Cloud success story in the MSBuild keynote\n\r\n  \nGet your reactive microservices to Kubernetes with Spring Boot and JHipster\n\r\n  \nMichael Coté asks on Twitter: What’s an API Gateway and why would you use it? Also, what does “business value” mean here? See the full interview with Rita Marinachi, Chris Sterling, and me to hear even more and also a how API gateways fit with service meshes.\n\r\n  \nProviding useful API error messages with Spring Boot\n\r\n  \nSpring Cloud 2020.0.3 (aka Ilford) Is Available\n\r\n  \nSpring Cloud Gateway for Kubernetes lead Chris Sterling on Redmonk\n\r\n  \nSpring Microservices Security Best Practices\n\r\n  \nSpring PetClinic Data JDBC upgraded to Java 16. Records do make a difference \n\r\n  \nCheck out this terminal application for the Spring Initializr: Spring Starter Terminal\n\r\n  \nThis is a reasonable JUnit test runner that hides the green test result logs so as to bring the errors to sharp relief\n\r\n  \nI found this old comic book about the amazing adventures of Java mascot Duke, and it is well worth a read: jcp-ec/AmazingAdventuresOfDuke.pdf at master · jcp-org/jcp-ec · GitHub\n\r\n  \nthis is an interesting blog on sending HTTP requests with WebClient",
          "link": "https://spring.io/blog/2021/06/01/this-week-in-spring-june-1st-2021",
          "publishedOn": "2021-06-01T21:00:00.000Z",
          "wordCount": 671,
          "title": "This Week in Spring - June 1st, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/05/28/spring-cloud-2020-0-3-aka-ilford-is-available",
          "author": null,
          "description": "On behalf of the community, I am pleased to announce that Service Release 3 of the Spring Cloud 2020.0 Release Train (2020.0.3) is available today. The release can be found in Maven Central. You can check out the 2020.0 release notes for more information.\nNotable Changes in the 2020.0.3 Release Train\n\r\nThe biggest change in this release was support for Spring Boot 2.5. Besides that, this release is primarily for bug fixes and dependency upgrades.\n\r\nSee all of the included issues and pull requests at the Github project.\nSpring Cloud Commons\n\r\n\r\n  \nAdded the possibility to disable load-balancing by property (#940)\n\r\n\nSpring Cloud Config\n\r\n\r\n  \nSeveral bug fixes related to spring.config.import with Spring Cloud Config Server\n\r\n\nSpring Cloud Consul\n\r\n\r\n  \nFix profile specific behavior relative…",
          "link": "https://spring.io/blog/2021/05/28/spring-cloud-2020-0-3-aka-ilford-is-available",
          "publishedOn": "2021-05-28T19:42:00.000Z",
          "wordCount": 772,
          "title": "Spring Cloud 2020.0.3 (aka Ilford) Is Available"
        },
        {
          "id": "https://spring.io/blog/2021/05/27/a-bootiful-podcast-micrometer-lead-tommy-ludwig",
          "author": null,
          "description": "Hi, Spring fans! In this episode, Josh Long (@starbuxman) talks to Micrometer-lead and observability guru Tommy Ludwig (@tommyludwig) about Tokyo, Japan; metrics; tracing; and so much more. \n\r\n\r\n  \nthe Micrometer project",
          "link": "https://spring.io/blog/2021/05/27/a-bootiful-podcast-micrometer-lead-tommy-ludwig",
          "publishedOn": "2021-05-27T07:00:00.000Z",
          "wordCount": 417,
          "title": "A Bootiful Podcast: Micrometer-lead Tommy Ludwig"
        },
        {
          "id": "https://spring.io/blog/2021/05/24/this-week-in-spring-may-25th-2021",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring! How’re you doing? I’m still fresh off my little vacation last week, feeling fantastic. I’ve spent the last several days working with Spring Boot and Spring Native and I have to tell you, they’re epic. \n\r\nIt’s gotten to the point where I sometimes spend time working on enabling Spring Native integrations for other projects - it really makes some third party abstractions come alive! It’s hard to know what the right comparison is. There’s not much you can do in this life that results in such an instantaneous, night-and-day difference in performance and memory profile with so few (user-visibile) changes. Imagine snapping your fingers and having your luxury hypercar (Spring Boot in this metaphor) transform into an equally c…",
          "link": "https://spring.io/blog/2021/05/24/this-week-in-spring-may-25th-2021",
          "publishedOn": "2021-05-25T06:00:00.000Z",
          "wordCount": 937,
          "title": "This Week in Spring - May 25th, 2021"
        },
        {
          "id": "https://spring.io/blog/2021/05/20/spring-boot-2-5-is-now-ga",
          "author": null,
          "description": "Update 2021-05-25: The release contains fixes for Spring Framework CVE-2021-22118.\n\r\nOn behalf of the Spring Boot team and everyone that has contributed, I am pleased to announce that Spring Boot 2.5.0 has been released and is available from Maven Central. \n\r\nThis release adds a significant number of new features and improvements. For full upgrade instructions and new and noteworthy features please see the release notes.\nWhat’s new in 2.5\n\r\n\r\n  \nSupport for Java 16\n\r\n  \nSupport for Gradle 7\n\r\n  \nEnhanced Docker image building\n\r\n  \nNew mechanism for Datasource initialization\n\r\n\r\nAdditionally, the HTML documentation published by the project has an updated look-and-feel and some new features. There is also support for dark mode! \nDependency upgrades\n\r\nSpring Boot 2.5 moves to new versions of several Spring projects:\n\r\n\r\n  \nSpring Data 2021.0\n\r\n  \nSpring HATEOAS 1.3\n\r\n  \nSpring Integration 5.5\n\r\n  \nSpring Kafka 2.7\n\r\n  \nSpring Retry 1.3\n\r\n  \nSpring Security 5.5\n\r\n  \nSpring Session 2021.0\n\r\n\r\nWe’ve also upgraded to the latest stable releases of other third-party libraries wherever possible. Please see the release notes for details.\nOther changes\n\r\nThere’s a whole host of other changes and improvements that are documented in the release notes. You can also find a list of deprecated classes and methods that we plan to remove in the next version.\nThank you\n\r\nWe want to take this opportunity to again thank all our users and contributors.\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask at stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/05/20/spring-boot-2-5-is-now-ga",
          "publishedOn": "2021-05-21T00:37:00.000Z",
          "wordCount": 652,
          "title": "Spring Boot 2.5 is now GA"
        },
        {
          "id": "https://spring.io/blog/2021/05/20/spring-boot-2-4-6-available-now",
          "author": null,
          "description": "Update 2021-05-25: This release contains fixes for Spring Framework CVE-2021-22118.\n\r\nOn behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.4.6 has been released and is now available from Maven Central.\n\r\nThis release includes 84 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/05/20/spring-boot-2-4-6-available-now",
          "publishedOn": "2021-05-21T00:11:00.000Z",
          "wordCount": 500,
          "title": "Spring Boot 2.4.6 available now"
        },
        {
          "id": "https://spring.io/blog/2021/05/20/a-bootiful-podcast-james-ward",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks to Google Cloud Developer Advocate (and mentor, and friend!) James Ward (@_JamesWard) about his podcast Happy Path Programming (@HappyPathProg), programming, software, Spring Native, and his work at various organizations like Adobe, Heroku, Lightbend, SalesForce, and now Google Cloud.",
          "link": "https://spring.io/blog/2021/05/20/a-bootiful-podcast-james-ward",
          "publishedOn": "2021-05-20T19:00:00.000Z",
          "wordCount": 433,
          "title": "A Bootiful Podcast: James Ward"
        },
        {
          "id": "https://spring.io/blog/2021/05/20/spring-integration-for-aws-2-5-goes-ga",
          "author": null,
          "description": "Dear Spring (and AWS) Community,\n\r\n\r\n\r\nToday it’s my pleasure to announce a release of Spring Integration for Amazon Web Services extension version 2.5.\n\r\n\r\n\r\nIt is available from Maven Central:\n\r\n\r\n\r\n\r\ncompile \"org.springframework.integration:spring-integration-aws:2.5.0\"\n\r\n\r\n\r\n\r\nMostly this version is a major move from Spring Cloud for AWS project hosted on Spring Cloud side to its own organization.\r\nPlus it includes upgrades to the latest dependencies, including recently released Spring Integration 5.5.\n\r\n\r\n\r\nMany thanks to everyone from the Community for all the feedback and contribution to this project.\n\r\n\r\n\r\nSpring Integration for AWS resources:\n\r\n\r\n\r\nProject Page | Contributing | Help | Chat",
          "link": "https://spring.io/blog/2021/05/20/spring-integration-for-aws-2-5-goes-ga",
          "publishedOn": "2021-05-20T16:25:43.000Z",
          "wordCount": 485,
          "title": "Spring Integration for AWS 2.5 goes GA"
        },
        {
          "id": "https://spring.io/blog/2021/05/20/spring-boot-2-3-11-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.3.11 has been released and is now available from Maven Central.\n\r\nThis release includes 52 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2021/05/20/spring-boot-2-3-11-available-now",
          "publishedOn": "2021-05-20T16:00:00.000Z",
          "wordCount": 490,
          "title": "Spring Boot 2.3.11 available now"
        },
        {
          "id": "https://spring.io/blog/2021/05/20/spring-web-services-3-1-1-is-out",
          "author": null,
          "description": "Greetings Spring community,\n\r\n\r\n\r\nThe Spring Web Services team has released 3.1.1. This is the first major release under the new versioning schema. Releases will no longer have .RELEASE and snapshots will only be -SNAPSHOT, to better comply with community approaches.\n\r\n\r\n\r\nWhile we strive to maintain alignment with Spring Framework and Spring Security, we also test against Java 8, Java 11, and Java LATEST (JDK 16 as of today).\n\r\n\r\n\r\nFor more details, read the following release notes for each version:\n\r\n\r\n\r\nRelease Notes - Spring Web Services - Version 3.1.1.\n\r\n\r\n\r\n\r\n\r\n#1198 - Test against JDK 16 on CI.\n\r\n\r\n\r\n#1197 - Upgrade to Spring Framework 5.3.7.\n\r\n\r\n\r\n#1187 - Upgrade to Spring Security 5.5.0.\n\r\n\r\n\r\n#1199 - Don’t skip main build targets during releases.\n\r\n\r\n\r\n\r\n\r\nLinks: Project Page | GitHub | Issues\n\r\n\r\n\r\nThe artifacts are located on Maven Central. Get it while it’s hot!\n\r\n\r\n\r\n\r\n\r\nSpringOne 2021 is coming\n\r\n\r\n\r\nThe hottest Spring conference is right around the corner. Spring developers from around the globe will sign in. It’s still not too late to register.",
          "link": "https://spring.io/blog/2021/05/20/spring-web-services-3-1-1-is-out",
          "publishedOn": "2021-05-20T07:00:00.000Z",
          "wordCount": 555,
          "title": "Spring Web Services 3.1.1 is out!"
        }
      ]
    },
    {
      "title": "HashiCorp Blog",
      "feedUrl": "https://www.hashicorp.com/blog/feed.xml",
      "siteUrl": "https://hashicorp.com/blog",
      "articles": [
        {
          "id": "https://www.hashicorp.com/blog/announcing-hashicorp-boundary-0-3",
          "author": null,
          "description": "The latest release of HashiCorp Boundary includes managed groups and OIDC configuration improvements, while Boundary Desktop is now available on Windows.",
          "link": "https://www.hashicorp.com/blog/announcing-hashicorp-boundary-0-3",
          "publishedOn": "2021-06-15T16:00:00.000Z",
          "wordCount": 786,
          "title": "Announcing HashiCorp Boundary 0.3"
        },
        {
          "id": "https://www.hashicorp.com/blog/toward-vagrant-3-0",
          "author": null,
          "description": "In order to support its growing ecosystem and community as we move toward the 3.0 release, we are making changes to Vagrant that will maintain its Ruby-based features while being ported to Go.",
          "link": "https://www.hashicorp.com/blog/toward-vagrant-3-0",
          "publishedOn": "2021-06-11T16:00:00.000Z",
          "wordCount": 1797,
          "title": "Toward Vagrant 3.0"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-hcp-packer",
          "author": null,
          "description": "HCP Packer is a new cloud service designed to bridge the gap between image creation and deployment with image-management workflows. The service will be available for beta testing in the coming months.",
          "link": "https://www.hashicorp.com/blog/announcing-hcp-packer",
          "publishedOn": "2021-06-09T10:50:00.000Z",
          "wordCount": 910,
          "title": "Announcing HCP Packer"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-cloud-platform-adds-transit-gateway-okta-new-skus",
          "author": null,
          "description": "The HashiCorp Cloud Platform (HCP) now has expanded capabilities for networking, single sign-on, and more. HCP will also support new configurations of HashiCorp Consul and HashiCorp Vault in the coming months.",
          "link": "https://www.hashicorp.com/blog/hashicorp-cloud-platform-adds-transit-gateway-okta-new-skus",
          "publishedOn": "2021-06-09T10:50:00.000Z",
          "wordCount": 1387,
          "title": "HashiCorp Cloud Platform Adds Transit Gateway, Okta Support, New Packages"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-hashicorp-terraform-1-0-general-availability",
          "author": null,
          "description": "Terraform 1.0 — now generally available — marks a major milestone for interoperability, ease of upgrades, and maintenance for your automation workflows.",
          "link": "https://www.hashicorp.com/blog/announcing-hashicorp-terraform-1-0-general-availability",
          "publishedOn": "2021-06-08T10:50:00.000Z",
          "wordCount": 1114,
          "title": "Announcing HashiCorp Terraform 1.0 General Availability"
        },
        {
          "id": "https://www.hashicorp.com/blog/terraform-cloud-improved-visibility-for-workflows",
          "author": null,
          "description": "Announcing several improvements to HashiCorp Terraform Cloud, focusing on visibility and extensibility.",
          "link": "https://www.hashicorp.com/blog/terraform-cloud-improved-visibility-for-workflows",
          "publishedOn": "2021-06-08T10:50:00.000Z",
          "wordCount": 995,
          "title": "Terraform Cloud Updates Improve Workflow Visibility"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-waypoint-0-4",
          "author": null,
          "description": "Waypoint 0.4 adds significant features, including mutable deployments and platform health reporting, among others.",
          "link": "https://www.hashicorp.com/blog/announcing-waypoint-0-4",
          "publishedOn": "2021-06-03T19:00:00.000Z",
          "wordCount": 1007,
          "title": "Announcing HashiCorp Waypoint 0.4"
        },
        {
          "id": "https://www.hashicorp.com/blog/new-terraform-tutorials-on-hashicorp-learn",
          "author": null,
          "description": "From working with providers, to managing resources, to working with Terraform on AWS, we have a lot of new hands-on Terraform exercises to try.",
          "link": "https://www.hashicorp.com/blog/new-terraform-tutorials-on-hashicorp-learn",
          "publishedOn": "2021-06-02T16:00:00.000Z",
          "wordCount": 739,
          "title": "New Terraform Tutorials on HashiCorp Learn"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-launch-day-support-for-amazon-ecs-anywhere-terraform-aws-provider",
          "author": null,
          "description": "The Terraform AWS provider now supports ECS Anywhere, a new capability in Amazon ECS that supports running and managing container-based applications on customers’ on-premises servers.",
          "link": "https://www.hashicorp.com/blog/announcing-launch-day-support-for-amazon-ecs-anywhere-terraform-aws-provider",
          "publishedOn": "2021-06-01T18:30:00.000Z",
          "wordCount": 657,
          "title": "Announcing Support for Amazon ECS Anywhere in the Terraform AWS Provider"
        },
        {
          "id": "https://www.hashicorp.com/blog/new-apply-user-interface-for-terraform-cloud",
          "author": null,
          "description": "The redesigned interface for HashiCorp Terraform Cloud brings clarity to how your resources, state, and infrastructure operations are represented during a Terraform run.",
          "link": "https://www.hashicorp.com/blog/new-apply-user-interface-for-terraform-cloud",
          "publishedOn": "2021-06-01T16:00:00.000Z",
          "wordCount": 654,
          "title": "New Apply User Interface for Terraform Cloud"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-cdk-for-terraform-0-4",
          "author": null,
          "description": "The Cloud Development Kit for Terraform 0.4 introduces experimental Go language support, asset construct, and Terraform Cloud integration.",
          "link": "https://www.hashicorp.com/blog/announcing-cdk-for-terraform-0-4",
          "publishedOn": "2021-05-27T18:00:00.000Z",
          "wordCount": 985,
          "title": "Announcing CDK for Terraform 0.4"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-consul-service-mesh-for-amazon-ecs",
          "author": null,
          "description": "AWS users may now select Consul as their service mesh for ECS deployments.",
          "link": "https://www.hashicorp.com/blog/announcing-consul-service-mesh-for-amazon-ecs",
          "publishedOn": "2021-05-26T18:00:00.000Z",
          "wordCount": 1261,
          "title": "Announcing Tech Preview of Consul Service Mesh for Amazon ECS"
        },
        {
          "id": "https://www.hashicorp.com/blog/the-hashiconf-europe-highlights-you-don-t-want-to-miss",
          "author": null,
          "description": "HashiConf Europe 2021 is coming June 8-11. Here are some of the highlights that you don’t want to miss, from customer stories to product deep-dives.",
          "link": "https://www.hashicorp.com/blog/the-hashiconf-europe-highlights-you-don-t-want-to-miss",
          "publishedOn": "2021-05-26T08:00:00.000Z",
          "wordCount": 1189,
          "title": "The HashiConf Europe Highlights You Don’t Want to Miss"
        },
        {
          "id": "https://www.hashicorp.com/blog/terraform-azuread-provider-now-supports-microsoft-graph",
          "author": null,
          "description": "Version 1.5.0 of the Terraform AzureAD provider lets you manage your Azure Active Directory resources using the Microsoft Graph API.",
          "link": "https://www.hashicorp.com/blog/terraform-azuread-provider-now-supports-microsoft-graph",
          "publishedOn": "2021-05-25T15:00:00.000Z",
          "wordCount": 812,
          "title": "Terraform AzureAD Provider Now Supports Microsoft Graph"
        },
        {
          "id": "https://www.hashicorp.com/blog/using-waypoint-runners-to-enable-gitops-workflows",
          "author": null,
          "description": "Waypoint runners perform builds, deployments, poll for Git repository changes, and allow deployments for any platform.",
          "link": "https://www.hashicorp.com/blog/using-waypoint-runners-to-enable-gitops-workflows",
          "publishedOn": "2021-05-24T17:00:00.000Z",
          "wordCount": 891,
          "title": "Using Waypoint Runners To Enable GitOps Workflows"
        },
        {
          "id": "https://www.hashicorp.com/blog/learn-secure-access-management-boundary",
          "author": null,
          "description": "Explore how Boundary provides secure access to hosts and services based on user identity with new tutorials on HashiCorp Learn.",
          "link": "https://www.hashicorp.com/blog/learn-secure-access-management-boundary",
          "publishedOn": "2021-05-20T16:00:00.000Z",
          "wordCount": 795,
          "title": "Learn Secure Access Management with Boundary"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-support-for-predictive-scaling-policy-in-the-terraform-aws-provider",
          "author": null,
          "description": "The Terraform AWS provider now supports predictive scaling policy, a machine learning based scaling mechanism of Amazon EC2 Auto Scaling.",
          "link": "https://www.hashicorp.com/blog/announcing-support-for-predictive-scaling-policy-in-the-terraform-aws-provider",
          "publishedOn": "2021-05-19T22:30:00.000Z",
          "wordCount": 920,
          "title": "Announcing Support for Predictive Scaling Policy in the Terraform AWS Provider"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-launch-day-support-for-aws-app-runner-in-the-terraform-aws-provider",
          "author": null,
          "description": "The Terraform AWS provider now supports AWS AppRunner, a purpose-built container application service that enables customers to build and run containerized web applications in just a few clicks.",
          "link": "https://www.hashicorp.com/blog/announcing-launch-day-support-for-aws-app-runner-in-the-terraform-aws-provider",
          "publishedOn": "2021-05-18T17:00:00.000Z",
          "wordCount": 807,
          "title": "Announcing Launch Day Support for AWS App Runner in the Terraform AWS Provider"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-general-availability-of-hashicorp-nomad-1-1",
          "author": null,
          "description": "Nomad 1.1 is now generally available. This release delivers more than 10 new features to enable more flexible scheduling and a simplified operator experience.",
          "link": "https://www.hashicorp.com/blog/announcing-general-availability-of-hashicorp-nomad-1-1",
          "publishedOn": "2021-05-18T16:30:00.000Z",
          "wordCount": 698,
          "title": "Announcing General Availability of HashiCorp Nomad 1.1"
        }
      ]
    },
    {
      "title": "Elastic Blog - Elasticsearch, Kibana, and ELK Stack",
      "feedUrl": "https://www.elastic.co/blog/feed",
      "siteUrl": "https://www.elastic.co",
      "articles": [
        {
          "id": "https://www.elastic.co/blog/process-ghosting-a-new-executable-image-tampering-attack",
          "author": "Gabriel Landau",
          "description": "Security teams defending Windows environments often rely on anti-malware products as a first line of defense against malicious executables. Microsoft provides security vendors with the ability to register callbacks that will be invoked upon the creation of processes on the system. Driver developers can call APIs such as PsSetCreateProcessNotifyRoutineEx to receive such events.\n\nDespite the name, PsSetCreateProcessNotifyRoutineEx callbacks are not actually invoked upon the creation of processes, but rather upon the creation of the first threads within those processes. This creates a gap between when a process is created and when security products are notified of its creation. It also gives malware authors a window to tamper with the backing executable before security products can scan it. R…",
          "link": "https://www.elastic.co/blog/process-ghosting-a-new-executable-image-tampering-attack",
          "publishedOn": "2021-06-15T18:00:00.000Z",
          "wordCount": 1911,
          "title": "What you need to know about Process Ghosting, a new executable image tampering attack"
        },
        {
          "id": "https://www.elastic.co/blog/adversary-emulation-with-prelude-operator-and-elastic-security",
          "author": "James Spiteri,Prelude Team",
          "description": "It’s no secret that organisations are up against skilled, relentless and determined adversaries. Security operations teams need to continuously test their detection capabilities by carrying out adversary emulation plans that are made up of varying tactics, techniques and procedures  (TTPs) and track key metrics of their coverage in order to close any existing gaps.\n\nThere are many tools available for running adversary emulation plans and performing purple team exercises. This blog will focus on how teams can use Prelude Operator in conjunction with Elastic Security.\n\nAt Elastic, we’ve been working closely with the team at Prelude as we have a very similar mission — we want to help security teams of all skill levels, arming all analysts and red teams alike. We want to protect the world’s da…",
          "link": "https://www.elastic.co/blog/adversary-emulation-with-prelude-operator-and-elastic-security",
          "publishedOn": "2021-06-14T18:00:00.000Z",
          "wordCount": 1530,
          "title": "Adversary emulation with Prelude Operator and Elastic Security"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-stack-7-13-2-released",
          "author": "Tyler Smalley",
          "description": "Elastic Stack 7.13.2 has been released. Read about the updates and bug fixes that have been included in Elasticsearch, Kibana, Beats, Logstash, Workplace Search, App Search, APM, Logs, Metrics, Uptime, SIEM, and Endpoint Security.",
          "link": "https://www.elastic.co/blog/elastic-stack-7-13-2-released",
          "publishedOn": "2021-06-14T07:30:00.000Z",
          "wordCount": 300,
          "title": "Elastic Stack 7.13.2 released"
        },
        {
          "id": "https://www.elastic.co/blog/how-to-configure-elastic-cloud-on-kubernetes-with-saml-and-hot-warm-cold-architecture",
          "author": "Francismara Souza",
          "description": "Elastic Cloud on Kubernetes (ECK) is an easy way to get the Elastic Stack up and running on top of Kubernetes. That’s because ECK automates the deployment, provisioning, management, and setup of Elasticsearch, Kibana, Beats, and more. \n\nAs logging and metric data — or time series data — has a predictable lifespan, you can use hot, warm, and cold architecture to easily manage your data over time as it ages and becomes less relevant.\n\nIn this guide, we’ll explain how to set up SAML with auth0 as an identity provider (IdP) as well as how to configure your deployment for hot-warm-cold architecture with ECK. We’ll use production features such as:\n\nDedicated nodes\nZone awareness\nPod and node affinity\nPodDisruption\nDedicated storage class\nBefore you get started, you should be familiar with SAML. …",
          "link": "https://www.elastic.co/blog/how-to-configure-elastic-cloud-on-kubernetes-with-saml-and-hot-warm-cold-architecture",
          "publishedOn": "2021-06-10T18:00:00.000Z",
          "wordCount": 2636,
          "title": "How to configure Elastic Cloud on Kubernetes with SAML and hot-warm-cold architecture"
        },
        {
          "id": "https://www.elastic.co/blog/how-south-dakota-bureau-of-information-and-telecommunications-deploys-elastic-to-secure-endpoints",
          "author": "David Kravets",
          "description": "The South Dakota Bureau of Information and Telecommunications (BIT) provides quality customer services and partnerships to ensure South Dakota’s IT organization is responsive, reliable, and well-aligned to support the state government’s business needs.\n\nThe BIT believes that “People should be online, not waiting in line.”\n\nThe bureau’s goals for the state's 885,000 residents include: \n\nDelivering valuable services at economical costs\nBuilding and retaining a highly skilled workforce\nProviding reliable, secure, and modern infrastrastructure\nWhen it comes to meeting the goal of a secure government infrastructure, the BIT discovered that its legacy SIEM solution couldn’t adequately monitor and alert on all of the endpoints associated with more than 9,000 systems. The BIT chose Elastic because…",
          "link": "https://www.elastic.co/blog/how-south-dakota-bureau-of-information-and-telecommunications-deploys-elastic-to-secure-endpoints",
          "publishedOn": "2021-06-09T15:00:00.000Z",
          "wordCount": 754,
          "title": "How South Dakota Bureau of Information and Telecommunications deploys Elastic to secure endpoints"
        },
        {
          "id": "https://www.elastic.co/blog/total-economic-impact-study-elastic-delivers-10x-performance-with-up-to-75-percent-cost-savings",
          "author": "Ben Pruden",
          "description": "Ten times faster at a fraction of the cost.\n\nIf you want a headline as to why you should consider adopting Elastic for security and observability, that is it. \n\nWe often work with our customers to help them establish the business value of Elastic within their organizations. We commissioned Forrester to conduct a Total Economic Impact (TEI) study of our security and observability solutions so our customers have an unbiased view that they can share with their internal stakeholders. The TEI examines the ROI organizations realize by deploying the Elastic Observability and Security solutions. \n\nThis study showcases the incredible value that our customers are achieving and provides guidance to help you consider the costs, benefits, and business impact Elastic can bring to your organization. \n\nTh…",
          "link": "https://www.elastic.co/blog/total-economic-impact-study-elastic-delivers-10x-performance-with-up-to-75-percent-cost-savings",
          "publishedOn": "2021-06-08T21:00:00.000Z",
          "wordCount": 882,
          "title": "Total Economic Impact<sup>TM</sup> study: Elastic delivers 10X performance with up to 75% cost savings"
        },
        {
          "id": "https://www.elastic.co/blog/problemchild-generate-alerts-to-detect-living-off-the-land-attacks",
          "author": "Apoorva Joshi,Disha Dasgupta,Justin Ibarra,Craig Chamberlain",
          "description": "In an earlier blog post, we spoke about building your own ProblemChild framework from scratch in the Elastic Stack to detect living off the land (LOtL) activity. As promised, we have now also released a fully trained detection model, anomaly detection configurations, and detection rules that you can use to get ProblemChild up and running in your environment in a matter of minutes. \n\nThis blog provides a high-level breakdown of the steps to enrich your Windows process event data using the released model to generate alerts when LOtL activity is detected in your environment. A more detailed documentation of the steps to be followed can be found in our publicly available detection-rules repository. \n \nProblemChild: A brief history\n\nProblemChild is a framework built using the Elastic Stack to d…",
          "link": "https://www.elastic.co/blog/problemchild-generate-alerts-to-detect-living-off-the-land-attacks",
          "publishedOn": "2021-06-08T18:00:00.000Z",
          "wordCount": 1983,
          "title": "ProblemChild: Generate alerts to detect living-off-the-land attacks"
        },
        {
          "id": "https://www.elastic.co/blog/protecting-windows-protected-processes",
          "author": "Gabriel Landau",
          "description": "This quick blog is the first in a two-part series discussing a userland Windows exploit initially disclosed by James Forshaw and Alex Ionescu. The exploit enables attackers to perform highly privileged actions that typically require a kernel driver.\n\nProtected process light\nWindows 8.1 introduced the concept of Protected Process Light (PPL), which enables specially-signed programs to run in such a way that they are immune from tampering and termination, even by administrative users. The goal is to keep malware from running amok — tampering with critical system processes and terminating anti-malware applications. There is a hierarchy of PPL “levels,” with higher-privilege ones immune from tampering by lower-privilege ones, but not vice-versa. \n\nFor more information on PPL processes, please …",
          "link": "https://www.elastic.co/blog/protecting-windows-protected-processes",
          "publishedOn": "2021-06-07T18:00:00.000Z",
          "wordCount": 905,
          "title": "Protecting Windows protected processes"
        },
        {
          "id": "https://www.elastic.co/blog/culture-pride-at-elastic-feeling-seen-and-safe-as-a-trans-woman",
          "author": "Elastic Culture",
          "description": "We all want to work for a company where we fit in. That’s why Elastic built a Source Code that encourages all to come as they are. In this Pride blog series, we highlight LGBTQIA+ Elasticians who have a unique story — one, perhaps, just as unique as yours.\n\nWe asked Kiley Davidson, IT Systems Engineer, to talk about her experience and share how Elastic’s culture allowed her to come out at work and thrive as a trans woman.\n \nHow did you know that Elastic was a safe place for you when you joined in 2018?\n\nWhen I joined Elastic in April of 2018, I knew I was trans, but wasn’t out to anyone but my wife and therapist. Even after starting my transition later that year, the idea of coming out at work was utterly terrifying: considering what often happens when transgender people transition at work…",
          "link": "https://www.elastic.co/blog/culture-pride-at-elastic-feeling-seen-and-safe-as-a-trans-woman",
          "publishedOn": "2021-06-07T15:00:00.000Z",
          "wordCount": 1357,
          "title": "Pride @ Elastic | Feeling seen and safe as a trans woman"
        },
        {
          "id": "https://www.elastic.co/blog/how-to-use-transforms-to-track-your-most-recent-customer-orders",
          "author": "Przemysław Witek",
          "description": "Creating an entity-centric index that contains only the latest document for each entity can be useful in a number of situations. For example, maybe you're managing an ecommerce site and you want to track the latest order placed by each of your customers. Or maybe you want to run a campaign targeting customers who haven't been active over a certain period. What's the fastest and most efficient way to compile and organize such data?\n\nTransforms in Elasticsearch enable you to create and maintain an entity-centric index based on the event index and a transforming function. Until recently, the only possible function was pivot, which is a continuous group-by plus aggregations. In version 7.12, we’ve added one more transforming function, called latest. It transforms a source index into a destinat…",
          "link": "https://www.elastic.co/blog/how-to-use-transforms-to-track-your-most-recent-customer-orders",
          "publishedOn": "2021-06-03T18:00:00.000Z",
          "wordCount": 1272,
          "title": "How to use transforms to track your most recent customer orders"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-license-update",
          "author": "Steve Kearns",
          "description": "In January 2021, we announced that starting with version 7.11, we would be changing the Apache 2.0 portions of Elasticsearch and Kibana source code to be dual licensed under Elastic License and SSPL, at the users’ discretion. As part of that change, we created Elastic License 2.0 (ELv2) as a permissive,  fair-code license, which allows free use, redistribution, modification, and derivative works, with only three simple limitations, outlined in our original announcement.  \n  \n We've been happy to see the level of community support for this change.  While we would have preferred to collaborate with Amazon, we're glad that with their fork and commitment to rename the Amazon Elasticsearch Service, it means that they will no longer be the cause of confusion in the Elasticsearch and Kibana commu…",
          "link": "https://www.elastic.co/blog/elastic-license-update",
          "publishedOn": "2021-06-03T15:00:00.000Z",
          "wordCount": 719,
          "title": "Elastic License Update"
        },
        {
          "id": "https://www.elastic.co/blog/cerner-depends-on-elastic-machine-learning-for-a-healthy-infrastructure",
          "author": "David Kravets",
          "description": "Cerner Corp. is a supplier of healthcare information technology systems, services, and devices. The company, with $5.7 billion in annual revenue, empowers people and communities to engage in their own care. A key aspect of the business is surfacing data to enable their clients to make informed decisions about their healthcare. \n\nThe 29,000 Cerner employees in 30 countries are on a mission to shape the healthcare of tomorrow. They believe that their influence goes beyond healthcare, and impacts the world.\n\nJim Avazpour, Director of Infrastructure, says Cerner was challenged by the massive amount of data that they log — network storage, virtualization, and supporting services — to monitor the health of its infrastructure. In response, Cerner chose Elasticsearch as their logging solution to h…",
          "link": "https://www.elastic.co/blog/cerner-depends-on-elastic-machine-learning-for-a-healthy-infrastructure",
          "publishedOn": "2021-06-02T18:00:00.000Z",
          "wordCount": 709,
          "title": "Cerner depends on Elastic machine learning for a healthy infrastructure"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-stack-7-13-1-released",
          "author": "Clint Hall",
          "description": "Version 7.13.1 of the Elastic Stack was released today. We recommend you upgrade to this latest version.\nThe 7.13.1 patch contains fixes and small enhancements for the stack. Notable bug fixes are:\nKibana: Some \"By value\" panels not rendering after upgrade from 7.12.1 to 7.13.0 (#100756)\nKibana: \"Math\" aggregation not working for Table view in TSVB (#100892)\nElasticsearch: Fix illegal access on PIT creation for frozen index (#73517)\nElasticsearch: Fix snapshot shard data lost issue when an index is deleted while the cluster is concurrently taking more than one snapshot (#73456)\nFor a full list of changes for each product, please refer to the release notes:\n7.13.1 Release Notes\nElastic Stack\nElasticsearch\nKibana\nBeats\nLogstash\nElastic Enterprise Search\nEnterprise Search\nWorkplace Search\nElastic Observability\nAPM",
          "link": "https://www.elastic.co/blog/elastic-stack-7-13-1-released",
          "publishedOn": "2021-06-02T18:00:00.000Z",
          "wordCount": 323,
          "title": "Elastic Stack 7.13.1 released"
        },
        {
          "id": "https://www.elastic.co/blog/new-in-elasticsearch-7-13-even-faster-aggregations",
          "author": "Nik Everett",
          "description": "In our last episode, I wrote about some speed improvements to date_histogram and I was beside myself with excitement to see if I could apply the same principles to other aggregations. I've spent most of the past few months playing a small part developing runtime fields but eventually I found time to take a look at the terms aggregation.\n \nIt's time for terms!\n\nWith the date_histogram aggregation we got a huge performance boost by rewriting it as a filters aggregation internally. Rewriting terms as filters has more mixed results. I often saw a wonderful speed up (454ms -> 131ms). Check the linked PR for more about \"often\". But now that we've rewritten the agg as filters, we can do much better! \n\nWe landed another optimization that I'm really excited about. It's such a great shortcut it feel…",
          "link": "https://www.elastic.co/blog/new-in-elasticsearch-7-13-even-faster-aggregations",
          "publishedOn": "2021-06-02T15:00:00.000Z",
          "wordCount": 1150,
          "title": "New in Elasticsearch 7.13: Even faster aggregations"
        },
        {
          "id": "https://www.elastic.co/blog/culture-how-diverse-perspectives-create-a-better-workplace-and-product",
          "author": "Elastic Culture",
          "description": "As a quality assurance engineer on the Kibana team at Elastic, Bhavya Raju Mandya makes an effort to see things from a different perspective. \n\n“My job is to break things,” says Bhavya. “I like impersonating a cat, being curious, seeing what happens if I knock something off, or moving something or changing the order to figure out what gives. The end goal is to protect and defend the quality of Kibana and that makes me happy.”\n\nThe value Bhavya places on curiosity and diverse perspectives is a direct result of her experiences. Bhavya grew up in the South of India, in a province called Karnataka. She studied software engineering and worked in Bangalore before moving to Montreal with her partner. \n“India is vast and diverse, with many different skin tones and features,” she says. “In South In…",
          "link": "https://www.elastic.co/blog/culture-how-diverse-perspectives-create-a-better-workplace-and-product",
          "publishedOn": "2021-05-28T15:00:00.000Z",
          "wordCount": 744,
          "title": "How diverse perspectives create a better workplace — and product"
        },
        {
          "id": "https://www.elastic.co/blog/why-elasticsearch-is-an-indispensable-component-of-the-adyen-stack",
          "author": "Adyen Team",
          "description": "At Adyen, we use Elasticsearch to power various parts of our payments platform. This includes payment search, monitoring, and log search. Let’s take a look at how we use Elastic for these different use cases and see how we capitalize on the power of Elasticsearch. \n\nWe recently did a talk about some of our Elasticsearch adventures at an Elastic meetup. You can find a recording here.\n\nBefore we look into our different use cases, it helps to get a high-level understanding of Adyen’s architecture.\n\nAt Adyen, we do many things, but the core of what we do is payment processing. Our payment platform is built for any business and every customer journey. We process payments across all sales channels. \n\nLet’s say you want to buy a beer at the local pub (a merchant) and you want to pay with your cre…",
          "link": "https://www.elastic.co/blog/why-elasticsearch-is-an-indispensable-component-of-the-adyen-stack",
          "publishedOn": "2021-05-27T15:00:00.000Z",
          "wordCount": 1465,
          "title": "Why Elasticsearch is an indispensable component of the Adyen stack"
        },
        {
          "id": "https://www.elastic.co/blog/king-wood-mallesons-ciso-relies-on-elastic-to-spot-and-identify-security-threats",
          "author": "David Kravets",
          "description": "King & Wood Mallesons (KWM) is among the world’s most innovative law firms and is represented by 2,400 lawyers in 28 locations across the globe. The international law firm, based in Australia, helps clients flourish in Asian markets by helping them understand and navigate local challenges and by delivering solutions that provide clients with a competitive advantage.\n\nThe firm believes in taking a partnership approach with clients and in pushing boundaries to connect Asia to the world and the world to Asia. \n\nTo succeed in that mission, John Reeman, the Chief Information Security Officer for KWM, says the firm began leveraging Elastic about two years ago for security operations. The move has provided the firm with fresh insights to quickly pinpoint security events across the enterprise.\n\n“W…",
          "link": "https://www.elastic.co/blog/king-wood-mallesons-ciso-relies-on-elastic-to-spot-and-identify-security-threats",
          "publishedOn": "2021-05-26T15:00:00.000Z",
          "wordCount": 697,
          "title": "King & Wood Mallesons CISO relies on Elastic to “spot and identify” security threats"
        },
        {
          "id": "https://www.elastic.co/blog/whats-new-elastic-7-13-0",
          "author": "Steve Kearns,Angelos Kottas",
          "description": "Key enhancements include cost-effective search across more data with searchable snapshots and the frozen tier, analyst-driven data enhancements on the fly with runtime fields, and expanded Microsoft integrations\nWe are pleased to announce the general availability (GA) of Elastic 7.13. This release brings a broad set of new capabilities to our Elastic Enterprise Search, Observability, and Security solutions, which are built into the Elastic Stack — Elasticsearch and Kibana. This release enables customers to search petabytes of data in minutes cost-effectively by leveraging searchable snapshots and the new frozen tier. Analysts can now enhance data on the fly using runtime fields, our implementation of schema on read, in Kibana Lens and Discover. \n\nAnd we are building upon our Microsoft part…",
          "link": "https://www.elastic.co/blog/whats-new-elastic-7-13-0",
          "publishedOn": "2021-05-25T19:08:00.000Z",
          "wordCount": 1976,
          "title": "Elastic 7.13.0 released: Search and store more data on Elastic"
        },
        {
          "id": "https://www.elastic.co/blog/whats-new-elastic-cloud-7-13-0",
          "author": "The Elastic Cloud Team",
          "description": "The latest updates to Elastic Cloud make it easier to deploy and manage Elasticsearch on Microsoft Azure, secure data in motion with Azure Private Link, and cost-effectively store and search more data across all cloud service providers with the frozen tier and searchable snapshots. Keep reading to learn more.\n \nEasily find, deploy, and manage Elastic directly within Microsoft Azure\n\nWe’re excited to announce the latest development in our ongoing partnership with Microsoft, the public preview of our Azure portal integration, which allows you to find, deploy, and manage Elasticsearch directly within the Azure portal. You can also take advantage of simplified ingestion for Azure platform, resource, and virtual machine logs, accelerating time to value for observability. By adding Workplace Sea…",
          "link": "https://www.elastic.co/blog/whats-new-elastic-cloud-7-13-0",
          "publishedOn": "2021-05-25T19:07:00.000Z",
          "wordCount": 738,
          "title": "What’s new in Elastic Cloud for 7.13: Microsoft Azure portal integration, Azure Private Link in private beta, and frozen tier"
        },
        {
          "id": "https://www.elastic.co/blog/whats-new-elasticsearch-7-13-0",
          "author": "George Kobar",
          "description": "We’re pleased to announce Elasticsearch 7.13.0, based on Apache Lucene 8.8.2. \n\nVersion 7.13 is the latest stable release of Elasticsearch and is now available for deployment via Elasticsearch Service on Elastic Cloud or via download for use in your own environment(s).\n\nReady to roll up your sleeves and get started? We have the links you need:\n\nStart Elasticsearch on Elastic Cloud\nDownload Elasticsearch\nElasticsearch 7.13.0 release notes\nElasticsearch 7.13.0 breaking changes\nSearch petabytes of data in minutes using low-cost object storage with the frozen tier\nWe believe that data is a differentiator for businesses and operations. But with exponential data growth, it becomes economically unfeasible to store and search it all.\n\nThe frozen tier, now generally available in 7.13, gives the abi…",
          "link": "https://www.elastic.co/blog/whats-new-elasticsearch-7-13-0",
          "publishedOn": "2021-05-25T19:06:00.000Z",
          "wordCount": 1637,
          "title": "Elasticsearch 7.13 released"
        }
      ]
    },
    {
      "title": "Ansible Blog",
      "feedUrl": "https://www.ansible.com/blog/rss.xml",
      "siteUrl": "https://www.ansible.com/blog",
      "articles": [
        {
          "id": "https://www.ansible.com/blog/whats-new-in-the-ansible-content-collection-for-kubernetes-2.0",
          "author": "Mike Graves",
          "description": "As the adoption of containers and Kubernetes increases to drive application modernization, IT organizations must find ways to easily deploy and manage multiple Kubernetes clusters across regions, both residing in the public cloud and/or on-premises, and all the way to the edge. As such, we continue to expand on the capabilities of our Certified Ansible Content Collection for kubernetes.core.",
          "link": "https://www.ansible.com/blog/whats-new-in-the-ansible-content-collection-for-kubernetes-2.0",
          "publishedOn": "2021-06-15T13:00:00.000Z",
          "wordCount": 1785,
          "title": "What’s New in the Ansible Content Collection for Kubernetes - 2.0"
        },
        {
          "id": "https://www.ansible.com/blog/ansiblefest-2021-cfp-is-open",
          "author": "info@ansible.com (Ansible)",
          "description": "AnsibleFest will be a free, virtual two day event again this year on September 29-30. You can expect all the usual highlights, like customer keynotes, breakout sessions, direct access to Ansible experts and more. We will also be bringing back tracks from last year like Network, Security, Developer and more to give you exactly the type of information you need for wherever you are in your Ansible journey.",
          "link": "https://www.ansible.com/blog/ansiblefest-2021-cfp-is-open",
          "publishedOn": "2021-06-08T14:30:00.000Z",
          "wordCount": 757,
          "title": "AnsibleFest 2021 CFP is Open"
        },
        {
          "id": "https://www.ansible.com/blog/ansible-community-steering-committee",
          "author": "The Ansible Community Team",
          "description": "As we all know, Ansible is a well-adapted tool for the end-to-end automation of IT infrastructures. At the same time, due to the addition of new features and developments within the project, the Ansible community is growing at an accelerated rate. To help structure the project and also to facilitate the change in direction, we are launching a Steering Committee for the Ansible Community Project.",
          "link": "https://www.ansible.com/blog/ansible-community-steering-committee",
          "publishedOn": "2021-06-01T17:00:00.000Z",
          "wordCount": 1115,
          "title": "Ansible Community Steering Committee"
        },
        {
          "id": "https://www.ansible.com/blog/fun-with-private-automation-hub-part-1",
          "author": "Daniel Leroux",
          "description": "With the introduction of Ansible Automation Platform 1.2 at AnsibleFest 2020, Ansible released private Automation Hub. This enables a means to deliver, manage and curate Ansible Automation Platform Certified Content via a central on-premises, self-hosted solution for use by internal automation communities.",
          "link": "https://www.ansible.com/blog/fun-with-private-automation-hub-part-1",
          "publishedOn": "2021-05-19T13:00:00.000Z",
          "wordCount": 1939,
          "title": "Fun with private Automation Hub - Part 1"
        }
      ]
    },
    {
      "title": "Azure DevOps Blog",
      "feedUrl": "https://devblogs.microsoft.com/devops/feed/",
      "siteUrl": "https://devblogs.microsoft.com/devops",
      "articles": [
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61853",
          "author": "Gloridel Morales",
          "description": "For the June patches, we are releasing fixes that impact our self-hosted product, Azure DevOps Server.\nRemoved references to stale test cases to help speed the data import process.\nThe post June patches for Azure DevOps Server appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/june-patches-for-azure-devops-server/",
          "publishedOn": "2021-06-15T19:09:15.000Z",
          "wordCount": 1247,
          "title": "June patches for Azure DevOps Server"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61742",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes – Intro to Azure Data Factory with @KromerBigData appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-intro-to-azure-data-factory-with-kromerbigdata/",
          "publishedOn": "2021-06-14T18:00:01.000Z",
          "wordCount": 1413,
          "title": "AzureFunBytes – Intro to Azure Data Factory with @KromerBigData"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61839",
          "author": "Jay Gordon",
          "description": "The top stories from the #AzureDevOps #community for 2021.06.11 are here!\nThe post Top Stories from the Microsoft DevOps Community – 2021.06.11 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-06-11/",
          "publishedOn": "2021-06-11T08:00:44.000Z",
          "wordCount": 1123,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.06.11"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61708",
          "author": "Jay Gordon",
          "description": "In this series of posts, I will focus on how to prepare ourselves from having to do manual work to handle our database systems. Each post will provide you with a step to take to begin moving data into the cloud.\nThe post AzureFunBytes Presents: Migrating Your Data – Create Your Cosmos DB appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-presents-migrating-your-data-create-your-cosmos-db/",
          "publishedOn": "2021-06-10T18:00:44.000Z",
          "wordCount": 2535,
          "title": "AzureFunBytes Presents: Migrating Your Data – Create Your Cosmos DB"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61745",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes Episode 42 – Hybrid Cloud on Azure with @ThomasMaurer appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-episode-42-hybrid-cloud-on-azure-with-thomasmaurer/",
          "publishedOn": "2021-06-08T17:00:19.000Z",
          "wordCount": 1384,
          "title": "AzureFunBytes Episode 42 – Hybrid Cloud on Azure with @ThomasMaurer"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61806",
          "author": "Jay Gordon",
          "description": "The top stories from the #AzureDevOps #community for 2021.06.04 are here!\nThe post Top Stories from the Microsoft DevOps Community – 2021.06.04 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-06-04/",
          "publishedOn": "2021-06-04T12:21:13.000Z",
          "wordCount": 1205,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.06.04"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61796",
          "author": "pazand",
          "description": "Personal access tokens (PATs) make it easy to authenticate against Azure Devops to integrate with your tools and services. However, leaked tokens could compromise your Azure DevOps account and data, putting your applications and services at significant risk.\nThe post New policies to restrict personal access token scope and lifespan appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/new-policies-to-restrict-personal-access-token-scope-and-lifespan/",
          "publishedOn": "2021-06-03T17:46:59.000Z",
          "wordCount": 1376,
          "title": "New policies to restrict personal access token scope and lifespan"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61789",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes – Intro to Bicep appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-intro-to-bicep/",
          "publishedOn": "2021-06-02T14:33:53.000Z",
          "wordCount": 1200,
          "title": "AzureFunBytes – Intro to Bicep"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61777",
          "author": "Jay Gordon",
          "description": "Happy Friday, DevOps Friends!  Hope you had a great Microsoft Build, I know I did.  I really enjoyed a lot of the great sessions, Ask The Experts, and of course keynotes that were broadcast throughout the week.  One of my favorite sessions was Ask the Experts: Infra as Code –\nThe post Top Stories from the Microsoft DevOps Community – 2021.05.28 appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/top-stories-from-the-microsoft-devops-community-2021-05-28/",
          "publishedOn": "2021-05-28T17:53:58.000Z",
          "wordCount": 1166,
          "title": "Top Stories from the Microsoft DevOps Community – 2021.05.28"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=61690",
          "author": "Jay Gordon",
          "description": "AzureFunBytes is a weekly opportunity to learn more about the fundamentals and foundations that make up Azure. It’s a chance for me to understand more about what people across the Azure organization do and how they do it. Every week we get together at 11 AM Pacific on Microsoft LearnTV and learn more about Azure.\nThe post AzureFunBytes – Containers and Kubernetes with @brendandburns appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azurefunbytes-containers-and-kubernetes-with-brendandburns/",
          "publishedOn": "2021-05-25T18:00:58.000Z",
          "wordCount": 1359,
          "title": "AzureFunBytes – Containers and Kubernetes with @brendandburns"
        }
      ]
    },
    {
      "title": "Discover Dev",
      "feedUrl": "https://www.discoverdev.io/rss.xml",
      "siteUrl": "http://discoverdev.io",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "http://feeds.feedburner.com/AmazonWebServicesBlog",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "2a373d1da673c370969bab9975909c889413e7b4",
          "author": "Jeff Barr",
          "description": "TL;DR – If you are using the ancient Feedburner feed for this blog, please change to the new one (https://aws.amazon.com/blogs/aws/feed/) ASAP. Back in the early days of AWS, I paid a visit to the Chicago headquarters of a cool startup called FeedBurner. My friend Matt Shobe demo’ed their new product to me and showed me […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/Xhu_RVZmQuY/",
          "publishedOn": "2021-06-15T16:49:54.000Z",
          "wordCount": 651,
          "title": "Heads Up – AWS News Blog RSS Feed Change"
        },
        {
          "id": "f057ea11c459d137b14bd39a8b215fd1b55c46d0",
          "author": "Jeff Barr",
          "description": "We launched three AWS Regions (Italy, South Africa, and Japan) in the last 12 months, and are working on regions in Australia, Indonesia, Spain, India, Switzerland, and the United Arab Emirates. Tel Aviv, Israel in the Works Today I am happy to announce that the AWS Israel (Tel Aviv) Region is in the works and […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/ObHL8-p0Y_0/",
          "publishedOn": "2021-06-11T04:07:36.000Z",
          "wordCount": 854,
          "title": "In the Works – AWS Region in Tel Aviv, Israel"
        },
        {
          "id": "0d87f068b55fc7843f4a16efa94e7f39317a52d1",
          "author": "Julien Simon",
          "description": "Over the last few years, Machine Learning (ML) has proven its worth in helping organizations increase efficiency and foster innovation. As ML matures, the focus naturally shifts from experimentation to production. ML processes need to be streamlined, standardized, and automated to build, train, deploy, and manage models in a consistent and reliable way. Perennial IT […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/XANxIh1DrHo/",
          "publishedOn": "2021-06-09T18:00:54.000Z",
          "wordCount": 878,
          "title": "Amazon SageMaker Named as the Outright Leader in Enterprise MLOps Platforms"
        },
        {
          "id": "0a6f033f543473ec26043a249a9479efeac02c59",
          "author": "Martin Beeby",
          "description": "Amazon FSx for Windows File Server provides fully managed file storage that is accessible over the industry-standard Server Message Block (SMB) protocol. It is built on Windows Server and offers a rich set of enterprise storage capabilities with the scalability, reliability, and low cost that you have come to expect from AWS. In addition to […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/RJ2Ne6UWkrg/",
          "publishedOn": "2021-06-08T21:04:51.000Z",
          "wordCount": 1289,
          "title": "File Access Auditing Is Now Available for Amazon FSx for Windows File Server"
        },
        {
          "id": "26697c1bef85d014c81418b796139fe7d1cc07af",
          "author": "Jeff Barr",
          "description": "I made my first trip to China in late 2008. I was able to speak to developers and entrepreneurs and to get a sense of the then-nascent market for cloud computing. With over 900 million Internet users as of 2020 (according to a recent report from China Internet Network Information Center), China now has the […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/GU_WAN0eq7s/",
          "publishedOn": "2021-06-07T23:54:52.000Z",
          "wordCount": 1235,
          "title": "Now Open Third Availability Zone in the AWS China (Beijing) Region"
        },
        {
          "id": "7abd88a50e7ca1187d62163688b6b675525deccb",
          "author": "Ross Barich",
          "description": "We at AWS continue to be impressed by the passion AWS enthusiasts have for knowledge sharing and supporting peer-to-peer learning in tech communities. A select few of the most influential and active community leaders in the world, who truly go above and beyond to create content and help others build better & faster on AWS, […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/gyB86BhvmFk/",
          "publishedOn": "2021-06-03T18:24:06.000Z",
          "wordCount": 1916,
          "title": "Introducing the newest AWS Heroes – June, 2021"
        },
        {
          "id": "a2bd2230a3cfaa594dc21e5b83c47a560eb39bf2",
          "author": "Marcia Villalba",
          "description": "In December of 2020, we made Amazon Location Service available in preview form for you to start building web and mobile applications with location-based features. Today I’m pleased to announce that we are making Amazon Location generally available along with two new features: routing and satellite imagery. I have been a full-stack developer for over […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/6PBkZP5YxbM/",
          "publishedOn": "2021-06-01T19:40:12.000Z",
          "wordCount": 1604,
          "title": "Amazon Location Service Is Now Generally Available with New Routing and Satellite Imagery Capabilities"
        },
        {
          "id": "e2c09f3554087f29b1181cd21535e08f33a1a37d",
          "author": "Danilo Poccia",
          "description": "With Amazon Redshift, you can use SQL to query and combine exabytes of structured and semi-structured data across your data warehouse, operational databases, and data lake. Now that AQUA (Advanced Query Accelerator) is generally available, you can improve the performance of your queries by up to 10 times with no additional costs and no code […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/vsIBQ-WoQ8I/",
          "publishedOn": "2021-05-27T20:00:10.000Z",
          "wordCount": 2599,
          "title": "Amazon Redshift ML Is Now Generally Available – Use SQL to Create Machine Learning Models and Make Predictions from Your Data"
        },
        {
          "id": "b0c9138fd7857802566b82e31a93ec008da273b7",
          "author": "Channy Yun",
          "description": "Since Amazon Elastic Container Service (Amazon ECS) was launched in 2014, AWS has released other options for running Amazon ECS tasks outside of an AWS Region such as AWS Wavelength, an offering for mobile edge devices or AWS Outposts, a service that extends to customers’ environments using hardware owned and fully managed by AWS. But […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/68ocNDKQLfs/",
          "publishedOn": "2021-05-27T17:13:26.000Z",
          "wordCount": 2046,
          "title": "Getting Started with Amazon ECS Anywhere – Now Generally Available"
        },
        {
          "id": "5183c1f235442ea38ac6eeec50996b3abd39e531",
          "author": "Danilo Poccia",
          "description": "The best way to get timely insights and react quickly to new information you receive from your business and your applications is to analyze streaming data. This is data that must usually be processed sequentially and incrementally on a record-by-record basis or over sliding time windows, and can be used for a variety of analytics […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/1k3SgVOc2Ag/",
          "publishedOn": "2021-05-27T16:25:11.000Z",
          "wordCount": 2506,
          "title": "Introducing Amazon Kinesis Data Analytics Studio – Quickly Interact with Streaming Data Using SQL, Python, or Scala"
        },
        {
          "id": "06a103b32d7540917020406954100ea849bffe76",
          "author": "Jeff Barr",
          "description": "We are currently building AWS regions in Australia, Indonesia, Spain, India, and Switzerland. UAE in the Works I am happy to announce that the AWS Middle East (UAE) Region is in the works and will open in the first half of 2022. The new region is an extension of our existing investment, which already includes […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/cPBIIiAjODI/",
          "publishedOn": "2021-05-26T04:03:34.000Z",
          "wordCount": 990,
          "title": "In the Works – AWS Region in the United Arab Emirates (UAE)"
        },
        {
          "id": "00cf76fbba9108f99f97d0a829f5da99bca9989e",
          "author": "Channy Yun",
          "description": "In October 2020, we announced the preview of AWS Lambda extensions, which you can use to easily integrate Lambda functions with your favorite tools for monitoring, observability, security, and governance. Today, I’m happy to announce the general availability of AWS Lambda Extensions which comes with new performance improvements and an expanded set of partners. As […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/Ojzzq6mN-AU/",
          "publishedOn": "2021-05-24T16:24:35.000Z",
          "wordCount": 2387,
          "title": "AWS Lambda Extensions Are Now Generally Available – Get Started with Your Favorite Operations Tools Today"
        },
        {
          "id": "2eb32615b0311b807948f09e866da9700a4494e7",
          "author": "Martin Beeby",
          "description": "Containers have become the default way that I package my web applications. Although I love the speed, productivity, and consistency that containers provide, there is one aspect of the container development workflow that I do not like: the lengthy routine I go through when I deploy a container image for the first time. You might […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/95poDWZrIXg/",
          "publishedOn": "2021-05-18T23:12:54.000Z",
          "wordCount": 2146,
          "title": "New – AWS App Runner: From Code to a Scalable, Secure Web Application in Minutes"
        },
        {
          "id": "8b2c4cd789faee0e06adea3f067ac1241363e50a",
          "author": "Channy Yun",
          "description": "Since AWS acquired CloudEndure in 2019, our new colleagues have offered CloudEndure Migration and CloudEndure Disaster Recovery. CloudEndure Migration can move applications from any physical, virtual, or cloud-based infrastructure to AWS at no charge. This complements AWS Server Migration Service (AWS SMS), which is an agentless service for migrating on-premises workloads to AWS. CloudEndure Disaster […]",
          "link": "http://feedproxy.google.com/~r/AmazonWebServicesBlog/~3/6CDf9qduI2I/",
          "publishedOn": "2021-05-17T17:52:00.000Z",
          "wordCount": 1970,
          "title": "How to Use the New AWS Application Migration Service for Lift-and-Shift Migrations"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/atom.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2476/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/base_rate.png\" title=\"Sure, you can talk about per-capita adjustment, but if you want to solve the problem, it's obvious that this is the group you need to focus on.\" alt=\"Sure, you can talk about per-capita adjustment, but if you want to solve the problem, it's obvious that this is the group you need to focus on.\" />",
          "link": "https://xkcd.com/2476/",
          "publishedOn": "2021-06-14T00:00:00.000Z",
          "wordCount": 185,
          "title": "Base Rate"
        },
        {
          "id": "https://xkcd.com/2475/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/health_drink.png\" title=\"You'd need to keep track of so many people! Would you use, like, Excel or something? Far too fancy for a simple country nanoenzyme developer like me.\" alt=\"You'd need to keep track of so many people! Would you use, like, Excel or something? Far too fancy for a simple country nanoenzyme developer like me.\" />",
          "link": "https://xkcd.com/2475/",
          "publishedOn": "2021-06-11T00:00:00.000Z",
          "wordCount": 185,
          "title": "Health Drink"
        },
        {
          "id": "https://xkcd.com/2474/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/first_time_since_early_2020.png\" title=\"Gotten the Ferris wheel operator's attention\" alt=\"Gotten the Ferris wheel operator's attention\" />",
          "link": "https://xkcd.com/2474/",
          "publishedOn": "2021-06-09T00:00:00.000Z",
          "wordCount": 191,
          "title": "First Time Since Early 2020"
        },
        {
          "id": "https://xkcd.com/2473/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/product_launch.png\" title=\"&quot;Okay, that was weird, but the product reveal was normal. I think the danger is pas--&quot; &quot;One more thing.&quot; &quot;Oh no.&quot;\" alt=\"&quot;Okay, that was weird, but the product reveal was normal. I think the danger is pas--&quot; &quot;One more thing.&quot; &quot;Oh no.&quot;\" />",
          "link": "https://xkcd.com/2473/",
          "publishedOn": "2021-06-07T00:00:00.000Z",
          "wordCount": 185,
          "title": "Product Launch"
        }
      ]
    },
    {
      "title": "Software Engineering Daily",
      "feedUrl": "https://softwareengineeringdaily.com/feed/podcast/",
      "siteUrl": "https://softwareengineeringdaily.com/archives/",
      "articles": [
        {
          "id": "https://softwareengineeringdaily.com/?p=11083",
          "author": null,
          "description": "Amundsen was started at Lyft and is the leading open-source data catalog with the fastest-growing community and the most integrations. Amundsen enables you to search your entire organization by text search, see automated and curated metadata, share context with co workers, and learn from others by seeing most common queries on a table or frequently\nThe post Stemma: Understanding Big Data with Mark Grover appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/15/stemma-understanding-big-data-with-mark-grover/?utm_source=rss&utm_medium=rss&utm_campaign=stemma-understanding-big-data-with-mark-grover",
          "publishedOn": "2021-06-15T09:00:32.000Z",
          "wordCount": null,
          "title": "Stemma: Understanding Big Data with Mark Grover",
          "itunes": {
            "duration": "40:33"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED4548783756.mp3",
            "length": "38968779",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11082",
          "author": null,
          "description": "Coinbase is a very popular and well trusted cryptocurrency platform for buying and selling digital assets like Bitcoin, Ethereum, and many more. With Coinbase you can manage your portfolio of cryptocurrencies in 1 place like you would for other investments. There are added features like scheduling recurring purchases of assets, time-delayed withdrawals from digital vaults,\nThe post Coinbase React Native: Building the Cryptocurrency Ecosystem with Brent Walter and Jacob Thornton appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/14/coinbase-rn-building-the-cryptocurrency-ecosystem-with-brent-walter-and-jacob-thornton/?utm_source=rss&utm_medium=rss&utm_campaign=coinbase-rn-building-the-cryptocurrency-ecosystem-with-brent-walter-and-jacob-thornton",
          "publishedOn": "2021-06-14T09:00:11.000Z",
          "wordCount": null,
          "title": "Coinbase React Native: Building the Cryptocurrency Ecosystem with Brent Walter and Jacob Thornton",
          "itunes": {
            "duration": "56:28"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED7754082961.mp3",
            "length": "54252232",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11073",
          "author": null,
          "description": "Corey Quinn is guest hosting on Software Engineering Daily this week, presenting a Tour of the Cloud. Corey Quinn is the Chief Cloud Economist at The Duckbill Group, where he helps companies fix their AWS bill by making it smaller and less horrifying. If you’re looking to lower your AWS bill or negotiate a new\nThe post Oracle Cloud with Salman Paracha appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/11/oracle-cloud-with-salman-paracha/?utm_source=rss&utm_medium=rss&utm_campaign=oracle-cloud-with-salman-paracha",
          "publishedOn": "2021-06-11T09:00:33.000Z",
          "wordCount": null,
          "title": "Oracle Cloud with Salman Paracha",
          "itunes": {
            "duration": "49:42"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED2000485501.mp3",
            "length": "47749093",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11072",
          "author": null,
          "description": "Corey Quinn is guest hosting on Software Engineering Daily this week, presenting a Tour of the Cloud. Corey Quinn is the Chief Cloud Economist at The Duckbill Group, where he helps companies fix their AWS bill by making it smaller and less horrifying. If you’re looking to lower your AWS bill or negotiate a new\nThe post Digital Ocean with John Allspaw appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/10/digital-ocean-with-john-allspaw/?utm_source=rss&utm_medium=rss&utm_campaign=digital-ocean-with-john-allspaw",
          "publishedOn": "2021-06-10T09:00:28.000Z",
          "wordCount": null,
          "title": "Digital Ocean with John Allspaw",
          "itunes": {
            "duration": "56:03"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED4109775475.mp3",
            "length": "53851287",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11059",
          "author": null,
          "description": "Corey Quinn is guest hosting on Software Engineering Daily this week, presenting a Tour of the Cloud. Corey Quinn is the Chief Cloud Economist at The Duckbill Group, where he helps companies fix their AWS bill by making it smaller and less horrifying. If you’re looking to lower your AWS bill or negotiate a new\nThe post GCP with Liz Fong-Jones appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/09/gcp-with-liz-fong-jones/?utm_source=rss&utm_medium=rss&utm_campaign=gcp-with-liz-fong-jones",
          "publishedOn": "2021-06-09T09:00:12.000Z",
          "wordCount": null,
          "title": "GCP with Liz Fong-Jones",
          "itunes": {
            "duration": "55:49"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED4121522002.mp3",
            "length": "53633651",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11056",
          "author": null,
          "description": "Corey Quinn is guest hosting on Software Engineering Daily this week, presenting a Tour of the Cloud. Corey Quinn is the Chief Cloud Economist at The Duckbill Group, where he helps companies fix their AWS bill by making it smaller and less horrifying. If you’re looking to lower your AWS bill or negotiate a new\nThe post Azure with Troy Hunt appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/08/azure-with-troy-hunt/?utm_source=rss&utm_medium=rss&utm_campaign=azure-with-troy-hunt",
          "publishedOn": "2021-06-08T09:00:24.000Z",
          "wordCount": null,
          "title": "Azure with Troy Hunt",
          "itunes": {
            "duration": "55:55"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED4596980197.mp3",
            "length": "53729473",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11042",
          "author": null,
          "description": "Corey Quinn is guest hosting on Software Engineering Daily this week, presenting a Tour of the Cloud. Corey Quinn is the Chief Cloud Economist at The Duckbill Group, where he helps companies fix their AWS bill by making it smaller and less horrifying. If you’re looking to lower your AWS bill or negotiate a new\nThe post AWS with Pete Cheslock appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/07/aws-with-pete-cheslock/?utm_source=rss&utm_medium=rss&utm_campaign=aws-with-pete-cheslock",
          "publishedOn": "2021-06-07T16:51:00.000Z",
          "wordCount": null,
          "title": "AWS with Pete Cheslock",
          "itunes": {
            "duration": "56:54"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED6941410192.mp3",
            "length": "54670171",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11012",
          "author": null,
          "description": "Mark Saroufim is the author of an article entitled “Machine Learning: The Great Stagnation”. Mark is a PyTorch Partner Engineer with Facebook AI. He has spent his entire career developing machine learning and artificial intelligence products. Before joining Facebook to do PyTorch engineering with external partners, Mark was a Machine Learning Engineer at Graphcore. Before\nThe post Machine Learning: The Great Stagnation with Mark Saroufim appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/04/machine-learning-the-great-stagnation-with-mark-saroufim/?utm_source=rss&utm_medium=rss&utm_campaign=machine-learning-the-great-stagnation-with-mark-saroufim",
          "publishedOn": "2021-06-04T09:00:20.000Z",
          "wordCount": null,
          "title": "Machine Learning: The Great Stagnation with Mark Saroufim",
          "itunes": {
            "duration": "50:40"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED1850298960.mp3",
            "length": "48681902",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11027",
          "author": null,
          "description": "Next week Corey Quinn will be guest hosting on Software Engineering Daily, presenting a Tour of the Cloud. Corey Quinn is the Chief Cloud Economist at The Duckbill Group, where he helps companies fix their AWS bill by making it smaller and less horrifying. If you’re looking to lower your AWS bill or negotiate a\nThe post Special Edition Repeat: AWS Analysis with Corey Quinn appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/03/special-edition-repeat-aws-analysis-with-corey-quinn/?utm_source=rss&utm_medium=rss&utm_campaign=special-edition-repeat-aws-analysis-with-corey-quinn",
          "publishedOn": "2021-06-03T09:00:26.000Z",
          "wordCount": null,
          "title": "Special Edition Repeat: AWS Analysis with Corey Quinn",
          "itunes": {
            "duration": "1:06:42"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED4087672822.mp3",
            "length": "64082655",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11011",
          "author": null,
          "description": "Platforms like Ethereum have billions of dollars of market cap and large developer communities. However, it is still a challenge to build widely adopted DApps on it because of current limitations. Blockchain Proof of Work transactions are typically slow, and Proof of Stake transactions trade off decentralization to achieve high throughput. Transaction fees get expensive,\nThe post Polygon: Connecting Ethereum Compatible Blockchain Networks with Denis Ermolin appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/02/polygon-connecting-ethereum-compatible-blockchain-networks-with-denis-ermolin/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-connecting-ethereum-compatible-blockchain-networks-with-denis-ermolin",
          "publishedOn": "2021-06-02T09:00:19.000Z",
          "wordCount": null,
          "title": "Polygon: Connecting Ethereum Compatible Blockchain Networks with Denis Ermolin",
          "itunes": {
            "duration": "45:48"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED2147885832.mp3",
            "length": "44003958",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11003",
          "author": null,
          "description": "AWS Outposts is a fully managed service that offers the same AWS infrastructure, AWS services, APIs, and tools to virtually any datacenter, co-location space, or on-premises facility for a truly consistent hybrid experience. AWS Outposts is ideal for workloads that require low latency access to on-premises systems, local data processing, data residency, and migration of\nThe post AWS Outpost Engineering with Joshua Burgin appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/06/01/aws-outpost-engineering-with-joshua-burgin/?utm_source=rss&utm_medium=rss&utm_campaign=aws-outpost-engineering-with-joshua-burgin",
          "publishedOn": "2021-06-01T09:00:52.000Z",
          "wordCount": null,
          "title": "AWS Outpost Engineering with Joshua Burgin",
          "itunes": {
            "duration": "53:13"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED5636536109.mp3",
            "length": "51134103",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=11002",
          "author": null,
          "description": "Flutter is a UI toolkit developed by Google that helps developers build natively compiled applications for mobile, web, desktop, and embedded devices from a single code base. Development is fast because the screen “hot reloads” as you develop, the architecture is layered for fast and expressive designs, and its widgets incorporate all critical platform differences\nThe post Flutter: Native Web and Mobile App Development with Allen Wyma appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/05/29/flutter-native-web-and-mobile-app-development-with-allen-wyma/?utm_source=rss&utm_medium=rss&utm_campaign=flutter-native-web-and-mobile-app-development-with-allen-wyma",
          "publishedOn": "2021-05-29T15:01:42.000Z",
          "wordCount": null,
          "title": "Flutter: Native Web and Mobile App Development with Allen Wyma",
          "itunes": {
            "duration": "47:34"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED6156563112.mp3",
            "length": "45697991",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=10991",
          "author": null,
          "description": "Data exploration uses visual exploration to understand what is in a dataset and the characteristics of the data. Data scientists explore data to understand things like customer behavior and resource utilization. Some common programming languages used for data exploration are Python, R, and Matlab.  Doris Jung-Lin Lee is currently a Graduate Research Assistant at the\nThe post Data Exploration with a New Python Library with Doris Lee appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/05/27/data-exploration-with-a-new-python-library-with-doris-lee/?utm_source=rss&utm_medium=rss&utm_campaign=data-exploration-with-a-new-python-library-with-doris-lee",
          "publishedOn": "2021-05-27T09:00:16.000Z",
          "wordCount": null,
          "title": "Data Exploration with a New Python Library with Doris Lee",
          "itunes": {
            "duration": "47:58"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED1351893925.mp3",
            "length": "46083032",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=10990",
          "author": null,
          "description": "Arun Kumar is an Assistant Professor in the Department of Computer Science and Engineering and the Halicioglu Data Science Institute at the University of California, San Diego. His primary research interests are in data management and systems for machine learning/artificial intelligence-based data analytics.  Systems and ideas based on his research have been released as part\nThe post Data Management Systems and Artificial Intelligence with Arun Kumar appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/05/26/data-management-systems-and-artificial-intelligence-with-arun-kumar/?utm_source=rss&utm_medium=rss&utm_campaign=data-management-systems-and-artificial-intelligence-with-arun-kumar",
          "publishedOn": "2021-05-27T02:58:05.000Z",
          "wordCount": null,
          "title": "Data Management Systems and Artificial Intelligence with Arun Kumar",
          "itunes": {
            "duration": "1:03:29"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED4209918231.mp3",
            "length": "60981604",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=10969",
          "author": null,
          "description": "Cloud data warehouses are databases hosted in cloud environments. They provide typical benefits of the cloud like flexible data access, scalability, and performance.  The company Firebolt provides a cloud data warehouse built for modern data environments. It decouples storage and compute to operate on top of existing data lakes like S3. It computes orders of\nThe post Firebolt: Data Warehouses with Eldad Farkash appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/05/25/firebolt-data-warehouses-with-eldad-farkash/?utm_source=rss&utm_medium=rss&utm_campaign=firebolt-data-warehouses-with-eldad-farkash",
          "publishedOn": "2021-05-25T09:00:53.000Z",
          "wordCount": null,
          "title": "Firebolt: Data Warehouses with Eldad Farkash",
          "itunes": {
            "duration": "57:59"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED5904677367.mp3",
            "length": "55703875",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=10978",
          "author": null,
          "description": "Running applications in containerized environments involves regularly organizing, adding and replacing containers. This complex job may involve managing clusters of containers in different geographic locations with different configuration requirements. Platforms like Kubernetes are great for managing this complexity, but include steep learning curves to efficiently get anything off the ground. The company Portainer provides a\nThe post Portainer: Container Management with Neil Cresswell appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/05/24/portainer-container-management-with-neil-cresswell/?utm_source=rss&utm_medium=rss&utm_campaign=portainer-container-management-with-neil-cresswell",
          "publishedOn": "2021-05-24T09:00:56.000Z",
          "wordCount": null,
          "title": "Portainer: Container Management with Neil Cresswell",
          "itunes": {
            "duration": "50:24"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED2257818505.mp3",
            "length": "48426384",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=10968",
          "author": null,
          "description": "Apache Superset is an open-source, fast, lightweight and modern data exploration and visualization platform. It can connect to any SQL based data source through SQLAlchemy at petabyte scale. Its architecture is highly scalable and it ships with a wide array of visualizations. The company Preset provides a powerful, easy to use data exploration and visualization\nThe post Preset: Visualizing Big Data with Srini Kadamati appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/05/20/preset-visualizing-big-data-with-srini-kadamati/?utm_source=rss&utm_medium=rss&utm_campaign=preset-visualizing-big-data-with-srini-kadamati",
          "publishedOn": "2021-05-20T09:00:50.000Z",
          "wordCount": null,
          "title": "Preset: Visualizing Big Data with Srini Kadamati",
          "itunes": {
            "duration": "53:46"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED2293057437.mp3",
            "length": "51662442",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=10963",
          "author": null,
          "description": "Application Programming Interfaces (APIs) are interfaces that enable multiple software applications to send and retrieve data from one another. They are commonly used for retrieving, saving, editing, or deleting data from databases, transmitting data between apps, and embedding third-party services into apps. The company BaseTen helps companies build and deploy machine learning APIs and applications.\nThe post BaseTen: Creating Machine Learning APIs with Tuhin Srivastava and Amir Haghighat appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/05/19/baseten-creating-machine-learning-apis-with-tuhin-srivastava-and-amir-haghighat/?utm_source=rss&utm_medium=rss&utm_campaign=baseten-creating-machine-learning-apis-with-tuhin-srivastava-and-amir-haghighat",
          "publishedOn": "2021-05-20T04:22:55.000Z",
          "wordCount": null,
          "title": "BaseTen: Creating Machine Learning APIs with Tuhin Srivastava and Amir Haghighat",
          "itunes": {
            "duration": "52:53"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED2097833809.mp3",
            "length": "50813680",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=10933",
          "author": null,
          "description": "The company Skynet Labs provides an open protocol for hosting data and web applications on the decentralized web. Skynet allows for decentralized, censorship-resistant, highly redundant storage and applications that are available around the globe. Developers don’t pay for their application’s storage, can launch apps with access to a user’s data right away, are free from\nThe post Skynet Labs: Decentralized Internet with Matthew Sevey appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/05/18/skynet-labs-decentralized-internet-with-matthew-sevey/?utm_source=rss&utm_medium=rss&utm_campaign=skynet-labs-decentralized-internet-with-matthew-sevey",
          "publishedOn": "2021-05-18T18:20:06.000Z",
          "wordCount": null,
          "title": "Skynet Labs: Decentralized Internet with Matthew Sevey",
          "itunes": {
            "duration": "55:12"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED8581010562.mp3",
            "length": "53040940",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://softwareengineeringdaily.com/?p=10932",
          "author": null,
          "description": "Columnar databases store and retrieve columns of data rather than rows of data. Each block of data in a columnar database stores up to 3 times as many records as row-based storage. This means you can read data with a third of the power needed in row-based data, among other advantages. The company Altinity is\nThe post ClickHouse: Data Warehousing with Robert Hodges appeared first on Software Engineering Daily.",
          "link": "https://softwareengineeringdaily.com/2021/05/17/clickhouse-data-warehousing-with-robert-hodges/?utm_source=rss&utm_medium=rss&utm_campaign=clickhouse-data-warehousing-with-robert-hodges",
          "publishedOn": "2021-05-17T18:48:04.000Z",
          "wordCount": null,
          "title": "ClickHouse: Data Warehousing with Robert Hodges",
          "itunes": {
            "duration": "44:15"
          },
          "enclosure": {
            "url": "https://traffic.megaphone.fm/SED9539024947.mp3",
            "length": "42517744",
            "type": "audio/mpeg"
          }
        }
      ]
    },
    {
      "title": "Camunda",
      "feedUrl": "https://camunda.com/feed/",
      "siteUrl": "https://camunda.com",
      "articles": [
        {
          "id": "https://camunda.com/?p=22086",
          "author": "Felix Mueller",
          "description": "What is Camunda Cloud, and why is the community so excited about the first ever on-demand SaaS process automation as a service?\nThe post Your Camunda Cloud Questions Answered appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/06/your-camunda-cloud-questions-answered/",
          "publishedOn": "2021-06-15T08:00:00.000Z",
          "wordCount": 2234,
          "title": "Your Camunda Cloud Questions Answered"
        },
        {
          "id": "https://camunda.com/?p=22263",
          "author": "Charley Mann",
          "description": "How did one of Germany’s leading insurers, handling insurance premiums in excess of six billion per year, undergo a complete digital transformation in less than six years?\nThe post Scaling Camunda Adoption at Provinzial appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/06/scaling-camunda-adoption-at-provinzial/",
          "publishedOn": "2021-06-14T13:39:19.000Z",
          "wordCount": 1906,
          "title": "Scaling Camunda Adoption at Provinzial"
        },
        {
          "id": "https://camunda.com/?p=22069",
          "author": "Luca Buchholz",
          "description": "We’re thrilled to introduce our first cohort of Camunda Champions - individuals who demonstrate product expertise while actively supporting and contributing to developer communities.\nThe post Welcome, Camunda Champions appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/06/welcome-camunda-champions/",
          "publishedOn": "2021-06-10T08:59:42.000Z",
          "wordCount": 1670,
          "title": "Welcome, Camunda Champions"
        },
        {
          "id": "https://camunda.com/?p=21971",
          "author": "Camunda Team",
          "description": "Our partner Novatec combined Business Process Management with Artificial Intelligence, and the result was awesome!\nThe post Intelligent Process Automation with Camunda and Amazon Comprehend appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/06/intelligent-process-automation-with-camunda-and-amazon-comprehend/",
          "publishedOn": "2021-06-09T09:25:59.000Z",
          "wordCount": 2749,
          "title": "Intelligent Process Automation with Camunda and Amazon Comprehend"
        },
        {
          "id": "https://camunda.com/?p=22042",
          "author": "Camunda Cloud Team",
          "description": "We’re excited to announce the release of Camunda Cloud 1.1.0-alpha1, which includes 1.1.0-alpha1  versions of Zeebe, Operate and\nThe post Camunda Cloud 1.1.0-alpha1 Released appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/06/camunda-cloud-110-alpha1-released/",
          "publishedOn": "2021-06-08T15:08:51.000Z",
          "wordCount": 1554,
          "title": "Camunda Cloud 1.1.0-alpha1 Released"
        },
        {
          "id": "https://camunda.com/?p=21941",
          "author": "Felix Mueller",
          "description": "We’re excited to announce the release of Camunda Optimize 3.5.0-alpha2, featuring a new Elasticsearch header plugin, and Report embedding improvements. \nThe post Camunda Optimize 3.5.0-alpha2 Released appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/06/camunda-optimize-3-5-0-alpha2-released/",
          "publishedOn": "2021-06-08T07:15:00.000Z",
          "wordCount": 1651,
          "title": "Camunda Optimize 3.5.0-alpha2 Released"
        },
        {
          "id": "https://camunda.com/?p=21820",
          "author": "Camunda BPM Team",
          "description": "We are pleased to announce the next alpha release of Camunda Platform Runtime 7.16. This release features the following improvements: Cockpit: Set Variables on Process Instance Migration (Enterprise) 7 Bug Fixes You can Download Camunda for free or Run it with Docker. For a complete list of all improvements, take a look at the release notes. Please also see the list of known issues. If you want to dig in deeper, you can find the source code on GitHub. Cockpit: Set Variables on Process Instance Migration This feature is only available in the Enterprise Edition of the Camunda Platform Runtime — try it out with a free trial. Our last alpha release featured the option to Set Variables on Process...\nThe post Camunda Platform Runtime 7.16.0-alpha2 Released appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/06/camunda-platform-runtime-7160-alpha2-released/",
          "publishedOn": "2021-06-08T07:00:00.000Z",
          "wordCount": 1398,
          "title": "Camunda Platform Runtime 7.16.0-alpha2 Released"
        },
        {
          "id": "https://camunda.com/?p=21776",
          "author": "Josh Wulf",
          "description": "The latest episode of the Camunda Nation podcast is live, and this time we’re talking all things BPMN Modeling with Camunda Platform engineer Maciej Barelkowski.\nThe post Modeling with Camunda: The Podcast appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/06/camunda-modeler-cawemo-bpmnio-the-podcast/",
          "publishedOn": "2021-06-02T16:58:06.000Z",
          "wordCount": 1437,
          "title": "Modeling with Camunda: The Podcast",
          "enclosure": {
            "url": "https://camunda.com/wp-content/uploads/2021/06/soundbite.mp4",
            "length": "1334214",
            "type": "video/mp4"
          }
        },
        {
          "id": "https://camunda.com/?p=21613",
          "author": "Camunda Team",
          "description": "How do we make government tech work better for our citizens and our stakeholders? \nThe post Process Automation in Government: Challenges, Benefits, Best Practices appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/05/process-automation-in-government-challenges-benefits-best-practices/",
          "publishedOn": "2021-05-28T10:33:27.000Z",
          "wordCount": 2007,
          "title": "Process Automation in Government: Challenges, Benefits, Best Practices"
        },
        {
          "id": "https://camunda.com/?p=21453",
          "author": "Camunda Team",
          "description": "How did we see such a great increase in engagement during our busiest season, despite not participating in Hacktoberfest before?\nThe post How to Run a Successful Hacktoberfest Campaign with No Prior Experience appeared first on Camunda.",
          "link": "https://camunda.com/blog/2021/05/how-to-run-a-successful-hacktoberfest-campaign-with-no-prior-experience/",
          "publishedOn": "2021-05-26T17:44:11.000Z",
          "wordCount": 3159,
          "title": "How to Run a Successful Hacktoberfest Campaign with No Prior Experience"
        }
      ]
    },
    {
      "title": "Brendan Gregg's Blog",
      "feedUrl": "http://www.brendangregg.com/blog/rss.xml",
      "siteUrl": "http://www.brendangregg.com/blog",
      "articles": [
        {
          "id": "http://www.brendangregg.com/blog/2021-06-15/bpf-internals.html",
          "author": null,
          "description": "For USENIX LISA2021 I gave a 40 minute deep dive talk on BPF internals for Linux, focusing on observability tracing tools. Since there are already BPF internals references online (listed in this post) I used the opportunity to create some new content, showing how bpftrace instrumentation works from user space down to machine code. I break it down to all the small components involved, where you'll find it's actually quite easy.",
          "link": "http://www.brendangregg.com/blog/2021-06-15/bpf-internals.html",
          "publishedOn": "2021-06-14T14:00:00.000Z",
          "wordCount": null,
          "title": "USENIX LISA2021 BPF Internals (eBPF)",
          "itunes": {}
        },
        {
          "id": "http://www.brendangregg.com/blog/2021-06-04/an-unbelievable-demo.html",
          "author": null,
          "description": "This is the story of the most unbelievable demo I've been given in world of open source. You can't make this stuff up.",
          "link": "http://www.brendangregg.com/blog/2021-06-04/an-unbelievable-demo.html",
          "publishedOn": "2021-06-03T14:00:00.000Z",
          "wordCount": null,
          "title": "An Unbelievable Demo",
          "itunes": {}
        },
        {
          "id": "http://www.brendangregg.com/blog/2021-05-29/moving-to-australia.html",
          "author": null,
          "description": "I've moved from the San Francisco Bay Area to Sydney, Australia, where I will continue the best job so far of my career: Performance engineering at Netflix. I'm grateful for the support of Netflix engineering management, Netflix HRBPs, and others for helping to make this happen. While my move is among the first from the Linux cloud teams, Netflix has had staff in Australia for years (for content, marketing, and the FreeBSD OCA).",
          "link": "http://www.brendangregg.com/blog/2021-05-29/moving-to-australia.html",
          "publishedOn": "2021-05-28T14:00:00.000Z",
          "wordCount": null,
          "title": "Moving my US tech job to Australia",
          "itunes": {}
        },
        {
          "id": "http://www.brendangregg.com/blog/2021-05-23/what-is-observability.html",
          "author": null,
          "description": "It's a made-up computer word that my word processor decorates with a wiggly red you-can't-spell line. At least it did until I clicked \"Add to Dictionary\" (it got too annoying as I was writing a book on computer observability).",
          "link": "http://www.brendangregg.com/blog/2021-05-23/what-is-observability.html",
          "publishedOn": "2021-05-22T14:00:00.000Z",
          "wordCount": null,
          "title": "What is Observability",
          "itunes": {}
        }
      ]
    }
  ],
  "cliVersion": "1.10.2"
}