{
  "sources": [
    {
      "title": "Spring",
      "feedUrl": "https://spring.io/blog.atom",
      "siteUrl": "https://spring.io/blog",
      "articles": [
        {
          "id": "https://spring.io/blog/2022/10/21/introducing-spring-modulith",
          "author": null,
          "description": "When designing software systems, architects and developers have plenty of architectural options to choose from. Microservice-based systems have become ubiquitous in the last couple of years. However, the idea of monolithic, modular systems has also regained popularity recently.\r\nIndependent of the architectural style ultimately selected, the individual applications comprising the overall system need their structure to be evolvable and able to follow changes in business requirements.\n\r\n\r\n\r\nTraditionally, application frameworks have provided structural guidance by providing abstractions aligned with technical concepts, such as Spring Framework’s stereotype annotations (@Controller, @Service, @Repository, and so on).\r\nHowever, shifting the focus to align code structure with the domain has pro…",
          "link": "https://spring.io/blog/2022/10/21/introducing-spring-modulith",
          "publishedOn": "2022-10-21T12:00:00.000Z",
          "wordCount": 1926,
          "title": "Introducing Spring Modulith",
          "imageUrl": "https://avatars.githubusercontent.com/u/128577?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/20/spring-boot-3-0-0-rc1-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 3.0.0-RC1 has been released and is now available from https://repo.spring.io/milestone.\n\r\nThis release includes 135 enhancements, documentation improvements, dependency upgrades, and bug fixes. \n\r\nThis is our first release candidate for Spring Boot 3.0, which we expect to release November 24, 2022. We are not expecting any more features to be added at this point, and we will only be making API changes if we find issues.\n\r\nThis release is the culmination of 11 months of work and is the first release to fully realize the themes that we set out to deliver in Spring Boot 3.0. Most notably, this release builds on the multi-year R&D effort that started with the experimental Spring Native project to pro…",
          "link": "https://spring.io/blog/2022/10/20/spring-boot-3-0-0-rc1-available-now",
          "publishedOn": "2022-10-21T04:00:00.000Z",
          "wordCount": 825,
          "title": "Spring Boot 3.0.0-RC1 available now",
          "imageUrl": "https://avatars.githubusercontent.com/u/519772?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/20/a-bootiful-podcast-microsoft-s-asir-selvasingh-on-azure-spring-apps-java-at-microsoft-application-security-and-more",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxma) talks to his friend, Microsoft’s Asir Selvasingh (@asirselvasingh), about Azure Spring Apps, Java at Microsoft, Spring, application security, and more. Want to learn more? Join us at SpringOne (6-8 December 2022)!",
          "link": "https://spring.io/blog/2022/10/20/a-bootiful-podcast-microsoft-s-asir-selvasingh-on-azure-spring-apps-java-at-microsoft-application-security-and-more",
          "publishedOn": "2022-10-20T15:00:00.000Z",
          "wordCount": 569,
          "title": "A Bootiful Podcast: Microsoft's Asir Selvasingh on Azure Spring Apps, Java at Microsoft, application security, and more",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/20/spring-boot-2-7-5-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.7.5 has been released and is now available from Maven Central.\n\r\nThis release includes 31 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2022/10/20/spring-boot-2-7-5-available-now",
          "publishedOn": "2022-10-20T14:27:46.000Z",
          "wordCount": 610,
          "title": "Spring Boot 2.7.5 available now",
          "imageUrl": "https://avatars.githubusercontent.com/u/490484?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/20/spring-framework-6-0-0-rc2-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I am pleased to announce that Spring Framework 6.0.0-RC2 is available now.\n\r\nSpring Framework 6.0.0-RC2 includes 28 fixes and improvements. Stay tuned for the announcement of Spring Boot 3.0.0-RC1 later today!\n\r\nProject Page | GitHub | Issues | Documentation",
          "link": "https://spring.io/blog/2022/10/20/spring-framework-6-0-0-rc2-available-now",
          "publishedOn": "2022-10-20T13:17:51.000Z",
          "wordCount": 554,
          "title": "Spring Framework 6.0.0-RC2 available now",
          "imageUrl": "https://avatars.githubusercontent.com/u/490484?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/20/cve-2022-31684-reactor-netty-http-server-may-log-request-headers",
          "author": null,
          "description": "The Reactor Netty 1.0.24 release on October 11 included fix for CVE-2022-31684 affecting Reactor Netty HTTP Server.\nUsers are encouraged to update as soon as possible.\n\r\nReactor Netty is used internally in many frameworks including Spring WebFlux and its WebClient.\nIf you have a Spring Boot application, you can upgrade to Reactor BOM 2020.0.24.",
          "link": "https://spring.io/blog/2022/10/20/cve-2022-31684-reactor-netty-http-server-may-log-request-headers",
          "publishedOn": "2022-10-20T12:45:00.000Z",
          "wordCount": 565,
          "title": "CVE-2022-31684: Reactor Netty HTTP Server may log request headers",
          "imageUrl": "https://avatars.githubusercontent.com/u/696661?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/20/spring-boot-2-6-13-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.6.13 has been released and is now available from Maven Central.\n\r\nThis release includes 27 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2022/10/20/spring-boot-2-6-13-available-now",
          "publishedOn": "2022-10-20T10:45:48.000Z",
          "wordCount": 610,
          "title": "Spring Boot 2.6.13 available now",
          "imageUrl": "https://avatars.githubusercontent.com/u/490484?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/20/spring-batch-5-0-rc1-is-out",
          "author": null,
          "description": "It is finally here! The first release candidate of Spring Batch 5 is now available from our milestone repository. In this release, we worked on the following items:\n\r\n\r\n  \nExecution context Meta-data improvement\n\r\n  \nGemFire support removal\n\r\n\r\nThis blog post walks through these two changes in details. For the complete list of changes, please check the release notes.\nExecution context Meta-data improvement\n\r\nIn addition to what Spring Batch already persists in the execution context with regard to runtime information (like the step type, the restart flag, etc), this release adds an important detail in the execution context which is the Spring Batch version that was used to serialize the context.\n\r\nWhile this seems a detail, it has a huge added value when debugging upgrade issues with regard to execution context serialization and deserialization.\nGemFire support removal\n\r\nBased on the decision to discontinue the support of Spring Data for Apache Geode, the support for Apache Geode in Spring Batch was removed.\n\r\nThe code was moved to the spring-batch-extensions repository as a community-driven effort.\nWhat’s next?\n\r\nWe are planning to roll out a second release candidate early November and release 5.0.0 GA by the end of November, in time for Spring Boot 3.0.0. We would appreciate your help to try this release candidate out and share your feedback with us on Github, Twitter and StackOverflow. You can find a migration guide here.\n\r\nI would like to thank all contributors who had a role in this first release candidate!\n\r\n\r\nSpring Batch Home|Source on Github|Reference documentation",
          "link": "https://spring.io/blog/2022/10/20/spring-batch-5-0-rc1-is-out",
          "publishedOn": "2022-10-20T08:00:00.000Z",
          "wordCount": 755,
          "title": "Spring Batch 5.0 RC1 is out!",
          "imageUrl": "https://avatars.githubusercontent.com/u/1210553?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/18/this-week-in-spring-october-18th-2022",
          "author": null,
          "description": "Hi, Spring fans! How’re you doin’? I’m doin’ alright! Last week I was in Antwerp, Belgium, for the amazing Devoxx BE show. I did a presentation with my friend and hero James Ward on Spring and Kotlin (that was voted third most-liked talk at a show with more than 250 speakers!) That was a personal career highlight for me - it’s not often you get to win and have fun in life. And, as if that wasn’t awesome enough, this week I am in Las Vegas, NV, for JavaOne! Fingers crossed, this week will go smoothly, too! Both Devoxx and JavaOne are the first such shows since at least before the pandemic. It’s been a very long time in coming and I’m elated, overjoyed, to be able to be here.\n\r\nAnd, of course, I’m super excited about SpringOne 2022! Also, the first in-person show of its kind since before the pandemic! It’s going to be amazing. Have you registered? If not, you might consider using this registration code - S1VM22_Advocate_200.\n\r\nAnd this week’s busy roundup reflects the usual flurry of activity on the Spring team as we ready releases for our end-of-November timelines for Spring Framework 6 and Spring Boot 3, which means we’ve got a ton of stuff to get into this week, so let’s!\n\r\n\r\n  \nSpring Framework 6.0 goes RC1\n\r\n  \nObservability with Spring Boot 3\n\r\n  \nA Bootiful Podcast: Google mad scientist Josh Suereth on Observability with OpenTelemetry, building better build tools, and so much more \n\r\n  \nSpring Batch 5.0.0-M8 is out!\n\r\n  \nLearn more about Spring Framework 6 and Spring Boot 3 in these two great talks from Devoxx 2022\n\r\n  \nSpring at JavaOne 2022\n\r\n  \nSpring Data 2022.0.0-RC1, 2021.2.5, and 2021.1.8 available\n\r\n  \nSpring Security 6.0.0-RC1 and 5.8.0-RC1 are released\n\r\n  \nSpring Security 5.7.4 and 5.6.8 available now\n\r\n  \nSpring for GraphQL 1.1.0-RC1 released\n\r\n  \nSpring Web Services 4.0.0-RC1 is out!",
          "link": "https://spring.io/blog/2022/10/18/this-week-in-spring-october-18th-2022",
          "publishedOn": "2022-10-18T19:00:00.000Z",
          "wordCount": 816,
          "title": "This Week in Spring - October 18th, 2022",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/18/spring-web-services-4-0-0-rc1-is-out",
          "author": null,
          "description": "Greetings Spring community,\n\r\n\r\n\r\nThe Spring Web Services team has released 4.0.0-RC1. This is the last planned release candidate that supports Spring Boot 3.0. The final GA release is coming next month in anticipation of Spring Boot 3.0 going GA.\n\r\n\r\n\r\n4.0.x is the generation of Spring Web Services that works with Jakarta EE 9, the version where the enterprise specs (JAX-WS, etc.) migrate from javax. to jakarta.. See Juergen Holler’s blog post for more details about that.\n\r\n\r\n\r\nBeing based upon Spring Framework 6.0, this is also the generation of Spring Web Services that is rebased on top of Java 17 (LTS). So check it out!\n\r\n\r\n\r\nFor more details, read the following release notes for each version:\n\r\n\r\n\r\nRelease Notes - Spring Web Services - Version 4.0.0-RC1\n\r\n\r\n\r\n#1284 - Upgrade to Spring…",
          "link": "https://spring.io/blog/2022/10/18/spring-web-services-4-0-0-rc1-is-out",
          "publishedOn": "2022-10-18T19:00:00.000Z",
          "wordCount": 899,
          "title": "Spring Web Services 4.0.0-RC1 is out!",
          "imageUrl": "https://avatars.githubusercontent.com/u/311040?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/18/spring-for-graphql-1-1-0-rc1-released",
          "author": null,
          "description": "I’m pleased to announce that the first release candidate of Spring for GraphQL 1.1.0 is now available from our Milestone repository. This version will be shipped with Spring Boot 3.0.0-RC1 due for release later this week.\n\r\nThis release candidate is the last stop for shipping new features; from that point, we’ll be focusing on bug fixes and documentation improvements. Our goal is to stabilize the current branch for our GA release scheduled next month.\n\r\nWith RC1, we’re shipping our new Observability support in Spring for GraphQL. Based on the new Micrometer Observation work, this infrastructure replaces the former GraphQL Metrics support in Spring Boot 2.7. GraphQL is a good use case for Observability in general, as the GraphQL engine can distribute the data fetching operations over caches, databases, REST APIs and more. It’s important not only to keep track of performance metrics for your GraphQL API, but also to be able to explore traces and investigate production issues.\n\r\nWe didn’t have time to tackle features like Pagination/Relay or AOT/Native support, but we’re listening to the community. We’re working on our roadmap for the next feature version, so now is the time to vote on existing issues to show your interest!\n\r\nThe annual Spring survey is here, it’s a great way to let us know what you think!\nHow can you help?\n\r\nIf you have general questions, please ask on stackoverflow.com using the spring-graphql tag.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow",
          "link": "https://spring.io/blog/2022/10/18/spring-for-graphql-1-1-0-rc1-released",
          "publishedOn": "2022-10-18T16:40:00.000Z",
          "wordCount": 749,
          "title": "Spring for GraphQL 1.1.0-RC1 released",
          "imageUrl": "https://avatars.githubusercontent.com/u/103264?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/18/spring-security-5-7-4-and-5-6-8-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I am pleased to announce that Spring Security 5.7.4 and 5.6.8 are available now. In both cases the releases are largely composed of dependency upgrades and minor fixes.\n\r\n\r\n\r\nTo learn more, please visit the 5.7.4 and\r\n 5.6.8 release summaries.\n\r\n\r\n\r\nProject Site | Reference | Help",
          "link": "https://spring.io/blog/2022/10/18/spring-security-5-7-4-and-5-6-8-available-now",
          "publishedOn": "2022-10-18T12:54:00.000Z",
          "wordCount": 564,
          "title": "Spring Security 5.7.4 and 5.6.8 available now",
          "imageUrl": "https://avatars.githubusercontent.com/u/5248162?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/18/spring-security-6-0-0-rc1-and-5-8-0-rc1-are-released",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I am pleased to announce that Spring Security 6.0.0-RC1 and 5.8.0-RC1 are available now.\n\r\n\r\n\r\nSee the 6.0.0-RC1 and 5.8.0-RC1 release notes for more details.\n\r\n\r\n\r\nProject Site | Reference | Help",
          "link": "https://spring.io/blog/2022/10/18/spring-security-6-0-0-rc1-and-5-8-0-rc1-are-released",
          "publishedOn": "2022-10-18T12:54:00.000Z",
          "wordCount": 549,
          "title": "Spring Security 6.0.0-RC1 and 5.8.0-RC1 are released",
          "imageUrl": "https://avatars.githubusercontent.com/u/5248162?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/17/spring-data-2022-0-0-rc1-2021-2-5-and-2021-1-8-available",
          "author": null,
          "description": "Dear Spring community,\n\r\nOn behalf of the Spring Data team and everyone who contributed, it is my pleasure to announce that Spring Data 2022.0.0 has entered its release candidate phase by releasing RC1 today. It is available from the milestone repository. This release ships with several tickets fixed. Along with the release candidate, we shipped 2021.2.5 and 2021.1.8 service releases, to be picked up by corresponding Spring Boot releases.\n\r\nThe release candidate ships with a revised module structure, specifically Spring Data for Apache Geode is no longer part of the release train. Expect a blog post that outlines details soon.\n\r\nPlease give Spring Data 2022.0.0-RC1 a try (for example, as part of the upcoming Spring Boot 3.0.0-RC1 release), which will be available start.spring.io soon, and …",
          "link": "https://spring.io/blog/2022/10/17/spring-data-2022-0-0-rc1-2021-2-5-and-2021-1-8-available",
          "publishedOn": "2022-10-17T08:23:00.000Z",
          "wordCount": 1171,
          "title": "Spring Data 2022.0.0-RC1, 2021.2.5, and 2021.1.8 available",
          "imageUrl": "https://avatars.githubusercontent.com/u/1035015?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/16/spring-at-javaone-2022",
          "author": null,
          "description": "Hi, Spring fans! It’s Sunday the 16th of October as I write this and I’m winging my way to sunny Las Vegas, Nevada, where I’ll be attending (and presenting at) the first JavaOne show in years! It didn’t exist as the JavaOne we know and love for years, even before the pandemic interrupted life as we know it worldwide. So this isn’t just the first JavaOne since 2019, it’s [the first JavaOne since 2017](https://www.infoq.com/news/2018/04/oracle-kills-java-one/_! I can’t wait to be there, to see the amazing community, to soak up the sun and fun with my teammates and friends in the ecosystem. And we want to see you, too.\n\r\nThere are a few of us doing talks from the Spring team and we’d love to see you!\n\r\nFirst of all: we have a booth, so join us there.\n\r\nThere are going to be a bunch of great t…",
          "link": "https://spring.io/blog/2022/10/16/spring-at-javaone-2022",
          "publishedOn": "2022-10-16T07:00:00.000Z",
          "wordCount": 933,
          "title": "Spring at JavaOne 2022",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/15/learn-more-about-spring-framework-6-and-spring-boot-3-in-these-two-great-talks-from-devoxx-2022",
          "author": null,
          "description": "Hi, Spring fans! I was just at Devoxx in Belgium, where hundreds of experts from across the Java ecosystem converged for the first time since 2019 to deliver their biggest and best. \n\r\nI could do a proper trip report, but I really just came here to point you to two talks from two of my amazing teammates, Stéphane Nicoll (@snicoll) and Brian Clozel (@bclozel), who have been very hard at work on both Spring Framework 6 and Spring Boot 3, both of which will land by the end of November, 2022. These are brand new generations of the framework, implying huge new paradigms and new opportunities for developers. \n\r\nThis first is a broader, whirlwind tour of the new features in Spring Framework 6 (which bubble up into Spring Boot 3).\n\r\n\r\nThis second one introduces the new ahead-of-time (AOT) support in Spring Framework 6 and Spring Boot 3, which makes it trivial to build GraalVM native images.\n\r\n\n\r\nNB: please ignore the metadata for the YouTube videos. Both talks feature both speakers, and there is no mention whatsoever of React and JavaScript and the like. I think that was a metadata issue with the publication of the videos on YouTube, which will hopefully be resolved. \n\r\nEnjoy! \n\r\nIf you missed this event, that’s OK - there’s still time to join the Spring team and larger Java ecosystem for SpringOne, being held 6-8 December, 2022, in sunny San Francisco, CA, 94105! Join us! (Psst.: If you register now, there’s a $200 discount from the pass price with this code S1VM22_Advocate_200.)",
          "link": "https://spring.io/blog/2022/10/15/learn-more-about-spring-framework-6-and-spring-boot-3-in-these-two-great-talks-from-devoxx-2022",
          "publishedOn": "2022-10-15T07:00:00.000Z",
          "wordCount": 787,
          "title": "Learn more about Spring Framework 6 and Spring Boot 3 in these two great talks from Devoxx 2022",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/13/spring-batch-5-0-0-m8-is-out",
          "author": null,
          "description": "On behalf of the team and all contributors, I am pleased to announce that Spring Batch 5.0.0-M8 is now available from our milestone repository.\n\r\nIn this milestone, we introduced two main changes:\n\r\n\r\n  \nNew default execution context serialization format\n\r\n  \nSystemCommandTasklet enhancements\n\r\n\r\nThis blog post walks through these two major changes in details. For the complete list of changes,\nplease check the release notes.\nNew default execution context serialization format\n\r\nIn this milestone release, the DefaultExecutionContextSerializer was updated to serialize/deserialize the context to/from Base64.\n\r\nMoreover, the default ExecutionContextSerializer configured by @EnableBatchProcessing or DefaultBatchConfiguration was changed from JacksonExecutionContextStringSerializer to DefaultExecutionContextSerializer. The dependency to Jackson was made optional. In order to use the JacksonExecutionContextStringSerializer, jackson-core should be added to the classpath.\nSystemCommandTasklet enhancements\n\r\nThe SystemCommandTasklet has been revisited in this release and was changed as follows:\n\r\n\r\n  \n\r\n  \nA new strategy interface named CommandRunner was introduced in order to decouple the command execution from the tasklet execution. The default implementation is the JvmCommandRunner which uses the java.lang.Runtime#exec API to run system commands. This interface can be implemented to use any other API to run system commands.\n\r\n  \n\r\n  \nThe method that runs the command now accepts an array of Strings representing the command and its arguments. There is no need to tokenize the command or do any pre-processing anymore. This change makes the API more intuitive, and less prone to errors.\n\r\n\nFeedback\n\r\nI would like to thank all contributors who had a role in this release! As we continue\nour work on Spring Batch 5, we look forward to your feedback on Github, Twitter and StackOverflow.\n\r\n\r\nSpring Batch Home|Source on Github|Reference documentation",
          "link": "https://spring.io/blog/2022/10/13/spring-batch-5-0-0-m8-is-out",
          "publishedOn": "2022-10-13T08:00:00.000Z",
          "wordCount": 766,
          "title": "Spring Batch 5.0.0-M8 is out!",
          "imageUrl": "https://avatars.githubusercontent.com/u/1210553?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/12/a-bootiful-podcast-google-mad-scientist-josh-suereth-on-observability-with-opentelemetry-building-better-build-tools-and-so-much-more",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) looks at the latest and greatest in Spring Boot 3 AOT, then talks to Google’s Josh Suereth (@jsuereth) about observability with OpenTelemetry, building better build tools, and so much more. \n\r\n\r\nWant to learn more about Spring Boot and the wider ecosystem? SpringOne 2022 is almost here! If you want a chance to learn from the source, I hope you’ll join us 6-8 December 2022, right here in my hometown of San Francisco, my favorite west coast city in the USA. (Psst.: If you register now, there’s a $200 discount from the pass price with this code S1VM22_Advocate_200.)",
          "link": "https://spring.io/blog/2022/10/12/a-bootiful-podcast-google-mad-scientist-josh-suereth-on-observability-with-opentelemetry-building-better-build-tools-and-so-much-more",
          "publishedOn": "2022-10-13T06:00:00.000Z",
          "wordCount": 641,
          "title": "A Bootiful Podcast: Google mad scientist Josh Suereth on Observability with OpenTelemetry, building better build tools, and so much more",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/12/observability-with-spring-boot-3",
          "author": null,
          "description": "The Spring Observability Team has been working on adding observability support for Spring Applications for quite some time, and we are pleased to inform you that this feature will be generally available with Spring Framework 6 and Spring Boot 3!\n\r\n\r\n\r\nWhat is observability? In our understanding, it is \"how well you can understand the internals of your system by examining its outputs\". We believe that the interconnection between metrics, logging, and distributed tracing gives you the ability to reason about the state of your system in order to debug exceptions and latency in your applications. You can watch more about what we think observability is in this episode of Enlightning with Jonatan Ivanov.\n\r\n\r\n\r\nThe upcoming Spring Boot 3.0.0-RC1 release will contain numerous autoconfigurations fo…",
          "link": "https://spring.io/blog/2022/10/12/observability-with-spring-boot-3",
          "publishedOn": "2022-10-12T21:00:00.000Z",
          "wordCount": 4128,
          "title": "Observability with Spring Boot 3",
          "imageUrl": "https://avatars.githubusercontent.com/u/3297437?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/10/12/spring-framework-6-0-goes-rc1",
          "author": null,
          "description": "Dear Spring community,\n\r\nIt is my pleasure to announce that a feature-complete Spring Framework 6.0 release candidate is available now! We are expecting a further release candidate in time for the first Spring Boot 3.0 release candidate next week, and then our final releases for general availability in November.\n\r\nAs a major revision of the core framework, 6.0 RC1 comes with a Java 17+ baseline, a move to Jakarta EE 9+ (in the jakarta namespace superseding the former javax based EE APIs), and a broader infrastructure revision. This provides access to the latest web containers such as Tomcat 10 / Jetty 11 and the latest persistence providers such as Hibernate ORM 6.1 - all of which are exclusively available with the jakarta-namespaced variants of the Servlet API and JPA. It also sets the st…",
          "link": "https://spring.io/blog/2022/10/12/spring-framework-6-0-goes-rc1",
          "publishedOn": "2022-10-12T11:45:11.000Z",
          "wordCount": 830,
          "title": "Spring Framework 6.0 goes RC1",
          "imageUrl": "https://avatars.githubusercontent.com/u/1263688?v=4?s=200"
        }
      ]
    },
    {
      "title": "HashiCorp Blog",
      "feedUrl": "https://www.hashicorp.com/blog/feed.xml",
      "siteUrl": "https://hashicorp.com/blog",
      "articles": [
        {
          "id": "https://www.hashicorp.com/blog/hashiconf-global-2022-from-zero-trust-to-no-code",
          "author": null,
          "description": "Check out the highlights from HashiConf Global 2022 and watch the 40+ keynote and session recordings now live on YouTube.",
          "link": "https://www.hashicorp.com/blog/hashiconf-global-2022-from-zero-trust-to-no-code",
          "publishedOn": "2022-10-21T16:30:00.000Z",
          "wordCount": 1805,
          "title": "HashiConf Global 2022: From Zero Trust to No Code",
          "imageUrl": "https://www.datocms-assets.com/2885/1666368098-2022_hashiconf_thursday_081_2507.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/pre-plan-apply-run-tasks-now-available-in-terraform-cloud",
          "author": null,
          "description": "Enhance your Terraform Cloud workflow by adding run tasks before the plan and/or apply stages.",
          "link": "https://www.hashicorp.com/blog/pre-plan-apply-run-tasks-now-available-in-terraform-cloud",
          "publishedOn": "2022-10-20T16:00:00.000Z",
          "wordCount": 1866,
          "title": "Pre-Plan/Apply Run Tasks Now Available in Terraform Cloud",
          "imageUrl": "https://www.datocms-assets.com/2885/1620073844-blog-library-product-terraform-cloud-tfc-black-gradient.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-wins-datadog-s-integration-developer-partner-of-the-year-award",
          "author": null,
          "description": "HashiCorp has won the 2022 Datadog Partner Network (DPN) Integration Developer Partner of the Year Award.",
          "link": "https://www.hashicorp.com/blog/hashicorp-wins-datadog-s-integration-developer-partner-of-the-year-award",
          "publishedOn": "2022-10-19T19:00:00.000Z",
          "wordCount": 1612,
          "title": "HashiCorp Wins Datadog’s Integration Developer Partner of the Year Award",
          "imageUrl": "https://www.datocms-assets.com/2885/1639970392-hashicorp-datadog.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/new-competency-program-validates-systems-integrators-hashicorp-expertise",
          "author": null,
          "description": "The new Technical Competency Program for Systems Integrators allows partners to display earned competency badges on both their own website and HashiCorp.com.",
          "link": "https://www.hashicorp.com/blog/new-competency-program-validates-systems-integrators-hashicorp-expertise",
          "publishedOn": "2022-10-19T16:00:00.000Z",
          "wordCount": 1760,
          "title": "New Competency Program Validates Systems Integrators’ HashiCorp Expertise",
          "imageUrl": "https://www.datocms-assets.com/2885/1666107145-partner-network-thumbnail.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/cockroach-labs-forgerock-paloalto-networks-highlight-new-vault-integrations",
          "author": null,
          "description": "The HashiCorp Vault ecosystem saw multiple integrations from partners Cockroach Labs, ForgeRock, and PaloAlto Networks as part of the 19 integrations completed this past quarter.",
          "link": "https://www.hashicorp.com/blog/cockroach-labs-forgerock-paloalto-networks-highlight-new-vault-integrations",
          "publishedOn": "2022-10-18T16:00:00.000Z",
          "wordCount": 2733,
          "title": "Cockroach Labs, ForgeRock & Palo Alto Networks Highlight New Vault Integrations",
          "imageUrl": "https://www.datocms-assets.com/2885/1666036246-oct19thvaultintbloggraphic.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/how-two-hashicorp-employees-marked-latinx-hispanic-heritage-month",
          "author": null,
          "description": "Karla De La Garza and Abraham Martinez, from HashiCorp’s Unidos Employee Resource Group, share their experiences in Mexico during Latinx & Hispanic Heritage Month.",
          "link": "https://www.hashicorp.com/blog/how-two-hashicorp-employees-marked-latinx-hispanic-heritage-month",
          "publishedOn": "2022-10-13T19:00:00.000Z",
          "wordCount": 3521,
          "title": "How Two HashiCorp Employees Marked Latinx & Hispanic Heritage Month",
          "imageUrl": "https://www.datocms-assets.com/2885/1665678755-unidos-hispanic-heritage-eeg.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/vault-1-12",
          "author": null,
          "description": "The new HashiCorp Vault 1.12 focuses on improving core workflows and making key features production-ready.",
          "link": "https://www.hashicorp.com/blog/vault-1-12",
          "publishedOn": "2022-10-13T16:30:00.000Z",
          "wordCount": 4592,
          "title": "HashiCorp Vault 1.12 Adds New Secrets Engines, ADP Updates, and More",
          "imageUrl": "https://www.datocms-assets.com/2885/1620082983-blog-library-product-vault-dark-graphics.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/cdk-for-terraform-0-13-significantly-improves-performance",
          "author": null,
          "description": "Cloud Development Kit for Terraform (CDKTF) 0.13 vastly reduces synth time across all supported languages.",
          "link": "https://www.hashicorp.com/blog/cdk-for-terraform-0-13-significantly-improves-performance",
          "publishedOn": "2022-10-10T16:00:00.000Z",
          "wordCount": 3310,
          "title": "CDK for Terraform 0.13 Significantly Improves Performance",
          "imageUrl": "https://www.datocms-assets.com/2885/1620081857-blog-library-product-terraform-dark-gradient.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/nomad-1-4-adds-nomad-variables-and-updates-service-discovery",
          "author": null,
          "description": "The GA release of HashiCorp Nomad 1.4 enhances native service discovery support with health checks and introduces Nomad Variables, which lets users store configuration values.",
          "link": "https://www.hashicorp.com/blog/nomad-1-4-adds-nomad-variables-and-updates-service-discovery",
          "publishedOn": "2022-10-06T16:00:00.000Z",
          "wordCount": 5177,
          "title": "Nomad 1.4 Adds Nomad Variables and Updates Service Discovery",
          "imageUrl": "https://www.datocms-assets.com/2885/1620083839-blog-library-product-nomad-dark-graphics.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-hcp-waypoint-public-beta",
          "author": null,
          "description": "HashiCorp Waypoint — now available on the HashiCorp Cloud Platform in public beta — lets users standardize application delivery across platforms.",
          "link": "https://www.hashicorp.com/blog/announcing-hcp-waypoint-public-beta",
          "publishedOn": "2022-10-06T16:00:00.000Z",
          "wordCount": 2306,
          "title": "Announcing HCP Waypoint Public Beta",
          "imageUrl": "https://www.datocms-assets.com/2885/1655842512-blog-library-product-hcp-waypoint.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/terraform-gains-visibility-self-service-and-compliance-upgrades",
          "author": null,
          "description": "Continuous validation, no-code provisioning, native OPA support for Terraform Cloud, and other new features are key upgrades to HashiCorp Terraform introduced at HashiConf Global 2022.",
          "link": "https://www.hashicorp.com/blog/terraform-gains-visibility-self-service-and-compliance-upgrades",
          "publishedOn": "2022-10-06T16:00:00.000Z",
          "wordCount": 3183,
          "title": "Terraform Gains Visibility, Self-Service, and Compliance Upgrades",
          "imageUrl": "https://www.datocms-assets.com/2885/1620081857-blog-library-product-terraform-dark-gradient.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/hcp-boundary-now-ga-bolsters-hashicorp-s-zero-trust-security-solution",
          "author": null,
          "description": "General availability of HCP Boundary lets developers access critical systems with fine-grained authorizations — without managing credentials or exposing your network.",
          "link": "https://www.hashicorp.com/blog/hcp-boundary-now-ga-bolsters-hashicorp-s-zero-trust-security-solution",
          "publishedOn": "2022-10-05T16:00:00.000Z",
          "wordCount": 2709,
          "title": "HCP Boundary — Now GA — Bolsters HashiCorp's Zero Trust Security Solution",
          "imageUrl": "https://www.datocms-assets.com/2885/1655842506-blog-library-product-hcp-boundary.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/hcp-vault-on-microsoft-azure-now-in-public-beta",
          "author": null,
          "description": "In addition to its availability on AWS, HCP Vault can now be deployed on Microsoft Azure infrastructure.",
          "link": "https://www.hashicorp.com/blog/hcp-vault-on-microsoft-azure-now-in-public-beta",
          "publishedOn": "2022-10-05T16:00:00.000Z",
          "wordCount": 1301,
          "title": "HCP Vault on Microsoft Azure Now in Public Beta",
          "imageUrl": "https://www.datocms-assets.com/2885/1664831430-blog-thumbnail-hcp_diagram_onblack_vault_azure.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-developer-your-new-experience-for-docs-and-tutorials",
          "author": null,
          "description": "HashiCorp Developer is your one-stop shop for interactive labs, sample code, videos, tutorials, and in-depth documentation.",
          "link": "https://www.hashicorp.com/blog/hashicorp-developer-your-new-experience-for-docs-and-tutorials",
          "publishedOn": "2022-10-05T16:00:00.000Z",
          "wordCount": 1911,
          "title": "HashiCorp Developer: Your New Experience for Docs and Tutorials",
          "imageUrl": "https://www.datocms-assets.com/2885/1664569797-dev-dot-home.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/consul-1-14-beta-announcing-simplified-service-mesh-deployments",
          "author": null,
          "description": "HashiCorp Consul 1.14 enhances traffic management and failover, and adds a new deployment method: Consul dataplane. AWS Lambda updates and beta Windows VM support were also added.",
          "link": "https://www.hashicorp.com/blog/consul-1-14-beta-announcing-simplified-service-mesh-deployments",
          "publishedOn": "2022-10-05T16:00:00.000Z",
          "wordCount": 5576,
          "title": "Consul 1.14 Beta: Announcing Simplified Service Mesh Deployments",
          "imageUrl": "https://www.datocms-assets.com/2885/1620083627-blog-library-product-consul-dark-graphics.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/introducing-a-new-hcp-based-management-plane-for-consul",
          "author": null,
          "description": "The HashiCorp Cloud Platform (HCP) adds new visibility and management controls for self-managed and HCP-managed Consul deployments.",
          "link": "https://www.hashicorp.com/blog/introducing-a-new-hcp-based-management-plane-for-consul",
          "publishedOn": "2022-10-05T16:00:00.000Z",
          "wordCount": 2601,
          "title": "Introducing a New HCP-Based Management Plane for Consul",
          "imageUrl": "https://www.datocms-assets.com/2885/1655842467-blog-library-product-hcp-consul.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/announcing-the-2022-hashicorp-technology-partner-award-winners",
          "author": null,
          "description": "The 2022 HashiCorp Technology Partner Awards have been announced. Find out who the winners are in our four categories this year.",
          "link": "https://www.hashicorp.com/blog/announcing-the-2022-hashicorp-technology-partner-award-winners",
          "publishedOn": "2022-10-04T22:30:00.000Z",
          "wordCount": 1629,
          "title": "Announcing the 2022 HashiCorp Technology Partner Award Winners",
          "imageUrl": "https://www.datocms-assets.com/2885/1600142862-blog-library-product-hashicorp.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/dungeons-dragons-for-team-building",
          "author": null,
          "description": "The HashiCorp Community team used a custom Dungeons & Dragons campaign as a team building exercise. Check out the highlights and then try it yourself.",
          "link": "https://www.hashicorp.com/blog/dungeons-dragons-for-team-building",
          "publishedOn": "2022-09-29T16:00:00.000Z",
          "wordCount": 1930,
          "title": "Dungeons & Dragons for Team Building",
          "imageUrl": "https://www.datocms-assets.com/2885/1664466398-dnd.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/terraform-enterprise-adds-run-metrics-versioned-docs-and-more",
          "author": null,
          "description": "Terraform Enterprise enhances observability and cuts operational burden with improved run metrics, identity-based storage authentication, and versioned documentation.",
          "link": "https://www.hashicorp.com/blog/terraform-enterprise-adds-run-metrics-versioned-docs-and-more",
          "publishedOn": "2022-09-27T16:00:00.000Z",
          "wordCount": 1691,
          "title": "Terraform Enterprise Adds Run Metrics, Versioned Docs, and More",
          "imageUrl": "https://www.datocms-assets.com/2885/1620083068-blog-library-product-terraform-black.jpg"
        }
      ]
    },
    {
      "title": "Elastic Blog - Elasticsearch, Kibana, and ELK Stack",
      "feedUrl": "https://www.elastic.co/blog/feed",
      "siteUrl": "https://www.elastic.co",
      "articles": [
        {
          "id": "https://www.elastic.co/blog/performing-real-user-monitoring-rum-with-elastic-apm",
          "author": "Adam Quan,Carly Richmond",
          "description": "Sorry if I lured you into the mood of having a sip of a wonderful cocktail made with rum and you realized that the RUM I’m talking about is not the rum you are craving. But, be assured that Elastic RUM is equally wonderful! Let’s take a sip! I do want to warn you that it will take a bit of time to go through the amount of detail I will cover in this blog.\nWhat is RUM?\nElastic real user monitoring, or RUM, captures user interactions with the web browser and provides a detailed view of the “real user experience” of your web applications from a performance perspective. Elastic’s RUM Agent is a JavaScript Agent, which means it supports any JavaScript-based application. RUM can provide valuable insight into your applications. Some of the common benefits of RUM include:\n\nRUM performance data can…",
          "link": "https://www.elastic.co/blog/performing-real-user-monitoring-rum-with-elastic-apm",
          "publishedOn": "2022-10-20T16:00:00.000Z",
          "wordCount": 11894,
          "title": "A Sip of Elastic RUM (Real User Monitoring)",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt1463e5e2ef1cadd0/5c98d5ed12edfac256db3cd9/elastic-apm-distributed-tracing-small.png"
        },
        {
          "id": "https://www.elastic.co/blog/performing-real-user-monitoring-rum-with-elastic-apm",
          "author": "Adam Quan,Carly Richmond",
          "description": "Elastic APM real user monitoring (RUM) captures user interactions with browsers. We will instrument an application with a React frontend and a Spring Boot backend using the RUM and Java agents. Together, they provide a holistic view of application performance from an end user perspective through distributed tracing.",
          "link": "https://www.elastic.co/blog/performing-real-user-monitoring-rum-with-elastic-apm",
          "publishedOn": "2022-10-20T16:00:00.000Z",
          "wordCount": 11894,
          "title": "A Sip of Elastic RUM (Real User Monitoring)",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt1463e5e2ef1cadd0/5c98d5ed12edfac256db3cd9/elastic-apm-distributed-tracing-small.png"
        },
        {
          "id": "https://www.elastic.co/blog/how-cios-can-support-business-resilience-in-uncertain-times",
          "author": "Riva Froymovich,Paul Smalera",
          "description": "The way technology leaders invest and plan today will determine the trajectory of your organization for the next half-decade, or more. Here's how to ensure you’re positioning your organization for resilience.",
          "link": "https://www.elastic.co/blog/how-cios-can-support-business-resilience-in-uncertain-times",
          "publishedOn": "2022-10-20T00:00:00.000Z",
          "wordCount": 8729,
          "title": "How CIOs can support business resilience in uncertain times",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt3dcc45f313ba566e/6351a94c1d78fa218f2524f8/blog-elastic-train.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/why-observability-can-break-through-top-challenges-to-digital-transformation",
          "author": "Riva Froymovich",
          "description": "Monitoring, machine learning, and visualizations are a game changer for telling the story of systems across your organization.",
          "link": "https://www.elastic.co/blog/why-observability-can-break-through-top-challenges-to-digital-transformation",
          "publishedOn": "2022-10-20T00:00:00.000Z",
          "wordCount": 7556,
          "title": "Why observability can break through top challenges to digital transformation",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt361ac7a1d4cf9ff4/6351ba38fd1d7f3ac0232969/observability-digital-transformation-2.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/how-cios-can-support-business-resilience-in-uncertain-times",
          "author": "Riva Froymovich,Paul Smalera",
          "description": ",\nToday, nearly every major decision an organization makes will flow through the CIO, and often, the CISO. \n\nFrom organizational structure to revenue opportunities to risk management — they’re all about digital transformation, cybersecurity, and your customer experience. The way technology leaders invest and plan today will determine the trajectory of your organization for the next half-decade, or more. \n\nWe spoke to a number of leaders in technology to identify the lessons that will arm your organization against the big unknowns the global economy is facing. Here are some of those hard-won lessons to ensure you’re positioning your organization for resilience.\n1. CIOs must advocate for the role of technology in your organization with business leadership \nWe know that the CIO role is more c…",
          "link": "https://www.elastic.co/blog/how-cios-can-support-business-resilience-in-uncertain-times",
          "publishedOn": "2022-10-20T00:00:00.000Z",
          "wordCount": 8729,
          "title": "How CIOs can support business resilience in uncertain times",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt3dcc45f313ba566e/6351a94c1d78fa218f2524f8/blog-elastic-train.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/why-observability-can-break-through-top-challenges-to-digital-transformation",
          "author": "Riva Froymovich",
          "description": ",\nDigital transformation will account for more than half of IT investment by 2024, but there are persistent blockers to success, says IDC: these include lack of organizational confidence, silos, and C-suite leadership.\n\n\nThese challenges have plagued technology decision makers who have hopeful visions for the future. While it may be obvious that these blockers can be surmounted by good communication and collaboration, that’s easier said than done. In fact, for the better part of a decade, McKinsey keeps finding that 7 out of 10 transformations — digital or otherwise — just plain fail.\n\n\nBut, could some of the technologies that hold the promise of business transformation be incrementally applied to pave the path for its success? The capabilities of observability solutions may provide a hint…",
          "link": "https://www.elastic.co/blog/why-observability-can-break-through-top-challenges-to-digital-transformation",
          "publishedOn": "2022-10-20T00:00:00.000Z",
          "wordCount": 7556,
          "title": "Why observability can break through top challenges to digital transformation",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt361ac7a1d4cf9ff4/6351ba38fd1d7f3ac0232969/observability-digital-transformation-2.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/five-signs-you-need-to-augment-your-siem",
          "author": "Joe DeFever",
          "description": "If you aren’t able to replace your existing SIEM outright, that doesn’t mean you can’t supplement its capabilities with a more performant solution. Elastic allows all users to try out a new, powerful SIEM with little to no upfront cost.",
          "link": "https://www.elastic.co/blog/five-signs-you-need-to-augment-your-siem",
          "publishedOn": "2022-10-19T16:00:00.000Z",
          "wordCount": 8413,
          "title": "Five signs you need to augment your SIEM",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltf648779557d7a164/6286f941ce671353d5080abf/unnamed-14.png"
        },
        {
          "id": "https://www.elastic.co/blog/five-signs-you-need-to-augment-your-siem",
          "author": "Joe DeFever",
          "description": ",\nSecurity teams with an existing security information and event management (SIEM) investment may find themselves having to pay more to their vendor in order to ingest and index more of their data. While they recognize that this greatly hinders their ability to effectively defend their environment, they can’t just uproot a central piece of their infrastructure either — time, licensing, and logistical restrictions stand in the way.\n\nIf you aren’t able to replace your existing SIEM outright, that doesn’t mean you can’t supplement its capabilities with a more performant solution. A recent report revealed that almost half (44%) of organizations want to augment or replace their current SIEM solution.\n\nIt may be time to augment your SIEM.\n\nFortunately, Elastic allows all users to try out a new, …",
          "link": "https://www.elastic.co/blog/five-signs-you-need-to-augment-your-siem",
          "publishedOn": "2022-10-19T16:00:00.000Z",
          "wordCount": 8413,
          "title": "Five signs you need to augment your SIEM",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltf648779557d7a164/6286f941ce671353d5080abf/unnamed-14.png"
        },
        {
          "id": "https://www.elastic.co/blog/sneak-peek-elastic-2022-global-threat-report",
          "author": "Elastic Security Labs",
          "description": "Elastic Security Labs has compiled the 2022 Global Threat Report to share trends and tactics adversaries and attack groups use, as observed by our threat research team and broader user community over the past year.",
          "link": "https://www.elastic.co/blog/sneak-peek-elastic-2022-global-threat-report",
          "publishedOn": "2022-10-19T07:00:00.000Z",
          "wordCount": 5889,
          "title": "Sneak Peek: Elastic’s 2022 Global Threat Report",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt0baa5e547d28f045/62f29d15e717bf11519ac520/blog-open-security-720x420-B.png"
        },
        {
          "id": "https://www.elastic.co/blog/sneak-peek-elastic-2022-global-threat-report",
          "author": "Elastic Security Labs",
          "description": ",\nThe Elastic Security Labs team is passionate about securing the world’s data from attack, and strives to raise the bar within the security industry. To this end, Elastic Security Labs has compiled the 2022 Global Threat Report to share trends and tactics adversaries and attack groups use, as observed by our threat research team and broader user community over the past year.\n\nLet’s dig into a few of the endpoint related findings: \n\n72% of all defense evasion techniques consisted of masquerading and system binary proxy execution \n\n~77% of all credential access techniques are attributed to OS credential dumping with commonly known utilities\n\nHere’s a chart on how the endpoint techniques breakdown across our data set.\nhttps://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt3e743aeca06b3f41/6350565dd27c4a22ea5bcb80/image1.png,image1.png,\nThis was just a preview of the research coming your way. We have lots of findings, recommendation coming your way next week. Stay tuned to Elastic Security Labs for the 2022 Elastic Global Threat Report.",
          "link": "https://www.elastic.co/blog/sneak-peek-elastic-2022-global-threat-report",
          "publishedOn": "2022-10-19T07:00:00.000Z",
          "wordCount": 5889,
          "title": "Sneak Peek: Elastic’s 2022 Global Threat Report",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt0baa5e547d28f045/62f29d15e717bf11519ac520/blog-open-security-720x420-B.png"
        },
        {
          "id": "https://www.elastic.co/blog/culture-david-pilato-outside-comfort-zone",
          "author": "Elastic Culture",
          "description": "David’s been a part of Elastic for more than nine years now—and he’s learned a lot along the way. Read his advice for finding confidence, getting out of your comfort zone, and boosting your career.",
          "link": "https://www.elastic.co/blog/culture-david-pilato-outside-comfort-zone",
          "publishedOn": "2022-10-18T00:00:00.000Z",
          "wordCount": 7389,
          "title": "Someone Like Me: David Pilato reflects on 9 years at Elastic and why you need to step outside your comfort zone",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt35c7d76813d25d1c/634d20e5a1828d22ebc8ee2e/10.0-Someone-Like-Me-David-blog-1680x980.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/culture-david-pilato-outside-comfort-zone",
          "author": "Elastic Culture",
          "description": ",\nDavid Pilato, Developer | Evangelist, recalls not sleeping for a week after discovering the Elasticsearch technology and using it to build various clusters with one click. A month later, he recalls saying to a colleague, “If Shay [Banon] creates a company, I'll either invest in it or join it.”\n\nDavid’s been a part of Elastic for more than nine years now—and he’s learned a lot along the way. \n\nOn our community team, David describes his job as encouraging people to adopt and use Elasticsearch. “My goal is to get people to download Elasticsearch and try it and if they move to a proof of concept project, I am more than happy,” he says. “I ‘sell’ the free tier of Elasticsearch, I’m not trying to convince people to buy.”\n\nBefore he joined Elastic, he found himself in the position of many of th…",
          "link": "https://www.elastic.co/blog/culture-david-pilato-outside-comfort-zone",
          "publishedOn": "2022-10-18T00:00:00.000Z",
          "wordCount": 7389,
          "title": "Someone Like Me: David Pilato reflects on 9 years at Elastic and why you need to step outside your comfort zone",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt35c7d76813d25d1c/634d20e5a1828d22ebc8ee2e/10.0-Someone-Like-Me-David-blog-1680x980.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-continues-to-gain-momentum-in-siem-market",
          "author": "Mike Nichols,Mike Paquette",
          "description": "Gartner SIEM MQ - Elastic has successfully delivered a leading Security Information and Event Management (SIEM) offering with only two years in the market.",
          "link": "https://www.elastic.co/blog/elastic-continues-to-gain-momentum-in-siem-market",
          "publishedOn": "2022-10-14T17:00:00.000Z",
          "wordCount": 7235,
          "title": "Elastic continues to gain momentum in SIEM market",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltd316fcd9a9047cca/62ea7319022e5e700e65d3f0/blog-open-and-transparent-security-720x420-A.png"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-continues-to-gain-momentum-in-siem-market",
          "author": "Mike Nichols,Mike Paquette",
          "description": ",\nElastic has successfully delivered a leading Security Information and Event Management (SIEM) offering with only two years in the market. According to IDC Worldwide Security Information and Event Management Market Shares, 2021: The Cardinal SIEMs report, Elastic is one of the fastest growing SIEMs (more than 80% year-over-year growth) — and had the fifth largest market share in 2021 of the 20+ SIEM vendors in the report. \n2021 worldwide SIEM revenue market share\nhttps://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltbbcc5746c1499bd1/634979188473831f96bbd039/image1.png,image1.png,\nAdditionally, Gartner® has recognized Elastic as a Visionary in the 2022 Magic Quadrant™ for SIEM. We believe this recognition is a testament to Elastic’s ability to deliver value to customers quickly an…",
          "link": "https://www.elastic.co/blog/elastic-continues-to-gain-momentum-in-siem-market",
          "publishedOn": "2022-10-14T17:00:00.000Z",
          "wordCount": 7235,
          "title": "Elastic continues to gain momentum in SIEM market",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltd316fcd9a9047cca/62ea7319022e5e700e65d3f0/blog-open-and-transparent-security-720x420-A.png"
        },
        {
          "id": "https://www.elastic.co/blog/the-art-of-the-possible-arming-us-veterans-with-knowledge",
          "author": "Cami Lewis",
          "description": "Elastic can help us understand the data that impacts our daily lives and guides our decisions. Learn how one Elastic employee transformed data into something that provides invaluable insight and answers common questions in the veteran community.",
          "link": "https://www.elastic.co/blog/the-art-of-the-possible-arming-us-veterans-with-knowledge",
          "publishedOn": "2022-10-13T00:00:00.000Z",
          "wordCount": 8487,
          "title": "The art of the possible: Arming U.S. veterans with knowledge",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt27b982477dd915e2/6297bbb5ae6f0e4156d191e7/meet-user-expectations-smiley-result-1680x980.png"
        },
        {
          "id": "https://www.elastic.co/blog/the-art-of-the-possible-arming-us-veterans-with-knowledge",
          "author": "Cami Lewis",
          "description": ",\nElastic can be used to help us understand the data that impacts our daily lives and guides our decisions, and the possibilities for individual use cases are endless. Our community is full of success stories about innovative ways Elastic empowers our users to make meaning out of data — and Isra Sunhachawi, senior solutions architect at Elastic recently did just that. Using the Elastic stack, Isra developed interactive maps and dashboards to depict the journey of a veteran from pre-enlistment to retirement. His tool distills otherwise meaningless data into useful information to help service members make informed decisions about housing, healthcare, and more.\n,In 2022, Isra submitted his tool to the Academy Health DataJam Challenge and he won, successfully demonstrating the enormous potenti…",
          "link": "https://www.elastic.co/blog/the-art-of-the-possible-arming-us-veterans-with-knowledge",
          "publishedOn": "2022-10-13T00:00:00.000Z",
          "wordCount": 8487,
          "title": "The art of the possible: Arming U.S. veterans with knowledge",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt27b982477dd915e2/6297bbb5ae6f0e4156d191e7/meet-user-expectations-smiley-result-1680x980.png"
        },
        {
          "id": "https://www.elastic.co/blog/by-the-numbers-public-sector-organizations-quantify-the-benefits-of-elastic-solutions",
          "author": "Leanne Link",
          "description": "To help public sector organizations better understand how their peers are using Elastic and what results they’re seeing, we partnered with Socratic Technologies to manage and analyze a survey of our public sector and education customers.",
          "link": "https://www.elastic.co/blog/by-the-numbers-public-sector-organizations-quantify-the-benefits-of-elastic-solutions",
          "publishedOn": "2022-10-12T00:00:00.000Z",
          "wordCount": 8157,
          "title": "By the numbers: Public sector organizations quantify the benefits of Elastic solutions",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltf5b360e2c890f278/6345ca74a75f39138053b8e5/01-shuttle-launch.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/the-evolution-of-discover-in-kibana",
          "author": "Matthias Polman-Wilhelm",
          "description": "Discover has been around for quite some time in Kibana. But recently, we've added a new document table, field statistics, and the ability to create threshold alert rules.",
          "link": "https://www.elastic.co/blog/the-evolution-of-discover-in-kibana",
          "publishedOn": "2022-10-12T00:00:00.000Z",
          "wordCount": 8337,
          "title": "The evolution of Discover in Kibana",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltb32fd2bb6a2cdb2e/62584638102a0b4e934e16fe/fao-1200x628-stack-drag-and-drop-white.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/the-automotive-landscape-is-transforming-how-can-industry-leaders-stay-ahead-of-the-curve",
          "author": "Suranjeeta Choudhury",
          "description": "The digital transformation process in the automotive industry has already begun. With the current macroeconomic  headwinds, find out how automakers, OEMs, and suppliers can be successful in overcoming those speed bumps.",
          "link": "https://www.elastic.co/blog/the-automotive-landscape-is-transforming-how-can-industry-leaders-stay-ahead-of-the-curve",
          "publishedOn": "2022-10-12T00:00:00.000Z",
          "wordCount": 8006,
          "title": "The automotive landscape is transforming — how can industry leaders stay ahead of the curve?",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt07422fa410fa6515/6346fc69e62c4d1068b76844/libraries-edev-ops-1680x980.png"
        },
        {
          "id": "https://www.elastic.co/blog/by-the-numbers-public-sector-organizations-quantify-the-benefits-of-elastic-solutions",
          "author": "Leanne Link",
          "description": ",\nWhen analyzing solution providers, it’s easy to get stuck in lists of product features and benefits, and harder to quantify what the actual results will be in your own environment. In some industries, like public sector, decision makers need to justify investments that will be put toward specialized use cases that apply only to their field, such as defense or public safety.\n\nTo help public sector organizations better understand how their peers are using Elastic and what results they’re seeing, we partnered with Socratic Technologies to manage and analyze a survey of our public sector and education customers. We wanted to know how — and how much — Elastic is helping them meet their missions, so that other organizations can understand how to best meet theirs. Respondents answered questions…",
          "link": "https://www.elastic.co/blog/by-the-numbers-public-sector-organizations-quantify-the-benefits-of-elastic-solutions",
          "publishedOn": "2022-10-12T00:00:00.000Z",
          "wordCount": 8157,
          "title": "By the numbers: Public sector organizations quantify the benefits of Elastic solutions",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltf5b360e2c890f278/6345ca74a75f39138053b8e5/01-shuttle-launch.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/the-evolution-of-discover-in-kibana",
          "author": "Matthias Polman-Wilhelm",
          "description": ",\nDiscover has been around for quite some time. Still, it is one of the most used parts of Kibana, allowing you to search and view the atoms of Elasticsearch: the indexed documents. In 2015, it was released as part of Kibana 4. Let’s have a look at the early days of data discovery:\nhttps://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt35ed3799b53db14f/6345c21b366c7610e0fbccc4/blog-elastic-evolution-1.png,blog-elastic-evolution-1.png,\nIn 5.6, the last significant change enabling users to view surrounding documents of a selected document was added (it was a separate plugin at that time). During 6.x and 7.x, we focused on removing technical debt, like moving from Angular 1 to React and migrating to Kibana’s new platform.\n\nNow in 8.x, we’ve been adding big changes one after another. W…",
          "link": "https://www.elastic.co/blog/the-evolution-of-discover-in-kibana",
          "publishedOn": "2022-10-12T00:00:00.000Z",
          "wordCount": 8337,
          "title": "The evolution of Discover in Kibana",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltb32fd2bb6a2cdb2e/62584638102a0b4e934e16fe/fao-1200x628-stack-drag-and-drop-white.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/the-automotive-landscape-is-transforming-how-can-industry-leaders-stay-ahead-of-the-curve",
          "author": "Suranjeeta Choudhury",
          "description": ",\nThe automotive industry is on the cusp of a phase shift — thanks to changes in buyer behavior, mobility preferences, and technology advances in connectivity and AI. In fact, according to a Deloitte study,1 by 2035 revenues from “as-a-service” business models that leverage the economies of scale will grow by over 400%.\n\nThe digital transformation process has already begun. Leading car manufacturers have joined forces in various initiatives, such as the Mobility Open Blockchain Initiative (MOBI)2 and the MaaS Alliance,3 to simplify and protect financial operations, build transparency and agility in the supply chain, and design future-proof solutions that protect and accelerate the ability to achieve shared ownership and usage models at scale.\n\nWith the current macroeconomic conditions acti…",
          "link": "https://www.elastic.co/blog/the-automotive-landscape-is-transforming-how-can-industry-leaders-stay-ahead-of-the-curve",
          "publishedOn": "2022-10-12T00:00:00.000Z",
          "wordCount": 8006,
          "title": "The automotive landscape is transforming — how can industry leaders stay ahead of the curve?",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt07422fa410fa6515/6346fc69e62c4d1068b76844/libraries-edev-ops-1680x980.png"
        }
      ]
    },
    {
      "title": "Ansible Blog",
      "feedUrl": "https://www.ansible.com/blog/rss.xml",
      "siteUrl": "https://www.ansible.com/blog",
      "articles": [
        {
          "id": "https://www.ansible.com/blog/introducing-event-driven-ansible",
          "author": "Joe Pisciotta",
          "description": "Today at AnsibleFest 2022, Red Hat announced an exciting new developer preview for Event-Driven Ansible. Most customers are on a journey toward full end-to-end automation and there are many paths you take along this journey.  Event-Driven Ansible is a new way to enhance and expand automation. It improves IT speed and agility, while enabling consistency and resilience.",
          "link": "https://www.ansible.com/blog/introducing-event-driven-ansible",
          "publishedOn": "2022-10-19T04:05:00.000Z",
          "wordCount": 3910,
          "title": "Introducing the Event-Driven Ansible developer preview",
          "imageUrl": "https://lh5.googleusercontent.com/4ib-UuFC47hOa3jGkoFiYan-VZBcovZHeapDpRcVoQCWXjEKt72Irvswn7q8wUOJmqsRCx3jidkF1wWk8RIEPArFL0I53SJ4JHqIJ-lMHo-8k3som7TZwm4c4yAJUBQap_gDIsP3lR-f21plkJsXiAj2uxRA_2EILD26iC7GA5znZTZlsId_tlm49g"
        },
        {
          "id": "https://www.ansible.com/blog/getting-started-with-event-driven-ansible",
          "author": "nmartins@redhat.com (Nuno Martins)",
          "description": "As one technology advances, it expands the possibilities for other technologies and offers the solutions of tomorrow for the challenges we face today. AnsibleFest 2022 brings us new advances in Ansible automation that are as bright as they are innovative. I am talking about the Event-Driven Ansible developer preview.",
          "link": "https://www.ansible.com/blog/getting-started-with-event-driven-ansible",
          "publishedOn": "2022-10-19T04:02:00.000Z",
          "wordCount": 3838,
          "title": "Getting Started with Event-Driven Ansible",
          "imageUrl": "https://lh5.googleusercontent.com/LVSgtbu7PWHg3zCHxtuiF8g8J8wW5yO2IBk9-hAsJioFnqb3zgaEPPJNHIudrZNyhcTl-TnARFSjKZXzcXw8jPS1F8pr2rS9dS-7kl2UIM0fif5eY7laJaGeguv_z4QvIGWkNuWNv3R5JpYpoin-0bvOWvXcn7Ae6Mi6XmxHfZyjSBBjPcz4gTDMwg"
        },
        {
          "id": "https://www.ansible.com/blog/event-driven-ansible-for-partners",
          "author": "Emily Bock",
          "description": "Event-driven automation is increasingly being adopted because of the strong benefits it delivers in managing huge amounts of complexity across multi-clouds, a multi-device remote workforce, and growing edge implementations. In a digital world, maintaining resilience and reliability is essential and event driven automation helps teams meet these needs while working around resource and skills gaps.",
          "link": "https://www.ansible.com/blog/event-driven-ansible-for-partners",
          "publishedOn": "2022-10-19T04:01:00.000Z",
          "wordCount": 3410,
          "title": "It takes a community: how partners play a key role in event driven automation",
          "imageUrl": "https://lh5.googleusercontent.com/Ar-jdRGP8239YbtfmnddQV6Q4g3QQjS1GNT-TQyKyb6Sz0_lE2VCgjqex0LMZw9E15a6Cs46S1QHrOCG4vy-7GVS2Z5JySq9-SQQ0DMXo-47O5duXeH4sLXo8IbEf2lDzxPb-UounU72bTPK75bxGeqDJ1bUw3vVuohUn0N87q0SyhZQQV3VFSllug"
        },
        {
          "id": "https://www.ansible.com/blog/ansible-and-packer-why-they-are-better-together",
          "author": "scavanau@redhat.com (Sean Cavanaugh)",
          "description": "Red Hat Ansible Automation Platform can help you orchestrate, operationalize and govern your hybrid cloud deployments.  In my last public cloud blog, I talked about Two Simple Ways Automation Can Save You Money on Your AWS Bill and similarly to Ashton’s blog Bringing Order to the Cloud: Day 2 Operations in AWS with Ansible, we both wanted to look outside the common public cloud use-case of provisioning and deprovisioning resources and instead look at automating common operational tasks.  For this blog post I want to cover how the Technical Marketing team for Ansible orchestrates a pipeline for demos and workshops with Ansible and how we integrate that with custom AMIs (Amazon Machine Images) created with Packer.  Packer is an open source tool that allows IT operators to standardize and automate the process of building system images.",
          "link": "https://www.ansible.com/blog/ansible-and-packer-why-they-are-better-together",
          "publishedOn": "2022-10-03T13:00:00.000Z",
          "wordCount": 3645,
          "title": "Using Ansible and Packer, From Provisioning to Orchestration",
          "imageUrl": "https://lh6.googleusercontent.com/z95BNeupD4B20SB-bsp_c3yUweZUTdjlUCR8RWalV4lRr1o0nmZSpFa2rdYqCnytvowXIRNcx-vv_JD-Vyp9HF5n7TW7Lyfi_mbbBKzHq5zHuIcDyeF38v-ddQLWkn0luR-ZhxKztPrMdiqNOIgN8rmeWtUZBNJ1lBtVkxsU_NBUZCRWqtlKIKoAsg"
        },
        {
          "id": "https://www.ansible.com/blog/dynamic-inventory-plugin-collection-for-network-device-management",
          "author": "Eric McLeroy",
          "description": "Tackling the complexities of enterprise inventories\n \r\nOne common challenge our customers face is the need to track hosts from multiple sources: LDAP, cloud providers, and enterprise CMDB systems. Using a dynamic inventory allows users to integrate with these systems and update the Ansible inventory as it varies over time, with hosts spinning up and shutting down in response to business demands.",
          "link": "https://www.ansible.com/blog/dynamic-inventory-plugin-collection-for-network-device-management",
          "publishedOn": "2022-09-28T13:00:00.000Z",
          "wordCount": 3336,
          "title": "Dynamic inventory plugin collection for network device management",
          "imageUrl": "https://www.ansible.com/hubfs/network%20device%20management%20blog.png"
        },
        {
          "id": "https://www.ansible.com/blog/migrate-to-azure-monitor-agent-on-azure-arc-using-red-hat-ansible-automation-platform",
          "author": "Scott Harwell",
          "description": "Azure Arc is becoming the default Microsoft Azure service for connecting non-Azure infrastructure into Azure monitoring and administration.  Azure has also issued a deprecation notice for the Azure Log Analytics Agents; Microsoft Monitoring Agent and Log Analytics (OMS).  Azure Monitor Agent replaces these agents, introducing a simplified, flexible method of configuring collection configuration called Data Collection Rules. To leverage Azure Monitor Agent with their non-Azure servers, customers will need to onboard their machines to Azure Arc-enabled servers.",
          "link": "https://www.ansible.com/blog/migrate-to-azure-monitor-agent-on-azure-arc-using-red-hat-ansible-automation-platform",
          "publishedOn": "2022-09-26T13:00:00.000Z",
          "wordCount": 4424,
          "title": "Migrate to Azure Monitor Agent on Azure Arc using Red Hat Ansible Automation Platform",
          "imageUrl": "https://www.ansible.com/hubfs/azure%20arc%20blog.png"
        }
      ]
    },
    {
      "title": "Azure DevOps Blog",
      "feedUrl": "https://devblogs.microsoft.com/devops/feed/",
      "siteUrl": "https://devblogs.microsoft.com/devops/",
      "articles": [
        {
          "id": "https://devblogs.microsoft.com/devops/?p=65894",
          "author": "Gloridel Morales",
          "description": "Last week we made significant updates to our product roadmap. We published the latest features for 2022, updated the list of features for 2023, and included an initiatives section that provides details about the product strategy and long-term investments.\nIn addition to including a new list of key features and initiatives,\nThe post Azure DevOps Roadmap update appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/azure-devops-roadmap-update/",
          "publishedOn": "2022-10-20T17:13:02.000Z",
          "wordCount": 4278,
          "title": "Azure DevOps Roadmap update",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2019/02/roadmap.png"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=65881",
          "author": "Gloridel Morales",
          "description": "This month, we are releasing fixes that impact our self-hosted product, Azure DevOps Server.\nResolve issue with newly added AD identities not appearing in security dialog identity pickers.\nThe post October patches for Azure DevOps Server appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/october-patches-for-azure-devops-server-2/",
          "publishedOn": "2022-10-18T16:59:44.000Z",
          "wordCount": 4452,
          "title": "October patches for Azure DevOps Server",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/06/HERO-1.jpg"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=65846",
          "author": "Aaron Hallberg",
          "description": "Exciting things are in store for Azure DevOps in the coming year! We’re planning deep investments in security as well as broad investment across the product. Read on for more information, and then be sure to check out our updated roadmap at https://aka.ms/AzureDevOpsRoadmap.\nThe post Integrate security into your developer workflow with GitHub Advanced Security for Azure DevOps appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/integrate-security-into-your-developer-workflow-with-github-advanced-security-for-azure-devops/",
          "publishedOn": "2022-10-12T12:59:49.000Z",
          "wordCount": 7180,
          "title": "Integrate security into your developer workflow with GitHub Advanced Security for Azure DevOps",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/10/AzDO-heart-Security.png"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=65675",
          "author": "Angel Wong",
          "description": "We have resolved a known issue regarding publishing extensions to the Visual Studio Marketplace. If you’ve run into the error message: “Your ability to create global personal access tokens (PATs) is restricted by your organization.”, this is likely because your administrator has enabled a policy to restrict the creation of global personal access tokens (PATs).\nThe post Publishing extensions to Marketplace issue resolved appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/publishing-extensions-to-marketplace-issue-resolved/",
          "publishedOn": "2022-10-10T16:08:03.000Z",
          "wordCount": 3883,
          "title": "Publishing extensions to Marketplace issue resolved",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/10/start_4.png"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=65804",
          "author": "Dan Hellem",
          "description": "Sprint 211 was a busy one. We were able to complete a lot of bugs and yet introduce some new exciting features. We also enabled a “Try the New Boards Hub” banner and popup to the legacy boards experience on select organizations.\nThe post New Boards Hub, Sprint 211 Update appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/new-boards-hub-sprint-211-update/",
          "publishedOn": "2022-10-07T14:28:43.000Z",
          "wordCount": 4867,
          "title": "New Boards Hub, Sprint 211 Update",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/10/sketch-3.png"
        }
      ]
    },
    {
      "title": "Discover Dev",
      "feedUrl": "https://www.discoverdev.io/rss.xml",
      "siteUrl": "http://discoverdev.io",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "http://feeds.feedburner.com/AmazonWebServicesBlog",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "f3d6027b89e3960df03f4dc7b386bf38d63c911d",
          "author": "Steve Roberts",
          "description": "This post is part of our Week in Review series. Check back each week for a quick roundup of interesting news and announcements from AWS! Monday means it’s time for another Week in Review post, so, without further ado, let’s dive right in! Last Week’s Launches Here’s some launch announcements from last week you may […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-october-17-2020/",
          "publishedOn": "2022-10-17T17:34:56.000Z",
          "wordCount": 1234,
          "title": "AWS Week in Review – October 17, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/10/17/AWS-WIR-10.17.22.png"
        },
        {
          "id": "71e7c11b2e368b46b3451452c13a32231a1453a3",
          "author": "Antje Barth",
          "description": "Deep learning (DL) models have been increasing in size and complexity over the last few years, pushing the time to train from days to weeks. Training large language models the size of GPT-3 can take months, leading to an exponential growth in training cost. To reduce model training times and enable machine learning (ML) practitioners […]",
          "link": "https://aws.amazon.com/blogs/aws/amazon-ec2-trn1-instances-for-high-performance-model-training-are-now-available/",
          "publishedOn": "2022-10-10T21:31:33.000Z",
          "wordCount": 2021,
          "title": "Amazon EC2 Trn1 Instances for High-Performance Model Training are Now Available",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/08/19/Site-Merch_EC2-Trainium_Blog.png"
        },
        {
          "id": "7c008f7e8cef2812709e94fb9b2a1a09fcd48422",
          "author": "Marcia Villalba",
          "description": "This post is part of our Week in Review series. Check back each week for a quick roundup of interesting news and announcements from AWS! I had an amazing start to the week last week as I was speaking at the AWS Community Day NL. This event had 500 attendees and over 70 speakers, and […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-october-10-2022/",
          "publishedOn": "2022-10-10T20:53:03.000Z",
          "wordCount": 1321,
          "title": "AWS Week in Review – October 10, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/10/10/AWS-WIR-10.10.22.png"
        },
        {
          "id": "4ed417884c91622d902ab22f2b9f806063ec1a09",
          "author": "Jeff Barr",
          "description": "In late 2019 I told you about the AWS Local Zone in Los Angeles, California. In that post I described Local Zones as a new type of AWS infrastructure deployment that brings select AWS services very close to a particular geographic area. A year after that launch, I announced our plans to add 3 more […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-local-zones-expansion-taipei-and-delhi/",
          "publishedOn": "2022-10-05T21:30:38.000Z",
          "wordCount": 1335,
          "title": "AWS Local Zones Expansion: Taipei and Delhi",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/10/04/Site-Merch_AWS-Local-Zones_Blog.png"
        },
        {
          "id": "b52baf93c46bb68d0030598dd7ae15d1a9913d72",
          "author": "Veliswa Boya",
          "description": "In June 2022 AWS announced a preview of Amazon Connect Cases, a feature of Amazon Connect that simplifies these customer interactions and reduces the average handle times of issues. Today I am excited to announce the general availability of Amazon Connect Cases. Cases, a feature of Amazon Connect, makes it easy for your contact center […]",
          "link": "https://aws.amazon.com/blogs/aws/announcing-general-availability-of-amazon-connect-cases/",
          "publishedOn": "2022-10-03T20:41:27.000Z",
          "wordCount": 1265,
          "title": "Announcing General Availability of Amazon Connect Cases",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/10/03/Site-Merch_Amazon-Connect-Keystone-Gardner_Blog.png"
        },
        {
          "id": "ae5d0488bf0646507a69e9e761f48098a248df55",
          "author": "Danilo Poccia",
          "description": "This post is part of our Week in Review series. Check back each week for a quick roundup of interesting news and announcements from AWS! A new week and a new month just started. Curious which were the most significant AWS news from the previous seven days? I got you covered with this post. Last […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-october-3-2022/",
          "publishedOn": "2022-10-03T18:32:35.000Z",
          "wordCount": 1288,
          "title": "AWS Week in Review – October 3, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/10/03/AWS-WIR-10.3.22.png"
        },
        {
          "id": "732ba82c2e85ba6a2394bf8a29ee95a5e73a4c90",
          "author": "Antje Barth",
          "description": "Artificial intelligence (AI) is all around us. AI sends certain emails to our spam folders. It powers autocorrect, which helps us fix typos when we text. And now we can use it to solve business problems. In business, data-driven insights have become increasingly valuable. These insights are often discovered with the help of machine learning […]",
          "link": "https://aws.amazon.com/blogs/aws/new-hands-on-course-for-business-analysts-practical-decision-making-using-no-code-ml-on-aws/",
          "publishedOn": "2022-10-03T16:26:34.000Z",
          "wordCount": 1837,
          "title": "New Hands-On Course for Business Analysts – Practical Decision Making using No-Code ML on AWS",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/27/Amazon-SageMaker-Canvas_Blog.png"
        },
        {
          "id": "5ab6ca4c7fbca6e707e93106cb015a859442a687",
          "author": "Sébastien Stormacq",
          "description": "I am pleased to announce today the availability of Amazon File Cache, a new high-speed cache service on AWS designed for processing file data stored in disparate locations—including on premises. File Cache accelerates and simplifies your most demanding cloud bursting and hybrid workflows by giving your applications access to files using a fast and familiar […]",
          "link": "https://aws.amazon.com/blogs/aws/amazon-file-cache-a-high-performance-cache-on-aws-for-your-on-premises-file-systems/",
          "publishedOn": "2022-09-30T14:56:40.000Z",
          "wordCount": 2239,
          "title": "Amazon File Cache – A High Performance Cache On AWS For Your On-Premises File Systems",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/29/Site-Merch_Amazon-File-Cache_Blog.png"
        },
        {
          "id": "f345653beefe2e326410b05edcca8bc0fdf98a41",
          "author": "Sébastien Stormacq",
          "description": "At AWS, we love to give our customers choices: the choice of infrastructure to deploy your workloads, to store your most important data, or the operating systems for your virtual desktops. Many of you choose Amazon Workspaces to provision and distribute virtual desktops securely and at scale to your workforce. Our customers choose Workspaces when […]",
          "link": "https://aws.amazon.com/blogs/aws/amazon-workspaces-introduces-ubuntu-desktops/",
          "publishedOn": "2022-09-29T16:48:05.000Z",
          "wordCount": 1606,
          "title": "Amazon WorkSpaces Introduces Ubuntu Desktops",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/29/Site-Merch_Ubuntu-Desktop-for-Workspaces_Blog-1.png"
        },
        {
          "id": "852c2e070c6cea86911d87c790881d8de55886cb",
          "author": "Channy Yun",
          "description": "Today we announce the general availability of AWS IoT FleetWise, a fully managed AWS service that makes it easier to collect, transform, and transfer vehicle data to the cloud. Last AWS re:Invent 2021, we previewed AWS IoT FleetWise, heard customer feedback, and improved features for various use cases of near-real-time vehicle data processing. With AWS […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-iot-fleetwise-now-generally-available-easily-collect-vehicle-data-and-send-to-the-cloud/",
          "publishedOn": "2022-09-27T16:54:48.000Z",
          "wordCount": 2470,
          "title": "AWS IoT FleetWise Now Generally Available – Easily Collect Vehicle Data and Send to the Cloud",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/22/Site-Merch_AWS-IoT-FleetWise_Blog.png"
        },
        {
          "id": "7ba7c22c89a95d2ced12a3220867b6146d0a2db5",
          "author": "Sébastien Stormacq",
          "description": "It looks like my travel schedule is coupled with this Week In Review series of blog posts. This week, I am traveling to Fort-de-France in the French Caribbean islands to meet our customers and partners. I enjoy the travel time when I am offline. It gives me the opportunity to reflect on the past or […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-september-26-2022/",
          "publishedOn": "2022-09-26T23:21:36.000Z",
          "wordCount": 1709,
          "title": "AWS Week In Review — September 26, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/09/24/AWS-WIR-9.26.22.png"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/atom.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2688/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/bubble_universes.png\" title=\"The theory finally unifies cosmic inflation and regular inflation.\" alt=\"The theory finally unifies cosmic inflation and regular inflation.\" />",
          "link": "https://xkcd.com/2688/",
          "publishedOn": "2022-10-21T00:00:00.000Z",
          "wordCount": 232,
          "title": "Bubble Universes",
          "imageUrl": "https://imgs.xkcd.com/comics/bubble_universes_2x.png"
        },
        {
          "id": "https://xkcd.com/2687/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/division_notation.png\" title=\"Science tip: Scientists hardly ever use the two-dot division sign, and when they do it often doesn't even mean division, but they still get REALLY mad when you repurpose it to write stuff like SALE! ALL SHOES 30÷ OFF!\" alt=\"Science tip: Scientists hardly ever use the two-dot division sign, and when they do it often doesn't even mean division, but they still get REALLY mad when you repurpose it to write stuff like SALE! ALL SHOES 30÷ OFF!\" />",
          "link": "https://xkcd.com/2687/",
          "publishedOn": "2022-10-19T00:00:00.000Z",
          "wordCount": 232,
          "title": "Division Notation",
          "imageUrl": "https://imgs.xkcd.com/comics/division_notation_2x.png"
        },
        {
          "id": "https://xkcd.com/2686/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/space_adventure.png\" title=\"&quot;Sir, it looked really cool.&quot; &quot;Oh no--prestige TV. Okay, which of you has a terrible secret that's being slowly revealed to the audience through flashbacks? Just spit it out so we can escape this arc!&quot;\" alt=\"&quot;Sir, it looked really cool.&quot; &quot;Oh no--prestige TV. Okay, which of you has a terrible secret that's being slowly revealed to the audience through flashbacks? Just spit it out so we can escape this arc!&quot;\" />",
          "link": "https://xkcd.com/2686/",
          "publishedOn": "2022-10-17T00:00:00.000Z",
          "wordCount": 232,
          "title": "Space Adventure",
          "imageUrl": "https://imgs.xkcd.com/comics/space_adventure_2x.png"
        },
        {
          "id": "https://xkcd.com/2685/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/2045.png\" title=\"&quot;Sorry, doctor, I'm going to have to come in on a different day--I have another appointment that would be really hard to move, in terms of the kinetic energy requirements.&quot;\" alt=\"&quot;Sorry, doctor, I'm going to have to come in on a different day--I have another appointment that would be really hard to move, in terms of the kinetic energy requirements.&quot;\" />",
          "link": "https://xkcd.com/2685/",
          "publishedOn": "2022-10-14T00:00:00.000Z",
          "wordCount": 230,
          "title": "2045",
          "imageUrl": "https://imgs.xkcd.com/comics/2045_2x.png"
        }
      ]
    },
    {
      "title": "Camunda",
      "feedUrl": "https://camunda.com/feed/",
      "siteUrl": "https://camunda.com/",
      "articles": [
        {
          "id": "https://camunda.com/?p=63590",
          "author": "Tobias Metzke-Bernstein",
          "description": "Monitoring is an essential facet of running applications in a production system. Through this process, organizations collect and analyze data, and determine if a program is performing as expected within set boundaries. When combined with alerting, monitoring allows for detecting unexpected system behavior to mitigate exceptional situations as fast as possible. Furthermore, tracking the performance of a system enables organizations to improve those aspects that have the biggest impact with higher priority. One essential aspect of monitoring is the list of key metrics you want to observe. There are different categories of statistics that can be of interest here. To observe the defined metrics, there are plenty of application monitoring tools on the market today. They differ in many aspects...\nThe post Monitoring Camunda Platform 7 with Prometheus appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/10/monitoring-camunda-platform-7-with-prometheus/",
          "publishedOn": "2022-10-18T13:52:00.000Z",
          "wordCount": 4603,
          "title": "Monitoring Camunda Platform 7 with Prometheus",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/10/image-7-1024x505-2.png"
        },
        {
          "id": "https://camunda.com/?p=65420",
          "author": "Bernd Ruecker",
          "description": "Learn from Bernd Ruecker, Camunda Co-founder/Chief Technologist, and Daniel Meyer, Camunda CTO, as they tackle questions on connectors, modeling & more.\nThe post CamundaCon 2022: Q&A with Bernd and Daniel appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/10/camundacon-2022-qa-bernd-daniel/",
          "publishedOn": "2022-10-14T20:00:27.000Z",
          "wordCount": 3668,
          "title": "CamundaCon 2022: Q&A with Bernd and Daniel",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/10/CamundaCon-QA-Bernd-Daniel.png"
        },
        {
          "id": "https://camunda.com/?p=64638",
          "author": "Christophe Dame",
          "description": "Directory services are an effective way to manage an organization’s users, groups, printers, devices, and more. Most organizations accomplish this using Active Directory, Apache Directory, Oracle Internet Directory, or other similar tools. Recently I worked with a customer who wanted to see how he could secure the Camunda 8 Platform and process applications with such a directory. Their requirements consisted of: Allowing Directory users to access Camunda applications (Tasklist, Operate, Optimize) Accessing secured Tasklist & Operate APIs from our custom project Securing the custom project In this article, I’ll briefly explain the 3 easy steps taken to fulfill their requirements which include: Federate users from the Directory service into Keycloak Declare an application in Identity to access Camunda APIs Configure...\nThe post Securing Camunda 8 self-managed cluster and applications behind a directory appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/10/securing-camunda-8-self-managed-cluster-and-applications-behind-a-directory/",
          "publishedOn": "2022-10-12T13:01:00.000Z",
          "wordCount": 3212,
          "title": "Securing Camunda 8 self-managed cluster and applications behind a directory",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/10/Active_Directory_Camunda_Platform_8.png"
        },
        {
          "id": "https://camunda.com/?p=64965",
          "author": "Camunda Platform Team",
          "description": "We’re extremely excited to announce the release of Camunda Platform 8.1.  In this post, we will go into the highlights of this release including Web Modeler, Connectors, Zeebe, Operate, Optimize, and more. Here’s the highlights of what’s included in this release: Easier Installation and maintenance for Camunda Platform Self-managed Hot backups for Self-Managed Token-Based authentication Modeler updates Process Templates FEEL Expression Editor Inline Annotations Changes to Camunda forms Connectors updates Workflow engine updates Operate updates Optimize updates Let’s get started! Easier installation and maintenance for Camunda Platform Self-Managed Improved Guides and Support for OpenShift and Amazon EKS (AWS) With this release, we are introducing official support for deploying and running Camunda Platform 8 Self-Managed on OpenShift and Amazon EKS (AWS)....\nThe post Camunda Platform 8.1 Released – What’s New appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/10/camunda-platform-8-1-released-whats-new/",
          "publishedOn": "2022-10-11T14:00:00.000Z",
          "wordCount": 6290,
          "title": "Camunda Platform 8.1 Released – What’s New",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/10/screenshot-camunda.com-2022.10.11-09_14_38.png"
        },
        {
          "id": "https://camunda.com/?p=65073",
          "author": "Camunda Platform Team",
          "description": "We’re extremely excited to announce the release of Camunda Platform 7.18 Here are some of the highlights: Cockpit: Improved instance selection to avoid unintended batch operations Cockpit: Easier navigation of high batch operation volumes MDC logging features Camunda Forms in Tasklist: Populate select options via process data Exception error codes Filter and order tasks by last updated WebSphere Liberty New and retired supported environments You can download Camunda Platform or run it with Docker. For a complete list of the changes, please check out the release notes. For patched security vulnerabilities, see our security notices. If you want to dig deeper, check out the source code on GitHub. Cockpit: Improved instance selection to avoid unintended batch operations Previously, when performing...\nThe post Camunda Platform 7.18 Released – What’s New appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/10/camunda-platform-7-18-released-whats-new/",
          "publishedOn": "2022-10-11T13:15:00.000Z",
          "wordCount": 3585,
          "title": "Camunda Platform 7.18 Released – What’s New",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/10/Camunda_7.18.png"
        },
        {
          "id": "https://camunda.com/?p=64182",
          "author": "Shane Ernest",
          "description": "We’re thrilled to announce Camunda Platform 8.1, the latest release of our process orchestration solution. This new version introduces features that accelerate connectivity to the many different systems and technologies that are required for true digital transformation, including: Create custom Connectors with our Integration Framework to accelerate connectivity New out-of-the-box Connectors for popular services Enhancements to Camunda Modeler that improve productivity Hot backups and official support for Amazon EKS and Red Hat OpenShift Plus, several upgrades requested by Camunda Platform 7 customers Organizations across all industries rely on complex technology stacks to adapt and enhance their operations in response to market dynamics, new disruptive companies, and increasing consumer expectations. Your technology stack likely includes everything from cutting-edge technologies to legacy...\nThe post Accelerate Connectivity with Camunda Platform 8.1 appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/10/accelerate-connectivity-with-camunda-platform-8-1/",
          "publishedOn": "2022-10-11T12:00:00.000Z",
          "wordCount": 3380,
          "title": "Accelerate Connectivity with Camunda Platform 8.1",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/10/Camunda-8.1-Release_2022_blog-featured-image_1200x630-1.png"
        },
        {
          "id": "https://camunda.com/?p=64132",
          "author": "Niall Deehan",
          "description": "What is FEEL As a part of the Decision Model and Notation (DMN) specification, the OMG also defined the Friendly Enough Expression Language (FEEL).  Since DMN is intended to be used by designers and business analysts who would like to build decision tables, FEEL needed to be designed as an uncomplicated and human-readable expression language that would help readers understand the logic being described or executed by the DMN table.  Expression languages are typically used by developers to evaluate data to produce a result based on query parameters or conditions. This means it’s syntactically closer to code than human-readable sentences. Since one of the goals of FEEL is to be “process analyst friendly,” it prioritizes readability more than other expression...\nThe post Using FEEL with Camunda 8 appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/09/using-feel-with-camunda-8/",
          "publishedOn": "2022-09-30T16:53:40.000Z",
          "wordCount": 4155,
          "title": "Using FEEL with Camunda 8",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/09/Camunda_using-FEEL-C8_blog-ftd-image_1200x630.png"
        },
        {
          "id": "https://camunda.com/?p=63983",
          "author": "Bernd Ruecker",
          "description": "Scaling process automation across an enterprise naturally includes a wide array of challenges. To counter these challenges, more and more organizations are evolving their organizational structures accordingly, often creating Centers of Excellence (CoE) and/or communities of practice (CoP). Please note that during this post we will use the term CoE, but keep in mind your organization might call this very differently. That said, in Camunda Platform 8, we included new functionalities that will help companies to scale process automation successfully.  This blog post discusses different aspects of scaling process automation, the role of CoEs, and how new Camunda 8 features support those initiatives.  What does scaling mean? Organizations that want to create a competitive edge through digital transformation (and frankly: which...\nThe post How Camunda 8 supports process automation at enterprise scale appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/09/how-camunda-8-supports-process-automation-at-enterprise-scale/",
          "publishedOn": "2022-09-29T19:30:00.000Z",
          "wordCount": 3896,
          "title": "How Camunda 8 supports process automation at enterprise scale",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/09/Camund_Blog_Process-Automation-at-Enterprise-Scale_1200x630-1.png"
        },
        {
          "id": "https://camunda.com/?p=63832",
          "author": "Josh Wulf",
          "description": "Microservices are an architectural style that structures an application as a collection of services that are: Highly maintainable and testable Loosely coupled Independently deployable Organized around business capabilities Owned by a small team Conway’s Law states that “any organization that designs a system (defined broadly) will produce a design whose structure is a copy of the organization’s communication structure”. If your organization has multiple teams working on different parts of a larger system, then microservices can serve as a separation of concerns that map an independent, encapsulated service to a specific team. These teams have clear boundaries of responsibility and can deploy on their own schedule. These factors lend themselves to a polyglot approach. What this means is that because...\nThe post 7 Best Programming Languages for Microservices appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/09/seven-best-programming-languages-for-microservices/",
          "publishedOn": "2022-09-29T13:30:00.000Z",
          "wordCount": 5125,
          "title": "7 Best Programming Languages for Microservices",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/09/Camunda_Blog_7-Best-Programming-Languages-Microservices_1200x630-1.png"
        },
        {
          "id": "https://camunda.com/?p=63238",
          "author": "Christopher Zell",
          "description": "During Summer Hackdays 2022, I worked on a project called “Zeebe chaos” (zbchaos), a fault injection command-line interface (CLI) tool. This allows us engineers to more easily run chaos experiments against Zeebe, build up confidence in the system’s capabilities, and discover potential weaknesses. Requirements To understand this blog post, it is useful to have a certain understanding of Kubernetes and Zeebe itself. Summer Hackdays: Hackdays are a regular event at Camunda, where people from different departments (engineering, consulting, DevRel, etc.) work together on new ideas, pet projects, and more. Check out previous Summer Hackdays here: Summer Hackdays 2020 Summer Hackdays 2019 Zeebe chaos CLI Working on the Zeebe project is not only about engineering a distributed system or a process...\nThe post Zbchaos — A new fault injection tool for Zeebe appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/09/zbchaos-a-new-fault-injection-tool-for-zeebe/",
          "publishedOn": "2022-09-27T18:00:00.000Z",
          "wordCount": 3973,
          "title": "Zbchaos — A new fault injection tool for Zeebe",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/09/Camunda_blog-ftd-image_2022_zbchaos_1200x630-1.png"
        }
      ]
    },
    {
      "title": "となりのヤングジャンプ（ワンパンマン）",
      "feedUrl": "https://tonarinoyj.jp/rss/series/13932016480028984490",
      "siteUrl": "https://tonarinoyj.jp/episode/13932016480028985383",
      "articles": [
        {
          "id": "tonarino_yj:episode:316112896950049151",
          "author": "原作/ＯＮＥ/漫画/村田雄介",
          "description": "ワンパンマン",
          "link": "https://tonarinoyj.jp/episode/316112896950049151",
          "publishedOn": "2022-10-19T15:00:00.000Z",
          "wordCount": 211,
          "title": "[第217話] ワンパンマン",
          "enclosure": {
            "url": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/316112896950049151-eaa2e7d053ba1801b931c55e99fdfda6",
            "length": "0",
            "type": "image/jpeg"
          },
          "imageUrl": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/316112896950049151-eaa2e7d053ba1801b931c55e99fdfda6"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.com/blog/all.atom",
      "siteUrl": "https://github.blog/",
      "articles": [
        {
          "id": "https://github.blog/2022-10-21-build-a-game-this-november-with-game-off-2022/",
          "author": null,
          "description": "Save the date! Game Off returns on November 1 for it’s 10th year! 🎉",
          "link": "https://github.blog/2022-10-21-build-a-game-this-november-with-game-off-2022/",
          "publishedOn": "2022-10-21T17:30:25.000Z",
          "wordCount": 896,
          "title": "Build a game this November with Game Off 2022",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/10/game-off-large.png"
        },
        {
          "id": "https://github.blog/2022-10-21-git-merge-2022-mission-report/",
          "author": null,
          "description": "Git Merge 2022 just wrapped up bringing the community together for 16 talks, three workshops, one Git Contributor Summit, and lots of great conversations over two days. Read on for more info, photos from the event, and all of the session recordings.",
          "link": "https://github.blog/2022-10-21-git-merge-2022-mission-report/",
          "publishedOn": "2022-10-21T16:00:11.000Z",
          "wordCount": 852,
          "title": "Git Merge 2022 &#8211; that&#8217;s a wrap! 🎬",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/10/git-merge-2022-view.png?fit=1200%2C630"
        },
        {
          "id": "https://github.blog/2022-10-20-unboxing-fork-improvements-and-unwrapping-fork-docs/",
          "author": null,
          "description": "We’re always trying to improve the GitHub developer experience in meaningful ways, and we love learning from our customers. In the last several months we released several new fork capabilities, and we’re publishing revised fork documentation that gives more details with clearer explanations to make fork concepts easier to understand.",
          "link": "https://github.blog/2022-10-20-unboxing-fork-improvements-and-unwrapping-fork-docs/",
          "publishedOn": "2022-10-20T18:00:58.000Z",
          "wordCount": 1802,
          "title": "Unboxing fork improvements and unwrapping fork docs",
          "imageUrl": "https://github.blog/wp-content/uploads/2020/07/new-docs-site.png"
        },
        {
          "id": "https://github.blog/2022-10-20-improving-navigation-for-github-actions/",
          "author": null,
          "description": "GitHub Actions changed how developers automate workflows with GitHub. Today, we’re introducing a new navigation to manage your GitHub Actions experience, improving discoverability and accessibility as well as opening up future feature opportunities.",
          "link": "https://github.blog/2022-10-20-improving-navigation-for-github-actions/",
          "publishedOn": "2022-10-20T16:00:00.000Z",
          "wordCount": 1329,
          "title": "Improving navigation for GitHub Actions",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/10/actions-header.png?fit=1600%2C841"
        },
        {
          "id": "https://github.blog/2022-10-18-git-security-vulnerabilities-announced/",
          "author": null,
          "description": "Upgrade your local installation of Git, especially when cloning with --recurse-submodules from untrusted repositories, or if you use git shell interactive mode.",
          "link": "https://github.blog/2022-10-18-git-security-vulnerabilities-announced/",
          "publishedOn": "2022-10-18T17:11:45.000Z",
          "wordCount": 1274,
          "title": "Git security vulnerabilities announced",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/10/Group-3.png"
        },
        {
          "id": "https://github.blog/2022-10-18-introducing-fine-grained-personal-access-tokens-for-github/",
          "author": null,
          "description": "Fine-grained personal access tokens offer enhanced security to developers and organization owners, to reduce the risk to your data of compromised tokens.",
          "link": "https://github.blog/2022-10-18-introducing-fine-grained-personal-access-tokens-for-github/",
          "publishedOn": "2022-10-18T15:35:02.000Z",
          "wordCount": 1919,
          "title": "Introducing fine-grained personal access tokens for GitHub",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/10/PAT-header.png"
        },
        {
          "id": "https://github.blog/2022-10-17-github-at-the-77th-united-nations-general-assembly/",
          "author": null,
          "description": "Read about how the GitHub Social Impact, Tech for Social Good and Policy teams participated in the 77th session of the United Nations General Assembly, including events we hosted with the World Health Organization and the UN Development Programme.",
          "link": "https://github.blog/2022-10-17-github-at-the-77th-united-nations-general-assembly/",
          "publishedOn": "2022-10-17T17:00:54.000Z",
          "wordCount": 1853,
          "title": "GitHub at the 77th United Nations General Assembly",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/10/196257167-b7382917-06cb-4a0f-ab72-24597b1d1d50.png"
        },
        {
          "id": "https://github.blog/2022-10-17-5-tips-for-embedding-security-into-your-workflows/",
          "author": null,
          "description": "Having a robust security plan is key to innovation. These tips will empower you to gain the upper hand on cyberattacks, so you can ship quickly and innovate with ease.",
          "link": "https://github.blog/2022-10-17-5-tips-for-embedding-security-into-your-workflows/",
          "publishedOn": "2022-10-17T15:00:47.000Z",
          "wordCount": 1528,
          "title": "5 tips for embedding security into your workflows",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/08/Security-Product@2x.png"
        },
        {
          "id": "https://github.blog/2022-10-14-osis-deep-dive-is-an-essential-discussion-on-the-future-of-ai-and-open-source/",
          "author": null,
          "description": "GitHub is sponsoring Open Source Initiative’s Deep Dive: AI because we think it’s important for the community to unpack how open source software, process, and principles can help best deliver on the promise of AI.",
          "link": "https://github.blog/2022-10-14-osis-deep-dive-is-an-essential-discussion-on-the-future-of-ai-and-open-source/",
          "publishedOn": "2022-10-14T16:00:41.000Z",
          "wordCount": 2175,
          "title": "OSI’s Deep Dive is an essential discussion on the future of AI and open source",
          "imageUrl": "https://github.blog/wp-content/uploads/2021/11/GitHub-Policy-blog-banner.png?fit=1200%2C630"
        },
        {
          "id": "https://github.blog/2022-10-13-introducing-github-advanced-security-siem-integrations-for-security-professionals/",
          "author": null,
          "description": "Learn about using GitHub Advanced Security (GHAS) alerts with Security Information and Events Management (SIEM) tools. Check out the integrations, and read more about getting started.",
          "link": "https://github.blog/2022-10-13-introducing-github-advanced-security-siem-integrations-for-security-professionals/",
          "publishedOn": "2022-10-13T19:25:03.000Z",
          "wordCount": 1706,
          "title": "Introducing GitHub Advanced Security SIEM integrations for security professionals",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/08/Security-Product@2x.png"
        }
      ]
    },
    {
      "title": "Martin Kleppmann's blog",
      "feedUrl": "https://feeds.feedburner.com/martinkl",
      "siteUrl": "http://martin.kleppmann.com/",
      "articles": [
        {
          "id": "http://martin.kleppmann.com/2022/10/12/verifying-distributed-systems-isabelle.html",
          "author": "Martin Kleppmann",
          "description": "This post also appears on Larry Paulson’s blog. We use distributed systems every day in the form of internet services. These systems are very useful, but also challenging to implement because networks are unpredictable. Whenever you send a message over the network, it is likely to arrive quite quickly, but...",
          "link": "http://martin.kleppmann.com/2022/10/12/verifying-distributed-systems-isabelle.html",
          "publishedOn": "2022-10-12T00:00:00.000Z",
          "wordCount": 2435,
          "title": "Verifying distributed systems with Isabelle/HOL",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Kubernetes – Production-Grade Container Orchestration",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": [
        {
          "id": "https://kubernetes.io/blog/2022/10/20/advanced-server-side-apply/",
          "author": null,
          "description": "Author: Daniel Smith (Google)\nServer-side apply (SSA) has now\nbeen GA for a few releases, and I\nhave found myself in a number of conversations, recommending that people / teams\nin various situations use it. So I’d like to write down some of those reasons.\nObvious (and not-so-obvious) benefits of SSA\nA list of improvements / niceties you get from switching from various things to\nServer-side apply!\nVersus client-side-apply (that is, plain kubectl apply):\n\nThe system gives you conflicts when you accidentally fight with another\nactor over the value of a field!\nWhen combined with --dry-run, there’s no chance of accidentally running a\nclient-side dry run instead of a server side dry run.\nVersus hand-rolling patches:\n\nThe SSA patch format is extremely natural to write, with no weird syntax.\nIt’s …",
          "link": "https://kubernetes.io/blog/2022/10/20/advanced-server-side-apply/",
          "publishedOn": "2022-10-20T00:00:00.000Z",
          "wordCount": 4804,
          "title": "Blog: Server Side Apply Is Great And You Should Be Using It",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/10/05/current-state-2019-third-party-audit/",
          "author": null,
          "description": "Authors (in alphabetical order): Cailyn Edwards (Shopify), Pushkar Joglekar (VMware), Rey Lejano (SUSE) and Rory McCune (DataDog)\nWe expect the brand new Third Party Security Audit of Kubernetes will be\npublished later this month (Oct 2022).\nIn preparation for that, let's look at the state of findings that were made\npublic as part of the last third party security audit of\n2019\nthat was based on Kubernetes v1.13.4.\nMotivation\nCraig Ingram has graciously attempted over the years to keep track of the\nstatus of the findings reported in the last audit in this issue:\nkubernetes/kubernetes#81146.\nThis blog post will attempt to dive deeper into this, address any gaps\nin tracking and become a point in time summary of the state of the\nfindings reported from 2019.\nThis article should also help reader…",
          "link": "https://kubernetes.io/blog/2022/10/05/current-state-2019-third-party-audit/",
          "publishedOn": "2022-10-05T00:00:00.000Z",
          "wordCount": 3944,
          "title": "Blog: Current State: 2019 Third Party Security Audit of Kubernetes",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/10/04/introducing-kueue/",
          "author": null,
          "description": "Authors: Abdullah Gharaibeh (Google), Aldo Culquicondor (Google)\nWhether on-premises or in the cloud, clusters face real constraints for resource usage, quota, and cost management reasons. Regardless of the autoscalling capabilities, clusters have finite capacity. As a result, users want an easy way to fairly and\nefficiently share resources.\nIn this article, we introduce Kueue,\nan open source job queueing controller designed to manage batch jobs as a single unit.\nKueue leaves pod-level orchestration to existing stable components of Kubernetes.\nKueue natively supports the Kubernetes Job\nAPI and offers hooks for integrating other custom-built APIs for batch jobs.\nWhy Kueue?\nJob queueing is a key feature to run batch workloads at scale in both on-premises and cloud environments. The main goal…",
          "link": "https://kubernetes.io/blog/2022/10/04/introducing-kueue/",
          "publishedOn": "2022-10-04T00:00:00.000Z",
          "wordCount": 4497,
          "title": "Blog: Introducing Kueue",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/10/03/userns-alpha/",
          "author": null,
          "description": "Authors: Rodrigo Campos (Microsoft), Giuseppe Scrivano (Red Hat)\nKubernetes v1.25 introduces the support for user namespaces.\nThis is a major improvement for running secure workloads in\nKubernetes. Each pod will have access only to a limited subset of the\navailable UIDs and GIDs on the system, thus adding a new security\nlayer to protect from other pods running on the same system.\nHow does it work?\nA process running on Linux can use up to 4294967296 different UIDs and\nGIDs.\nUser namespaces is a Linux feature that allows mapping a set of users\nin the container to different users in the host, thus restricting what\nIDs a process can effectively use.\nFurthermore, the capabilities granted in a new user namespace do not\napply in the host initial namespaces.\nWhy is it important?\nThere are mainly t…",
          "link": "https://kubernetes.io/blog/2022/10/03/userns-alpha/",
          "publishedOn": "2022-10-03T00:00:00.000Z",
          "wordCount": 3366,
          "title": "Blog: Kubernetes 1.25: alpha support for running Pods with user namespaces",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/09/29/enforce-immutability-using-cel/",
          "author": null,
          "description": "Author: Alexander Zielenski (Google)\nImmutable fields can be found in a few places in the built-in Kubernetes types.\nFor example, you can't change the .metadata.name of an object. Specific objects\nhave fields where changes to existing objects are constrained; for example, the\n.spec.selector of a Deployment.\nAside from simple immutability, there are other common design patterns such as\nlists which are append-only, or a map with mutable values and immutable keys.\nUntil recently the best way to restrict field mutability for CustomResourceDefinitions\nhas been to create a validating\nadmission webhook:\nthis means a lot of complexity for the common case of making a field immutable.\nBeta since Kubernetes 1.25, CEL Validation Rules allow CRD authors to express\nvalidation constraints on their fields…",
          "link": "https://kubernetes.io/blog/2022/09/29/enforce-immutability-using-cel/",
          "publishedOn": "2022-09-29T00:00:00.000Z",
          "wordCount": 5317,
          "title": "Blog: Enforce CRD Immutability with CEL Transition Rules",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/09/26/storage-in-tree-to-csi-migration-status-update-1.25/",
          "author": null,
          "description": "Author: Jiawei Wang (Google)\nThe Kubernetes in-tree storage plugin to Container Storage Interface (CSI) migration infrastructure has already been beta since v1.17. CSI migration was introduced as alpha in Kubernetes v1.14.\nSince then, SIG Storage and other Kubernetes special interest groups are working to ensure feature stability and compatibility in preparation for CSI Migration feature to go GA.\nSIG Storage is excited to announce that the core CSI Migration feature is generally available in Kubernetes v1.25 release!\nSIG Storage wrote a blog post in v1.23 for CSI Migration status update which discussed the CSI migration status for each storage driver. It has been a while and this article is intended to give a latest status update on each storage driver for their CSI Migration status in Ku…",
          "link": "https://kubernetes.io/blog/2022/09/26/storage-in-tree-to-csi-migration-status-update-1.25/",
          "publishedOn": "2022-09-26T00:00:00.000Z",
          "wordCount": 4087,
          "title": "Blog: Kubernetes 1.25: Kubernetes In-Tree to CSI Volume Migration Status Update",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/09/23/crd-validation-rules-beta/",
          "author": null,
          "description": "Authors: Joe Betz (Google), Cici Huang (Google), Kermit Alexander (Google)\nIn Kubernetes 1.25, Validation rules for CustomResourceDefinitions (CRDs) have graduated to Beta!\nValidation rules make it possible to declare how custom resources are validated using the Common Expression Language (CEL). For example:\napiVersion: apiextensions.k8s.io/v1\nkind: CustomResourceDefinition\n ...\n openAPIV3Schema:\n type: object\n properties:\n spec:\n type: object\n x-kubernetes-validations:\n - rule: \"self.minReplicas <= self.replicas && self.replicas <= self.maxReplicas\"\n message: \"replicas should be in the range minReplicas..maxReplicas.\"\n properties:\n replicas:\n type: integer\n ...\n\n\nValidation rules support a wide range of use cases. To get a sense of some of the capabilities, let's look at a few examples:\nV…",
          "link": "https://kubernetes.io/blog/2022/09/23/crd-validation-rules-beta/",
          "publishedOn": "2022-09-23T00:00:00.000Z",
          "wordCount": 4333,
          "title": "Blog: Kubernetes 1.25: CustomResourceDefinition Validation Rules Graduate to Beta",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "http://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/aaa2b41b800c",
          "author": "Netflix Technology Blog",
          "description": "by Jun He, Akash Dwivedi, Natallia Dzenisenka, Snehal Chennuru, Praneeth Yenugutala, Pawan Dixit",
          "link": "https://netflixtechblog.com/orchestrating-data-ml-workflows-at-scale-with-netflix-maestro-aaa2b41b800c?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-10-18T20:43:36.000Z",
          "wordCount": 6706,
          "title": "Orchestrating Data/ML Workflows at Scale With Netflix Maestro",
          "imageUrl": "https://miro.medium.com/max/1200/0*SDt718rSvgh2Nclv"
        },
        {
          "id": "https://medium.com/p/6253603880a6",
          "author": "Netflix Technology Blog",
          "description": "A conversation between Travis Brooks, Netflix Product Manager for Experimentation Platform, and George Khachatryan, OfferFit CEO",
          "link": "https://netflixtechblog.com/how-product-teams-can-build-empathy-through-experimentation-6253603880a6?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-10-12T20:56:33.000Z",
          "wordCount": 4554,
          "title": "How Product Teams Can Build Empathy Through Experimentation",
          "imageUrl": "https://miro.medium.com/max/1200/1*tdD6kCUukBXG91LAAYr-zw.png"
        },
        {
          "id": "https://medium.com/p/1abf249ba95f",
          "author": "Netflix Technology Blog",
          "description": "by Kostas Christidis",
          "link": "https://netflixtechblog.com/timestone-netflixs-high-throughput-low-latency-priority-queueing-system-with-built-in-support-1abf249ba95f?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-09-28T15:40:35.000Z",
          "wordCount": 5444,
          "title": "Timestone: Netflix’s High-Throughput, Low-Latency Priority Queueing System with Built-in Support…",
          "imageUrl": "https://miro.medium.com/focal/1200/632/46/46/1*JvNLSZmWCDB1WjDDUamU_g.png"
        }
      ]
    },
    {
      "title": "Google AI Blog",
      "feedUrl": "http://feeds.feedburner.com/blogspot/gJZg",
      "siteUrl": "http://ai.googleblog.com/",
      "articles": [
        {
          "id": "http://ai.googleblog.com/2022/10/pi-ars-accelerating-evolution-learned.html",
          "author": null,
          "description": "Posted by Wenhao Yu, Research Scientist, Robotics at Google, and Kuang-Huei Lee, Research Engineer, Google Research, Brain team \nEvolution strategy (ES) is a family of optimization techniques inspired by the ideas of natural selection: a population of candidate solutions are usually evolved over generations to better adapt to an optimization objective. ES has been applied to a variety of challenging decision making problems, such as legged locomotion, quadcopter control, and even power system control.  \n\nCompared to gradient-based reinforcement learning (RL) methods like proximal policy optimization (PPO) and soft actor-critic (SAC), ES has several advantages. First, ES directly explores in the space of controller parameters, while gradient-based methods often explore within a limited acti…",
          "link": "http://ai.googleblog.com/2022/10/pi-ars-accelerating-evolution-learned.html",
          "publishedOn": "2022-10-20T20:39:00.015Z",
          "wordCount": 27700,
          "title": "PI-ARS: Accelerating Evolution-Learned Visual-Locomotion with Predictive Information Representations",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh9-FBUlQSRlE2rFmeloCUXYYfBngkIWz6RIDURErqOxjFSd785fpbkjetz4lkfbUhxY8rDB88yOy26ml669f2WcP16SkXH8uZfy60jCgMq28Ggm__ombQNfdhvYe-1qsOF1imso96y26PjhT3pSukVmy__RHkVdKOJRbMTTS_k0hEJfWexdcbY4QJ2QA/s72-c/image3.gif"
        },
        {
          "id": "http://ai.googleblog.com/2022/10/musiq-assessing-image-aesthetic-and.html",
          "author": null,
          "description": "Posted by Junjie Ke, Senior Software Engineer, and Feng Yang, Senior Staff Software Engineer, Google Research\nUnderstanding the aesthetic and technical quality of images is important for providing a better user visual experience. Image quality assessment (IQA) uses models to build a bridge between an image and a user's subjective perception of its quality. In the deep learning era, many IQA approaches, such as NIMA, have achieved success by leveraging the power of convolutional neural networks (CNNs). However, CNN-based IQA models are often constrained by the fixed-size input requirement in batch training, i.e., the input images need to be resized or cropped to a fixed size shape. This preprocessing is problematic for IQA because images can have very different aspect ratios and resolutions…",
          "link": "http://ai.googleblog.com/2022/10/musiq-assessing-image-aesthetic-and.html",
          "publishedOn": "2022-10-20T16:58:00.010Z",
          "wordCount": 27669,
          "title": "MUSIQ: Assessing Image Aesthetic and Technical Quality with Multi-scale Transformers",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiCIbYQlkOE0n8G7IFh_Uo4KhEafpAKdpnx9swpUA06IV4kFaqN2bTjd22zaSmhVUDmzpFOAqTH73AQNtXvffeaW3UZwlI54w427v7dsDsI8_8UQEvY198hGgTCu9f0upoDn33AYsq0fqUbwu12rwb9_FVzrSTTHNewaiJyMIpEDzMURKzFdzpZOubazQ/s72-c/MUSIQ.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/10/do-modern-imagenet-classifiers.html",
          "author": null,
          "description": "Posted by Manoj Kumar, Research Engineer, and Ekin Dogus Cubuk, Research Scientist, Google Research \nThe task of determining the similarity between images is an open problem in computer vision and is crucial for evaluating the realism of machine-generated images. Though there are a number of straightforward methods of estimating image similarity (e.g., low-level metrics that measure pixel differences, such as FSIM and SSIM), in many cases, the measured similarity differences do not match the differences perceived by a person. However, more recent work has demonstrated that intermediate representations of neural network classifiers, such as AlexNet, VGG and SqueezeNet trained on ImageNet, exhibit perceptual similarity as an emergent property. That is, Euclidean distances between encoded rep…",
          "link": "http://ai.googleblog.com/2022/10/do-modern-imagenet-classifiers.html",
          "publishedOn": "2022-10-19T17:57:00.005Z",
          "wordCount": 27562,
          "title": "Do Modern ImageNet Classifiers Accurately Predict Perceptual Similarity?",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEguCNOD5qe7A72gZv0sl7QIgLv4HL06sCxEzVQLELH8Affzu_UzyEFJPj2nGU5PdEFO6h6XErHLFZqpFgcrJQZO0sif3zH70avGxMsop1IBQvfFKTBKfdJ-6OBYdIODCS9xopyjaIRRmcNR58EygavFwwxrGxqlOLidEkIvZxvHCIUdBsnczvy_EC7C/s72-c/image5.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/10/table-tennis-research-platform-for.html",
          "author": null,
          "description": "Posted by Avi Singh, Research Scientist, and Laura Graesser, Research Engineer, Robotics at Google\nRobot learning has been applied to a wide range of challenging real world tasks, including dexterous manipulation, legged locomotion, and grasping. It is less common to see robot learning applied to dynamic, high-acceleration tasks requiring tight-loop human-robot interactions, such as table tennis. There are two complementary properties of the table tennis task that make it interesting for robotic learning research. First, the task requires both speed and precision, which puts significant demands on a learning algorithm. At the same time, the problem is highly-structured (with a fixed, predictable environment) and naturally multi-agent (the robot can play with humans or another robot), makin…",
          "link": "http://ai.googleblog.com/2022/10/table-tennis-research-platform-for.html",
          "publishedOn": "2022-10-18T17:50:00.024Z",
          "wordCount": 27730,
          "title": "Table Tennis: A Research Platform for Agile Robotics",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh563V_fA2AfwFfnKgijiPz38oX40zeziDIAGd6chEHZiNJRLpo1N3IXjqYRhF9acNGgkwrrBvbDMKIeTxov5QJHtTx3FO36jdOVlvMpRWdjrASBWSrGLNWP8gIPoS_qEk4z5fdJiNhLKwYWiMQDsjiFwvE5iABgFNyoREW37VzHjJ102qWxpNP7aWBvg/s72-c/i-S2R.gif"
        },
        {
          "id": "http://ai.googleblog.com/2022/10/ul2-20b-open-source-unified-language.html",
          "author": null,
          "description": "Posted by Yi Tay and Mostafa Dehghani, Research Scientists, Google Research, Brain Team\nBuilding models that understand and generate natural language well is one the grand goals of machine learning (ML) research and has a direct impact on building smart systems for everyday applications. Improving the quality of language models is a key target for researchers to make progress toward such a goal.   \n\nMost common paradigms to build and train language models use either autoregressive decoder-only architectures (e.g., PaLM or GPT-3), where the model is trained to predict the next word for a given prefix phrase, or span corruption-based encoder-decoder architectures (e.g., T5, ST-MoE), where the training objective is to recover the subset of words masked out of the input. On the one hand, T5-li…",
          "link": "http://ai.googleblog.com/2022/10/ul2-20b-open-source-unified-language.html",
          "publishedOn": "2022-10-14T18:47:00.009Z",
          "wordCount": 27854,
          "title": "UL2 20B: An Open Source Unified Language Learner",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjoRWMTOf1JUl345eb5BqKEPTRRxPvzPdzvspKtqlwNHqo4BVq98MJYkvEVPZAPdYmLaFMLQKAolOdzKD3uzbYTdYM8S9Z-y5BXgy6kotdukG8w9VCkrZt3Vb0H-BEDp8XC5bGIsA_OEQPWWll1vNRZbSBwJWowTCTf9cnW-7fDOXT8MmyH5s8KzieCQg/s72-c/image3.gif"
        },
        {
          "id": "http://ai.googleblog.com/2022/10/crossmodal-3600-multilingual-reference.html",
          "author": null,
          "description": "Posted by Ashish Thapliyal, Software Engineer, and Jordi Pont-Tuset, Research Scientist, Google Research\nImage captioning is the machine learning task of automatically generating a fluent natural language description for a given image. This task is important for improving accessibility for visually impaired users and is a core task in multimodal research encompassing both vision and language modeling.  \n \nHowever, datasets for image captioning are primarily available in English. Beyond that, there are only a few datasets covering a limited number of languages that represent just a small fraction of the world’s population. Further, these datasets feature images that severely under-represent the richness and diversity of cultures from across the globe. These aspects have hindered research on…",
          "link": "http://ai.googleblog.com/2022/10/crossmodal-3600-multilingual-reference.html",
          "publishedOn": "2022-10-13T16:53:00.014Z",
          "wordCount": 27895,
          "title": "Crossmodal-3600 — Multilingual Reference Captions for Geographically Diverse Images",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhA3qznWJUsCY3Jh7Z5CPA5U3dJIBWD28I3OOEXklBBY4TseAh5iap2pmDdYi-s4PbBZZu7lgMut_pW9WpbEr9FLyRK0WBnzejaerkRjJfNAc4tKhOvbnxhTY70akSiIrEir7NUxXhgbFyA1DopoQdqY0feRtoiTRkuyh6Goiqs2m73Yz9bFeBvkhekSg/s72-c/xm3600_animation_long.gif"
        },
        {
          "id": "http://ai.googleblog.com/2022/10/audiolm-language-modeling-approach-to.html",
          "author": null,
          "description": "Posted by Zalán Borsos, Research Software Engineer, and Neil Zeghidour, Research Scientist, Google Research \nGenerating realistic audio requires modeling information represented at different scales. For example, just as music builds complex musical phrases from individual notes, speech combines temporally local structures, such as phonemes or syllables, into words and sentences. Creating well-structured and coherent audio sequences at all these scales is a challenge that has been addressed by coupling audio with transcriptions that can guide the generative process, be it text transcripts for speech synthesis or MIDI representations for piano. However, this approach breaks when trying to model untranscribed aspects of audio, such as speaker characteristics necessary to help people with spee…",
          "link": "http://ai.googleblog.com/2022/10/audiolm-language-modeling-approach-to.html",
          "publishedOn": "2022-10-06T20:05:00.001Z",
          "wordCount": 27482,
          "title": "AudioLM: a Language Modeling Approach to Audio Generation",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiX0MyO_IXk730mCbbJX7LXxBRIxJk2K41Y4leuEk4WQRjz0kgIp9CGHFwLePaKt3qEcCK8fvhAxjJ7J_sXH05q7xnsMbjZZFDDLPIlVyaKr3yYo77oT2KBqe9gw4MFuUZnUfxFprP67ExPzr2RNxduB0SruUGjJXghihHSoxvMtlG3YNtHHesZOJzY/s72-c/image2.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/10/large-motion-frame-interpolation.html",
          "author": null,
          "description": "Posted by Fitsum Reda and Janne Kontkanen, Google Research \nFrame interpolation is the process of synthesizing in-between images from a given set of images. The technique is often used for temporal up-sampling to increase the refresh rate of videos or to create slow motion effects. Nowadays, with digital cameras and smartphones, we often take several photos within a few seconds to capture the best picture. Interpolating between these “near-duplicate” photos can lead to engaging videos that reveal scene motion, often delivering an even more pleasing sense of the moment than the original photos.  \n  \nFrame interpolation between consecutive video frames, which often have small motion, has been studied extensively. Unlike videos, however, the temporal spacing between near-duplicate photos can …",
          "link": "http://ai.googleblog.com/2022/10/large-motion-frame-interpolation.html",
          "publishedOn": "2022-10-04T18:43:00.004Z",
          "wordCount": 27659,
          "title": "Large Motion Frame Interpolation",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgRIrNGJ_ULWX3iM63cdI0H6CJx9200rUy_yxYJbT15kNRlAkgiZ4o_8NfWyfZ2GnTusotAQXxMjVkhh0zvOW92meJkwRniD2Fh6DyvZukZDOo_ZujCcsos37LOeE9rpZlyh2VNFYVMa5WapuSpCxdTJ9UWVBLZvRdlup7ACXPlq_zhR6tyE8KoUpsg0g/s72-c/image3.gif"
        },
        {
          "id": "http://ai.googleblog.com/2022/09/quantization-for-fast-and.html",
          "author": null,
          "description": "Posted by Srivatsan Krishnan, Student Researcher, and Aleksandra Faust, Senior Staff Research Scientist, Google Research, Brain Team   \nDeep reinforcement learning (RL) continues to make great strides in solving real-world sequential decision-making problems such as balloon navigation, nuclear physics, robotics, and games. Despite its promise, one of its limiting factors is long training times. While the current approach to speed up RL training on complex and difficult tasks leverages distributed training scaling up to hundreds or even thousands of computing nodes, it still requires the use of significant hardware resources which makes RL training expensive, while increasing its environmental impact. However, recent work [1, 2] indicates that performance optimizations on existing hardware …",
          "link": "http://ai.googleblog.com/2022/09/quantization-for-fast-and.html",
          "publishedOn": "2022-09-27T17:32:00.001Z",
          "wordCount": 27488,
          "title": "Quantization for Fast and Environmentally Sustainable Reinforcement Learning",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgF_4o81i0gPf7bU-_E8Fqhy_Ih-AdGI6s_CNhcfVv6wirCsGJlMdwX7DQamF3VYTUbNNJn1E2omMJ3tziscCnTxrxMslApGiPfrg67-3H7WpKCcxXJg5ihqaSrKlOLClmgTIxy8yDKMIFZIQzZL1tNamHlGGvtXZW6zWDAHHlN8kRCZAjYGcuFuDaOYw/s72-c/image4.gif"
        },
        {
          "id": "http://ai.googleblog.com/2022/09/tensorstore-for-high-performance.html",
          "author": null,
          "description": "Posted by Jeremy Maitin-Shepard and Laramie Leavitt, Software Engineers, Connectomics at Google\nMany exciting contemporary applications of computer science and machine learning (ML) manipulate multidimensional datasets that span a single large coordinate system, for example, weather modeling from atmospheric measurements over a spatial grid or medical imaging predictions from multi-channel image intensity values in a 2d or 3d scan. In these settings, even a single dataset may require terabytes or petabytes of data storage. Such datasets are also challenging to work with as users may read and write data at irregular intervals and varying scales, and are often interested in performing analyses using numerous machines working in parallel.  \n\nToday we are introducing TensorStore, an open-sourc…",
          "link": "http://ai.googleblog.com/2022/09/tensorstore-for-high-performance.html",
          "publishedOn": "2022-09-22T21:33:00.007Z",
          "wordCount": 27884,
          "title": "TensorStore for High-Performance, Scalable Array Storage",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgX9DAdPcFpMfSPteAKTplWpi2h3okSemN9o1J3B6K45LHBjkp2OiSbNimITgluVBLLyyVwXIhe0tvhwDIG01lWXXPCW-Lh0HqOg6qRBE96ON4ndUBmb4kdDmQ0cMsk2dZcsHkTNU2quF7UMttmX8-GbfMLGmXfKePb1sGIa0qSODsf6oV4dXPZhoo-/s72-c/image1.gif"
        }
      ]
    },
    {
      "title": "Seth Godin's Blog on marketing, tribes and respect",
      "feedUrl": "https://feeds.feedblitz.com/sethsblog",
      "siteUrl": "https://seths.blog",
      "articles": [
        {
          "id": "https://seths.blog/?p=44056",
          "author": "Seth Godin",
          "description": "“The number of people who say that Moore’s Law can’t continue doubles every 24 months.” Even if you don’t understand this at first, it’s worth a second to understand it. Moore’s Law, now nearly sixty years old, describes a simple engineering fact that has changed the life of everyone on the planet. The number of […]",
          "link": "https://feeds.feedblitz.com/~/716500452/0/sethsblog~Dawanis-Law/",
          "publishedOn": "2022-10-21T08:25:00.000Z",
          "wordCount": 1175,
          "title": "Dawani’s Law",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806132-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=43037",
          "author": "Seth Godin",
          "description": "Objections are helpful. We object by holding back action or support because we question one or more pieces of data. But the other half of this is the obligation: if the data ends up meeting the standard of proof we set for it, we have to change our minds and spend as much energy supporting […]",
          "link": "https://feeds.feedblitz.com/~/716283416/0/sethsblog~The-obligation-of-the-honest-skeptic/",
          "publishedOn": "2022-10-20T08:54:00.000Z",
          "wordCount": 1056,
          "title": "The obligation of the honest skeptic",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806136-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=41166",
          "author": "Seth Godin",
          "description": "When the stakes are high, when it has to be a HIT, in all capital letters, we overinvest. The big stars. The lack of creative risk. The inflated budget and the meetings overrun with meddlers. After all, it’s big. Our insistence that it be guaranteed to work almost ensures that it won’t. Forcing something to […]",
          "link": "https://feeds.feedblitz.com/~/716073084/0/sethsblog~The-paradox-of-big/",
          "publishedOn": "2022-10-19T08:31:00.000Z",
          "wordCount": 1050,
          "title": "The paradox of big",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806139-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=43025",
          "author": "Seth Godin",
          "description": "Even the longest biography is only 66 hours on audio. This means that the author has to leave out almost everything. We write our own autobiography each day by deciding what to focus on, what to rehash, and what to worry about. The same life story can be told in many ways, and the way […]",
          "link": "https://feeds.feedblitz.com/~/715965146/0/sethsblog~Your-autobiography/",
          "publishedOn": "2022-10-18T07:35:00.000Z",
          "wordCount": 1057,
          "title": "Your autobiography",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061313.jpg"
        },
        {
          "id": "https://seths.blog/?p=44008",
          "author": "Seth Godin",
          "description": "Cars aren’t like companies. Most cars on the road will be sold, again and again, until they end up as parts. Companies usually start and end with their founders. Sometimes, a small, stable company is sold to an individual operator, usually for a multiple of the expected annual profit. It’s an investment in future cash […]",
          "link": "https://feeds.feedblitz.com/~/715864308/0/sethsblog~Selling-a-company/",
          "publishedOn": "2022-10-17T08:22:00.000Z",
          "wordCount": 1413,
          "title": "Selling a company",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806136-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=39746",
          "author": "Seth Godin",
          "description": "Someone said that to me the other day and it was heartbreaking. The number of tasks in our culture that require someone who was born with off-the-charts talent is small indeed. Just about everything else we need people to do is the result of effort, practice and care. It’s true that variations of that work […]",
          "link": "https://feeds.feedblitz.com/~/715773264/0/sethsblog~Im-not-that-smart/",
          "publishedOn": "2022-10-16T08:30:00.000Z",
          "wordCount": 1116,
          "title": "“I’m not that smart”",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061317.jpg"
        },
        {
          "id": "https://seths.blog/?p=42252",
          "author": "Seth Godin",
          "description": "When abundance showed up, first in manufactured goods, then in information, it all seemed like a simple win. More of what we want, thanks. But of course, more of too many things is too much. We are leaving the age of information and entering the age of choice. Not just choosing what we’ll consume, but […]",
          "link": "https://feeds.feedblitz.com/~/715677944/0/sethsblog~We-forgot-to-choose/",
          "publishedOn": "2022-10-15T08:34:00.000Z",
          "wordCount": 1077,
          "title": "We forgot to choose",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061313.jpg"
        },
        {
          "id": "https://seths.blog/?p=43976",
          "author": "Seth Godin",
          "description": "That’s what it said on the side of the tractor-trailer on the highway. Since 1924, they’re almost 100 years old. But it’s unlikely that it’s everyone’s favorite. Being everyone’s favorite is such an attractive goal, and almost impossible to achieve. Ask someone about their favorite pie and they’ll talk about the one they ate as […]",
          "link": "https://feeds.feedblitz.com/~/715566360/0/sethsblog~Americas-favorite-pie/",
          "publishedOn": "2022-10-14T08:06:00.000Z",
          "wordCount": 1195,
          "title": "“America’s favorite pie”",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806136-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=43984",
          "author": "Seth Godin",
          "description": "Without a doubt, the world has become more connected, noisier and more complex. But along the way, we’re still applying our instincts from a century ago, from a planet of villages and different expectations. Rhetorical questions worth considering as we think about what’s normal. Where does here end and there begin? Is there a line […]",
          "link": "https://feeds.feedblitz.com/~/715452174/0/sethsblog~The-small-world-questions/",
          "publishedOn": "2022-10-13T08:22:00.000Z",
          "wordCount": 1141,
          "title": "The small world questions",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806134-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=43932",
          "author": "Seth Godin",
          "description": "Big companies act like big companies. We don’t take them seriously when they say they care, because there is no “they.” When they send a holiday card or an email, we don’t really think it was from a person we could connect with. Individuals act like individuals. When they write us a note or show […]",
          "link": "https://feeds.feedblitz.com/~/715344454/0/sethsblog~The-uncanny-valley-of-scale/",
          "publishedOn": "2022-10-12T08:04:00.000Z",
          "wordCount": 1180,
          "title": "The uncanny valley of scale",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806132-1.jpg"
        }
      ]
    },
    {
      "title": "The JetBrains Blog",
      "feedUrl": "https://blog.jetbrains.com/feed/",
      "siteUrl": "https://blog.jetbrains.com",
      "articles": [
        {
          "id": "https://blog.jetbrains.com/?post_type=clion&p=289412",
          "author": "Anastasia Kazakova",
          "description": "A new CLion 2022.3 EAP build is available! Download build 223.7126.6 from our website, via the Toolbox App, or as a snap package (if you are using Ubuntu). If you are on macOS, there is a separate build for Apple Silicon (M1 chip). Update via patch if you are using the previous EAP build. DOWNLOAD […]",
          "link": "https://blog.jetbrains.com/clion/2022/10/clion-2022-3-eap-cpp20-modules-now-supported/",
          "publishedOn": "2022-10-21T15:21:53.000Z",
          "wordCount": 2623,
          "title": "CLion 2022.3 EAP: C++20 Modules Now Supported!",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/09/Social_share_image_1280x720_CLion-2x.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=idea&p=289416",
          "author": "Zlata Kalyuzhnaya",
          "description": "We’re happy to announce a new live stream on Java ecosystem security with Open Source and DevSecOps! To learn more about using security in the Java ecosystem, register today and join us on the day of the event: Date: Tuesday, October 27, 2022 Time: 5:00 pm –6:00 pm CEST REGISTER FOR THE WEBINAR Session agenda […]",
          "link": "https://blog.jetbrains.com/idea/2022/10/new-live-stream-diving-into-java-ecosystem-security-with-open-source-and-devsecops/",
          "publishedOn": "2022-10-21T14:42:15.000Z",
          "wordCount": 2211,
          "title": "New Live Stream: Diving Into Java Ecosystem Security With Open Source and DevSecOps",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2019/02/intellij-idea_social.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=go&p=289427",
          "author": "Sergey Kozlovskiy",
          "description": "The fourth build of the GoLand 2022.3 EAP is now available!  You can get the EAP build via the Toolbox App, download it from our website, use a snap package (for Ubuntu), or from inside GoLand, select Check IDE updates for Early Access Program in Preferences/Settings | Appearance & Behavior | System Settings | Updates. […]",
          "link": "https://blog.jetbrains.com/go/2022/10/21/test-generation-for-generic-functions-code-vision-improvements-for-http-client-and-docker-in-goland-2022-3-eap-4/",
          "publishedOn": "2022-10-21T14:37:05.000Z",
          "wordCount": 3045,
          "title": "Test Generation for Generic Functions, Code Vision, Improvements for HTTP Client and Docker in GoLand 2022.3 EAP #4",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/09/Blog_Social_share_image_1280x720_GoLand-2x.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=idea&p=287698",
          "author": "Maria Kosukhina",
          "description": "IntelliJ IDEA 2022.3 EAP 4 is out!  It brings a new way to work with projects in WSL2, numerous improvements to working with Jakarta EE 10, Hibernate, Micronaut, the HTTP Client, Docker, and more. This blog post covers these and other updates in detail.  You can get the latest build from our website or the […]",
          "link": "https://blog.jetbrains.com/idea/2022/10/intellij-idea-2022-3-eap-4/",
          "publishedOn": "2022-10-21T14:04:39.000Z",
          "wordCount": 2918,
          "title": "IntelliJ IDEA 2022.3 EAP 4: Jakarta EE 10, Hibernate 6.1 Features, Docker Updates, and More",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2019/02/intellij-idea_social.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=blog&p=289079",
          "author": "Valeria Letusheva",
          "description": "Join us Monday, October 31, at 5:00 pm UTC (check other timezones) for our live webinar, New UI for Your IDE: A Glimpse Into the Future with JetBrains Developer Advocates. REGISTER JetBrains released our first IDE in January 2001. Since then, there have been many incremental changes to the UI we know and love. Recently, […]",
          "link": "https://blog.jetbrains.com/blog/2022/10/21/online-broadcast-new-ui/",
          "publishedOn": "2022-10-21T12:58:10.000Z",
          "wordCount": 2099,
          "title": "Webinar: “New UI for Your IDE: A Glimpse Into the Future”",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/DSGN-14789-Webinar-New-UI-A-Glimpse-at-the-Future-v2_JB_Blog_Social_share_image_1280-720.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=appcode&p=289109",
          "author": "Anastasia Kazakova",
          "description": "Hi everyone, A new AppCode 2022.3 EAP build (223.7126.4) is available for download from our website or via the Toolbox App. You can also update from the second 2022.3 EAP build via patch. DOWNLOAD APPCODE EAP This EAP build improves AppCode’s compatibility with Xcode 14.1 RC by fixing an exception that happens on project opening […]",
          "link": "https://blog.jetbrains.com/appcode/2022/10/appcode-2022-3-eap-compatibility-with-xcode-14-1-rc-and-enhanced-inline-refactoring/",
          "publishedOn": "2022-10-21T11:09:03.000Z",
          "wordCount": 2004,
          "title": "AppCode 2022.3 EAP: Compatibility With Xcode 14.1 RC and Enhanced Inline Refactoring",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/09/Blog_Social_share_image_1280x720_AppCode-2x.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=ruby&p=289042",
          "author": "Iryna Pisklyarova",
          "description": "RubyMine 2022.3 EAP4 is here! Below, you can see the most notable new functionality. Please try it out and share your feedback in the comments or by using our issue tracker. New UI available via settings Last year, we announced a closed preview program for the new UI for JetBrains IDEs. We aimed to introduce […]",
          "link": "https://blog.jetbrains.com/ruby/2022/10/rubymine-2022-3-eap4/",
          "publishedOn": "2022-10-21T06:28:40.000Z",
          "wordCount": 2574,
          "title": "Meet RubyMine 2022.3 EAP4, with the New UI and Settings Sync Solution",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/Blog_Featured_image_1280x600_RubyMine-2x.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=dotnet&p=288797",
          "author": "Anastasia Kazakova",
          "description": "The new RiderFlow update is out now! Let’s take a look at what’s new. New to RiderFlow? RiderFlow helps manage scenes, navigate and search through them, and even refactor them. You can download it from the Asset Store, use the Unity package manager to install it, or get RiderFlow.unitypackage directly from our website. DOWNLOAD RIDERFLOW […]",
          "link": "https://blog.jetbrains.com/dotnet/2022/10/20/riderflow-2022-1-4-bug-fix-update/",
          "publishedOn": "2022-10-20T11:53:20.000Z",
          "wordCount": 2218,
          "title": "RiderFlow 2022.1.4 Bug-Fix Update",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/rf-bug-fix-blog-social-share-image-1280x720-1.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=phpstorm&p=287711",
          "author": "Roman Pronskiy",
          "description": "In this build, we added full support for PHP 8.2. Keep on reading to learn all about it! The EAP allows you to try new features from the upcoming PhpStorm 2022.3. EAP builds are free to use. You can install them side by side with a stable version of PhpStorm. If something doesn’t work correctly, […]",
          "link": "https://blog.jetbrains.com/phpstorm/2022/10/phpstorm-2022-3-early-access-3-support-for-php-8-2/",
          "publishedOn": "2022-10-18T13:23:07.000Z",
          "wordCount": 2583,
          "title": "PhpStorm 2022.3 Early Access #3: Support for PHP 8.2",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/ps-release-blog-social-share-image-1280x720-1-2.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=kotlin&p=285279",
          "author": "Alina Grebenkina",
          "description": "Kotlin 1.7.20 has been released Kotlin 1.7.20 brings a bunch of improvements for you to try out: K2 support for several new plugins Preview of the ..< operator for open-ended ranges Kotlin/Native memory manager enabled by default Inline classes with generic underlying types (experimental) Support for Gradle 7.1 Learn more in the blog post Kotlin […]",
          "link": "https://blog.jetbrains.com/kotlin/2022/10/kotlin-news-1-7-20-released-multiplatform-mobile-is-in-beta-nullability-guide/",
          "publishedOn": "2022-10-18T10:54:05.000Z",
          "wordCount": 2038,
          "title": "Kotlin News: 1.7.20 Released, Multiplatform Mobile Is in Beta, Nullability Guide",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/Monthly-digest-7-September-2022-01.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=scala&p=287668",
          "author": "Maciej Gorywoda",
          "description": "ScalaCon 2022 has come and gone. It started on Tuesday, October 4, and over the course of 4 days, the audience had the chance to enjoy 21 talks and 2 keynotes. JetBrains was a Gold Sponsor of the event, which meant that we, the Scala Plugin team, had the opportunity to participate, present a lightning […]",
          "link": "https://blog.jetbrains.com/scala/2022/10/18/intellijscala-scalacon-2022/",
          "publishedOn": "2022-10-18T09:25:09.000Z",
          "wordCount": 2016,
          "title": "IntelliJScala @ ScalaCon 2022",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/scalacon.jpg"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=dataspell&p=287657",
          "author": "Valeria Letusheva",
          "description": "DataSpell 2022.2.3 implements an important fix – editing the search query no longer results in cell code deletion. There are also more improvements to the notebook editor in this build. Read on to learn more. You can download the new version from our website, update directly from the IDE, update via the free Toolbox App, […]",
          "link": "https://blog.jetbrains.com/dataspell/2022/10/2022-2-3/",
          "publishedOn": "2022-10-18T06:03:33.000Z",
          "wordCount": 1862,
          "title": "DataSpell 2022.2.3 Is Out!",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/Release_Blog_Social_share_image_1280x720_DataSpell_3-2x.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}