{
  "sources": [
    {
      "title": "Spring",
      "feedUrl": "https://spring.io/blog.atom",
      "siteUrl": "https://spring.io/blog",
      "articles": [
        {
          "id": "https://spring.io/blog/2022/12/15/spring-for-apache-pulsar-0-1-0-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring for Apache Pulsar 0.1.0 has been released and is now available from Maven Central.\n\r\nThis is the initial GA minor release of the framework. The full 1.0.0 GA release is expected mid Q12023 and will contain many more features. Although it still lives in the experimental Spring projects it is expected to move into the main Spring projects as part of the full release.\nNotable Changes\n\r\nWe have been busy adding features since our last blog. Notable new features include:\n\r\n\r\n  \nReactive support\n\r\n  \nGraalVM Native Image Support\n\r\n\r\nPlease see the release notes for more detail.\n\r\nA great place to get started is the Quick Tour in the reference docs.\nStay in touch…\n\r\nAs always, we welcome feedback and contributions, so please reach out to us on GitHub.\n\r\nGitHub | Issues | Documentation | Stack Overflow",
          "link": "https://spring.io/blog/2022/12/15/spring-for-apache-pulsar-0-1-0-available-now",
          "publishedOn": "2022-12-15T21:00:00.000Z",
          "wordCount": 655,
          "title": "Spring for Apache Pulsar 0.1.0 available now",
          "imageUrl": "https://avatars.githubusercontent.com/u/28907971?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/12/15/a-bootiful-podcast-microsoft-s-brian-benz-on-the-state-of-java-microsoft-azure-and-so-much-more",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks to Microsoft’s Brian Benz (@bbenz)",
          "link": "https://spring.io/blog/2022/12/15/a-bootiful-podcast-microsoft-s-brian-benz-on-the-state-of-java-microsoft-azure-and-so-much-more",
          "publishedOn": "2022-12-15T11:00:00.000Z",
          "wordCount": 542,
          "title": "A Bootiful Podcast: Microsoft's Brian Benz on the state of Java, Microsoft, Azure, and so much more",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/12/15/spring-framework-6-0-3-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I am pleased to announce that Spring Framework 6.0.3 is available now.\n\r\nSpring Framework 6.0.3 includes 48 fixes and documentation improvements. This version will be shipped with Spring Boot 3.0.1, to be released next week.\n\r\nProject Page | GitHub | Issues | Documentation",
          "link": "https://spring.io/blog/2022/12/15/spring-framework-6-0-3-available-now",
          "publishedOn": "2022-12-15T09:47:00.000Z",
          "wordCount": 556,
          "title": "Spring Framework 6.0.3 available now",
          "imageUrl": "https://avatars.githubusercontent.com/u/103264?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/12/14/notice-of-permissions-changes-to-repo-spring-io-january-2023",
          "author": null,
          "description": "A critical piece of infrastructure, the Spring Artifactory instance lies at the heart of the Spring portfolio development work. Since 2013, JFrog, Inc., has generously sponsored the instance for the Spring developer community.\n\r\nIn October 2020, we announced some permissions changes to our Artifactory instance to restrict anonymous access to the platform for third-party dependencies.\n\r\nAt that time, we asked the Community to source Spring releases from Maven Central. Today, we are announcing some changes to our infrastructure in alignment with that request so that we can better position repo.spring.io for the long term.\nHow to use repo.spring.io\n\r\nrepo.spring.io is intended for the download of snapshots and milestone artifacts that are not available from Maven Central. All other artifacts …",
          "link": "https://spring.io/blog/2022/12/14/notice-of-permissions-changes-to-repo-spring-io-january-2023",
          "publishedOn": "2022-12-15T06:01:00.000Z",
          "wordCount": 995,
          "title": "Notice of Permissions Changes to repo.spring.io, January 2023",
          "imageUrl": "https://avatars.githubusercontent.com/u/630743?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/12/13/this-week-in-spring-december-13th-2022",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring! I truly, absolutely, can not believe that we’re nearly done with the year already! Have you made your new years’ resolutions? Submitted your expense reports? It’s that time of the year when I’m going to start focusing on staying warm and avoiding undue work for a while :-) I hope you do too. This is why I’m glad I write these roundups: I hope they save people from extra, undue work! So, with that… let’s dive into the roundup!\n\r\n\r\n  \nA Bootiful Podcast: Vaadin’s Marcus Hellberg on rich UIs, Spring Boot 3, GraalVM native images, and more\n\r\n  \nA Guide to Spring CredHub\n\r\n  \nDo more with Azure Spring Apps – scale to zero and enhance productivity\n\r\n  \nForm Login and Basic Authentication in springdoc-openapi\n\r\n  \nGetting Started with Blaze Persistence\n\r\n  \nGuide to Java PriorityQueue\n\r\n  \nJava Generics PECS – Producer Extends Consumer Super\n\r\n  \nRSocket Security with Spring Boot via Spring Security | VMware Tanzu Developer Center\n\r\n  \nRate Limiting With Client IP in Spring Cloud Gateway\n\r\n  \nReinitialize Singleton Bean in Spring Context\n\r\n  \na very important release - v3.0.0 - of the rickroll-security-spring-boot-starter  · TomCools/rickroll-security-spring-boot-starter!\n\r\n  \nRunning Spring Boot Applications with the Embedded Camunda Engine\n\r\n  \nSecuring RSocket TCP with TLS | VMware Tanzu Developer Center\n\r\n  \nSpring Cloud Data Flow version 2.10.0 released\n\r\n  \nSpring Dependency Injection | VMware Tanzu Developer Center\n\r\n  \nSpring Tools 4.17.0 released\n\r\n  \nTracing a Reactive Kotlin App with Spring Cloud Sleuth | VMware Tanzu Developer Center",
          "link": "https://spring.io/blog/2022/12/13/this-week-in-spring-december-13th-2022",
          "publishedOn": "2022-12-13T09:00:00.000Z",
          "wordCount": 751,
          "title": "This Week in Spring - December 13th, 2022",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/12/12/spring-cloud-data-flow-version-2-10-0-released",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, we are very excited to announce the 2.10.0 release of Spring Cloud Data Flow is now available from Maven Central.\nSpring updates\n\r\nUpdates to the following versions:\n\r\n\r\n  \nSpring Boot 2.7.6\n\r\n  \nSpring Framework 5.3.24\n\r\n  \nSpring Cloud 2021.0.5\n\r\n\nSpring Shell\n\r\nSpring Shell has been updated to 2.1.4.\nDocumentation Updates\nContainer images for ARM.\n\r\nSpring Cloud Data Flow and Skipper, and Stream Application projects contain scripts to use in creating containers when running on an ARM platform. The Reference Guide has a section describing the use of the scripts.\nScripts for local Kuberenetes Development\n\r\nWe have added a collection of scripts to the Spring Cloud Data Flow that makes it easy to launch a local Kuberenetes cluster and install SCDF with MariaDB and RabbitMQ or Kafka. See the Reference Guide for more info.\n\r\nThe detailed release notes contain more info.\nStay in touch…\n\r\nAs always, we welcome feedback and contributions, so please reach out to us on Stackoverflow or GitHub.",
          "link": "https://spring.io/blog/2022/12/12/spring-cloud-data-flow-version-2-10-0-released",
          "publishedOn": "2022-12-12T16:00:00.000Z",
          "wordCount": 670,
          "title": "Spring Cloud Data Flow version 2.10.0 released",
          "imageUrl": "https://avatars.githubusercontent.com/u/466422?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/12/08/a-bootiful-podcast-vaadin-s-marcus-hellberg-on-rich-uis-spring-boot-3-graalvm-native-images-and-more",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks to Vaadin’s Marcus Hellberg (@marcushellberg) about rich UIs, Vaadin Flow, the new Hilla Framework, GraalVM native image compilation, and so much more",
          "link": "https://spring.io/blog/2022/12/08/a-bootiful-podcast-vaadin-s-marcus-hellberg-on-rich-uis-spring-boot-3-graalvm-native-images-and-more",
          "publishedOn": "2022-12-08T11:00:00.000Z",
          "wordCount": 559,
          "title": "A Bootiful Podcast: Vaadin's Marcus Hellberg on rich UIs, Spring Boot 3, GraalVM native images, and more",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/12/07/do-more-with-azure-spring-apps-scale-to-zero-and-enhance-productivity",
          "author": null,
          "description": "In 2020, Spotify coined the term \"Golden Path” to refer to a supported approach and set of components to build and deploy software. Having these paths simplifies the development process, lets developers focus on their applications instead of infrastructure and speeds time to production. Microsoft and VMware have partnered to make Azure Spring Apps a golden path for deploying and scaling Spring applications in the cloud. And with new capabilities like the scale to zero and developer productivity enhancements, Azure Spring Apps now offers an even more economical and optimized route to get your Spring applications into production.\n1. Start from zero and scale to zero – consumption plan\n\r\nWe are introducing a new consumption pricing plan for Azure Spring Apps – you can start from zero and scal…",
          "link": "https://spring.io/blog/2022/12/07/do-more-with-azure-spring-apps-scale-to-zero-and-enhance-productivity",
          "publishedOn": "2022-12-07T17:00:00.000Z",
          "wordCount": 1715,
          "title": "Do more with Azure Spring Apps – scale to zero and enhance productivity",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/12/07/spring-tools-4-17-0-released",
          "author": null,
          "description": "Dear Spring Community,\n\r\nI am happy to announce the 4.17.0 release of the Spring Tools 4 for Eclipse, Visual Studio Code, and Theia.\nmajor changes to the Spring Tools 4 for Eclipse distribution\n\r\n\r\n  \nupdated to Eclipse 2022-12 release (new and noteworthy)\n\r\n\nearly access to new experimental features\n\r\nAmong a number of bug fixes and minor improvements, this release introduces experimental support for:\n\r\n\r\n  \nSpring Boot version validations: The IDE will tell you when there is a newer major, minor, or patch version available for your Spring Boot project\n\r\n  \nSpring Boot upgrade support: The tooling will help you upgrading your existing projects to newer Spring Boot versions, including upgrades to newer patch and minor versions, as well as newer major versions (e.g. upgrading to Spring Boot 3)\n\r\n  \nSpring specific validations and refactorings: The tooling will indicate whether something can or should be changed in your source code to keep your Spring project up-to-date with the latest recommendations or advancements in Spring\n\r\n\r\nTo learn more about these new experimental features, please take a look at the user guide: https://github.com/spring-projects/sts4/wiki/\nAnd we would like to hear from you. Please let us know if you come across any issues or have thoughts and wishes for further improvements in this space: https://github.com/spring-projects/sts4/issues\nfixes and improvements\n\r\nDetailed changes can be found here: https://github.com/spring-projects/sts4/wiki/Changelog#2022-12-07-4170-release-incl-language-servers-version-1410\ndownloads\n\r\nTo download the distribution for Eclipse and find links to the marketplace entries for Visual Studio Code and Theia, please go visit:\n\r\n\r\n  \nSpring Tools 4: https://spring.io/tools/\n\r\n\r\nSpring Tools 4.17.1 is scheduled to be released in early Febuary 2023.\n\r\nEnjoy!",
          "link": "https://spring.io/blog/2022/12/07/spring-tools-4-17-0-released",
          "publishedOn": "2022-12-07T16:00:00.000Z",
          "wordCount": 753,
          "title": "Spring Tools 4.17.0 released",
          "imageUrl": "https://avatars.githubusercontent.com/u/107705?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/12/06/this-week-in-spring-december-6th-2022",
          "author": null,
          "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring! How are you? You know what I’ve wanted to do? See my friends on the Spring team in person since the pandemic descended. And, I’m overjoyed to relate, I’ve just had the privilege of a nice meeting with several of them last night. And I’m going to see more of them today! Seriously. I feel like I won the lottery. I’ve missed my friends. Hug your friends and family, friends. You never know when the next pandemic (or life in general) will put distance between you and them. So, in order to close that distance, I’m going to go back to meetings with them, and I’ll leave you with yet another week’s curated list of content. (Can you believe we’re like four weeks away from 2023?)\n\r\n\r\n  \nA Bootiful Podcast: Java Champion Gunnar Mo…",
          "link": "https://spring.io/blog/2022/12/06/this-week-in-spring-december-6th-2022",
          "publishedOn": "2022-12-06T09:00:00.000Z",
          "wordCount": 834,
          "title": "This Week in Spring - December 6th, 2022",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/12/05/spring-shell-2-1-4-and-3-0-0-m3-are-now-available",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Shell 2.1.4 and 3.0.0-M3 has been released and is now available from https://repo.spring.io/release, Maven Central and https://repo.spring.io/milestone respectively.\n\r\n3.0.0-M3 is first milestone which builds on Spring Boot 3.0.0 GA version.\n\r\nPlease see the release notes 2.1.4 and release notes 3.0.0-M3 for more details.\n\r\nThanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nProject Page | GitHub | Issues | Documentation",
          "link": "https://spring.io/blog/2022/12/05/spring-shell-2-1-4-and-3-0-0-m3-are-now-available",
          "publishedOn": "2022-12-05T15:25:14.000Z",
          "wordCount": 592,
          "title": "Spring Shell 2.1.4 and 3.0.0-M3 are now available",
          "imageUrl": "https://avatars.githubusercontent.com/u/50398?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/12/02/spring-ws-samples-upgraded-for-spring-boot-3-0",
          "author": null,
          "description": "With the recent announcement of Spring Boot 3.0 going GA, some of you may be interested in upgrading your Spring Web Services-based applications to take full advantage of this. The Spring WS team has upgraded our set of sample apps to help you carry that out.\n\r\n\r\n\r\nThe main branch now tracks the version of samples with all these updates. (The prior version of samples built on Spring Boot 2.7 are now on that repository’s 1.0.x branch.)\n\r\n\r\n\r\nSome of the highlights are covered below.\n\r\n\r\n\r\nA LOT of our tools have moved!\n\r\n\r\n\r\nBack in the olden days, much of our XML processing tools were inside the JDK. But ever since Java 9 and the migrations of Java EE-based packages to the Eclipse Foundation, those tools have since been pulled out of the JDK. On top of that, SOAP-based libraries, heavily l…",
          "link": "https://spring.io/blog/2022/12/02/spring-ws-samples-upgraded-for-spring-boot-3-0",
          "publishedOn": "2022-12-02T23:26:00.000Z",
          "wordCount": 1386,
          "title": "Spring WS Samples upgraded for Spring Boot 3.0!",
          "imageUrl": "https://avatars.githubusercontent.com/u/311040?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/12/02/spring-cloud-2022-0-0-release-candidate-3-codename-kilburn-has-been-released",
          "author": null,
          "description": "On behalf of the community, I am pleased to announce that the Release Candidate 3 (RC3) of the Spring Cloud 2022.0 Release Train is available today. The release can be found in Spring Milestone repository. You can check out the 2022.0 release notes for more information.\nNotable Changes in the 2022.0.0 RC3 release\n\r\nClick here to see all issues in this release.\n\r\nSpring Cloud 2022.0.0-RC3 requires Spring Boot 3.0.0.\nSpring Cloud Contract\n\r\n\r\n  \nRemoves Gradle’s support for src/test/resources/contracts checking (#1848)\n\r\n\r\nCheck the latest migration guide entry for more information.\nSpring Cloud Gateway\n\r\n\r\n  \nAdded the possibility to disable global CORS configuration (#2779)\n\r\n\nSpring Cloud OpenFeign\n\r\n\r\n  \nSupport for AOT and native images has been added (#794)\n\r\n  \nSupport for Micrometer …",
          "link": "https://spring.io/blog/2022/12/02/spring-cloud-2022-0-0-release-candidate-3-codename-kilburn-has-been-released",
          "publishedOn": "2022-12-02T14:00:00.000Z",
          "wordCount": 997,
          "title": "Spring Cloud 2022.0.0 Release Candidate 3 (codename Kilburn) Has Been Released",
          "imageUrl": "https://avatars.githubusercontent.com/u/4328892?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/12/01/a-bootiful-podcast-java-champion-gunnar-morling-about-messaging-middleware-debezium-change-data-capture-and-more",
          "author": null,
          "description": "Hi, Spring fans! In this installment, Josh Long (@starbuxman) talks to Java Champion Gunnar Morling (@gunnarmorling) about messaging middleware, Debezium, and more.",
          "link": "https://spring.io/blog/2022/12/01/a-bootiful-podcast-java-champion-gunnar-morling-about-messaging-middleware-debezium-change-data-capture-and-more",
          "publishedOn": "2022-12-01T09:00:00.000Z",
          "wordCount": 547,
          "title": "A Bootiful Podcast: Java Champion Gunnar Morling about messaging middleware, Debezium, change data capture, and more.",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/11/29/this-week-in-spring-november-29th-2022-spring-boot-3-has-arrived",
          "author": null,
          "description": "Hi, Spring fans! It’s here! It’s finally here, at long last! Spring Boot 3!! And of course with Spring Boot 3.0 comes a whole portfolio of integrated projects that have also been updated! Remember, a huge theme in this release is support for GraalVM native images, and that’s now supported across the board. You know what to do: start.spring.io. \n\r\nI put together a Spring Tipds video introducing some of the major themes of Spring Framework 6 / Spring Boot 3. \n\r\n\r\nI also did an in-depth look at the new GraalVM support powered by Spring’s ahead-of-time (AOT) engine. \n\r\n\r\nThere’s so much else to talk about this week, but I really can’t stress this enough: Spring Boot 3 is here! In some ways, it feels like this release has been more than four years in the making! It’s amazing, and I can’t wait f…",
          "link": "https://spring.io/blog/2022/11/29/this-week-in-spring-november-29th-2022-spring-boot-3-has-arrived",
          "publishedOn": "2022-11-29T18:00:00.000Z",
          "wordCount": 886,
          "title": "This Week in Spring - November 29th, 2022 (Spring Boot 3 has arrived)",
          "imageUrl": "https://avatars.githubusercontent.com/u/54473?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/11/29/spring-integration-6-0-goes-ga",
          "author": null,
          "description": "Dear Spring community,\n\r\n\r\n\r\nOn behalf of the team, it is my very great pleasure to announce that Spring Integration 6.0.0 is now generally available and can be found in Maven Central.\n\r\n\r\n\r\nThis release is the culmination of more than a year of work.\r\nA massive thank you to everyone that has contributed, and to all the early adopters that have been providing vital feedback on the milestones.\n\r\n\r\n\r\nThis version is fully based on Spring Framework 6.0, Spring Data 2022.0, Spring for GraphQL 1.1, Spring WebServices 4.0 and many other major releases of Spring portfolio projects which contribute to their respective integration modules.\r\nOn the other hand Spring Integration 6.0 is a part of recently released Spring Boot 3.0.\n\r\n\r\n\r\nHighlights of the new release include:\n\r\n\r\n\r\n\r\n\r\nA Java 17 baseline\n\r\n\r\n\r\nSupport for native images with GraalVM and Spring AOT engine\n\r\n\r\n\r\nObservability instrumentation with Micrometer and Micrometer Tracing\n\r\n\r\n\r\nSupport for Jakarta EE 10 with an EE 9 baseline\n\r\n\r\n\r\n\r\n\r\nThere’s far too many features to list them all here in detail, so head over to the What’s New documentation page and check out a Migration Guide on GitHub.\r\nIf you just want to get started, you can easily bootstrap a new project on start.spring.io.\r\nIf you’d like to try out the GraalVM support, start.spring.io can help with that too.\n\r\n\r\n\r\nCheers, \n\r\nArtem\n\r\n\r\n\r\nProject Page | GitHub Issues | Contributing | Help | Chat",
          "link": "https://spring.io/blog/2022/11/29/spring-integration-6-0-goes-ga",
          "publishedOn": "2022-11-29T17:55:29.000Z",
          "wordCount": 731,
          "title": "Spring Integration 6.0 goes GA",
          "imageUrl": "https://avatars.githubusercontent.com/u/1071590?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/11/28/spring-vault-3-0-goes-ga",
          "author": null,
          "description": "On behalf of the team, it is my very great pleasure to announce that Spring Vault 3.0 is now generally available, and 3.0.0 can be found in Maven Central.\n\r\n\r\n\r\nThis release ships with several refinements and new features. Highlights of the new release include:\n\r\n\r\n\r\n\r\n\r\nA Java 17 baseline\n\r\n\r\n\r\nSupport additional HTTP Clients, including the reactive JDK HTTP Client\n\r\n\r\n\r\nSupport for Vault Repositories using versioned Key/Value secrets engines\n\r\n\r\n\r\n\r\n\r\nThere are far too many features to list them all here in detail, so head over to the release notes page in our wiki to find out more.\n\r\n\r\n\r\nThanks to everyone who has contributed to Spring Vault over the years!\n\r\n\r\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow",
          "link": "https://spring.io/blog/2022/11/28/spring-vault-3-0-goes-ga",
          "publishedOn": "2022-11-28T08:14:16.000Z",
          "wordCount": 621,
          "title": "Spring Vault 3.0 goes GA",
          "imageUrl": "https://avatars.githubusercontent.com/u/1035015?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/11/24/spring-modulith-0-1-released",
          "author": null,
          "description": "Hot on the heels of Spring Boot 3.0 GA, it’s my pleasure to announce the availability of Spring Modulith 0.1. The release concludes the integration of the Moduliths project into the Spring ecosystem. I want to especially thank Dmitry Belyaev and Björn Kieling who helped a lot during the migration and contributed significant new features to the project, the event publication repository implementations for JDBC and MongoDB in particular.\n\r\nFor a general introduction into the project, please check out the original announcement and this InfoQ article.\n\r\nChangelog | Reference documentation",
          "link": "https://spring.io/blog/2022/11/24/spring-modulith-0-1-released",
          "publishedOn": "2022-11-24T21:53:00.000Z",
          "wordCount": 591,
          "title": "Spring Modulith 0.1 released",
          "imageUrl": "https://avatars.githubusercontent.com/u/128577?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/11/24/spring-boot-3-0-goes-ga",
          "author": null,
          "description": "On behalf of the team, it is my very great pleasure to announce that Spring Boot 3.0 is now generally available and 3.0.0 can be found in Maven Central.\n\r\nThis release is the culmination of 12 months work and over 5700 commits by 151 different individuals. A massive thank you to everyone that has contributed, and to all the early adopters that have been providing vital feedback on the milestones.\n\r\nThis is the first major revision of Spring Boot since 2.0 was released 4.5 years ago. It’s also the first GA version of Spring Boot that provides support for Spring Framework 6.0 and GraalVM. \n\r\nHighlights of the new release include:\n\r\n\r\n  \nA Java 17 baseline\n\r\n  \nSupport for generating native images with GraalVM, superseding the experimental Spring Native project\n\r\n  \nImproved observability with Micrometer and Micrometer Tracing\n\r\n  \nSupport for Jakarta EE 10 with an EE 9 baseline\n\r\n\r\nThere’s far too many features to list them all here in detail, so head over to the release notes page on our wiki to find out more. If you just want to get started, you can easily bootstrap a new project on start.spring.io. If you’d like to try out the GraalVM support, start.spring.io can help with that too.\n\r\nOver the coming weeks we’ll be publishing blog posts that cover some Spring Boot 3.0 features in detail.\n\r\nThanks again to everyone that has contributed to Spring and Spring Boot over the years! Supporting Jakarta EE 9 and 10, the observability enhancements, and GraalVM support has been a huge team effort that has left no corner of the Spring portfolio untouched. A special thank you to the developers of the other projects in the Spring portfolio, without whom this release would not have been possible.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2022/11/24/spring-boot-3-0-goes-ga",
          "publishedOn": "2022-11-24T18:34:00.000Z",
          "wordCount": 803,
          "title": "Spring Boot 3.0 Goes GA",
          "imageUrl": "https://avatars.githubusercontent.com/u/914682?v=4?s=200"
        },
        {
          "id": "https://spring.io/blog/2022/11/24/spring-boot-2-7-6-available-now",
          "author": null,
          "description": "On behalf of the team and everyone who has contributed, I’m happy to announce that Spring Boot 2.7.6 has been released and is now available from Maven Central.\n\r\nThis release includes 44 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests.\nHow can you help?\n\r\nIf you’re interested in helping out, check out the “ideal for contribution” tag in the issue repository. If you have general questions, please ask on stackoverflow.com using the spring-boot tag or chat with the community on Gitter.\n\r\nProject Page | GitHub | Issues | Documentation | Stack Overflow | Gitter",
          "link": "https://spring.io/blog/2022/11/24/spring-boot-2-7-6-available-now",
          "publishedOn": "2022-11-24T15:13:00.000Z",
          "wordCount": 608,
          "title": "Spring Boot 2.7.6 available now",
          "imageUrl": "https://avatars.githubusercontent.com/u/490484?v=4?s=200"
        }
      ]
    },
    {
      "title": "HashiCorp Blog",
      "feedUrl": "https://www.hashicorp.com/blog/feed.xml",
      "siteUrl": "https://hashicorp.com/blog",
      "articles": [
        {
          "id": "https://www.hashicorp.com/blog/new-terraform-run-tasks-from-checkpoint-rapid7-zscaler-and-others",
          "author": null,
          "description": "New Terraform Cloud Run Tasks partners provide more options to ensure security and compliance for cloud infrastructure management.",
          "link": "https://www.hashicorp.com/blog/new-terraform-run-tasks-from-checkpoint-rapid7-zscaler-and-others",
          "publishedOn": "2022-12-16T17:00:00.000Z",
          "wordCount": 1710,
          "title": "New Terraform Run Tasks From Checkpoint, Rapid7, ZScaler and Others",
          "imageUrl": "https://www.datocms-assets.com/2885/1620073844-blog-library-product-terraform-cloud-tfc-black-gradient.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-predicts-what-to-expect-in-2023",
          "author": null,
          "description": "Leaders from around HashiCorp share their predictions for the coming year on everything from Kubernetes to AI to zero trust security.",
          "link": "https://www.hashicorp.com/blog/hashicorp-predicts-what-to-expect-in-2023",
          "publishedOn": "2022-12-15T20:00:00.000Z",
          "wordCount": 2738,
          "title": "HashiCorp Predicts: What to Expect in 2023",
          "imageUrl": "https://www.datocms-assets.com/2885/1671135312-2022_hashiconf_tuesday_056_0244.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/terraform-plugin-framework-is-now-generally-available",
          "author": null,
          "description": "The Terraform Plugin Framework 1.0 is now generally available to provide a modern and extensible way for developers to create Terraform providers.",
          "link": "https://www.hashicorp.com/blog/terraform-plugin-framework-is-now-generally-available",
          "publishedOn": "2022-12-14T17:00:00.000Z",
          "wordCount": 2189,
          "title": "Terraform Plugin Framework Is Now Generally Available",
          "imageUrl": "https://www.datocms-assets.com/2885/1620083068-blog-library-product-terraform-black.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/dynamic-secrets-for-waypoint-with-vault",
          "author": null,
          "description": "Learn how to source dynamic secrets from HashiCorp Vault in your Waypoint deployments using dynamic configuration.",
          "link": "https://www.hashicorp.com/blog/dynamic-secrets-for-waypoint-with-vault",
          "publishedOn": "2022-12-08T17:00:00.000Z",
          "wordCount": 4174,
          "title": "Dynamic Secrets for Waypoint with Vault",
          "imageUrl": "https://www.datocms-assets.com/2885/1620083916-blog-library-product-waypoint-dark-gradient.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashicorp-terraform-and-aws-re-invent-caps-off-a-big-year",
          "author": null,
          "description": "AWS re:Invent 2022 is here. We highlighted what’s new with Terraform and AWS — like Launch Day support for new AWS services in the Terraform AWS Provider.",
          "link": "https://www.hashicorp.com/blog/hashicorp-terraform-and-aws-re-invent-caps-off-a-big-year",
          "publishedOn": "2022-11-30T20:00:00.000Z",
          "wordCount": 3044,
          "title": "HashiCorp Terraform and AWS: re:Invent Caps Off a Big Year",
          "imageUrl": "https://www.datocms-assets.com/2885/1620155432-blog-library-product-terraform-aws-logomarks-dark.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/re-invent-roundup-hashicorp-zero-trust-security-and-more-with-aws",
          "author": null,
          "description": "Read our recap of HashiCorp security and networking news and developments on AWS from this past year.",
          "link": "https://www.hashicorp.com/blog/re-invent-roundup-hashicorp-zero-trust-security-and-more-with-aws",
          "publishedOn": "2022-11-29T19:00:00.000Z",
          "wordCount": 3651,
          "title": "re:Invent Roundup: HashiCorp Zero Trust Security and More with AWS",
          "imageUrl": "https://www.datocms-assets.com/2885/1669667767-aws_partnerawards2022_1200x628_vpartner_namer_apn_partner-social-image_1200x628.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/how-hashicorp-waypoint-works-with-terraform-vault-and-consul",
          "author": null,
          "description": "HashiCorp Waypoint uses plugins to accept configurations from Terraform, Consul, and Vault to simplify your application release orchestration workflow.",
          "link": "https://www.hashicorp.com/blog/how-hashicorp-waypoint-works-with-terraform-vault-and-consul",
          "publishedOn": "2022-11-28T18:00:00.000Z",
          "wordCount": 1835,
          "title": "How HashiCorp Waypoint Works with Terraform, Vault, and Consul",
          "imageUrl": "https://www.datocms-assets.com/2885/1669651791-waypoint-diagram-thumbnail.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/hashitalks-2023-24-hours-of-virtual-knowledge-sharing",
          "author": null,
          "description": "HashiTalks returns on February 16, 2023. Join our global community for 24 hours of knowledge sharing. The call for speakers is open until December 7, 2022.",
          "link": "https://www.hashicorp.com/blog/hashitalks-2023-24-hours-of-virtual-knowledge-sharing",
          "publishedOn": "2022-11-22T20:00:00.000Z",
          "wordCount": 2247,
          "title": "HashiTalks 2023: 24-Hours of Virtual Knowledge Sharing",
          "imageUrl": "https://www.datocms-assets.com/2885/1669146703-ht23_twitter_1600x900_nocta.png"
        },
        {
          "id": "https://www.hashicorp.com/blog/aws-and-hashicorp-s-journey-to-1-billion-terraform-aws-provider-downloads",
          "author": null,
          "description": "The HashiCorp Terraform AWS provider has surpassed one billion downloads — here’s how we got there, and what to look for next.",
          "link": "https://www.hashicorp.com/blog/aws-and-hashicorp-s-journey-to-1-billion-terraform-aws-provider-downloads",
          "publishedOn": "2022-11-22T17:00:00.000Z",
          "wordCount": 3595,
          "title": "AWS and HashiCorp's Journey to 1 Billion Terraform AWS Provider Downloads",
          "imageUrl": "https://www.datocms-assets.com/2885/1620155432-blog-library-product-terraform-aws-logomarks-dark.jpg"
        },
        {
          "id": "https://www.hashicorp.com/blog/consul-service-mesh-support-for-aws-lambda-now-generally-available",
          "author": null,
          "description": "HashiCorp Consul support for AWS Lambda is now generally available, enabling services in the mesh to invoke Lambda serverless functions.",
          "link": "https://www.hashicorp.com/blog/consul-service-mesh-support-for-aws-lambda-now-generally-available",
          "publishedOn": "2022-11-21T19:00:00.000Z",
          "wordCount": 3112,
          "title": "Consul Service Mesh Support for AWS Lambda Now Generally Available",
          "imageUrl": "https://www.datocms-assets.com/2885/1620155275-blog-library-product-consul-aws-logomarks-dark.jpg"
        }
      ]
    },
    {
      "title": "Elastic Blog - Elasticsearch, Kibana, and ELK Stack",
      "feedUrl": "https://www.elastic.co/blog/feed",
      "siteUrl": "https://www.elastic.co",
      "articles": [
        {
          "id": "https://www.elastic.co/blog/elastic-recognized-as-a-leader-in-the-2022-gartner-magic-quadrant-for-insight-engines",
          "author": "Matt Riley",
          "description": "Elastic is delighted to be named a Leader in the 2022 Gartner Magic Quadrant for Insight Engines. Download the complimentary report today, and see why we believe Elastic Enterprise Search gives developers the best solution for creating ML-powered search and discovery experiences.",
          "link": "https://www.elastic.co/blog/elastic-recognized-as-a-leader-in-the-2022-gartner-magic-quadrant-for-insight-engines",
          "publishedOn": "2022-12-16T00:00:00.000Z",
          "wordCount": 8556,
          "title": "Elastic recognized as a Leader in the 2022 Gartner® Magic Quadrant™ for Insight Engines",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blta40940eb1762c019/639b4967d45f0a5df66be514/gartner-magic-quadrant-insight-engines-december-2022.png"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-recognized-as-a-leader-in-the-2022-gartner-magic-quadrant-for-insight-engines",
          "author": "Matt Riley",
          "description": ",\n\nWe’re pleased to announce that Elastic has been named a Leader in the 2022 Gartner® Magic Quadrant™ for Insight Engines. This is our second year of inclusion in the Gartner Magic Quadrant for this category, and this year’s evaluation places Elastic as the furthest entry on the \"Completeness of Vision\" axis. We believe this placement, our market momentum, and the strength of our vision are outcomes driven by two fundamentals:\n\nOur unwavering focus on search and the expanding toolkit of search capabilities we deliver to developers, search operators, and data analysts.\nThe Elastic platform’s ability to address a broad range of search application needs – from standalone applications like internal workplace search, to new search-powered applications built to deliver specific functionalities …",
          "link": "https://www.elastic.co/blog/elastic-recognized-as-a-leader-in-the-2022-gartner-magic-quadrant-for-insight-engines",
          "publishedOn": "2022-12-16T00:00:00.000Z",
          "wordCount": 8556,
          "title": "Elastic recognized as a Leader in the 2022 Gartner® Magic Quadrant™ for Insight Engines",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blta40940eb1762c019/639b4967d45f0a5df66be514/gartner-magic-quadrant-insight-engines-december-2022.png"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-security-maintains-product-approved-status-for-av-comparatives",
          "author": "Samantha Zeitlin,Mark Dufresne",
          "description": "AV-Comparatives offers a comparison as an independent organization performing systematic testing that checks whether security software lives up to its promises. Elastic Security performed better than ever on the real-world protection test.",
          "link": "https://www.elastic.co/blog/elastic-security-maintains-product-approved-status-for-av-comparatives",
          "publishedOn": "2022-12-15T17:00:00.000Z",
          "wordCount": 7183,
          "title": "Elastic Security maintains Product Approved status for AV-Comparatives",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blte21ddedce08464b6/61e1de94c5ff2e754efb027e/blog-security-lock-720x420.png"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-security-maintains-product-approved-status-for-av-comparatives",
          "author": "Samantha Zeitlin,Mark Dufresne",
          "description": ",\nOrganizations need real-world protection from malware, but how do you know what you’ll get for security coverage in advance of purchasing a product? AV-Comparatives offers a comparison as an independent organization performing systematic testing that checks whether security software lives up to its promises. They create a real-world environment for accurate testing.\nThe testing is well-regarded in the industry, assessing malware prevention, real-world protection, and performance of antivirus products. Elastic has performed well consistently on malware protection testing since 2017, starting with our legacy Endgame product and achieving Approved Business Security Product each test cycle. Now, we’re performing better than ever on the real-world protection test. \nSecurity software testing o…",
          "link": "https://www.elastic.co/blog/elastic-security-maintains-product-approved-status-for-av-comparatives",
          "publishedOn": "2022-12-15T17:00:00.000Z",
          "wordCount": 7183,
          "title": "Elastic Security maintains Product Approved status for AV-Comparatives",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blte21ddedce08464b6/61e1de94c5ff2e754efb027e/blog-security-lock-720x420.png"
        },
        {
          "id": "https://www.elastic.co/blog/2022-forrester-aiops-wave-it-operations-elastic-observability",
          "author": "Gagan Singh",
          "description": "AIOps has become increasingly important in observability for managing complex, cloud-native applications and technologies. Learn how Elastic Observability earned top scores for multiple criteria in the new Forrester Wave, AI for IT Operations!",
          "link": "https://www.elastic.co/blog/2022-forrester-aiops-wave-it-operations-elastic-observability",
          "publishedOn": "2022-12-15T00:00:00.000Z",
          "wordCount": 6945,
          "title": "Elastic recognized as a Strong Performer in The Forrester Wave™: Artificial Intelligence for IT Operations (AIOps), Q4 2022",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt725dead2f4819e77/63979ed853892a121b0b56d6/forreseter-wave-ad-ai-ops-1920x1080.png"
        },
        {
          "id": "https://www.elastic.co/blog/2022-forrester-aiops-wave-it-operations-elastic-observability",
          "author": "Gagan Singh",
          "description": ",\nWe are excited to announce that Elastic has been recognized as a Strong Performer in The Forrester Wave™: Artificial Intelligence for IT Operations (AIOps), Q4 2022 in our first year participating! \n\nAs organizations modernize their infrastructure and applications, operations and development teams are faced with an exponential growth in data. With the increased complexity and faster release cycles in hybrid and cloud environments, teams are overwhelmed when trying to detect and find the root cause of issues. In today’s digital world, application performance dictates business success and downtime and poor customer experience negatively impacts company revenue. \n\nElastic Observability is built on Elasticsearch, with powerful search and machine learning capabilities to provide customers wit…",
          "link": "https://www.elastic.co/blog/2022-forrester-aiops-wave-it-operations-elastic-observability",
          "publishedOn": "2022-12-15T00:00:00.000Z",
          "wordCount": 6945,
          "title": "Elastic recognized as a Strong Performer in The Forrester Wave™: Artificial Intelligence for IT Operations (AIOps), Q4 2022",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt725dead2f4819e77/63979ed853892a121b0b56d6/forreseter-wave-ad-ai-ops-1920x1080.png"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-security-for-siem-recognized-by-leading-industry-analysts",
          "author": "Mike Nichols,Mike Paquette",
          "description": "Elastic named a Leader in the 2022 in Forrester Wave™: Security Analytics, Q4 2022. Forrester remarks that “Far and above, Elastic’s data visualizations steal the show.”",
          "link": "https://www.elastic.co/blog/elastic-security-for-siem-recognized-by-leading-industry-analysts",
          "publishedOn": "2022-12-14T17:00:00.000Z",
          "wordCount": 7489,
          "title": "Elastic named a Leader in The Forrester Wave™: Security Analytics Platforms, Q4 2022",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt69323019f723d794/5ffe0811f093203f68d42e54/blog-thumb-release-security.png"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-security-for-siem-recognized-by-leading-industry-analysts",
          "author": "Mike Nichols,Mike Paquette",
          "description": ",\nIt’s that time of the year… and we’re not talking about the holidays. That’s right, it’s analyst report season.\nElastic continues to be recognized by leading industry analyst firms. Today, Forrester Research recognized Elastic as a Leader in The Forrester Wave™: Security Analytics Platforms, Q4 2022. Elastic had the highest score in the Wave in the strategy category. \n\n\nhttps://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt34f5a352b1a55049/639a0584f8b8d66898be5451/2022Q4_Security_Analytics_Platforms_176427.png,2022Q4_Security_Analytics_Platforms_176427.png,\nForrester remarks that “Far and away, Elastic’s data visualizations steal the show” and “Elastic is cloud-agnostic, providing flexibility to customers to use the CSP that they prefer.”\nElastic SIEM unifies security analytics,…",
          "link": "https://www.elastic.co/blog/elastic-security-for-siem-recognized-by-leading-industry-analysts",
          "publishedOn": "2022-12-14T17:00:00.000Z",
          "wordCount": 7489,
          "title": "Elastic named a Leader in The Forrester Wave™: Security Analytics Platforms, Q4 2022",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt69323019f723d794/5ffe0811f093203f68d42e54/blog-thumb-release-security.png"
        },
        {
          "id": "https://www.elastic.co/blog/overview-image-similarity-search-in-elastic",
          "author": "Radovan Ondas,Bernhard Suhm",
          "description": "Searching through images to find the right one has always been a challenge. But with image similarity search, you can create a more intuitive search experience. Learn more about image similarity search in Elastic.",
          "link": "https://www.elastic.co/blog/overview-image-similarity-search-in-elastic",
          "publishedOn": "2022-12-14T00:00:00.000Z",
          "wordCount": 8705,
          "title": "Overview of image similarity search in Elastic",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt858693fe0109c5db/6297bad161670f0fb5dcff89/enterprise-search-search-bar-pattern-light-1680x980.png"
        },
        {
          "id": "https://www.elastic.co/blog/overview-image-similarity-search-in-elastic",
          "author": "Radovan Ondas,Bernhard Suhm",
          "description": ",\nImagine being able to mimic a celebrity’s look with a screenshot. Users could use the image to quickly find clothing sold online that matches the style. But, this is not the search experience of today.\nCustomers struggle to find what they need, and if they can’t, they'll leave. Some of them don't remember the name (keyword) of what they are looking for, but have an idea of what it looks like or the actual image. With vector search, an integrated capability in Elastic, organizations can implement similarity image search. This helps organizations create a more intuitive search experience so customers can easily search for what they are looking for with just an image.\nTo implement this functionality in Elastic, you don’t need to be a machine learning expert to get started. That’s because ve…",
          "link": "https://www.elastic.co/blog/overview-image-similarity-search-in-elastic",
          "publishedOn": "2022-12-14T00:00:00.000Z",
          "wordCount": 8705,
          "title": "Overview of image similarity search in Elastic",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt858693fe0109c5db/6297bad161670f0fb5dcff89/enterprise-search-search-bar-pattern-light-1680x980.png"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-tidal-making-mitre-att-ck-easier",
          "author": "Devon Kerr",
          "description": "Security vendors seem to have a complicated relationship with the MITRE ATT&CK(™) matrix. With one hand, they hold it high as a powerful resource, and with the other, they criticize some aspect of it. But regardless of your viewpoint on any given day, ATT&CK is one of the most important resources for improving your understanding of threat capabilities and aligning those to technical controls, countermeasures, or mitigations. \nWe at Elastic know a bit about ATT&CK — not only as a tool for detection engineering, but also from our experience in the MITRE Engenuity ATT&CK evaluations (link) — having participated since the very beginning. Our most recent MITRE evaluation results were strong. \nComprehension is, unfortunately, expensive — in terms of both time and other limited resources. ATT&CK …",
          "link": "https://www.elastic.co/blog/elastic-tidal-making-mitre-att-ck-easier",
          "publishedOn": "2022-12-13T00:00:00.000Z",
          "wordCount": 7168,
          "title": "Elastic + Tidal making MITRE ATT&CK easier",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt91e276a7d0ceb90c/6390bf849aa0c8195e56918c/Tidal-TID.png"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-tidal-making-mitre-att-ck-easier",
          "author": "Devon Kerr",
          "description": "Elastic is partnering with Tidal Cyber to improve transparency even further, and helping Tidal and Elastic users understand the capabilities we’re providing in the language of ATT&CK.",
          "link": "https://www.elastic.co/blog/elastic-tidal-making-mitre-att-ck-easier",
          "publishedOn": "2022-12-13T00:00:00.000Z",
          "wordCount": 7168,
          "title": "Elastic + Tidal making MITRE ATT&CK easier",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt91e276a7d0ceb90c/6390bf849aa0c8195e56918c/Tidal-TID.png"
        },
        {
          "id": "https://www.elastic.co/blog/why-splunk-customers-face-a-choice-for-observability-and-modernization",
          "author": null,
          "description": "Evaluating Elastic capabilities vs. Splunk for observability? It's time to dump Splunk. Elastic offers a simpler, unified solution that positions companies for the future. Modern application and operations teams are finding freedom, flexibility, and accelerated productivity with Elastic Observability. Here’s why.",
          "link": "https://www.elastic.co/blog/why-splunk-customers-face-a-choice-for-observability-and-modernization",
          "publishedOn": "2022-12-12T00:00:00.000Z",
          "wordCount": 8883,
          "title": "Why Splunk customers face a choice for observability and modernization",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt9c25f36b2d8f341f/6297bbcd588ffb4d799f9838/library-branding-elastic-observability-white-1680x980.png"
        },
        {
          "id": "https://www.elastic.co/blog/analyze-visualize-strava-activity-details-elastic-stack",
          "author": "Philipp Kahr",
          "description": "This is the second blog post in a series of ones to follow. I will take you through a journey of data onboarding, manipulation, and visualization using Strava as a backdrop.",
          "link": "https://www.elastic.co/blog/analyze-visualize-strava-activity-details-elastic-stack",
          "publishedOn": "2022-12-12T00:00:00.000Z",
          "wordCount": 10515,
          "title": "Analyze and visualize Strava activity details with the Elastic Stack",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt385cbf758d24d2b8/637d23855834861044c20fc4/fao-1200x628-stack-drag-and-drop-white.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/why-splunk-customers-face-a-choice-for-observability-and-modernization",
          "author": null,
          "description": ",\nBusinesses everywhere are facing a challenging environment: increased cost pressures coupled with high volumes of data generated by complex, distributed, cloud-native environments. As a result, teams need smarter analytics, access, and retention across all their data — instantly and from anywhere — in order to resolve issues, make decisions, and ensure resiliency.\n\nMany companies have adopted Splunk Enterprise and have a choice to make, since Splunk offers fragmented observability with Splunk Enterprise, Splunk Cloud and Splunk Observability with different pricing models. \n\nElastic offers a fast, simple, solution that positions companies for the future. Modern application and operations teams are finding freedom, flexibility, and accelerated productivity with Elastic Observability. Here’…",
          "link": "https://www.elastic.co/blog/why-splunk-customers-face-a-choice-for-observability-and-modernization",
          "publishedOn": "2022-12-12T00:00:00.000Z",
          "wordCount": 8883,
          "title": "Why Splunk customers face a choice for observability and modernization",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt9c25f36b2d8f341f/6297bbcd588ffb4d799f9838/library-branding-elastic-observability-white-1680x980.png"
        },
        {
          "id": "https://www.elastic.co/blog/analyze-visualize-strava-activity-details-elastic-stack",
          "author": "Philipp Kahr",
          "description": ",\nThis is the second blog post in our Strava series, based on the first one: “How to import Strava data into the Elastic Stack.” I will take you through a journey of data onboarding, manipulation, and visualization.\n\nWhat is Strava and why is it the focus? Strava is a platform where athletes, from recreational to professional, can share their activities. All my fitness data from my Apple Watch, Garmin, and Zwift is automatically synced and saved there. It is safe to say that if I want to get an overview of my fitness, getting the data out of Strava is the first step.\n\nWhy do this with the Elastic Stack? I want to ask my data questions, and questions are just searches!\n\nHave I ridden my bike more this year than last?\nOn average, is my heart rate reduced by doing more distance on my bike?\nAm…",
          "link": "https://www.elastic.co/blog/analyze-visualize-strava-activity-details-elastic-stack",
          "publishedOn": "2022-12-12T00:00:00.000Z",
          "wordCount": 10515,
          "title": "Analyze and visualize Strava activity details with the Elastic Stack",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt385cbf758d24d2b8/637d23855834861044c20fc4/fao-1200x628-stack-drag-and-drop-white.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-stack-8-5-3-released",
          "author": "Julien Lind",
          "description": "Read about the updates and bug fixes that have been included in this release.",
          "link": "https://www.elastic.co/blog/elastic-stack-8-5-3-released",
          "publishedOn": "2022-12-08T00:00:00.000Z",
          "wordCount": 5832,
          "title": "Elastic Stack 8.5.3 released",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt9c35d17afad9d20d/5f122812c31823015df6ef0a/blog-thumb-rocket-launch.png"
        },
        {
          "id": "https://www.elastic.co/blog/3-cybersecurity-strategies-healthcare-leaders-digital-first-world",
          "author": "Suranjeeta Choudhury,Carl Adasa, VP of Global SOC Operations, Proficio",
          "description": "Cybersecurity is an imperative in today's healthcare. Find out how Elastic Security and Proficio can bring the best of security solutions and managed security services, empowering healthcare companies to improve patient care.",
          "link": "https://www.elastic.co/blog/3-cybersecurity-strategies-healthcare-leaders-digital-first-world",
          "publishedOn": "2022-12-08T00:00:00.000Z",
          "wordCount": 7636,
          "title": "3 cybersecurity strategies for healthcare leaders in a digital-first world",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltf8d739af2dcba954/63921b65a8ba0e5eb857eeef/03-nurse.jpg"
        },
        {
          "id": "https://www.elastic.co/blog/elastic-stack-8-5-3-released",
          "author": "Julien Lind",
          "description": ",\nVersion 8.5.3 of the Elastic Stack was released today. We recommend you upgrade to this latest version.\n\nThis release contains a fix for a Kibana security vulnerability. Please see our security statement for more details.\n\nThe 8.5.3 patch contains fixes and small enhancements for the stack. A notable bug fix in Kibana is:\n\nKibana server fails to start when locale is set to ja-JP (#146693)\nElasticsearch - Support SAN/dnsName for restricted trust (#91946)\n\n\nFor a full list of changes for each product, please refer to the release notes:\n8.5.3 Release Notes\nElastic Stack\n\nKibana\nElasticsearch\nBeats\nLogstash\n\nElastic Enterprise Search\n\nEnterprise Search\n\nElastic Observability\n\nAPM\n\nElastic Security\n\nElastic Security Solution",
          "link": "https://www.elastic.co/blog/elastic-stack-8-5-3-released",
          "publishedOn": "2022-12-08T00:00:00.000Z",
          "wordCount": 5832,
          "title": "Elastic Stack 8.5.3 released",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/blt9c35d17afad9d20d/5f122812c31823015df6ef0a/blog-thumb-rocket-launch.png"
        },
        {
          "id": "https://www.elastic.co/blog/3-cybersecurity-strategies-healthcare-leaders-digital-first-world",
          "author": "Suranjeeta Choudhury,Carl Adasa, VP of Global SOC Operations, Proficio",
          "description": ",\nFrom on-demand healthcare services like telehealth to wearable technologies, predictive healthcare to blockchain technologies for electronic health records, or 5G for healthcare services to AI and augmented reality for state-of-the-art medical treatments, the healthcare industry is at an inflection point. These digital transformations also bring along elevated cybersecurity risks.\n\nEarlier this year, in a comprehensive cybersecurity benchmarking study conducted by ThoughtLab, the healthcare industry was found to be lacking in maturity from a cybersecurity implementation standpoint, placed only slightly ahead of the media and entertainment industry and industrial manufacturing.\n\n[Download the report: Cybersecurity solutions for a riskier world]\n\nHealthcare companies can take advantage of …",
          "link": "https://www.elastic.co/blog/3-cybersecurity-strategies-healthcare-leaders-digital-first-world",
          "publishedOn": "2022-12-08T00:00:00.000Z",
          "wordCount": 7636,
          "title": "3 cybersecurity strategies for healthcare leaders in a digital-first world",
          "imageUrl": "https://static-www.elastic.co/v3/assets/bltefdd0b53724fa2ce/bltf8d739af2dcba954/63921b65a8ba0e5eb857eeef/03-nurse.jpg"
        }
      ]
    },
    {
      "title": "Ansible Blog",
      "feedUrl": "https://www.ansible.com/blog/rss.xml",
      "siteUrl": "https://www.ansible.com/blog",
      "articles": [
        {
          "id": "https://www.ansible.com/blog/creating-custom-rules-for-ansible-lint",
          "author": "Vineeth Reddy Katuru",
          "description": "What is Ansible Lint? \n \r\nAnsible Lint is a command-line tool (part of the ansible-lint upstream community project) for linting of Ansible Playbooks, Roles, and Collections. Ok, so what exactly is “linting?” Its fundamental objective is to promote proven behaviors, patterns, and practices while avoiding typical traps that can quickly result in errors or make code more difficult to maintain. That is - leverage community recommendations and opinions in writing Ansible content by means of a tool to help ensure what you’re writing is generally valid.",
          "link": "https://www.ansible.com/blog/creating-custom-rules-for-ansible-lint",
          "publishedOn": "2022-12-15T14:30:00.000Z",
          "wordCount": 3915,
          "title": "Creating Custom Rules for Ansible Lint",
          "imageUrl": "https://www.ansible.com/hubfs/Ansible%20lint%20blog.png"
        },
        {
          "id": "https://www.ansible.com/blog/red-hat-ansible-automation-platform-now-available-in-aws-marketplace",
          "author": "Hicham Mourad",
          "description": "At AnsibleFest 2022 in the “windy city” Chicago, Red Hat announced Ansible Automation Platform’s upcoming availability in AWS Marketplace. That day is here!",
          "link": "https://www.ansible.com/blog/red-hat-ansible-automation-platform-now-available-in-aws-marketplace",
          "publishedOn": "2022-12-14T14:30:00.000Z",
          "wordCount": 3507,
          "title": "Red Hat Ansible Automation Platform now available in AWS Marketplace",
          "imageUrl": "https://www.ansible.com/hubfs/AWS%20marketplace%20blog.png"
        },
        {
          "id": "https://www.ansible.com/blog/crank-up-your-automation-with-ansible-validated-content",
          "author": "nmartins@redhat.com (Nuno Martins)",
          "description": "Ansible validated content is expert-built automation content packaged as Collections that contain Ansible roles and playbooks that you can use “out-the-box” through Ansible Automation Platform.",
          "link": "https://www.ansible.com/blog/crank-up-your-automation-with-ansible-validated-content",
          "publishedOn": "2022-12-12T19:30:00.000Z",
          "wordCount": 3345,
          "title": "Crank up your automation with Ansible validated content",
          "imageUrl": "https://lh6.googleusercontent.com/L0SaYOYFPRRB8oUzhGJC9V7qE0uBTVzNkDf8IE0efQ2x3M3R6ROcFqPdmrqChWM_4VZ25uifzd1Fjl9eQCWB7rh0QyS83fwOq5bGXxk7VSyZe2JwKm9cfLaZq--ykmuNR9_QBVSB2X7RwdaN2cRPI5QF8QrLKWOT1zkh3epnO5s3Somwm_I383gT6RC6KQ"
        },
        {
          "id": "https://www.ansible.com/blog/project-signing-and-verification",
          "author": "Lila Yasin",
          "description": "Project signing is a new feature developed for Red Hat Ansible Automation Platform that came out in the latest 2.3 release. It enables users to sign project-based content (think playbooks, workflows, inventories, etc.) and verify whether or not that content has remained secure. It also features a new CLI tool, ansible-sign. This blog post will explain how it works, illustrate how to implement it, and highlight a few scenarios.",
          "link": "https://www.ansible.com/blog/project-signing-and-verification",
          "publishedOn": "2022-12-06T14:00:00.000Z",
          "wordCount": 4102,
          "title": "Project signing and verification",
          "imageUrl": "https://www.ansible.com/hubfs/Project%20signing%20card.png"
        },
        {
          "id": "https://www.ansible.com/blog/keep-the-learning-pace-a-holiday-recap-about-network-automation-sessions",
          "author": "Dafné Mendoza",
          "description": "In case you want to review the most relevant sessions, here is a summary on the abridged network automation related sessions that you can check on-demand.",
          "link": "https://www.ansible.com/blog/keep-the-learning-pace-a-holiday-recap-about-network-automation-sessions",
          "publishedOn": "2022-12-05T17:00:00.000Z",
          "wordCount": 3064,
          "title": "Keep the learning pace! A Holiday recap about network automation sessions",
          "imageUrl": "https://www.ansible.com/hubfs/Keep%20the%20learning%20pace%20blog.png"
        },
        {
          "id": "https://www.ansible.com/blog/whats-new-in-red-hat-ansible-automation-platform-2.3",
          "author": "scavanau@redhat.com (Sean Cavanaugh)",
          "description": "We are thrilled to announce the general availability of Red Hat Ansible Automation Platform 2.3. If you didn’t get the opportunity to attend AnsibleFest 2022 in Chicago, or get time to watch the keynotes on the AnsibleFest content hub, I am the lucky Ansiblite (or is it Ansi-Bull) who will walk you through all the new, cool and exciting features coming with our new release. Ansible Automation Platform 2.3 introduces a number of new features and capabilities that deliver simpler, security-focused automation at scale. Ansible Automation Platform 2.3 is compatible with the Developer Preview of Event-Driven Ansible, a new set of capabilities that empower true end-to-end automation.",
          "link": "https://www.ansible.com/blog/whats-new-in-red-hat-ansible-automation-platform-2.3",
          "publishedOn": "2022-11-29T14:00:00.000Z",
          "wordCount": 5106,
          "title": "What's new in Ansible Automation Platform 2.3",
          "imageUrl": "https://www.ansible.com/hubfs/AAP%202.3%20whats%20new%20card.png"
        },
        {
          "id": "https://www.ansible.com/blog/walking-on-clouds-with-ansible",
          "author": "nmartins@redhat.com (Nuno Martins)",
          "description": "Today is a good day, and when it's a day like this we often feel like we are walking on clouds. With this latest announcement for the newest Red Hat Ansible Certified Collections available to our customers on the 28th of November, I am sure many cloud practitioners will be anticipating what the future will bring for their cloud automation.",
          "link": "https://www.ansible.com/blog/walking-on-clouds-with-ansible",
          "publishedOn": "2022-11-28T15:00:00.000Z",
          "wordCount": 3285,
          "title": "Walking on Clouds with Ansible",
          "imageUrl": "https://lh4.googleusercontent.com/6oMDqzqtZumAj0ecMols413I2wj8Hw73CbxlgQ86PmYieO3HQyRW61NCEaq4qpEixEh_uWVSNGuYDdMfq_tvi44qnQ-RgncujC-RxYIWDZ_lTjxEJo8xfga7Wp31UsyRo_pzjXf_LKwpYmXynnI6m6VFVPz2LglzZYAFNZSz8cEXFxfa1ORbpqS_tv28"
        },
        {
          "id": "https://www.ansible.com/blog/importing/exporting-collections-in-automation-hubs",
          "author": "jhardy@redhat.com (John Hardy)",
          "description": "This article discusses how to export and import Collections from one automation hub to another.",
          "link": "https://www.ansible.com/blog/importing/exporting-collections-in-automation-hubs",
          "publishedOn": "2022-11-22T14:00:00.000Z",
          "wordCount": 3447,
          "title": "Importing/Exporting Collections in automation hubs",
          "imageUrl": "https://www.ansible.com/hubfs/importingexporting%20blog.png"
        },
        {
          "id": "https://www.ansible.com/blog/3-new-ansible-automation-hub-updates",
          "author": "trmcconn@redhat.com (Tricia McConnell)",
          "description": "Beyond the buzz at AnsibleFest 2022 around event-driven automation, availability of Ansible in  AWS and Azure marketplaces, and Project Wisdom, some important changes were happening within Ansible automation hub, so let's take a closer look at the latest developments.",
          "link": "https://www.ansible.com/blog/3-new-ansible-automation-hub-updates",
          "publishedOn": "2022-11-21T14:00:00.000Z",
          "wordCount": 3287,
          "title": "3 new Ansible automation hub updates",
          "imageUrl": "https://www.ansible.com/hubfs/hub%20update%20blog.png"
        }
      ]
    },
    {
      "title": "Azure DevOps Blog",
      "feedUrl": "https://devblogs.microsoft.com/devops/feed/",
      "siteUrl": "https://devblogs.microsoft.com/devops/",
      "articles": [
        {
          "id": "https://devblogs.microsoft.com/devops/?p=66150",
          "author": "Gloridel Morales",
          "description": "This month, we are releasing fixes that impact our self-hosted product, Azure DevOps Server.\nFailures in the “Account Parallelism Sync Analytics Job”.\nAzure DevOps Server 2020.1.2 Patch 4\nThe post December patches for Azure DevOps Server appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/december-patches-for-azure-devops-server-2/",
          "publishedOn": "2022-12-13T18:06:53.000Z",
          "wordCount": 4812,
          "title": "December patches for Azure DevOps Server",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2018/09/index-hero.jpg"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=66155",
          "author": "Dan Hellem",
          "description": "List of New Boards Hub bugs fixed in sprint 214. We enabled the “Try New Boards Hub” message across another ring of accounts. The process continues to go slower than originally expected. Every time we enable the message, we receive more feedback on issues that need to be fixed.\nThe post New Boards Hub, Sprint 214 Update appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/new-boards-hub-sprint-214-update/",
          "publishedOn": "2022-12-12T15:31:16.000Z",
          "wordCount": 4628,
          "title": "New Boards Hub, Sprint 214 Update",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2022/03/agile.png"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=66134",
          "author": "Gloridel Morales",
          "description": "12/16 Update: There is an additional step that you will have to follow while upgrading to Azure DevOps Server 2022. This applies to Azure DevOps Server/Team Foundation Server and Elasticsearch installations on the same and in different machines.\nUpgrade Elasticsearch 2.x and 5.x to 7.x\nYou will have to select Install New Search while configuring search post Azure DevOps Server upgrade.\nThe post Updated: Now available: Azure DevOps Server 2022 RTW appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/now-available-azure-devops-server-2022-rtw/",
          "publishedOn": "2022-12-06T20:00:07.000Z",
          "wordCount": 5626,
          "title": "Updated: Now available: Azure DevOps Server 2022 RTW",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2018/09/index-hero.jpg"
        },
        {
          "id": "https://devblogs.microsoft.com/devops/?p=65991",
          "author": "Bohdan Janousek",
          "description": "We are upgrading the .NET used by Azure Pipelines agent from current .NET Core 3.1 to .NET 6. This is to support new Apple silicon hardware as well as newer operating systems such as Ubuntu 22.04, or Windows on ARM64. Another reason for the .NET upgrade is the fact the .NET Core 3.1 version is already in maintenance phase and the support ends on December 13th,\nThe post Upgrade of .NET agent for Azure Pipelines appeared first on Azure DevOps Blog.",
          "link": "https://devblogs.microsoft.com/devops/upgrade-of-net-agent-for-azure-pipelines/",
          "publishedOn": "2022-11-23T11:20:31.000Z",
          "wordCount": 5999,
          "title": "Upgrade of .NET agent for Azure Pipelines",
          "imageUrl": "https://devblogs.microsoft.com/devops/wp-content/uploads/sites/6/2019/02/AzureDevOps.png"
        }
      ]
    },
    {
      "title": "Discover Dev",
      "feedUrl": "https://www.discoverdev.io/rss.xml",
      "siteUrl": "http://discoverdev.io",
      "articles": []
    },
    {
      "title": "AWS News Blog",
      "feedUrl": "http://feeds.feedburner.com/AmazonWebServicesBlog",
      "siteUrl": "https://aws.amazon.com/blogs/aws/",
      "articles": [
        {
          "id": "3f44cecf80edbc14ee966c9c46596ccede484f1f",
          "author": "Antje Barth",
          "description": "Amazon SageMaker Canvas provides business analysts with a visual interface to solve business problems using machine learning (ML) without writing a single line of code. Since we introduced SageMaker Canvas in 2021, many users have asked us for an enhanced, seamless collaboration experience that enables data scientists to share trained models with their business analysts […]",
          "link": "https://aws.amazon.com/blogs/aws/new-bring-ml-models-built-anywhere-into-amazon-sagemaker-canvas-and-generate-predictions/",
          "publishedOn": "2022-12-14T16:45:52.000Z",
          "wordCount": 1448,
          "title": "New – Bring ML Models Built Anywhere into Amazon SageMaker Canvas and Generate Predictions",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/11/18/Site-Merch_Amazon-SageMaker-Canvas_Blog.png"
        },
        {
          "id": "f76cf7ff0047a1af2e03a6a49905cd0af60accb7",
          "author": "Jeff Barr",
          "description": "Starting in April of 2023 we will be making two changes to Amazon Simple Storage Service (Amazon S3) to put our latest best practices for bucket security into effect automatically. The changes will begin to go into effect in April and will be rolled out to all AWS Regions within weeks. Once the changes are […]",
          "link": "https://aws.amazon.com/blogs/aws/heads-up-amazon-s3-security-changes-are-coming-in-april-of-2023/",
          "publishedOn": "2022-12-13T21:23:29.000Z",
          "wordCount": 1248,
          "title": "Heads-Up: Amazon S3 Security Changes Are Coming in April of 2023",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/827bfc458708f0b442009c9c9836f7e4b65557fb/2020/06/03/Blog-Post_thumbnail.png"
        },
        {
          "id": "38646395c7ef57fef2041e8de74e54446ae45793",
          "author": "Marcia Villalba",
          "description": "This post is part of our Week in Review series. Check back each week for a quick roundup of interesting news and announcements from AWS! The world is asynchronous, is what Werner Vogels, Amazon CTO, reminded us during his keynote last week at AWS re:Invent. At the beginning of the keynote, he showed us how […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-week-in-review-december-12-2022/",
          "publishedOn": "2022-12-12T22:02:33.000Z",
          "wordCount": 1514,
          "title": "AWS Week in Review – December 12, 2022",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/12/12/AWS-WIR-12.12.22.png"
        },
        {
          "id": "9b22726a3e68bf2e7407f519b286ce9588418703",
          "author": "Marcia Villalba",
          "description": "Today we are announcing a new Amazon Comprehend feature for intelligent document processing (IDP). This feature allows you to classify and extract entities from PDF documents, Microsoft Word files, and images directly from Amazon Comprehend without you needing to extract the text first. Many customers need to process documents that have a semi-structured format, like […]",
          "link": "https://aws.amazon.com/blogs/aws/now-process-pdfs-word-documents-and-images-with-amazon-comprehend-for-idp/",
          "publishedOn": "2022-12-01T17:51:25.000Z",
          "wordCount": 1543,
          "title": "New – Process PDFs, Word Documents, and Images with Amazon Comprehend for IDP",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/11/24/Site-Merch_Amazon-Comprehend-for-Intelligent-Document-Processing_Blog.png"
        },
        {
          "id": "222c6b77db7b5f5f6ec69fcc90e8a7cb595451c4",
          "author": "Channy Yun",
          "description": "In 2016, we launched Amazon GameLift, a dedicated hosting solution that securely deploys and automatically scales fleets of session-based multiplayer game servers to meet worldwide player demand. With Amazon GameLift, you can create and upload a game server build once, replicate, and then deploy across multiple AWS Regions and AWS Local Zones to reach your […]",
          "link": "https://aws.amazon.com/blogs/aws/introducing-amazon-gamelift-anywhere-run-your-game-servers-on-your-own-infrastructure/",
          "publishedOn": "2022-12-01T17:49:17.000Z",
          "wordCount": 1659,
          "title": "Introducing Amazon GameLift Anywhere – Run Your Game Servers on Your Own Infrastructure",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/11/16/2022-gamelift-anywhere-0.jpg"
        },
        {
          "id": "d29044f8e57bafd3bebc55e88c2ff464055fe550",
          "author": "Steve Roberts",
          "description": "Today, we announced the preview release of Amazon CodeCatalyst. A unified software development and delivery service, Amazon CodeCatalyst enables software development teams to quickly and easily plan, develop, collaborate on, build, and deliver applications on AWS, reducing friction throughout the development lifecycle. In my time as a developer the biggest excitement—besides shipping software to users—was […]",
          "link": "https://aws.amazon.com/blogs/aws/announcing-amazon-codecatalyst-preview-a-unified-software-development-service/",
          "publishedOn": "2022-12-01T17:31:09.000Z",
          "wordCount": 2467,
          "title": "Announcing Amazon CodeCatalyst, a Unified Software Development Service (Preview)",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/11/25/Site-Merch_Amazon-CodeCatalyst_Blog-1.png"
        },
        {
          "id": "a06338eb3c56149fb4502fc20e98979d5b98cbb8",
          "author": "Donnie Prakoso",
          "description": "It is increasingly common to use multiple cloud services as building blocks to assemble a modern event-driven application. Using purpose-built services to accomplish a particular task ensures developers get the best capabilities for their use case. However, communication between services can be difficult if they use different technologies to communicate, meaning that you need to […]",
          "link": "https://aws.amazon.com/blogs/aws/new-create-point-to-point-integrations-between-event-producers-and-consumers-with-amazon-eventbridge-pipes/",
          "publishedOn": "2022-12-01T17:08:56.000Z",
          "wordCount": 2227,
          "title": "New — Create Point-to-Point Integrations Between Event Producers and Consumers with Amazon EventBridge Pipes",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/11/25/Site-Merch_Amazon-EventBridge_Pipes_Blog.png"
        },
        {
          "id": "e192bd704e7b3a5a0a1e8ca11d4329d85f29ef1b",
          "author": "Sébastien Stormacq",
          "description": "I am excited to announce the availability of a distributed map for AWS Step Functions. This flow extends support for orchestrating large-scale parallel workloads such as the on-demand processing of semi-structured data. Step Function’s map state executes the same processing steps for multiple entries in a dataset. The existing map state is limited to 40 […]",
          "link": "https://aws.amazon.com/blogs/aws/step-functions-distributed-map-a-serverless-solution-for-large-scale-parallel-data-processing/",
          "publishedOn": "2022-12-01T16:58:32.000Z",
          "wordCount": 2388,
          "title": "Step Functions Distributed Map – A Serverless Solution for Large-Scale Parallel Data Processing",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/11/22/Site-Merch_AWS-Step-Functions_Distributed-Map_Blog-Sidebar.png"
        },
        {
          "id": "803631ae81c7cabb27063790e4f8aa8a53c48da2",
          "author": "Sébastien Stormacq",
          "description": "AWS Marketplace Vendor Insights is a new capability of AWS Marketplace. It simplifies third-party software risk assessments when procuring solutions from the AWS Marketplace. It helps you to ensure that the third-party software continuously meets your industry standards by compiling security and compliance information, such as data privacy and residency, application security, and access control, […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-marketplace-vendor-insights-simplify-third-party-software-risk-assessments/",
          "publishedOn": "2022-11-30T23:49:57.000Z",
          "wordCount": 1806,
          "title": "AWS Marketplace Vendor Insights – Simplify Third-Party Software Risk Assessments",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/11/18/Site-Merch_AWS-Marketplace-Vendor-Insights_Blog.png"
        },
        {
          "id": "dc4135389b98b1a4c58cbedd92904a957165a7fb",
          "author": "Antje Barth",
          "description": "As you move your machine learning (ML) workloads into production, you need to continuously monitor your deployed models and iterate when you observe a deviation in your model performance. When you build a new model, you typically start validating the model offline using historical inference request data. But this data sometimes fails to account for […]",
          "link": "https://aws.amazon.com/blogs/aws/new-for-amazon-sagemaker-perform-shadow-tests-to-compare-inference-performance-between-ml-model-variants/",
          "publishedOn": "2022-11-30T18:36:48.000Z",
          "wordCount": 1490,
          "title": "New for Amazon SageMaker – Perform Shadow Tests to Compare Inference Performance Between ML Model Variants",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/11/22/Site-Merch_Full-Build_Amazon-SageMaker-shadow-testing_Blog.png"
        },
        {
          "id": "68da6bc4cdde1e218287d2175d96cd6fcf5732ac",
          "author": "Antje Barth",
          "description": "In 2019, we introduced Amazon SageMaker Studio, the first fully integrated development environment (IDE) for data science and machine learning (ML). SageMaker Studio gives you access to fully managed Jupyter Notebooks that integrate with purpose-built tools to perform all ML steps, from preparing data to training and debugging models, tracking experiments, deploying and monitoring models, […]",
          "link": "https://aws.amazon.com/blogs/aws/next-generation-sagemaker-notebooks-now-with-built-in-data-preparation-real-time-collaboration-and-notebook-automation/",
          "publishedOn": "2022-11-30T18:34:59.000Z",
          "wordCount": 2042,
          "title": "Next Generation SageMaker Notebooks – Now with Built-in Data Preparation, Real-Time Collaboration, and Notebook Automation",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/11/21/Site-Merch_Amazon-SageMaker-Studio-Notebooks_Blog.png"
        },
        {
          "id": "a4b2fd2c078e283171f1c0ebe65d4b3befcce646",
          "author": "Antje Barth",
          "description": "Amazon SageMaker JumpStart is a machine learning (ML) hub that can help you accelerate your ML journey. SageMaker JumpStart gives you access to built-in algorithms with pre-trained models from popular model hubs, pre-trained foundation models to help you perform tasks such as article summarization and image generation, and end-to-end solutions to solve common use cases. […]",
          "link": "https://aws.amazon.com/blogs/aws/new-share-ml-models-and-notebooks-more-easily-within-your-organization-with-amazon-sagemaker-jumpstart/",
          "publishedOn": "2022-11-30T18:32:44.000Z",
          "wordCount": 1294,
          "title": "New – Share ML Models and Notebooks More Easily Within Your Organization with Amazon SageMaker JumpStart",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/11/22/Site-Merch_Amazon-SageMaker-JumpStart_Blog.png"
        },
        {
          "id": "a6c2e7999e75fcdbac0264a787345e7cc102c681",
          "author": "Marcia Villalba",
          "description": "AWS Machine Learning University is now providing a free educator enablement program. This program provides faculty at community colleges, minority-serving institutions (MSIs), and historically Black colleges and universities (HBCUs) with the skills and resources to teach data analytics, artificial intelligence (AI), and machine learning (ML) concepts to build a diverse pipeline for in-demand jobs of […]",
          "link": "https://aws.amazon.com/blogs/aws/aws-machine-learning-university-new-educator-enablement-program-to-build-diverse-talent-for-ml-ai-jobs/",
          "publishedOn": "2022-11-30T18:21:37.000Z",
          "wordCount": 1337,
          "title": "AWS Machine Learning University New Educator Enablement Program to Build Diverse Talent for ML/AI Jobs",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/11/30/escalante-launch-blog-thumb.png"
        },
        {
          "id": "a3df3f584fbeaa72bcfd1602e37a589cebaf3db1",
          "author": "Danilo Poccia",
          "description": "When we talk with customers, we hear that they want to be able to harness insights from data in order to make timely, impactful, and actionable business decisions. A common pattern with data-driven organizations is that they have many diﬀerent data sources they need to ingest into their analytics systems. This requires them to build […]",
          "link": "https://aws.amazon.com/blogs/aws/new-for-amazon-redshift-simplify-data-ingestion-and-make-your-data-warehouse-more-secure-and-reliable/",
          "publishedOn": "2022-11-30T18:18:42.000Z",
          "wordCount": 1723,
          "title": "New for Amazon Redshift – Simplify Data Ingestion and Make Your Data Warehouse More Secure and Reliable",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/827bfc458708f0b442009c9c9836f7e4b65557fb/2020/06/03/Blog-Post_thumbnail.png"
        },
        {
          "id": "173c33aaebef80f4198557f2b51dd3b215517e09",
          "author": "Donnie Prakoso",
          "description": "To build machine learning models, machine learning engineers need to develop a data transformation pipeline to prepare the data. The process of designing this pipeline is time-consuming and requires a cross-team collaboration between machine learning engineers, data engineers, and data scientists to implement the data preparation pipeline into a production environment. The main objective of […]",
          "link": "https://aws.amazon.com/blogs/aws/new-introducing-support-for-real-time-and-batch-inference-in-amazon-sagemaker-data-wrangler/",
          "publishedOn": "2022-11-30T18:14:14.000Z",
          "wordCount": 1998,
          "title": "New — Introducing Support for Real-Time and Batch Inference in Amazon SageMaker Data Wrangler",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/827bfc458708f0b442009c9c9836f7e4b65557fb/2020/06/03/Blog-Post_thumbnail.png"
        },
        {
          "id": "97085f0b733b45f6660dd61a52eab8ee12246617",
          "author": "Donnie Prakoso",
          "description": "Data fuels machine learning. In machine learning, data preparation is the process of transforming raw data into a format that is suitable for further processing and analysis. The common process for data preparation starts with collecting data, then cleaning it, labeling it, and finally validating and visualizing it. Getting the data right with high quality […]",
          "link": "https://aws.amazon.com/blogs/aws/new-amazon-sagemaker-data-wrangler-supports-saas-applications-as-data-sources/",
          "publishedOn": "2022-11-30T18:12:05.000Z",
          "wordCount": 2458,
          "title": "New — Amazon SageMaker Data Wrangler Supports SaaS Applications as Data Sources",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/827bfc458708f0b442009c9c9836f7e4b65557fb/2020/06/03/Blog-Post_thumbnail.png"
        },
        {
          "id": "bb2a6aa181f76ef1d8fdc0056149bf70e01058c3",
          "author": "Steve Roberts",
          "description": "Gathering insights from data is a more effective process if that data isn’t fragmented across multiple systems and data stores, whether on premises or in the cloud. Amazon AppFlow provides bidirectional data integration between on-premises systems and applications, SaaS applications, and AWS services. It helps customers break down data silos using a low- or no-code, […]",
          "link": "https://aws.amazon.com/blogs/aws/announcing-additional-data-connectors-for-amazon-appflow/",
          "publishedOn": "2022-11-30T18:09:37.000Z",
          "wordCount": 1306,
          "title": "Announcing Additional Data Connectors for Amazon AppFlow",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/827bfc458708f0b442009c9c9836f7e4b65557fb/2020/06/03/Blog-Post_thumbnail.png"
        },
        {
          "id": "7ca4cd611ea7dd61e5bbd3f48af5af26d91668f9",
          "author": "Antje Barth",
          "description": "As companies increasingly adopt machine learning (ML) for their business applications, they are looking for ways to improve governance of their ML projects with simplified access control and enhanced visibility across the ML lifecycle. A common challenge in that effort is managing the right set of user permissions across different groups and ML activities. For […]",
          "link": "https://aws.amazon.com/blogs/aws/new-ml-governance-tools-for-amazon-sagemaker-simplify-access-control-and-enhance-transparency-over-your-ml-projects/",
          "publishedOn": "2022-11-30T17:51:02.000Z",
          "wordCount": 1898,
          "title": "New ML Governance Tools for Amazon SageMaker – Simplify Access Control and Enhance Transparency Over Your ML Projects",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/11/17/Site-Merch-ML-Governance_Blog.png"
        },
        {
          "id": "b918eaaca2429f94564180180fdc8d2938aaae00",
          "author": "Jeff Barr",
          "description": "Back in 1980, at my second professional programming job, I was working on a project that analyzed driver’s license data from a bunch of US states. At that time data of that type was generally stored in fixed-length records, with values carefully (or not) encoded into each field. Although we were given schemas for the […]",
          "link": "https://aws.amazon.com/blogs/aws/join-the-preview-aws-glue-data-quality/",
          "publishedOn": "2022-11-30T17:49:38.000Z",
          "wordCount": 1415,
          "title": "Join the Preview – AWS Glue Data Quality",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/11/22/Site-Merch_AWS-Glue_Data-Quality_Blog-1.png"
        },
        {
          "id": "cac2818702a6c1aaa8157fc247203f740d7d65a2",
          "author": "Channy Yun",
          "description": "PostgreSQL has become the preferred open-source relational database for many enterprises and start-ups with its extensible design for developers. One of the reasons developers use PostgreSQL is it allows them to add database functionality by building extensions with their preferred programming languages. You can already install and use PostgreSQL extensions in Amazon Aurora PostgreSQL-Compatible Edition […]",
          "link": "https://aws.amazon.com/blogs/aws/new-trusted-language-extensions-for-postgresql-on-amazon-aurora-and-amazon-rds/",
          "publishedOn": "2022-11-30T17:28:12.000Z",
          "wordCount": 2074,
          "title": "New – Trusted Language Extensions for PostgreSQL on Amazon Aurora and Amazon RDS",
          "imageUrl": "https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/11/19/Site-Merch_Amazon-RDS-Trusted-Language-Extensions-for-PostgreSQL_Blog.png"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/atom.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2712/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/gravity.png\" title=\"It's a long way down.\" alt=\"It's a long way down.\" />",
          "link": "https://xkcd.com/2712/",
          "publishedOn": "2022-12-16T00:00:00.000Z",
          "wordCount": 206,
          "title": "Gravity",
          "imageUrl": null
        },
        {
          "id": "https://xkcd.com/2711/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/optimal_bowling.png\" title=\"If you want to bowl a strike, the optimal place is almost certainly inside a bowling alley, although with a little luck any establishment uphill from one could also work.\" alt=\"If you want to bowl a strike, the optimal place is almost certainly inside a bowling alley, although with a little luck any establishment uphill from one could also work.\" />",
          "link": "https://xkcd.com/2711/",
          "publishedOn": "2022-12-14T00:00:00.000Z",
          "wordCount": 207,
          "title": "Optimal Bowling",
          "imageUrl": "https://imgs.xkcd.com/comics/optimal_bowling_2x.png"
        },
        {
          "id": "https://xkcd.com/2710/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/hydropower_breakthrough.png\" title=\"A hydroelectric dam is also known as a heavy water reactor.\" alt=\"A hydroelectric dam is also known as a heavy water reactor.\" />",
          "link": "https://xkcd.com/2710/",
          "publishedOn": "2022-12-12T00:00:00.000Z",
          "wordCount": 207,
          "title": "Hydropower Breakthrough",
          "imageUrl": "https://imgs.xkcd.com/comics/hydropower_breakthrough_2x.png"
        },
        {
          "id": "https://xkcd.com/2709/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/solar_system_model.png\" title=\"The Earth is, on average, located in the habitable zone, but at any given time it has a certain probability of being outside it, which is why life exists on Earth but is mortal.\" alt=\"The Earth is, on average, located in the habitable zone, but at any given time it has a certain probability of being outside it, which is why life exists on Earth but is mortal.\" />",
          "link": "https://xkcd.com/2709/",
          "publishedOn": "2022-12-09T00:00:00.000Z",
          "wordCount": 209,
          "title": "Solar System Model",
          "imageUrl": "https://imgs.xkcd.com/comics/solar_system_model_2x.png"
        }
      ]
    },
    {
      "title": "Camunda",
      "feedUrl": "https://camunda.com/feed/",
      "siteUrl": "https://camunda.com/",
      "articles": [
        {
          "id": "https://camunda.com/?p=69517&preview=true&preview_id=69517",
          "author": "Maciej Barelkowski",
          "description": "We are happy to announce the release of Camunda Desktop Modeler 5.6, which ships with broader BPMN support and some key UI improvements.\nThe post Camunda Desktop Modeler 5.6 released appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/12/camunda-modeler-5-6-release-blog-post/",
          "publishedOn": "2022-12-13T13:00:00.000Z",
          "wordCount": 2354,
          "title": "Camunda Desktop Modeler 5.6 released",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/12/camunda-modeler-5-6-released-2.jpg"
        },
        {
          "id": "https://camunda.com/?p=69519&preview=true&preview_id=69519",
          "author": "Camunda Optimize Team",
          "description": "See what's new in Camunda Optimize. Camunda Optimize provides business activity monitoring for workflows, supporting continuous process improvement.\nThe post Camunda Optimize 3.10 alpha2 released appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/12/optimize-3-10-0-alpha2-released/",
          "publishedOn": "2022-12-13T12:50:00.000Z",
          "wordCount": 2121,
          "title": "Camunda Optimize 3.10 alpha2 released",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/12/camunda-optimize-3-10-0-alpha2-release.png"
        },
        {
          "id": "https://camunda.com/?p=69518&preview=true&preview_id=69518",
          "author": "Camunda Platform Team",
          "description": "We are pleased to announce the next alpha release of Camunda Automation Platform 7, including new REST docs, support for PostgreSQL 15 and more.\nThe post Camunda Automation Platform 7.19.0-alpha2 released appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/12/camunda-automation-platform-7-19-0-alpha2/",
          "publishedOn": "2022-12-13T12:40:00.000Z",
          "wordCount": 2571,
          "title": "Camunda Automation Platform 7.19.0-alpha2 released",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/12/camunda-platform-7-19-0-alpha2-released.jpg"
        },
        {
          "id": "https://camunda.com/?p=69423&preview=true&preview_id=69423",
          "author": "Mia Moore",
          "description": "Learn all about our Hacktoberfest 2022 challenge. We hope you all had a great time participating in it and Hacktoberfest as a whole! \nThe post Hacktoberfest 2022 recap appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/12/hacktoberfest-2022-recap/",
          "publishedOn": "2022-12-12T13:25:00.000Z",
          "wordCount": 2309,
          "title": "Hacktoberfest 2022 recap",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/12/Camunda-Hacktoberfest-Recap_1200x627.png"
        },
        {
          "id": "https://camunda.com/?p=69131&preview=true&preview_id=69131",
          "author": "Thomas Heinrichs",
          "description": "With Amazon SQS, SNS, and Lambda Connectors, as well as Kafka and RabbitMQ Connectors, microservice choreography and orchestration get even closer together.\nThe post Boosting your microservice architecture with message broker Connectors appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/12/boosting-microservice-architecture-message-broker-connectors/",
          "publishedOn": "2022-12-08T13:30:00.000Z",
          "wordCount": 3608,
          "title": "Boosting your microservice architecture with message broker Connectors",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/12/boosting-microservice-architecture-with-message-broker-connectors_Camunda.png"
        },
        {
          "id": "https://camunda.com/?p=68873&preview=true&preview_id=68873",
          "author": "Thomas Heinrichs",
          "description": "Learn how process mapping can help your organization gain an advantage. See an example and tips and recommendations for creating one yourself.\nThe post Benefits of process mapping: Examples and guide appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/12/process-mapping-benefits/",
          "publishedOn": "2022-12-01T21:48:46.000Z",
          "wordCount": 3595,
          "title": "Benefits of process mapping: Examples and guide",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/12/benefits-of-process-mapping.png"
        },
        {
          "id": "https://camunda.com/?p=68193",
          "author": "Thomas Heinrichs",
          "description": "In this tutorial, learn how you can take advantage of Camunda for powerful process orchestration as a .NET developer.\nThe post Camunda Platform 8 for .NET developers appeared first on Camunda.",
          "link": "https://camunda.com/blog/2022/11/camunda-platform-8-dotnet-developers/",
          "publishedOn": "2022-11-21T17:48:18.000Z",
          "wordCount": 4562,
          "title": "Camunda Platform 8 for .NET developers",
          "imageUrl": "https://camunda.com/wp-content/uploads/2022/11/Camunda-8-dotNET-developers_1200x630.png"
        }
      ]
    },
    {
      "title": "となりのヤングジャンプ（ワンパンマン）",
      "feedUrl": "https://tonarinoyj.jp/rss/series/13932016480028984490",
      "siteUrl": "https://tonarinoyj.jp/episode/13932016480028985383",
      "articles": [
        {
          "id": "tonarino_yj:episode:316190247031398461",
          "author": "原作/ＯＮＥ/漫画/村田雄介",
          "description": "ワンパンマン",
          "link": "https://tonarinoyj.jp/episode/316190247031398461",
          "publishedOn": "2022-12-14T15:00:00.000Z",
          "wordCount": 201,
          "title": "[第221話] ワンパンマン",
          "enclosure": {
            "url": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/316190247031398461-a78dd9ea4c1e15ee75dfd81bbbd99048",
            "length": "0",
            "type": "image/jpeg"
          },
          "imageUrl": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/316190247031398461-a78dd9ea4c1e15ee75dfd81bbbd99048"
        },
        {
          "id": "tonarino_yj:episode:316190247003850147",
          "author": "原作/ＯＮＥ/漫画/村田雄介",
          "description": "ワンパンマン",
          "link": "https://tonarinoyj.jp/episode/316190247003850147",
          "publishedOn": "2022-11-30T15:00:00.000Z",
          "wordCount": 201,
          "title": "[第220話] ワンパンマン",
          "enclosure": {
            "url": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/316190247003850147-1c71a36147f4377f39b59302994c1fa5",
            "length": "0",
            "type": "image/jpeg"
          },
          "imageUrl": "https://cdn-img.tonarinoyj.jp/public/episode-thumbnail/316190247003850147-1c71a36147f4377f39b59302994c1fa5"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.com/blog/all.atom",
      "siteUrl": null,
      "articles": [
        {
          "id": "https://github.blog/2022-12-16-release-radar-nov-2022/",
          "author": null,
          "description": "We promised we&#8217;d be back soon and here we are! There has been an incredible amount of open source projects shipping major version releases before the year wraps up. I can&#8217;t believe we are all saying that now. &#8220;When the year wraps up!&#8221; or &#8220;See you next year!&#8221; What happened to 2022? Well, we know [&#8230;]",
          "link": "https://github.blog/2022-12-16-release-radar-nov-2022/",
          "publishedOn": "2022-12-16T19:00:22.000Z",
          "wordCount": 2108,
          "title": "Release Radar · November 2022 Edition",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/12/Release-Radar-November-2022.jpg"
        },
        {
          "id": "https://github.blog/2022-12-15-leaked-a-secret-check-your-github-alerts-for-free/",
          "author": null,
          "description": "GitHub now allows you to track any leaked secrets in your public repository, for free. With secret scanning alerts, you can track and action on leaked secrets directly within GitHub.",
          "link": "https://github.blog/2022-12-15-leaked-a-secret-check-your-github-alerts-for-free/",
          "publishedOn": "2022-12-15T17:00:52.000Z",
          "wordCount": 1368,
          "title": "Leaked a secret? Check your GitHub alerts&#8230;for free",
          "imageUrl": "https://github.blog/wp-content/uploads/2021/12/Security-Community.png"
        },
        {
          "id": "https://github.blog/2022-12-15-github-advanced-security-customers-can-now-push-protect-their-custom-patterns/",
          "author": null,
          "description": "With just one click, admins in GitHub Advanced Security organizations can protect their custom patterns on push.",
          "link": "https://github.blog/2022-12-15-github-advanced-security-customers-can-now-push-protect-their-custom-patterns/",
          "publishedOn": "2022-12-15T17:00:38.000Z",
          "wordCount": 1420,
          "title": "GitHub Advanced Security customers can now push protect their custom patterns",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/04/Security-Enterprise@2x.png"
        },
        {
          "id": "https://github.blog/2022-12-14-raising-the-bar-for-software-security-next-steps-for-github-com-2fa/",
          "author": null,
          "description": "GitHub will require all users who contribute code on GitHub.com to enable one or more forms of two-factor authentication (2FA) by the end of 2023. Learn more about our approach, when we’ll begin our rollout, and what you can expect as we begin requiring 2FA.",
          "link": "https://github.blog/2022-12-14-raising-the-bar-for-software-security-next-steps-for-github-com-2fa/",
          "publishedOn": "2022-12-14T17:00:15.000Z",
          "wordCount": 1573,
          "title": "Raising the bar for software security: next steps for GitHub.com 2FA",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/12/2fa-social.png?fit=1260%2C1260"
        },
        {
          "id": "https://github.blog/2022-12-13-creating-an-accessible-search-experience-with-the-querybuilder-component/",
          "author": null,
          "description": "GitHub’s search inputs have several complex accessibility considerations. Let’s dive into what those are, how we addressed them, and talk about the standalone, reusable component that was ultimately built.",
          "link": "https://github.blog/2022-12-13-creating-an-accessible-search-experience-with-the-querybuilder-component/",
          "publishedOn": "2022-12-13T16:08:24.000Z",
          "wordCount": 2568,
          "title": "Creating an accessible search experience with the QueryBuilder component",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/06/Engineering-Product@2x.png"
        },
        {
          "id": "https://github.blog/2022-12-12-highlights-from-git-2-39/",
          "author": null,
          "description": "Another new release of Git is here to end the year! Take a look at some of our highlights on what's new in Git 2.39.",
          "link": "https://github.blog/2022-12-12-highlights-from-git-2-39/",
          "publishedOn": "2022-12-12T15:50:38.000Z",
          "wordCount": 2330,
          "title": "Highlights from Git 2.39",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/12/git239.png"
        },
        {
          "id": "https://github.blog/2022-12-09-release-radar-october-2022/",
          "author": null,
          "description": "Before you say it, yes, the October Release Radar was supposed to be shared in November. But with Hackatoberfest, GitHub Universe, Turkey Day, and in real life (IRL) conferences returning to their pre-COVID frequency, we&#8217;ve all been so busy. And our community has been hustling to ship all kinds of open source projects. We wanted [&#8230;]",
          "link": "https://github.blog/2022-12-09-release-radar-october-2022/",
          "publishedOn": "2022-12-09T19:00:32.000Z",
          "wordCount": 1673,
          "title": "Release Radar · October 2022 Edition",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/12/Release-Radar-October-2022.jpg?fit=1200%2C630"
        },
        {
          "id": "https://github.blog/2022-12-08-experiment-the-hidden-costs-of-waiting-on-slow-build-times/",
          "author": null,
          "description": "How much does it really cost to buy more powerful cloud compute resources for development work? A lot less than you think.",
          "link": "https://github.blog/2022-12-08-experiment-the-hidden-costs-of-waiting-on-slow-build-times/",
          "publishedOn": "2022-12-08T18:00:02.000Z",
          "wordCount": 2363,
          "title": "Experiment: The hidden costs of waiting on slow build times",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/03/Enterprise-Product@2x-1.png"
        },
        {
          "id": "https://github.blog/2022-12-08-git-commit-uruguay-lowering-barriers-to-make-software-development-more-inclusive-and-diverse/",
          "author": null,
          "description": "We delivered two different courses specifically designed to help students in the lowest-income neighborhood of Montevideo, Uruguay learn how to use GitHub and understand the value of open source.",
          "link": "https://github.blog/2022-12-08-git-commit-uruguay-lowering-barriers-to-make-software-development-more-inclusive-and-diverse/",
          "publishedOn": "2022-12-08T17:00:06.000Z",
          "wordCount": 1268,
          "title": "Git Commit Uruguay: Lowering barriers to make software development more inclusive and diverse",
          "imageUrl": "https://github.blog/wp-content/uploads/2019/03/education-social.png?fit=1201%2C630"
        },
        {
          "id": "https://github.blog/2022-12-08-hello-from-githubs-new-chief-product-officer/",
          "author": null,
          "description": "GitHub is in an exciting phase of our journey as the developer community grows significantly every day, and the needs of the community grow and change with it. Today we’re introducing our new Chief Product officer.",
          "link": "https://github.blog/2022-12-08-hello-from-githubs-new-chief-product-officer/",
          "publishedOn": "2022-12-08T16:59:59.000Z",
          "wordCount": 1107,
          "title": "Hello from GitHub’s new Chief Product Officer",
          "imageUrl": "https://github.blog/wp-content/uploads/2022/12/Group-5-1.png"
        }
      ]
    },
    {
      "title": "Martin Kleppmann's blog",
      "feedUrl": "https://feeds.feedburner.com/martinkl",
      "siteUrl": "http://martin.kleppmann.com/",
      "articles": []
    },
    {
      "title": "Kubernetes – Production-Grade Container Orchestration",
      "feedUrl": "https://kubernetes.io/feed.xml",
      "siteUrl": "https://kubernetes.io/",
      "articles": [
        {
          "id": "https://kubernetes.io/blog/2022/12/19/devicemanager-ga/",
          "author": null,
          "description": "Author: Swati Sehgal (Red Hat)\nThe Device Plugin framework was introduced in the Kubernetes v1.8 release as a vendor\nindependent framework to enable discovery, advertisement and allocation of external\ndevices without modifying core Kubernetes. The feature graduated to Beta in v1.10.\nWith the recent release of Kubernetes v1.26, Device Manager is now generally\navailable (GA).\nWithin the kubelet, the Device Manager facilitates communication with device plugins\nusing gRPC through Unix sockets. Device Manager and Device plugins both act as gRPC\nservers and clients by serving and connecting to the exposed gRPC services respectively.\nDevice plugins serve a gRPC service that kubelet connects to for device discovery,\nadvertisement (as extended resources) and allocation. Device Manager connects to\nt…",
          "link": "https://kubernetes.io/blog/2022/12/19/devicemanager-ga/",
          "publishedOn": "2022-12-19T00:00:00.000Z",
          "wordCount": 3734,
          "title": "Blog: Kubernetes 1.26: Device Manager graduates to GA",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/12/16/kubernetes-1-26-non-graceful-node-shutdown-beta/",
          "author": null,
          "description": "Author: Xing Yang (VMware), Ashutosh Kumar (VMware)\nKubernetes v1.24 introduced an alpha quality implementation of improvements\nfor handling a non-graceful node shutdown.\nIn Kubernetes v1.26, this feature moves to beta. This feature allows stateful workloads to failover to a different node after the original node is shut down or in a non-recoverable state, such as the hardware failure or broken OS.\nWhat is a node shutdown in Kubernetes?\nIn a Kubernetes cluster, it is possible for a node to shut down. This could happen either in a planned way or it could happen unexpectedly. You may plan for a security patch, or a kernel upgrade and need to reboot the node, or it may shut down due to preemption of VM instances. A node may also shut down due to a hardware failure or a software problem.\nTo tr…",
          "link": "https://kubernetes.io/blog/2022/12/16/kubernetes-1-26-non-graceful-node-shutdown-beta/",
          "publishedOn": "2022-12-16T18:00:00.000Z",
          "wordCount": 4170,
          "title": "Blog: Kubernetes 1.26: Non-Graceful Node Shutdown Moves to Beta",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/12/15/dynamic-resource-allocation/",
          "author": null,
          "description": "Authors: Patrick Ohly (Intel), Kevin Klues (NVIDIA)\nDynamic resource allocation is a new API for requesting resources. It is a\ngeneralization of the persistent volumes API for generic resources, making it possible to:\naccess the same resource instance in different pods and containers,\nattach arbitrary constraints to a resource request to get the exact resource\nyou are looking for,\ninitialize a resource according to parameters provided by the user.\nThird-party resource drivers are responsible for interpreting these parameters\nas well as tracking and allocating resources as requests come in.\nDynamic resource allocation is an alpha feature and only enabled when the\nDynamicResourceAllocation feature\ngate and the\nresource.k8s.io/v1alpha1 API group are enabled. For details, see the\n--feature-gat…",
          "link": "https://kubernetes.io/blog/2022/12/15/dynamic-resource-allocation/",
          "publishedOn": "2022-12-15T00:00:00.000Z",
          "wordCount": 4730,
          "title": "Blog: Kubernetes 1.26: Alpha API For Dynamic Resource Allocation",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/12/13/windows-host-process-containers-ga/",
          "author": null,
          "description": "Authors: Brandon Smith (Microsoft) and Mark Rossetti (Microsoft)\nThe long-awaited day has arrived: HostProcess containers, the Windows equivalent to Linux privileged\ncontainers, has finally made it to GA in Kubernetes 1.26!\nWhat are HostProcess containers and why are they useful?\nCluster operators are often faced with the need to configure their nodes upon provisioning such as\ninstalling Windows services, configuring registry keys, managing TLS certificates,\nmaking network configuration changes, or even deploying monitoring tools such as a Prometheus's node-exporter.\nPreviously, performing these actions on Windows nodes was usually done by running PowerShell scripts\nover SSH or WinRM sessions and/or working with your cloud provider's virtual machine management tooling.\nHostProcess containe…",
          "link": "https://kubernetes.io/blog/2022/12/13/windows-host-process-containers-ga/",
          "publishedOn": "2022-12-13T00:00:00.000Z",
          "wordCount": 3890,
          "title": "Blog: Kubernetes 1.26: Windows HostProcess Containers Are Generally Available",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/12/12/kubernetes-release-artifact-signing/",
          "author": null,
          "description": "Author: Sascha Grunert\nThe Kubernetes Special Interest Group (SIG) Release is proud to announce that we\nare digitally signing all release artifacts, and that this aspect of Kubernetes\nhas now reached beta.\nSigning artifacts provides end users a chance to verify the integrity of the\ndownloaded resource. It allows to mitigate man-in-the-middle attacks directly on\nthe client side and therefore ensures the trustfulness of the remote serving the\nartifacts. The overall goal of out past work was to define the used tooling for\nsigning all Kubernetes related artifacts as well as providing a standard signing\nprocess for related projects (for example for those in kubernetes-sigs).\nWe already signed all officially released container images (from Kubernetes v1.24 onwards).\nImage signing was alpha for v…",
          "link": "https://kubernetes.io/blog/2022/12/12/kubernetes-release-artifact-signing/",
          "publishedOn": "2022-12-12T00:00:00.000Z",
          "wordCount": 3633,
          "title": "Blog: Kubernetes 1.26: We're now signing our binary release artifacts!",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/12/09/kubernetes-v1-26-release/",
          "author": null,
          "description": "Authors: Kubernetes 1.26 Release Team\nIt's with immense joy that we announce the release of Kubernetes v1.26!\nThis release includes a total of 37 enhancements: eleven of them are graduating to Stable, ten are\ngraduating to Beta, and sixteen of them are entering Alpha. We also have twelve features being\ndeprecated or removed, three of which we better detail in this announcement.\nRelease theme and logo\nKubernetes 1.26: Electrifying\nThe theme for Kubernetes v1.26 is Electrifying.\nEach Kubernetes release is the result of the coordinated effort of dedicated volunteers, and only\nmade possible due to the use of a diverse and complex set of computing resources, spread out through\nmultiple datacenters and regions worldwide. The end result of a release - the binaries, the image\ncontainers, the docum…",
          "link": "https://kubernetes.io/blog/2022/12/09/kubernetes-v1-26-release/",
          "publishedOn": "2022-12-09T00:00:00.000Z",
          "wordCount": 5243,
          "title": "Blog: Kubernetes v1.26: Electrifying",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/12/05/forensic-container-checkpointing-alpha/",
          "author": null,
          "description": "Authors: Adrian Reber (Red Hat)\nForensic container checkpointing is based on Checkpoint/Restore In\nUserspace (CRIU) and allows the creation of stateful copies\nof a running container without the container knowing that it is being\ncheckpointed. The copy of the container can be analyzed and restored in a\nsandbox environment multiple times without the original container being aware\nof it. Forensic container checkpointing was introduced as an alpha feature in\nKubernetes v1.25.\nHow does it work?\nWith the help of CRIU it is possible to checkpoint and restore containers.\nCRIU is integrated in runc, crun, CRI-O and containerd and forensic container\ncheckpointing as implemented in Kubernetes uses these existing CRIU\nintegrations.\nWhy is it important?\nWith the help of CRIU and the corresponding integ…",
          "link": "https://kubernetes.io/blog/2022/12/05/forensic-container-checkpointing-alpha/",
          "publishedOn": "2022-12-05T00:00:00.000Z",
          "wordCount": 4152,
          "title": "Blog: Forensic container checkpointing in Kubernetes",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/12/02/seccomp-notifier/",
          "author": null,
          "description": "Authors: Sascha Grunert\nDebugging software in production is one of the biggest challenges we have to\nface in our containerized environments. Being able to understand the impact of\nthe available security options, especially when it comes to configuring our\ndeployments, is one of the key aspects to make the default security in\nKubernetes stronger. We have all those logging, tracing and metrics data already\nat hand, but how do we assemble the information they provide into something\nhuman readable and actionable?\nSeccomp is one of the standard mechanisms to protect a Linux based\nKubernetes application from malicious actions by interfering with its system\ncalls. This allows us to restrict the application to a defined set of\nactionable items, like modifying files or responding to HTTP requests. …",
          "link": "https://kubernetes.io/blog/2022/12/02/seccomp-notifier/",
          "publishedOn": "2022-12-02T00:00:00.000Z",
          "wordCount": 4915,
          "title": "Blog: Finding suspicious syscalls with the seccomp notifier",
          "imageUrl": null
        },
        {
          "id": "https://kubernetes.io/blog/2022/12/01/runtime-observability-opentelemetry/",
          "author": null,
          "description": "Authors: Sascha Grunert\nWhen speaking about observability in the cloud native space, then probably\neveryone will mention OpenTelemetry (OTEL) at some point in the\nconversation. That's great, because the community needs standards to rely on\nfor developing all cluster components into the same direction. OpenTelemetry\nenables us to combine logs, metrics, traces and other contextual information\n(called baggage) into a single resource. Cluster administrators or software\nengineers can use this resource to get a viewport about what is going on in the\ncluster over a defined period of time. But how can Kubernetes itself make use of\nthis technology stack?\nKubernetes consists of multiple components where some are independent and others\nare stacked together. Looking at the architecture from a containe…",
          "link": "https://kubernetes.io/blog/2022/12/01/runtime-observability-opentelemetry/",
          "publishedOn": "2022-12-01T00:00:00.000Z",
          "wordCount": 4557,
          "title": "Blog: Boosting Kubernetes container runtime observability with OpenTelemetry",
          "imageUrl": "list_pod_sandbox.png"
        },
        {
          "id": "https://kubernetes.io/blog/2022/11/28/registry-k8s-io-faster-cheaper-ga/",
          "author": null,
          "description": "Authors: Adolfo García Veytia (Chainguard), Bob Killen (Google)\nStarting with Kubernetes 1.25, our container image registry has changed from k8s.gcr.io to registry.k8s.io. This new registry spreads the load across multiple Cloud Providers & Regions, functioning as a sort of content delivery network (CDN) for Kubernetes container images. This change reduces the project’s reliance on a single entity and provides a faster download experience for a large number of users.\nTL;DR: What you need to know about this change\nContainer images for Kubernetes releases from 1.25 onward are no longer published to k8s.gcr.io, only to registry.k8s.io.\nIn the upcoming December patch releases, the new registry domain default will be backported to all branches still in support (1.22, 1.23, 1.24).\nIf you run in …",
          "link": "https://kubernetes.io/blog/2022/11/28/registry-k8s-io-faster-cheaper-ga/",
          "publishedOn": "2022-11-28T00:00:00.000Z",
          "wordCount": 3895,
          "title": "Blog: registry.k8s.io: faster, cheaper and Generally Available (GA)",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "http://techblog.netflix.com/feeds/posts/default",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/17440a9e141d",
          "author": "Netflix Technology Blog",
          "description": "by Jasmine Omeke, Obi-Ike Nwoke, Olek Gorajek",
          "link": "https://netflixtechblog.com/ready-to-go-sample-data-pipelines-with-dataflow-17440a9e141d?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-12-04T00:10:21.000Z",
          "wordCount": 7459,
          "title": "Ready-to-go sample data pipelines with Dataflow",
          "imageUrl": "https://miro.medium.com/max/1200/1*4IalrwbpzJovyfmA8lMtyA.png"
        }
      ]
    },
    {
      "title": "Google AI Blog",
      "feedUrl": "http://feeds.feedburner.com/blogspot/gJZg",
      "siteUrl": "http://ai.googleblog.com/",
      "articles": [
        {
          "id": "http://ai.googleblog.com/2022/12/formation-of-robust-bound-states-of.html",
          "author": null,
          "description": "Posted by Alexis Morvan and Trond Andersen, Research Scientists, Google Quantum AI  \nWhen quantum computers were first proposed, they were hoped to be a way to better understand the quantum world. With a so-called “quantum simulator,” one could engineer a quantum computer to investigate how various quantum phenomena arise, including those that are intractable to simulate with a classical computer.  \n    \nBut making a useful quantum simulator has been a challenge. Until now, quantum simulations with superconducting qubits have predominantly been used to verify pre-existing theoretical predictions and have rarely explored or discovered new phenomena. Only a few experiments with trapped ions or cold atoms have revealed new insights. Superconducting qubits, even though they are one of the main…",
          "link": "http://ai.googleblog.com/2022/12/formation-of-robust-bound-states-of.html",
          "publishedOn": "2022-12-08T17:49:00.000Z",
          "wordCount": 27965,
          "title": "Formation of Robust Bound States of Interacting Photons",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEisNfGCQ_8kC8xVoseP1NOYsCFDToeHeKLqggTMZ_m8Vf5FCQJz8PIZHYAiJjYhdyEjbobeKjUuwWuj93kUbPh2DRDsBITwKte59PQ4JGvJdpag90irXNn7IZJwinO--ixayIuJG4FXfhinV9AJWd8CDISH_EiCtRJ2mGTk9kVxEBnEwTTFJxs8n4QPYw/s72-c/LocalOccupancy.jpg"
        },
        {
          "id": "http://ai.googleblog.com/2022/12/private-ads-prediction-with-dp-sgd.html",
          "author": null,
          "description": "Posted by Krishna Giri Narra, Software Engineer, Google, and Chiyuan Zhang, Research Scientist, Google Research     \nAd technology providers widely use machine learning (ML) models to predict and present users with the most relevant ads, and to measure the effectiveness of those ads. With increasing focus on online privacy, there’s an opportunity to identify ML algorithms that have better privacy-utility trade-offs. Differential privacy (DP) has emerged as a popular framework for developing ML algorithms responsibly with provable privacy guarantees. It has been extensively studied in the privacy literature, deployed in industrial applications and employed by the U.S. Census. Intuitively, the DP framework enables ML models to learn population-wide properties, while protecting user-level inf…",
          "link": "http://ai.googleblog.com/2022/12/private-ads-prediction-with-dp-sgd.html",
          "publishedOn": "2022-12-07T19:17:00.004Z",
          "wordCount": 27774,
          "title": "Private Ads Prediction with DP-SGD",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhH0zcrGSog4-U3u53G7bdeCmEcT-gXL3mkzL1sb1e7q_RzCK0Ykk0TA7x6cHeQNG0CCFQVH8YKLJzpVtuIkVP4P8Kbcz5jL04v8KwOtyG2ZolcL519X9H2Y9UamCP2e6hTvnmnLWnMLPixFPf9WfpVkB1RJtG6c55MRuEwSauzH9oAHXAUVr_8eT5b6w/s72-c/DP-SGD%20on%20pCTR.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/12/google-at-emnlp-2022.html",
          "author": null,
          "description": "Posted by Malaya Jules, Program Manager, Google  \nThis week, the premier conference on Empirical Methods in Natural Language Processing (EMNLP 2022) is being held in Abu Dhabi, United Arab Emirates. We are proud to be a Diamond Sponsor of EMNLP 2022, with Google researchers contributing at all levels. This year we are presenting over 50 papers and are actively involved in 10 different workshops and tutorials.\n    \nIf you’re registered for EMNLP 2022, we hope you’ll visit the Google booth to learn more about the exciting work across various topics, including language interactions, causal inference, question answering and more. Take a look below to learn more about the Google research being presented at EMNLP 2022 (Google affiliations in bold). \n    \n\nCommittees\n  \nOrganizing Committee inclu…",
          "link": "http://ai.googleblog.com/2022/12/google-at-emnlp-2022.html",
          "publishedOn": "2022-12-07T08:41:00.004Z",
          "wordCount": 27708,
          "title": "Google at EMNLP 2022",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgqYLW6ReQZqTfAiNHw-2GAhaMHz64Da0ZvvdSJct3XILzSA--DDIAAbibW1Fc5QLudC80_oqVog4EQ2Vb42JLZDpTbc3JoYdkL3vjLJvaGsqI6u-ZVtqPkQnn8Y3swmed8_viTexOS7D0eSDPs74aD0t9zZS7c0uC_4M0B4NLHg6jPVe6_eCtZnHn27A/s72-w640-c-h347/GoogleAtEMNLP2022.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/12/will-you-find-these-shortcuts.html",
          "author": null,
          "description": "Posted by Katja Filippova, Research Scientist, and Sebastian Ebert, Software Engineer, Google Research, Brain team    \nModern machine learning models that learn to solve a task by going through many examples can achieve stellar performance when evaluated on a test set, but sometimes they are right for the “wrong” reasons: they make correct predictions but use information that appears irrelevant to the task. How can that be? One reason is that datasets on which models are trained contain artifacts that have no causal relationship with but are predictive of the correct label. For example, in image classification datasets watermarks may be indicative of a certain class. Or it can happen that all the pictures of dogs happen to be taken outside, against green grass, so a green background become…",
          "link": "http://ai.googleblog.com/2022/12/will-you-find-these-shortcuts.html",
          "publishedOn": "2022-12-06T20:56:00.002Z",
          "wordCount": 27752,
          "title": "Will You Find These Shortcuts?",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEirIFZvqiAhmmMEjS0OcMx4syg7O-B2G4zayDTo7Km8lR1Wc-UDp7PM7lStfTgN3xS_fUQoMtpmi348dorE5Zg3aqIcpZQEumFnP7LP_3mDAQbV7baMBVfkB6DaBNCdkqgCRp5KHp-ydz21OFebl-0D3FabODxr6JHLVfTlgT9c8qYfHJYHpbQEl7S4-g/s72-c/image3.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/12/talking-to-robots-in-real-time.html",
          "author": null,
          "description": "Posted by Corey Lynch, Research Scientist, and Ayzaan Wahid, Research Engineer, Robotics at Google   \nA grand vision in robot learning, going back to the SHRDLU experiments in the late 1960s, is that of helpful robots that inhabit human spaces and follow a wide variety of natural language commands. Over the last few years, there have been significant advances in the application of machine learning (ML) for instruction following, both in simulation and in real world systems. Recent Palm-SayCan work has produced robots that leverage language models to plan long-horizon behaviors and reason about abstract goals. Code as Policies has shown that code-generating language models combined with pre-trained perception systems can produce language conditioned policies for zero shot robot manipulation…",
          "link": "http://ai.googleblog.com/2022/12/talking-to-robots-in-real-time.html",
          "publishedOn": "2022-12-01T18:01:00.000Z",
          "wordCount": 27685,
          "title": "Talking to Robots in Real Time",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgbFdyJRWeJfiREcvw26XS6tK0xPD_v7opYB9M9Ku8x5-X2SAHxFvuE1KlL8RPqc0aUPYqDVPC9MYmJpW6GgVuDY0sHIBlk1JyOfXAGg47HeWDDGmsKor3w_2XkkLt5GR-rVPst9m2neg1KUO5AbeyUQjrYa0redbk18FBgmqhO70yJnkRFJH03BNcPww/s72-c/interactive%20language%20hero%20image.gif"
        },
        {
          "id": "http://ai.googleblog.com/2022/11/making-traversable-wormhole-with.html",
          "author": null,
          "description": "Posted by Alexander Zlokapa, Student Researcher, and Hartmut Neven, VP of Engineering, Quantum AI Team  \nWormholes — wrinkles in the fabric of spacetime that connect two disparate locations — may seem like the stuff of science fiction. But whether or not they exist in reality, studying these hypothetical objects could be the key to making concrete the tantalizing link between information and matter that has bedeviled physicists for decades.  \n  \nSurprisingly, a quantum computer is an ideal platform to investigate this connection. The trick is to use a correspondence called AdS/CFT, which establishes an equivalence between a theory that describes gravity and spacetime (and wormholes) in a fictional world with a special geometry (AdS) to a quantum theory that does not contain gravity at all …",
          "link": "http://ai.googleblog.com/2022/11/making-traversable-wormhole-with.html",
          "publishedOn": "2022-11-30T16:04:00.013Z",
          "wordCount": 28078,
          "title": "Making a Traversable Wormhole with a Quantum Computer",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhU9eS2OdfWaWTauxP5RgeHe1s6IYR0YoHRBoBwJ9Mu9WOp7xooz3-SmedxYte9sERlcdbImkXgHoIp0jIkUiTgxp_xSJpbgoTHmqYJQ9q2nelfPePSmEV93JJmoo-fvwmCKzLTf2Lx9CkR9BnJoWcf6DbvSHooCMNLOb_iU8Ox6gHJvyuvm6FAAK3yag/s72-c/quantum%20hero.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/11/better-language-models-without-massive.html",
          "author": null,
          "description": "Posted by Jason Wei and Yi Tay, Research Scientists, Google Research, Brain Team \nIn recent years, language models (LMs) have become more prominent in natural language processing (NLP) research and are also becoming increasingly impactful in practice. Scaling up LMs has been shown to improve performance across a range of NLP tasks. For instance, scaling up language models can improve perplexity across seven orders of magnitude of model sizes, and new abilities such as multi-step reasoning have been observed to arise as a result of model scale. However, one of the challenges of continued scaling is that training new, larger models requires great amounts of computational resources. Moreover, new models are often trained from scratch and do not leverage the weights from previously existing mo…",
          "link": "http://ai.googleblog.com/2022/11/better-language-models-without-massive.html",
          "publishedOn": "2022-11-29T17:00:00.001Z",
          "wordCount": 27711,
          "title": "Better Language Models Without Massive Compute",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhB22pJzJVI0U1O0fbs4Hf-cV9xQUvQuSy6YmrHIrgSn4CYeofDMZqbmQsZSl6oviqXMs7Ta-P_t2tMpcR3ix3VaHS6E5NKFyvg2_B14lfnvlpz_p2Kdq2L9k4ziGmMB9OEV2Qr4DE6z9Zdu-zv08QWitKQnNdUgojSyKfxXj5wj4CXll46aHd4u-LWGA/s72-w640-c-h493/image5.png"
        },
        {
          "id": "http://ai.googleblog.com/2022/11/google-at-neurips-2022.html",
          "author": null,
          "description": "Posted by Cat Armato, Program Manager, Google   \nThis week marks the beginning of the 36th annual Conference on Neural Information Processing Systems (NeurIPS 2022), the biggest machine learning conference of the year. NeurIPS 2022 will be held as a hybrid event, in person in New Orleans, LA with some virtual attendance options, and includes invited talks, demonstrations and presentations of some of the latest in machine learning research. This year, NeurIPS is also offering a new track, called Spotlight Papers, which will provide opportunities to highlight papers presented in prestigious journals that would otherwise not have been eligible for submission. \n    \nGoogle is proud to be a Diamond level sponsor of NeurIPS this year and will have a significant presence year with more than 175 a…",
          "link": "http://ai.googleblog.com/2022/11/google-at-neurips-2022.html",
          "publishedOn": "2022-11-28T15:29:00.001Z",
          "wordCount": 31182,
          "title": "Google at NeurIPS 2022",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiFu9A3sY0HxdAipfjxcvc3VgHgId2k0W4LpXS5sDZb9DJ8iVrCngQMygh5DJAvKHTIIWPzuSL1s4_jmQwdPMAEzm_gbRT3Bo_GcLoQxN6vtr14NjTSuqWPwlMELRBXsI86xtJqEaqj_hAOoaFMLMfG0yeB9SzJtBMWoGLFSVQ3yc5zPs-aGHGVVSZnqg/s72-c/GoogleNewOrleansNeurIPS2022-lrg.jpg"
        }
      ]
    },
    {
      "title": "Seth Godin's Blog on marketing, tribes and respect",
      "feedUrl": "https://feeds.feedblitz.com/sethsblog",
      "siteUrl": "https://seths.blog",
      "articles": [
        {
          "id": "https://seths.blog/?p=42139",
          "author": "Seth Godin",
          "description": "Soap is 85 cents a bar or two for a dollar. Which should you buy? It depends. It depends on how much space you have, whether you like this brand, how full your cart is and whether or not you’re sure if the person who sent you to the market wants you to buy two. […]",
          "link": "https://feeds.feedblitz.com/~/722431772/0/sethsblog~Staring-at-decisions/",
          "publishedOn": "2022-12-18T12:01:00.000Z",
          "wordCount": 1271,
          "title": "Staring at decisions",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806132-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=44385",
          "author": "Seth Godin",
          "description": "This is the season for all the lists–the hot authors, singers and restaurants in any given genre. If you’re on the list, congratulations! You’re the next big thing. For now. But the truth of the next big thing is that you can’t stay that way. The hot bands of yesterday aren’t hot the same way […]",
          "link": "https://feeds.feedblitz.com/~/722348136/0/sethsblog~The-next-big-thing/",
          "publishedOn": "2022-12-17T12:04:00.000Z",
          "wordCount": 1125,
          "title": "The next big thing",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806133-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=44389",
          "author": "Seth Godin",
          "description": "The internet doesn’t have to be this way. It seems like the structure we live with and struggle with and sometimes work against is pre-ordained and obvious, but much of it is the result of the origin of the consumer net. Slow modems in particular. When the WELL and AOL and other services began to […]",
          "link": "https://feeds.feedblitz.com/~/722258312/0/sethsblog~Slow-modems/",
          "publishedOn": "2022-12-16T14:45:00.000Z",
          "wordCount": 1354,
          "title": "Slow modems",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806139-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=42365",
          "author": "Seth Godin",
          "description": "If you want reach and engagement, optimizing for small screens is usually the way to go. There are more mobile devices in the world than we can count, and large numbers of people spend their days consuming content from the palm of their hand. But productivity? In just about every context I’m aware of, important […]",
          "link": "https://feeds.feedblitz.com/~/722240482/0/sethsblog~Little-screens-and-productivity/",
          "publishedOn": "2022-12-16T10:20:00.000Z",
          "wordCount": 1168,
          "title": "Little screens and productivity",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061318.jpg"
        },
        {
          "id": "https://seths.blog/?p=44378",
          "author": "Seth Godin",
          "description": "It began with what bosses needed to say to get workers to do what they needed done. And then it became widespread, because typing the right things into Google makes it more likely you will find what you’re looking for. (True aside: When I worked at Yahoo, they had a secret list of the 100 […]",
          "link": "https://feeds.feedblitz.com/~/722132720/0/sethsblog~Prompt-engineering/",
          "publishedOn": "2022-12-15T10:12:00.000Z",
          "wordCount": 1175,
          "title": "Prompt engineering",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061310-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=42432",
          "author": "Seth Godin",
          "description": "Random events are unevenly distributed and rarely arrive on time. Resilience and frequency increase the chances that the break we are hoping for will arrive when we need it. The resilience to keep at it so that we can live with later instead of sooner. And the frequency of interaction and shipping so that we […]",
          "link": "https://feeds.feedblitz.com/~/722027456/0/sethsblog~Sooner-or-later/",
          "publishedOn": "2022-12-14T09:51:00.000Z",
          "wordCount": 1105,
          "title": "Sooner or later…",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806139-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=44360",
          "author": "Seth Godin",
          "description": "The question, of course, is how long? We’ve been working hard on fusion for sixty years (using ‘we’ to include myself with all of humanity, not because I’m a physicist). The Post writes: “To most of us, this was only a matter of time,” said a senior fusion scientist familiar with the work of the […]",
          "link": "https://feeds.feedblitz.com/~/721931944/0/sethsblog~It-was-only-a-matter-of-time/",
          "publishedOn": "2022-12-13T08:34:00.000Z",
          "wordCount": 1213,
          "title": "It was only a matter of time",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806138-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=44352",
          "author": "Seth Godin",
          "description": "Our stories about brains are all invented. If a stunning surrealistic painting turns out to have been painted by an elephant or a toddler, does that make it less beautiful? If an essay on the nature of reality was written by GPT-3 or a Tufts scholar, does it matter? There are people who have no […]",
          "link": "https://feeds.feedblitz.com/~/721835872/0/sethsblog~And-what-if-you-cant-tell/",
          "publishedOn": "2022-12-12T09:29:00.000Z",
          "wordCount": 1233,
          "title": "And what if you can’t tell?",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_180613-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=44346",
          "author": "Seth Godin",
          "description": "When AI is smart enough to write an essay, then what happens? GPT3 is back in the news, because, as expected, it’s getting better and better. Using a simple chat interface, you can easily ask it a wide range of questions (write a 1,000 word essay about Clara Barton) that certainly feels like a diligent […]",
          "link": "https://feeds.feedblitz.com/~/721745320/0/sethsblog~Attention-trust-and-GPT/",
          "publishedOn": "2022-12-11T10:21:00.000Z",
          "wordCount": 1213,
          "title": "Attention, trust and GPT3",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_1806135-1.jpg"
        },
        {
          "id": "https://seths.blog/?p=44333",
          "author": "Seth Godin",
          "description": "The thing is that facts almost never get in the way of a good story. Because a good story feels true. A good story resonates. A good story is based on our feelings, long-held and hard-earned. A good story sticks with us, regardless of the facts. If I bring facts to rebut your story, they […]",
          "link": "https://feeds.feedblitz.com/~/721641442/0/sethsblog~Dont-let-a-story-get-in-the-way/",
          "publishedOn": "2022-12-10T10:41:00.000Z",
          "wordCount": 1170,
          "title": "Don’t let a story get in the way",
          "imageUrl": "https://149521506.v2.pressablecdn.com/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061318.jpg"
        }
      ]
    },
    {
      "title": "The JetBrains Blog",
      "feedUrl": "https://blog.jetbrains.com/feed/",
      "siteUrl": "https://blog.jetbrains.com",
      "articles": [
        {
          "id": "https://blog.jetbrains.com/?post_type=webstorm&p=308811",
          "author": "Ekaterina Ryabukha",
          "description": "Last month, we rolled out WebStorm 2022.3, our final major update of 2022. We’d like to thank all of you who have already tried it and shared your thoughts with us! We’ve had an overwhelming amount of feedback, with the new UI being the absolute leader in the number of mentions: We’re still processing your […]",
          "link": "https://blog.jetbrains.com/webstorm/2022/12/webstorm-2023-1-roadmap/",
          "publishedOn": "2022-12-16T15:49:31.000Z",
          "wordCount": 2331,
          "title": "What’s Next: WebStorm 2023.1 Roadmap",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/12/ws-roadmap-blog-social-share-image-1280x720-1.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=webstorm&p=299357",
          "author": "David Watson",
          "description": "The fourth bug-fix update for v2022.2 is now available. You can upgrade to the latest build using the Toolbox App or via our website. WebStorm 2022.2.4 brings the following fix: We’ve fixed the issue causing WebStorm to highlight the Tailwind CSS @config directive as an error (WEB-57766). For more information, please see the release notes. […]",
          "link": "https://blog.jetbrains.com/webstorm/2022/12/webstorm-2022-2-4/",
          "publishedOn": "2022-12-16T15:14:26.000Z",
          "wordCount": 1585,
          "title": "WebStorm 2022.2.4 Is Out",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/11/WebStorm-2022-2-4-social.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=rust&p=308471",
          "author": "Sergey Kozlovskiy",
          "description": "In the 2022.3 release cycle we’ve enabled macro expansion for function-like and derive macros and build script evaluation by default.  We’ve implemented code insight features like the intention action preview, among others. The Run/debug section includes various improvements, and we’ve changed how types are rendered in the Debug window.  Additionally, there are a number of […]",
          "link": "https://blog.jetbrains.com/rust/2022/12/16/intellij-rust-updates-for-2022-3/",
          "publishedOn": "2022-12-16T14:59:16.000Z",
          "wordCount": 2608,
          "title": "IntelliJ Rust: Updates for 2022.3",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/12/Blog_Social_share_image_1280x720-4.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=teamcity&p=308336",
          "author": "Sergei Ugdyzhekov",
          "description": "Introduction TeamCity offers seamless integration with AWS, allowing you to deploy on AWS quickly and efficiently. Until now, the main problem with integrating TeamCity and AWS has been that all AWS-related features required dedicated credentials. In most cases, this meant that you had to manage static IAM keys for each feature instance. That increased the […]",
          "link": "https://blog.jetbrains.com/teamcity/2022/12/introducing-aws-connection/",
          "publishedOn": "2022-12-16T12:53:24.000Z",
          "wordCount": 2804,
          "title": "Introducing AWS Connection: A New Approach for Working With AWS in TeamCity",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/12/Introducing-AWS-Connection-social.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=ktor&p=307046",
          "author": "Hadi Hariri",
          "description": "We’ve been working on defining our roadmap for Ktor for 2023, and much like we did for 2022, we’d like to share our plans with you and what we have in store. One of the things we’re planning on doing this year is releasing 3.0.0. While major versions generally indicate a breaking change, most of […]",
          "link": "https://blog.jetbrains.com/ktor/2022/12/16/ktor-2023-roadmap/",
          "publishedOn": "2022-12-16T11:14:16.000Z",
          "wordCount": 2318,
          "title": "Ktor 2023 Roadmap",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/12/image-21-1.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=fleet&p=308327",
          "author": "Eugene Toporov",
          "description": "We have released the last big update for Fleet Preview in 2022. It includes some large and anticipated changes to support for various technologies and several general product improvements. Here are the highlights: Fleet now supports C++ projects with compilation databases. In smart mode, things like error highlighting, C++ code completion, parameter info, code documentation […]",
          "link": "https://blog.jetbrains.com/fleet/2022/12/fleet-preview-update-1-12-c-c-solution-view-svelte-tailwindcss-smart-mode-memory-optimizations-and-more/",
          "publishedOn": "2022-12-16T10:23:00.000Z",
          "wordCount": 2011,
          "title": "Fleet Preview Update 1.12: C++, C# Solution View, Svelte, TailwindCSS, Smart Mode Memory Optimizations and More",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/DSGN-14708_Fleet_public_release_Blog_Social_share_image_1280x720_06.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=datagrip&p=308277",
          "author": "Alisa Lukonina",
          "description": "7 years ago today, DataGrip was brought into the world. We’d like to share some milestones from our history and express our gratitude to our users who have made huge contributions to DataGrip over the years. We’ve done it together! June 2014 Early Access Program starts for 0xDBE December 2015 DataGrip 1.0 released July 2016 […]",
          "link": "https://blog.jetbrains.com/datagrip/2022/12/16/datagrip-turns-7/",
          "publishedOn": "2022-12-16T09:33:23.000Z",
          "wordCount": 1937,
          "title": "DataGrip Turns 7!",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/12/Screen-Shot-2022-12-16-at-10.18.09-AM.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=dotnet&p=284011",
          "author": "Khalid Abuhakmeh",
          "description": "You’ve likely heard about Blazor, .NET’s frontend framework for writing web applications. Blazor lets you use your existing C# skills to build full-stack applications, from client to server. One way to construct Blazor applications is to compile your frontend into a WebAssembly (WASM) file and deploy and run your app in a web browser. The […]",
          "link": "https://blog.jetbrains.com/dotnet/2022/12/15/the-future-of-net-with-wasm/",
          "publishedOn": "2022-12-15T15:50:55.000Z",
          "wordCount": 4014,
          "title": "The Future of .NET with WASM",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/10/rd-how-tos-blog-social-share-image-1280x720-1.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=education&p=307985",
          "author": "Anastasia Khramushina",
          "description": "The last version of EduTools in 2022 offers new features for both learners and course creators. As a JetBrains Academy student, you can now publish your projects to GitHub right from your IDE. As a course creator, you can now rely on an improved structure of your project directories and files. We’ve also enhanced the […]",
          "link": "https://blog.jetbrains.com/education/2022/12/15/edutools-plugin-2022-12-is-available/",
          "publishedOn": "2022-12-15T09:04:35.000Z",
          "wordCount": 2014,
          "title": "EduTools Plugin 2022.12 Is Available",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/12/Featured_Blog_Social_1280x720_EduTools-2.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=blog&p=306697",
          "author": "Marina Kovaleva",
          "description": "All of our IDEs and .NET tools have rolled out their last updates for this year, and we hope the latest features and improvements will not only help you take your productivity a step higher but will also make your coding more fun! Here’s an overview of the highlights of each update. IntelliJ-based IDEs First, […]",
          "link": "https://blog.jetbrains.com/blog/2022/12/15/2022-3-jetbrains-ides-and-net-tools/",
          "publishedOn": "2022-12-15T08:14:08.000Z",
          "wordCount": 2789,
          "title": "Overview of the 2022.3 Versions of All JetBrains IDEs and .NET Tools",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/12/Blog_Featured_image_1280x600-4-1.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=appcode&p=305731",
          "author": "Anastasia Kazakova",
          "description": "Hi, AppCode 2022.3 has just been released! It comes compatible with macOS 13 and Xcode 14.2, brings more refactoring capabilities for Swift, enables language injections, and offers a new approach to settings synchronization. With the release of v2022.3, we are sunsetting the product. As of December 14, 2022, we will no longer sell new subscriptions […]",
          "link": "https://blog.jetbrains.com/appcode/2022/12/appcode-2022-3-release-and-end-of-sales-and-support/",
          "publishedOn": "2022-12-14T17:49:31.000Z",
          "wordCount": 2671,
          "title": "AppCode 2022.3 Release and End of Sales and Support",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/12/Release_Blog_Social_share_image_1280x720_AppCode-2x.png"
        },
        {
          "id": "https://blog.jetbrains.com/?post_type=kotlin&p=307983",
          "author": "Ekaterina Petrova",
          "description": "Kotlin Multiplatform Mobile is in Beta, and the technology’s ecosystem is continuing to expand and mature. All of this would be impossible without the community’s contributions. In order to celebrate the work of the community’s authors of articles, videos, and samples, we’re launching the Kotlin Multiplatform Mobile Content Creators Recognition Campaign. Today, we would like […]",
          "link": "https://blog.jetbrains.com/kotlin/2022/12/shout-out-to-kotlin-multiplatform-mobile-content-creators/",
          "publishedOn": "2022-12-14T13:04:53.000Z",
          "wordCount": 2012,
          "title": "Shout-Out to Kotlin Multiplatform Mobile Content Creators!",
          "imageUrl": "https://blog.jetbrains.com/wp-content/uploads/2022/09/Multiplatform-Mobile-Content-Creators_Twitter-Blog.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}